let a_r1 = "Бобер, Светлячок, Лисица,<br>Опоссум, Кролик, Лягушка,<br>Рад-олень, Белка";
let a_r2 = "Бобер, Кошка, Курица,<br>Светлячок, Лисица, Опоссум,<br>Кролик, Лягушка, Рад-олень, Белка";
let a_r3 = "Светлячок, Опоссум";
let a_r4 = "Бобер, Курица, Светлячок,<br>Лисица, Опоссум, Кролик,<br>Лягушка, Рад-олень, Белка";
let a_r5 = "Бобер, Курица, Светлячок,<br>Лисица, Опоссум, Лягушка,<br>Рад-олень, Белка";
let a_r6 = "Бобер, Светлячок, Опоссум,<br>Лягушка, Рад-олень, Белка";
let animals = [
// LvlCritterA
	[-123301, -23433, "Дикий рубеж", a_r4],
	[-123429, -23561, "Дикий рубеж", a_r4],
	[-30083, -57100, "Лес", a_r2],
	[-30083, -56844, "Лес", a_r2],
	[-30211, -56972, "Лес", a_r2],
	[-21621, -52989, "Лес", a_r2],
	[-21621, -52733, "Лес", a_r2],
	[-21749, -52861, "Лес", a_r2],
	[-70689, -47588, "Лес", a_r2],
	[-70689, -47332, "Лес", a_r2],
	[-130178, -33280, "Дикий рубеж", a_r4],
	[-24911, -80136, "Лес", a_r2],
	[-24911, -79880, "Лес", a_r2],
	[-98090, -94879, "Шлаковая бездна", a_r3],
	[-98090, -94751, "Шлаковая бездна", a_r3],
	[-80680, -70432, "Лес", a_r2],
	[-80680, -70304, "Лес", a_r2],
	[-80680, -70176, "Лес", a_r2],
	[-80808, -70304, "Лес", a_r2],
	[-21943, -120128, "Лес", a_r2],
	[-21943, -119872, "Лес", a_r2],
	[-22071, -120000, "Лес", a_r2],
	[-20827, -111488, "Лес", a_r2],
	[-20827, -111232, "Лес", a_r2],
	[-8028, -107946, "Лес", a_r2],
	[-8028, -107690, "Лес", a_r2],
	[-8156, -107818, "Лес", a_r2],
	[-31967, -100072, "Лес", a_r2],
	[-31967, -99816, "Лес", a_r2],
	[-32095, -99944, "Лес", a_r2],
	[-96355, -112838, "Шлаковая бездна", a_r3],
	[-96144, -113045, "Шлаковая бездна", a_r3],
	[-96757, -112832, "Шлаковая бездна", a_r3],
	[-113818, -117242, "Шлаковая бездна", a_r3],
	[-113642, -117400, "Шлаковая бездна", a_r3],
	[-113549, -117606, "Шлаковая бездна", a_r3],
	[-126983, -111877, "Шлаковая бездна", a_r3],
	[-127174, -111661, "Шлаковая бездна", a_r3],
	[-127174, -111533, "Шлаковая бездна", a_r3],
	[-127174, -111789, "Шлаковая бездна", a_r3],
	[-109482, -105070, "Шлаковая бездна", a_r3],
	[-109482, -104942, "Шлаковая бездна", a_r3],
	[-109482, -105198, "Шлаковая бездна", a_r3],
	[-109610, -105070, "Шлаковая бездна", a_r3],
	[-141191, -17002, "Дикий рубеж", a_r4],
	[-141319, -16874, "Дикий рубеж", a_r4],
	[-132664, -3483, "Дикий рубеж", a_r4],
	[-132610, -3358, "Дикий рубеж", a_r4],
	[-132664, -3227, "Дикий рубеж", a_r4],
	[-132792, -3355, "Дикий рубеж", a_r4],
	[-162481, -62881, "Дикий рубеж", a_r4],
	[-162481, -62753, "Дикий рубеж", a_r4],
	[-162481, -62625, "Дикий рубеж", a_r4],
	[-162609, -62753, "Дикий рубеж", a_r4],
	[-132484, -54662, "Шлаковая бездна", a_r3],
	[-132484, -54534, "Шлаковая бездна", a_r3],
	[-132484, -54790, "Шлаковая бездна", a_r3],
	[-132612, -54662, "Шлаковая бездна", a_r3],
	[-140852, -35049, "Дикий рубеж", a_r4],
	[-140980, -34921, "Дикий рубеж", a_r4],
	[-171702, -56488, "Дикий рубеж", a_r4],
	[-171702, -56360, "Дикий рубеж", a_r4],
	[-171702, -56232, "Дикий рубеж", a_r4],
	[-171830, -56360, "Дикий рубеж", a_r4],
	[-155153, -94550, "Шлаковая бездна", a_r3],
	[-155025, -94678, "Шлаковая бездна", a_r3],
	[-168090, -79277, "Дикий рубеж", a_r4],
	[-168090, -79149, "Дикий рубеж", a_r4],
	[-164451, -129457, "Шлаковая бездна", a_r3],
	[-164451, -129329, "Шлаковая бездна", a_r3],
	[-164451, -129585, "Шлаковая бездна", a_r3],
	[-164579, -129457, "Шлаковая бездна", a_r3],
	[201016, -18893, "Ядовитая долина", a_r6],
	[201016, -18765, "Ядовитая долина", a_r6],
	[201016, -18637, "Ядовитая долина", a_r6],
	[200888, -18765, "Ядовитая долина", a_r6],
	[199842, -3098, "Ядовитая долина", a_r6],
	[199952, -2968, "Ядовитая долина", a_r6],
	[199842, -2842, "Ядовитая долина", a_r6],
	[184857, -23449, "Ядовитая долина", a_r6],
	[184921, -23315, "Ядовитая долина", a_r6],
	[184921, -23187, "Ядовитая долина", a_r6],
	[184721, -23295, "Ядовитая долина", a_r6],
	[184276, -7317, "Ядовитая долина", a_r6],
	[184404, -7189, "Ядовитая долина", a_r6],
	[173367, -2252, "Ядовитая долина", a_r6],
	[173367, -2124, "Ядовитая долина", a_r6],
	[173367, -1996, "Ядовитая долина", a_r6],
	[173239, -2124, "Ядовитая долина", a_r6],
	[146423, -29914, "Ядовитая долина", a_r6],
	[146423, -29786, "Ядовитая долина", a_r6],
	[146429, -29599, "Ядовитая долина", a_r6],
	[146295, -29786, "Ядовитая долина", a_r6],
	[199563, -44639, "Ядовитая долина", a_r6],
	[199678, -44407, "Ядовитая долина", a_r6],
	[199435, -44511, "Ядовитая долина", a_r6],
	[182360, -53293, "Ядовитая долина", a_r6],
	[182360, -53165, "Ядовитая долина", a_r6],
	[182360, -53037, "Ядовитая долина", a_r6],
	[182232, -53165, "Ядовитая долина", a_r6],
	[174413, -36007, "Ядовитая долина", a_r6],
	[174413, -35879, "Ядовитая долина", a_r6],
	[174413, -35751, "Ядовитая долина", a_r6],
	[174285, -35879, "Ядовитая долина", a_r6],
	[158431, -65125, "Ядовитая долина", a_r6],
	[158431, -64997, "Ядовитая долина", a_r6],
	[158431, -64869, "Ядовитая долина", a_r6],
	[158303, -64997, "Ядовитая долина", a_r6],
	[161256, -42403, "Ядовитая долина", a_r6],
	[161256, -42275, "Ядовитая долина", a_r6],
	[161128, -42403, "Ядовитая долина", a_r6],
	[157115, -37902, "Ядовитая долина", a_r6],
	[156986, -37775, "Ядовитая долина", a_r6],
	[183282, -76264, "Ядовитая долина", a_r6],
	[183430, -76249, "Ядовитая долина", a_r6],
	[183403, -76427, "Ядовитая долина", a_r6],
	[158174, -82957, "Ядовитая долина", a_r6],
	[158174, -82829, "Ядовитая долина", a_r6],
	[158174, -82701, "Ядовитая долина", a_r6],
	[158046, -82829, "Ядовитая долина", a_r6],
	[144747, -70137, "Ядовитая долина", a_r6],
	[144747, -70009, "Ядовитая долина", a_r6],
	[144747, -69881, "Ядовитая долина", a_r6],
	[144619, -70009, "Ядовитая долина", a_r6],
	[143950, -67449, "Ядовитая долина", a_r6],
	[144018, -67203, "Ядовитая долина", a_r6],
	[143642, -67306, "Ядовитая долина", a_r6],
	[141882, -110260, "Лес", a_r2],
	[141882, -110132, "Лес", a_r2],
	[141882, -110004, "Лес", a_r2],
	[141754, -110132, "Лес", a_r2],
	[70000, -27718, "Лес", a_r2],
	[70000, -27462, "Лес", a_r2],
	[69872, -27590, "Лес", a_r2],
	[41345, -14572, "Лес", a_r2],
	[41345, -14444, "Лес", a_r2],
	[41345, -14316, "Лес", a_r2],
	[41217, -14444, "Лес", a_r2],
	[53160, -16, "Лес", a_r2],
	[53288, -144, "Лес", a_r2],
	[119904, -60269, "Лес", a_r2],
	[119904, -60141, "Лес", a_r2],
	[119904, -60013, "Лес", a_r2],
	[119776, -60141, "Лес", a_r2],
	[117362, -34501, "Лес", a_r2],
	[117362, -34245, "Лес", a_r2],
	[60455, -61880, "Лес", a_r2],
	[60579, -61775, "Лес", a_r2],
	[60359, -61792, "Лес", a_r2],
	[111761, -88605, "Лес", a_r2],
	[111761, -88349, "Лес", a_r2],
	[111633, -88477, "Лес", a_r2],
	[92704, -96841, "Лес", a_r2],
	[92704, -96713, "Лес", a_r2],
	[37004, -94402, "Лес", a_r2],
	[36876, -94274, "Лес", a_r2],
	[48368, -95444, "Лес", a_r2],
	[48368, -95700, "Лес", a_r2],
	[37004, -94146, "Лес", a_r2],
	[56919, -89404, "Лес", a_r2],
	[56919, -89660, "Лес", a_r2],
	[4675, -90412, "Лес", a_r2],
	[4675, -90156, "Лес", a_r2],
	[4547, -90284, "Лес", a_r2],
	[21755, -80783, "Лес", a_r2],
	[21755, -80655, "Лес", a_r2],
	[21755, -80527, "Лес", a_r2],
	[21627, -80655, "Лес", a_r2],
	[127894, -115260, "Лес", a_r2],
	[127894, -115004, "Лес", a_r2],
	[127766, -115132, "Лес", a_r2],
	[130585, -101219, "Лес", a_r2],
	[130585, -100963, "Лес", a_r2],
	[130457, -101091, "Лес", a_r2],
	[89376, -111329, "Лес", a_r2],
	[89272, -111327, "Лес", a_r2],
	[89478, -111326, "Лес", a_r2],
	[74542, -101435, "Лес", a_r2],
	[74542, -101307, "Лес", a_r2],
	[74542, -101563, "Лес", a_r2],
	[62956, -102442, "Лес", a_r2],
	[62956, -102314, "Лес", a_r2],
	[62956, -102186, "Лес", a_r2],
	[7076, -126528, "Лес", a_r2],
	[7076, -126272, "Лес", a_r2],
	[26650, -112262, "Лес", a_r2],
	[26662, -112060, "Лес", a_r2],
	[-21016, -154979, "Лес", a_r2],
	[-21016, -154851, "Лес", a_r2],
	[-21016, -154723, "Лес", a_r2],
	[-21144, -154851, "Лес", a_r2],
	[-15507, -142254, "Лес", a_r2],
	[-15507, -141998, "Лес", a_r2],
	[-15635, -142126, "Лес", a_r2],
	[-41009, -158118, "Лес", a_r2],
	[-40881, -158246, "Лес", a_r2],
	[-40881, -157990, "Лес", a_r2],
	[-36230, -141783, "Лес", a_r2],
	[-36230, -141527, "Лес", a_r2],
	[-36358, -141655, "Лес", a_r2],
	[-71411, -163511, "Шлаковая бездна", a_r3],
	[-70870, -163009, "Шлаковая бездна", a_r3],
	[-89104, -153092, "Шлаковая бездна", a_r3],
	[-89104, -152964, "Шлаковая бездна", a_r3],
	[-89104, -153220, "Шлаковая бездна", a_r3],
	[-89232, -153092, "Шлаковая бездна", a_r3],
	[-31736, -173191, "Лес", a_r2],
	[-31736, -172935, "Лес", a_r2],
	[-31864, -173063, "Лес", a_r2],
	[-35439, -182744, "Лес", a_r2],
	[-35323, -182637, "Лес", a_r2],
	[-35694, -182485, "Лес", a_r2],
	[-72020, -164317, "Шлаковая бездна", a_r3],
	[-124266, -167887, "Шлаковая бездна", a_r3],
	[-124222, -167767, "Шлаковая бездна", a_r3],
	[-124179, -167646, "Шлаковая бездна", a_r3],
	[-124343, -167723, "Шлаковая бездна", a_r3],
	[-172427, -149676, "Шлаковая бездна", a_r3],
	[-172416, -149803, "Шлаковая бездна", a_r3],
	[-172307, -149819, "Шлаковая бездна", a_r3],
	[-172519, -149739, "Шлаковая бездна", a_r3],
	[87128, -148039, "Лес", a_r2],
	[87128, -147783, "Лес", a_r2],
	[87000, -147911, "Лес", a_r2],
	[57818, -155737, "Лес", a_r2],
	[57818, -155481, "Лес", a_r2],
	[57690, -155609, "Лес", a_r2],
	[64950, -149822, "Лес", a_r2],
	[64950, -149566, "Лес", a_r2],
	[64822, -149694, "Лес", a_r2],
	[63241, -139218, "Лес", a_r2],
	[63241, -138962, "Лес", a_r2],
	[63113, -139090, "Лес", a_r2],
	[18155, -133646, "Лес", a_r2],
	[18155, -133390, "Лес", a_r2],
	[18027, -133518, "Лес", a_r2],
	[-55003, 197031, "Топь", a_r5],
	[-55003, 197159, "Топь", a_r5],
	[-55131, 197031, "Топь", a_r5],
	[-87840, 202600, "Клюквенное болото", a_r1],
	[-87624, 203000, "Клюквенное болото", a_r1],
	[-11825, 168441, "Топь", a_r5],
	[-11825, 168569, "Топь", a_r5],
	[-11953, 168569, "Топь", a_r5],
	[-35227, 185886, "Топь", a_r5],
	[-35227, 186014, "Топь", a_r5],
	[-35227, 186142, "Топь", a_r5],
	[-35355, 186014, "Топь", a_r5],
	[-9392, 140758, "Топь", a_r5],
	[-9392, 140886, "Топь", a_r5],
	[-80231, 137469, "Клюквенное болото", a_r1],
	[-80359, 137341, "Клюквенное болото", a_r1],
	[-112456, 136117, "Клюквенное болото", a_r1],
	[-112381, 136250, "Клюквенное болото", a_r1],
	[-112456, 136373, "Клюквенное болото", a_r1],
	[-173722, 188899, "Клюквенное болото", a_r1],
	[-173716, 189125, "Клюквенное болото", a_r1],
	[-173850, 189027, "Клюквенное болото", a_r1],
	[-170213, 133401, "Клюквенное болото", a_r1],
	[-170213, 133529, "Клюквенное болото", a_r1],
	[-170213, 133657, "Клюквенное болото", a_r1],
	[-170341, 133529, "Клюквенное болото", a_r1],
	[-173188, 141583, "Клюквенное болото", a_r1],
	[-173316, 141455, "Клюквенное болото", a_r1],
	[133140, 202661, "Топь", a_r5],
	[133140, 202789, "Топь", a_r5],
	[133140, 202917, "Топь", a_r5],
	[133012, 202789, "Топь", a_r5],
	[204618, 165237, "Дикий рубеж", a_r4],
	[204441, 165275, "Дикий рубеж", a_r4],
	[204403, 165099, "Дикий рубеж", a_r4],
	[204510, 165168, "Дикий рубеж", a_r4],
	[201112, 178855, "Дикий рубеж", a_r4],
	[201240, 178855, "Дикий рубеж", a_r4],
	[201240, 178983, "Дикий рубеж", a_r4],
	[201240, 178727, "Дикий рубеж", a_r4],
	[182341, 182416, "Топь", a_r5],
	[182438, 182531, "Топь", a_r5],
	[182341, 182672, "Топь", a_r5],
	[182213, 182544, "Топь", a_r5],
	[132842, 178090, "Топь", a_r5],
	[132842, 178218, "Топь", a_r5],
	[161617, 186159, "Топь", a_r5],
	[161617, 186287, "Топь", a_r5],
	[161489, 186287, "Топь", a_r5],
	[202490, 133428, "Дикий рубеж", a_r4],
	[202490, 133300, "Дикий рубеж", a_r4],
	[202362, 133428, "Дикий рубеж", a_r4],
	[200368, 149328, "Дикий рубеж", a_r4],
	[200376, 148587, "Дикий рубеж", a_r4],
	[200303, 148667, "Дикий рубеж", a_r4],
	[173163, 137435, "Дикий рубеж", a_r4],
	[172971, 137535, "Дикий рубеж", a_r4],
	[172962, 137058, "Дикий рубеж", a_r4],
	[172843, 137407, "Дикий рубеж", a_r4],
	[171053, 148310, "Дикий рубеж", a_r4],
	[171053, 148182, "Дикий рубеж", a_r4],
	[170925, 148310, "Дикий рубеж", a_r4],
	[171053, 148438, "Дикий рубеж", a_r4],
	[131731, 136300, "Дикий рубеж", a_r4],
	[131731, 136172, "Дикий рубеж", a_r4],
	[105008, 202768, "Топь", a_r5],
	[105008, 203024, "Топь", a_r5],
	[104880, 202896, "Топь", a_r5],
	[67686, 190705, "Топь", a_r5],
	[67686, 190833, "Топь", a_r5],
	[67558, 190705, "Топь", a_r5],
	[5987, 194526, "Топь", a_r5],
	[5987, 194654, "Топь", a_r5],
	[5987, 194782, "Топь", a_r5],
	[5859, 194654, "Топь", a_r5],
	[30245, 194296, "Топь", a_r5],
	[30245, 194424, "Топь", a_r5],
	[30245, 194552, "Топь", a_r5],
	[30117, 194424, "Топь", a_r5],
	[96188, 133055, "Дикий рубеж", a_r4],
	[96316, 133055, "Дикий рубеж", a_r4],
	[96412, 133197, "Дикий рубеж", a_r4],
	[71549, 145674, "Топь", a_r5],
	[71421, 145802, "Топь", a_r5],
	[34503, 137764, "Топь", a_r5],
	[34503, 137892, "Топь", a_r5],
	[55436, 153971, "Топь", a_r5],
	[55436, 154099, "Топь", a_r5],
	[55436, 154227, "Топь", a_r5],
	[-84537, 100109, "Дикий рубеж", a_r4],
	[-84537, 100381, "Дикий рубеж", a_r4],
	[-95639, 123934, "Клюквенное болото", a_r1],
	[-119224, 101178, "Дикий рубеж", a_r4],
	[-119224, 101434, "Дикий рубеж", a_r4],
	[-119352, 101306, "Дикий рубеж", a_r4],
	[-114164, 99586, "Дикий рубеж", a_r4],
	[-114164, 99714, "Дикий рубеж", a_r4],
	[-114164, 99842, "Дикий рубеж", a_r4],
	[-114292, 99714, "Дикий рубеж", a_r4],
	[-104972, 100878, "Дикий рубеж", a_r4],
	[-123904, 130689, "Клюквенное болото", a_r1],
	[-123938, 130813, "Клюквенное болото", a_r1],
	[-123972, 130936, "Клюквенное болото", a_r1],
	[-124061, 130778, "Клюквенное болото", a_r1],
	[-69940, 83148, "Дикий рубеж", a_r4],
	[-70057, 83174, "Дикий рубеж", a_r4],
	[-70025, 82965, "Дикий рубеж", a_r4],
	[-70148, 83009, "Дикий рубеж", a_r4],
	[-109773, 75430, "Дикий рубеж", a_r4],
	[-109901, 75558, "Дикий рубеж", a_r4],
	[-18311, 58920, "Дикий рубеж", a_r4],
	[-18311, 59048, "Дикий рубеж", a_r4],
	[-18311, 59176, "Дикий рубеж", a_r4],
	[-18439, 59048, "Дикий рубеж", a_r4],
	[-74434, 45442, "Дикий рубеж", a_r4],
	[-74434, 45698, "Дикий рубеж", a_r4],
	[-74562, 45570, "Дикий рубеж", a_r4],
	[-93102, 50346, "Дикий рубеж", a_r4],
	[-93102, 50474, "Дикий рубеж", a_r4],
	[-93102, 50602, "Дикий рубеж", a_r4],
	[-93230, 50474, "Дикий рубеж", a_r4],
	[-76255, 51465, "Дикий рубеж", a_r4],
	[-76383, 51337, "Дикий рубеж", a_r4],
	[-76255, 51209, "Дикий рубеж", a_r4],
	[-79406, 16925, "Дикий рубеж", a_r4],
	[-79534, 17053, "Дикий рубеж", a_r4],
	[-125193, 22826, "Дикий рубеж", a_r4],
	[-113567, 23776, "Дикий рубеж", a_r4],
	[-113695, 23648, "Дикий рубеж", a_r4],
	[-149891, 122383, "Клюквенное болото", a_r1],
	[-149891, 122511, "Клюквенное болото", a_r1],
	[-140932, 76352, "Дикий рубеж", a_r4],
	[-140932, 76480, "Дикий рубеж", a_r4],
	[-141060, 76480, "Дикий рубеж", a_r4],
	[-153576, 43502, "Дикий рубеж", a_r4],
	[-153576, 43630, "Дикий рубеж", a_r4],
	[-153576, 43758, "Дикий рубеж", a_r4],
	[-145071, 45868, "Дикий рубеж", a_r4],
	[-145071, 45996, "Дикий рубеж", a_r4],
	[-134452, 51012, "Дикий рубеж", a_r4],
	[-134452, 51140, "Дикий рубеж", a_r4],
	[-134452, 51268, "Дикий рубеж", a_r4],
	[-134580, 51140, "Дикий рубеж", a_r4],
	[-173024, 46643, "Дикий рубеж", a_r4],
	[-173217, 46690, "Дикий рубеж", a_r4],
	[-157725, 22074, "Дикий рубеж", a_r4],
	[-149143, 30951, "Дикий рубеж", a_r4],
	[-149120, 31167, "Дикий рубеж", a_r4],
	[-149333, 31082, "Дикий рубеж", a_r4],
	[140871, 67703, "Дикий рубеж", a_r4],
	[140871, 67575, "Дикий рубеж", a_r4],
	[139257, 75415, "Дикий рубеж", a_r4],
	[139385, 75409, "Дикий рубеж", a_r4],
	[139391, 75537, "Дикий рубеж", a_r4],
	[139379, 75281, "Дикий рубеж", a_r4],
	[145430, 84566, "Дикий рубеж", a_r4],
	[145385, 84151, "Дикий рубеж", a_r4],
	[144954, 84399, "Дикий рубеж", a_r4],
	[199509, 34790, "Ядовитая долина", a_r6],
	[199553, 34948, "Ядовитая долина", a_r6],
	[199498, 35153, "Ядовитая долина", a_r6],
	[196834, 10113, "Ядовитая долина", a_r6],
	[196624, 10188, "Ядовитая долина", a_r6],
	[199811, 17748, "Ядовитая долина", a_r6],
	[199811, 17876, "Ядовитая долина", a_r6],
	[199811, 18004, "Ядовитая долина", a_r6],
	[167514, 8407, "Ядовитая долина", a_r6],
	[167514, 8663, "Ядовитая долина", a_r6],
	[167386, 8535, "Ядовитая долина", a_r6],
	[162544, 9692, "Ядовитая долина", a_r6],
	[162544, 9820, "Ядовитая долина", a_r6],
	[162416, 9692, "Ядовитая долина", a_r6],
	[156687, 19084, "Ядовитая долина", a_r6],
	[156743, 19368, "Ядовитая долина", a_r6],
	[156559, 19212, "Ядовитая долина", a_r6],
	[72226, 113252, "Дикий рубеж", a_r4],
	[72318, 113162, "Дикий рубеж", a_r4],
	[72137, 113160, "Дикий рубеж", a_r4],
	[48690, 110780, "Дикий рубеж", a_r4],
	[48690, 110652, "Дикий рубеж", a_r4],
	[48562, 110780, "Дикий рубеж", a_r4],
	[60166, 116725, "Дикий рубеж", a_r4],
	[60038, 116725, "Дикий рубеж", a_r4],
	[11040, 99751, "Дикий рубеж", a_r4],
	[11168, 99751, "Дикий рубеж", a_r4],
	[11168, 99879, "Дикий рубеж", a_r4],
	[19017, 110518, "Дикий рубеж", a_r4],
	[19017, 110646, "Дикий рубеж", a_r4],
	[19017, 110774, "Дикий рубеж", a_r4],
	[106306, 68182, "Дикий рубеж", a_r4],
	[106218, 68553, "Дикий рубеж", a_r4],
	[126868, 71561, "Дикий рубеж", a_r4],
	[126996, 71689, "Дикий рубеж", a_r4],
	[125355, 94280, "Дикий рубеж", a_r4],
	[125483, 94280, "Дикий рубеж", a_r4],
	[125483, 94408, "Дикий рубеж", a_r4],
	[88479, 86572, "Дикий рубеж", a_r4],
	[88479, 86700, "Дикий рубеж", a_r4],
	[88351, 86700, "Дикий рубеж", a_r4],
	[8885, 67639, "Дикий рубеж", a_r4],
	[8650, 67635, "Дикий рубеж", a_r4],
	[8757, 67511, "Дикий рубеж", a_r4],
	[28172, 92060, "Дикий рубеж", a_r4],
	[28196, 91971, "Дикий рубеж", a_r4],
	[105765, 17661, "Лес", a_r2],
	[105765, 17789, "Лес", a_r2],
	[105765, 17917, "Лес", a_r2],
	[105637, 17789, "Лес", a_r2],
	[120214, 16874, "Ядовитая долина", a_r6],
	[120086, 16746, "Ядовитая долина", a_r6],
	[78800, 4818, "Лес", a_r2],
	[78800, 4562, "Лес", a_r2],
	[53288, 111, "Лес", a_r2],
	[29645, 2332, "Лес", a_r2],
	[29645, 2460, "Лес", a_r2],
	[29645, 2588, "Лес", a_r2],
	[29517, 2460, "Лес", a_r2],
	[26488, -112296, "Лес", a_r2],
	[-155000, -94517, "Шлаковая бездна", a_r3],
// LvlCritterB
	[-121076, -9445, "Дикий рубеж", a_r4],
	[-120948, -9573, "Дикий рубеж", a_r4],
	[-60453, -64637, "Лес", a_r2],
	[-60581, -64765, "Лес", a_r2],
	[-60453, -64893, "Лес", a_r2],
	[-61633, -48012, "Лес", a_r2],
	[-61761, -48140, "Лес", a_r2],
	[-61633, -48268, "Лес", a_r2],
	[-12349, -87321, "Лес", a_r2],
	[-12477, -87449, "Лес", a_r2],
	[-12349, -87577, "Лес", a_r2],
	[-30720, -75458, "Лес", a_r2],
	[-30720, -75714, "Лес", a_r2],
	[-120849, -79997, "Шлаковая бездна", a_r3],
	[-120977, -79869, "Шлаковая бездна", a_r3],
	[-120849, -79869, "Шлаковая бездна", a_r3],
	[-14906, -98499, "Лес", a_r2],
	[-14906, -98371, "Лес", a_r2],
	[-15034, -98499, "Лес", a_r2],
	[-14906, -98627, "Лес", a_r2],
	[-33477, -110669, "Лес", a_r2],
	[-33349, -110797, "Лес", a_r2],
	[-33349, -110541, "Лес", a_r2],
	[-146616, -26960, "Дикий рубеж", a_r4],
	[-146616, -27088, "Дикий рубеж", a_r4],
	[-144191, -9496, "Дикий рубеж", a_r4],
	[-174416, -71690, "Дикий рубеж", a_r4],
	[-174508, -71579, "Дикий рубеж", a_r4],
	[-174636, -71707, "Дикий рубеж", a_r4],
	[-174508, -71835, "Дикий рубеж", a_r4],
	[-177876, -108685, "Дикий рубеж", a_r4],
	[-177876, -108557, "Дикий рубеж", a_r4],
	[-177876, -108429, "Дикий рубеж", a_r4],
	[177536, -26100, "Ядовитая долина", a_r6],
	[177536, -26356, "Ядовитая долина", a_r6],
	[189937, -399, "Ядовитая долина", a_r6],
	[189937, -527, "Ядовитая долина", a_r6],
	[140815, -26862, "Ядовитая долина", a_r6],
	[140748, -26694, "Ядовитая долина", a_r6],
	[140620, -26822, "Ядовитая долина", a_r6],
	[143107, -8646, "Ядовитая долина", a_r6],
	[142990, -8527, "Ядовитая долина", a_r6],
	[142990, -8783, "Ядовитая долина", a_r6],
	[147765, -2169, "Ядовитая долина", a_r6],
	[147637, -2297, "Ядовитая долина", a_r6],
	[189976, -46720, "Ядовитая долина", a_r6],
	[189976, -46592, "Ядовитая долина", a_r6],
	[189848, -46720, "Ядовитая долина", a_r6],
	[190104, -46720, "Ядовитая долина", a_r6],
	[181077, -44308, "Ядовитая долина", a_r6],
	[180853, -44345, "Ядовитая долина", a_r6],
	[180981, -44473, "Ядовитая долина", a_r6],
	[148467, -38805, "Ядовитая долина", a_r6],
	[148339, -38933, "Ядовитая долина", a_r6],
	[148467, -39061, "Ядовитая долина", a_r6],
	[149710, -90660, "Лес", a_r2],
	[149710, -90532, "Лес", a_r2],
	[149710, -90788, "Лес", a_r2],
	[157212, -75950, "Ядовитая долина", a_r6],
	[157084, -76078, "Ядовитая долина", a_r6],
	[137431, -67695, "Ядовитая долина", a_r6],
	[137303, -67823, "Ядовитая долина", a_r6],
	[137431, -67951, "Ядовитая долина", a_r6],
	[153534, -68773, "Ядовитая долина", a_r6],
	[153493, -68529, "Ядовитая долина", a_r6],
	[192252, -107705, "Лес", a_r2],
	[192252, -107833, "Лес", a_r2],
	[137020, -121729, "Лес", a_r2],
	[137364, -121933, "Лес", a_r2],
	[137298, -121713, "Лес", a_r2],
	[117258, -17504, "Лес", a_r2],
	[117130, -17632, "Лес", a_r2],
	[117258, -17760, "Лес", a_r2],
	[109529, -490, "Лес", a_r2],
	[109401, -618, "Лес", a_r2],
	[109529, -746, "Лес", a_r2],
	[67523, -157, "Лес", a_r2],
	[101217, -34802, "Лес", a_r2],
	[101089, -34930, "Лес", a_r2],
	[101217, -35058, "Лес", a_r2],
	[74981, -48158, "Лес", a_r2],
	[74981, -48414, "Лес", a_r2],
	[44446, -62220, "Лес", a_r2],
	[44318, -62348, "Лес", a_r2],
	[44446, -62476, "Лес", a_r2],
	[64368, -34882, "Лес", a_r2],
	[64368, -34754, "Лес", a_r2],
	[64240, -34882, "Лес", a_r2],
	[64368, -35010, "Лес", a_r2],
	[108429, -66584, "Лес", a_r2],
	[108429, -66840, "Лес", a_r2],
	[129990, -68853, "Ядовитая долина", a_r6],
	[129990, -69109, "Ядовитая долина", a_r6],
	[83493, -97594, "Лес", a_r2],
	[83493, -97850, "Лес", a_r2],
	[68598, -93832, "Лес", a_r2],
	[68522, -93904, "Лес", a_r2],
	[68420, -94057, "Лес", a_r2],
	[49047, -87212, "Лес", a_r2],
	[49175, -87084, "Лес", a_r2],
	[49175, -87212, "Лес", a_r2],
	[49175, -87340, "Лес", a_r2],
	[20858, -96305, "Лес", a_r2],
	[20858, -96561, "Лес", a_r2],
	[30224, -95864, "Лес", a_r2],
	[30224, -95992, "Лес", a_r2],
	[30224, -96120, "Лес", a_r2],
	[28601, -79940, "Лес", a_r2],
	[28729, -79812, "Лес", a_r2],
	[28729, -80068, "Лес", a_r2],
	[114487, -112916, "Лес", a_r2],
	[80994, -130274, "Лес", a_r2],
	[81112, -130256, "Лес", a_r2],
	[81112, -130512, "Лес", a_r2],
	[92600, -116960, "Лес", a_r2],
	[93000, -117232, "Лес", a_r2],
	[69570, -111186, "Лес", a_r2],
	[69570, -111314, "Лес", a_r2],
	[69570, -111442, "Лес", a_r2],
	[33582, -125017, "Лес", a_r2],
	[33582, -125273, "Лес", a_r2],
	[37717, -98865, "Лес", a_r2],
	[37717, -98993, "Лес", a_r2],
	[37717, -99121, "Лес", a_r2],
	[-25270, -149620, "Лес", a_r2],
	[-25270, -149876, "Лес", a_r2],
	[-34456, -163756, "Лес", a_r2],
	[-40747, -148067, "Лес", a_r2],
	[-40747, -147939, "Лес", a_r2],
	[-40875, -148067, "Лес", a_r2],
	[-40747, -148195, "Лес", a_r2],
	[-106783, -148918, "Шлаковая бездна", a_r3],
	[-106783, -149046, "Шлаковая бездна", a_r3],
	[-106783, -149174, "Шлаковая бездна", a_r3],
	[-106911, -149046, "Шлаковая бездна", a_r3],
	[-34456, -164012, "Лес", a_r2],
	[-81345, -167110, "Шлаковая бездна", a_r3],
	[-81345, -167238, "Шлаковая бездна", a_r3],
	[-81345, -167366, "Шлаковая бездна", a_r3],
	[-81473, -167238, "Шлаковая бездна", a_r3],
	[192076, -161895, "Лес", a_r2],
	[191802, -161856, "Лес", a_r2],
	[69136, -160354, "Лес", a_r2],
	[69147, -160193, "Лес", a_r2],
	[69061, -160281, "Лес", a_r2],
	[69352, -160329, "Лес", a_r2],
	[96595, -144921, "Лес", a_r2],
	[96595, -145177, "Лес", a_r2],
	[51886, -139936, "Лес", a_r2],
	[51886, -140192, "Лес", a_r2],
	[16821, -143651, "Лес", a_r2],
	[16693, -143779, "Лес", a_r2],
	[16821, -143907, "Лес", a_r2],
	[-34944, 203194, "Топь", a_r5],
	[-34934, 202905, "Топь", a_r5],
	[-22711, 177976, "Топь", a_r5],
	[-22859, 178058, "Топь", a_r5],
	[-22706, 178130, "Топь", a_r5],
	[-54271, 166294, "Клюквенное болото", a_r1],
	[-53557, 166555, "Клюквенное болото", a_r1],
	[-53637, 166510, "Клюквенное болото", a_r1],
	[-54192, 166330, "Клюквенное болото", a_r1],
	[-121367, 177388, "Клюквенное болото", a_r1],
	[-121495, 177388, "Клюквенное болото", a_r1],
	[-121367, 177260, "Клюквенное болото", a_r1],
	[-108243, 183513, "Клюквенное болото", a_r1],
	[-108257, 183770, "Клюквенное болото", a_r1],
	[-19538, 136589, "Топь", a_r5],
	[-19437, 137676, "Топь", a_r5],
	[-19191, 137305, "Топь", a_r5],
	[-19840, 137395, "Топь", a_r5],
	[-71816, 145976, "Клюквенное болото", a_r1],
	[-71680, 145864, "Клюквенное болото", a_r1],
	[-71536, 145776, "Клюквенное болото", a_r1],
	[-94880, 150296, "Клюквенное болото", a_r1],
	[-95411, 148748, "Клюквенное болото", a_r1],
	[-95256, 148400, "Клюквенное болото", a_r1],
	[-93630, 150297, "Клюквенное болото", a_r1],
	[-93299, 147931, "Клюквенное болото", a_r1],
	[-86816, 151176, "Клюквенное болото", a_r1],
	[-86688, 150368, "Клюквенное болото", a_r1],
	[-93367, 151898, "Клюквенное болото", a_r1],
	[-90218, 162138, "Клюквенное болото", a_r1],
	[-90219, 162380, "Клюквенное болото", a_r1],
	[-89208, 162836, "Клюквенное болото", a_r1],
	[-89337, 162870, "Клюквенное болото", a_r1],
	[-111897, 145051, "Клюквенное болото", a_r1],
	[-112025, 145051, "Клюквенное болото", a_r1],
	[-111897, 144923, "Клюквенное болото", a_r1],
	[-142241, 197197, "Клюквенное болото", a_r1],
	[-142369, 197197, "Клюквенное болото", a_r1],
	[-142241, 197069, "Клюквенное болото", a_r1],
	[-176647, 167704, "Клюквенное болото", a_r1],
	[-177004, 174217, "Клюквенное болото", a_r1],
	[-177042, 174557, "Клюквенное болото", a_r1],
	[-176913, 174453, "Клюквенное болото", a_r1],
	[-136441, 162315, "Клюквенное болото", a_r1],
	[-136557, 162559, "Клюквенное болото", a_r1],
	[-136736, 162358, "Клюквенное болото", a_r1],
	[-135969, 162166, "Клюквенное болото", a_r1],
	[-135963, 162048, "Клюквенное болото", a_r1],
	[-135867, 162105, "Клюквенное болото", a_r1],
	[177906, 198834, "Топь", a_r5],
	[177839, 198955, "Топь", a_r5],
	[177681, 198838, "Топь", a_r5],
	[193681, 167377, "Дикий рубеж", a_r4],
	[193905, 167111, "Дикий рубеж", a_r4],
	[193809, 167505, "Дикий рубеж", a_r4],
	[193809, 167377, "Дикий рубеж", a_r4],
	[148072, 182945, "Топь", a_r5],
	[148072, 182817, "Топь", a_r5],
	[188708, 131334, "Дикий рубеж", a_r4],
	[188708, 131206, "Дикий рубеж", a_r4],
	[159092, 150318, "Дикий рубеж", a_r4],
	[159092, 150446, "Дикий рубеж", a_r4],
	[113117, 168351, "Топь", a_r5],
	[113117, 168479, "Топь", a_r5],
	[112989, 168351, "Топь", a_r5],
	[113117, 168223, "Топь", a_r5],
	[92289, 169937, "Топь", a_r5],
	[92289, 170065, "Топь", a_r5],
	[55086, 165779, "Топь", a_r5],
	[55086, 165651, "Топь", a_r5],
	[54496, 189680, "Топь", a_r5],
	[54496, 189808, "Топь", a_r5],
	[54496, 189552, "Топь", a_r5],
	[110817, 131675, "Дикий рубеж", a_r4],
	[110818, 131548, "Дикий рубеж", a_r4],
	[110690, 131548, "Дикий рубеж", a_r4],
	[63093, 161787, "Топь", a_r5],
	[63093, 161915, "Топь", a_r5],
	[63093, 161659, "Топь", a_r5],
	[17984, 143517, "Топь", a_r5],
	[17984, 143645, "Топь", a_r5],
	[17984, 143389, "Топь", a_r5],
	[-59925, 117188, "Дикий рубеж", a_r4],
	[-60295, 116921, "Дикий рубеж", a_r4],
	[-96032, 103700, "Дикий рубеж", a_r4],
	[-95903, 103500, "Дикий рубеж", a_r4],
	[-76665, 129087, "Клюквенное болото", a_r1],
	[-77176, 76701, "Дикий рубеж", a_r4],
	[-77562, 76887, "Дикий рубеж", a_r4],
	[-77562, 77015, "Дикий рубеж", a_r4],
	[-130953, 84598, "Дикий рубеж", a_r4],
	[-130953, 84726, "Дикий рубеж", a_r4],
	[-130953, 84470, "Дикий рубеж", a_r4],
	[-102545, 89608, "Дикий рубеж", a_r4],
	[-102545, 89736, "Дикий рубеж", a_r4],
	[-102673, 89608, "Дикий рубеж", a_r4],
	[-102545, 89480, "Дикий рубеж", a_r4],
	[-80888, 37924, "Дикий рубеж", a_r4],
	[-80888, 38052, "Дикий рубеж", a_r4],
	[-81016, 38052, "Дикий рубеж", a_r4],
	[-105158, 54779, "Дикий рубеж", a_r4],
	[-105158, 54907, "Дикий рубеж", a_r4],
	[-87166, 24503, "Дикий рубеж", a_r4],
	[-87049, 24887, "Дикий рубеж", a_r4],
	[-87096, 25114, "Дикий рубеж", a_r4],
	[-87695, 24793, "Дикий рубеж", a_r4],
	[-107590, 31819, "Дикий рубеж", a_r4],
	[-107462, 31691, "Дикий рубеж", a_r4],
	[-137248, 116288, "Клюквенное болото", a_r1],
	[-137248, 116416, "Клюквенное болото", a_r1],
	[-137376, 116288, "Клюквенное болото", a_r1],
	[-137248, 116160, "Клюквенное болото", a_r1],
	[-159050, 125239, "Клюквенное болото", a_r1],
	[-164608, 115400, "Клюквенное болото", a_r1],
	[-164608, 115528, "Клюквенное болото", a_r1],
	[-164736, 115400, "Клюквенное болото", a_r1],
	[-150057, 72520, "Дикий рубеж", a_r4],
	[-131081, 84598, "Дикий рубеж", a_r4],
	[-158074, 43756, "Дикий рубеж", a_r4],
	[-158074, 43884, "Дикий рубеж", a_r4],
	[-158202, 43756, "Дикий рубеж", a_r4],
	[-158074, 43628, "Дикий рубеж", a_r4],
	[-141205, 65236, "Дикий рубеж", a_r4],
	[-141205, 65364, "Дикий рубеж", a_r4],
	[-141333, 65236, "Дикий рубеж", a_r4],
	[-141205, 65108, "Дикий рубеж", a_r4],
	[-145042, 5269, "Дикий рубеж", a_r4],
	[-133103, 18109, "Дикий рубеж", a_r4],
	[-132975, 17981, "Дикий рубеж", a_r4],
	[-146241, 22264, "Дикий рубеж", a_r4],
	[-146221, 22018, "Дикий рубеж", a_r4],
	[-166793, 22586, "Дикий рубеж", a_r4],
	[-166866, 22700, "Дикий рубеж", a_r4],
	[-166866, 22444, "Дикий рубеж", a_r4],
	[164052, 33150, "Ядовитая долина", a_r6],
	[163924, 33022, "Ядовитая долина", a_r6],
	[193170, 40268, "Ядовитая долина", a_r6],
	[193010, 40528, "Ядовитая долина", a_r6],
	[150379, 60509, "Дикий рубеж", a_r4],
	[150507, 60509, "Дикий рубеж", a_r4],
	[150507, 60381, "Дикий рубеж", a_r4],
	[186936, 6926, "Ядовитая долина", a_r6],
	[186936, 7054, "Ядовитая долина", a_r6],
	[186808, 6926, "Ядовитая долина", a_r6],
	[168629, 14103, "Ядовитая долина", a_r6],
	[168629, 14231, "Ядовитая долина", a_r6],
	[168501, 14103, "Ядовитая долина", a_r6],
	[168629, 13975, "Ядовитая долина", a_r6],
	[177361, 14168, "Ядовитая долина", a_r6],
	[177269, 14281, "Ядовитая долина", a_r6],
	[177141, 14153, "Ядовитая долина", a_r6],
	[177269, 14025, "Ядовитая долина", a_r6],
	[172787, 20788, "Ядовитая долина", a_r6],
	[172726, 20909, "Ядовитая долина", a_r6],
	[172598, 20781, "Ядовитая долина", a_r6],
	[172726, 20653, "Ядовитая долина", a_r6],
	[191738, 21744, "Ядовитая долина", a_r6],
	[191866, 21616, "Ядовитая долина", a_r6],
	[156387, 7542, "Ядовитая долина", a_r6],
	[156387, 7670, "Ядовитая долина", a_r6],
	[156259, 7542, "Ядовитая долина", a_r6],
	[156387, 7414, "Ядовитая долина", a_r6],
	[142452, 14837, "Ядовитая долина", a_r6],
	[142580, 14709, "Ядовитая долина", a_r6],
	[149786, 13870, "Ядовитая долина", a_r6],
	[149786, 13614, "Ядовитая долина", a_r6],
	[162744, 19709, "Ядовитая долина", a_r6],
	[162744, 19837, "Ядовитая долина", a_r6],
	[162616, 19709, "Ядовитая долина", a_r6],
	[121188, 126121, "Дикий рубеж", a_r4],
	[121188, 125865, "Дикий рубеж", a_r4],
	[121188, 125993, "Дикий рубеж", a_r4],
	[121060, 125993, "Дикий рубеж", a_r4],
	[61273, 98575, "Дикий рубеж", a_r4],
	[61317, 98368, "Дикий рубеж", a_r4],
	[56493, 108330, "Дикий рубеж", a_r4],
	[56493, 108202, "Дикий рубеж", a_r4],
	[56493, 108074, "Дикий рубеж", a_r4],
	[56365, 108202, "Дикий рубеж", a_r4],
	[119726, 66652, "Дикий рубеж", a_r4],
	[119726, 66396, "Дикий рубеж", a_r4],
	[119598, 66524, "Дикий рубеж", a_r4],
	[114045, 72913, "Дикий рубеж", a_r4],
	[114173, 73041, "Дикий рубеж", a_r4],
	[114173, 72913, "Дикий рубеж", a_r4],
	[107785, 86683, "Дикий рубеж", a_r4],
	[107785, 86555, "Дикий рубеж", a_r4],
	[107657, 86683, "Дикий рубеж", a_r4],
	[125483, 94152, "Дикий рубеж", a_r4],
	[81727, 69678, "Дикий рубеж", a_r4],
	[81599, 69806, "Дикий рубеж", a_r4],
	[81727, 69806, "Дикий рубеж", a_r4],
	[74629, 93717, "Дикий рубеж", a_r4],
	[74629, 93589, "Дикий рубеж", a_r4],
	[74629, 93461, "Дикий рубеж", a_r4],
	[74501, 93589, "Дикий рубеж", a_r4],
	[61615, 98253, "Дикий рубеж", a_r4],
	[61445, 98240, "Дикий рубеж", a_r4],
	[22376, 97993, "Дикий рубеж", a_r4],
	[22376, 97865, "Дикий рубеж", a_r4],
	[22376, 97737, "Дикий рубеж", a_r4],
	[22248, 97865, "Дикий рубеж", a_r4],
	[12106, 58088, "Дикий рубеж", a_r4],
	[12074, 57962, "Дикий рубеж", a_r4],
	[67523, 98, "Лес", a_r2],
	[51938, 14185, "Лес", a_r2],
	[51938, 13929, "Лес", a_r2],
	[47570, 21524, "Лес", a_r2],
	[47571, 21753, "Лес", a_r2],
	[47575, 21638, "Лес", a_r2],
	[31655, 27911, "Дикий рубеж", a_r4],
	[31479, 27914, "Дикий рубеж", a_r4],
	[114487, -112660, "Лес", a_r2],
	[191968, -162056, "Лес", a_r2]
];

let anim1_1icons = L.layerGroup().addTo(map);
function Animals1_1OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_1Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_1icons);}}}
	else {anim1_1icons.clearLayers();}
}

let anim1_2icons = L.layerGroup().addTo(map);
function Animals1_2OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_2Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Лес") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_2icons);}}}
	else {anim1_2icons.clearLayers();}
}

let anim1_3icons = L.layerGroup().addTo(map);
function Animals1_3OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_3Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_3icons);}}}
	else {anim1_3icons.clearLayers();}
}

let anim1_4icons = L.layerGroup().addTo(map);
function Animals1_4OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_4Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Шлаковая бездна" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_4icons);}}}
	else {anim1_4icons.clearLayers();}
}

let anim1_5icons = L.layerGroup().addTo(map);
function Animals1_5OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_5Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_5icons);}}}
	else {anim1_5icons.clearLayers();}
}

let anim1_6icons = L.layerGroup().addTo(map);
function Animals1_6OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_6Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Шлаковая бездна" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_6icons);}}}
	else {anim1_6icons.clearLayers();}
}

let anim1_7icons = L.layerGroup().addTo(map);
function Animals1_7OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_7Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_7icons);}}}
	else {anim1_7icons.clearLayers();}
}

let anim1_8icons = L.layerGroup().addTo(map);
function Animals1_8OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_8Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_8icons);}}}
	else {anim1_8icons.clearLayers();}
}

let anim1_9icons = L.layerGroup().addTo(map);
function Animals1_9OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_9Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_9icons);}}}
	else {anim1_9icons.clearLayers();}
}

let anim1_10icons = L.layerGroup().addTo(map);
function Animals1_10OnOff() {
	let chbox;
	chbox=document.getElementById('Animals1_10Button');
	if (chbox.checked) {
		for (let i = 0; i < animals.length; i++) {
			if (animals[i][2] == "Клюквенное болото" || animals[i][2] == "Лес" || animals[i][2] == "Дикий рубеж" || animals[i][2] == "Топь" || animals[i][2] == "Ядовитая долина") {
			new L.circleMarker([animals[i][0],animals[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("<u>Могут заспавниться:</u><br>"+animals[i][3]).bindTooltip("<u>Могут заспавниться:</u><br>"+animals[i][3], {direction: 'top'}).addTo(anim1_10icons);}}}
	else {anim1_10icons.clearLayers();}
}

// --------------------------------------------------
let animals2 = [
//Бобер
[-54271, 166294, "00115EDA"],
[-53557, 166555, "00115EDA"],
[-53637, 166510, "00115EDA"],
[-54192, 166330, "00115EDA"],
[-19538, 136589, "00115EDA"],
[-19437, 137676, "00115EDA"],
[-19191, 137305, "00115EDA"],
[-19840, 137395, "00115EDA"],
[-71816, 145976, "00115EDA"],
[-71680, 145864, "00115EDA"],
[-71536, 145776, "00115EDA"],
[-94880, 150296, "00115EDA"],
[-95411, 148748, "00115EDA"],
[-95256, 148400, "00115EDA"],
[-93630, 150297, "00115EDA"],
[-93299, 147931, "00115EDA"],
[-86816, 151176, "00115EDA"],
[-86688, 150368, "00115EDA"],
[-93367, 151898, "00115EDA"],
[-90218, 162138, "00115EDA"],
[-90219, 162380, "00115EDA"],
[-89208, 162836, "00115EDA"],
[-89337, 162870, "00115EDA"],
[-176647, 167704, "00115EDA"],
[-177004, 174217, "00115EDA"],
[-177042, 174557, "00115EDA"],
[-176913, 174453, "00115EDA"],
[-136441, 162315, "00115EDA"],
[-136557, 162559, "00115EDA"],
[-136736, 162358, "00115EDA"],
[-135969, 162166, "00115EDA"],
[-135963, 162048, "00115EDA"],
[-135867, 162105, "00115EDA"],
[125483, 94152, "00115EDA"],
[47570, 21524, "00115EDA"],
[47571, 21753, "00115EDA"],
[47575, 21638, "00115EDA"],
//Брамин
[-119611, -46191, "003DB3D9"],
[-120178, -45444, "003DB3D9"],
[15377, -109939, "003DB3D9"],
[13384, -109602, "003DB3D9"],
[14510, -108671, "003DB3D9"],
[15923, -109241, "003DB3D9"],
[24908, -106556, "003DB3D9"],
[19435, -105664, "003DB3D9"],
[20228, -104414, "003DB3D9"],
[25567, -105993, "003DB3D9"],
[24937, -105909, "003DB3D9"],
[-148718, 115376, "003DB3D9"],
[-149307, 115152, "003DB3D9"],
[-149162, 115411, "003DB3D9"],
[5606, 64105, "003DB3D9"],
[5494, 64349, "003DB3D9"],
[5651, 64686, "003DB3D9"],
//Кошка
[13313, 174752, "004F60A6"],
[13322, 174686, "004F60A6"],
[-5710, 34070, "004F60A6"],
[-5792, 34087, "004F60A6"],
[-5634, 34056, "004F60A6"],
[-5546, 34037, "004F60A6"],
[60275, -96596, "WixonHomestead_LvlCritterCat2 &quotЧесвик II&quot [NPC_:00590119]"],
//Курица
[-104336, 35292, "00424A60"],
[-103948, 35324, "00424A60"],
[-104143, 35030, "00424A60"],
[-104014, 35152, "00424A60"],
[-104408, 35093, "00424A60"],
[-99963, 34141, "00424A60"],
[-99797, 34091, "00424A60"],
//Светлячок
[51382, -42352, "0026F9FE", "Светлячок - 3 шт.<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]"],
//Лисица
[-19573, 73328, "004F60EC"],
[-19677, 73642, "004F60EC"],
[-19346, 73794, "004F60EC"],
[-19675, 73924, "004F60EC"],
//Опоссум
[17230, -106800, "0026BB4F"],
[18676, -106124, "0026BB4F"],
[29567, -100750, "0026BB4F"],
[17751, 9760, "0026BB4F"],
[18106, 8697, "0026BB4F"],
[17890, 9472, "0026BB4F"],
[18296, 9474, "0026BB4F"],
//Кролик
[-61765, 6443, "004F60DB"],
[-63631, 7893, "004F60DB"],
[28523, 82338, "004F60DB"],
[28570, 82485, "004F60DB"],
[28570, 82613, "004F60DB"],
[28659, 82277, "004F60DB"],
[-61763, 6187, "004F60DB"],
//Лягушка
[-55593, -10244, "004F60E3"],
[-55486, -10314, "004F60E3"],
[-55380, -10385, "004F60E3"],
[-55273, -10456, "004F60E3"],
[-55166, -10527, "004F60E3"],
[50147, 118580, "004F60E3"],
[50147, 118452, "004F60E3"],
[50147, 118324, "004F60E3"],
[50019, 118452, "004F60E3"],
[158383, 21934, "004F60E3_2", "Лягушка - 10 шт.<br>[Внутри локации Шахта Карлтона]"],
//Рад-олень
[-48271, -11637, "0018DFA4"],
[47006, 42945, "0018DFA4"],
[47060, 43222, "0018DFA4"],
[104479, 132125, "0008CA3C"],
[-101232, 85708, "0008CA3C"],
[-168246, -13186, "0046DBE1"],
[-168410, -12567, "0046DBE1"],
[-167452, -14198, "0046DBE1"],
[-166195, -12922, "0046DBE1"],
[-169112, -10904, "0046DBE1"],
[-167292, -11248, "0046DBE1"],
[58602, -108132, "00115A8B"],
[16770, 272093, ":00115A8B"],
[16722, 271630, "00115A8B"],
[37200, 168546, "00115A8B"],
[38560, 169146, "00115A8B"],
[104070, 132210, "00115A8B"],
[-119920, 115605, "00115A8B"],
[-30156, 67840, "00115A8B"],
[-101357, 85971, "00115A8B"],
[91098, 39619, "00115A8B"],
[-39871, 12530, "00090E57"],
[-39802, 12442, "00090E57"],
[47604, 43184, "00090E57"],
[-48222, -11731, "00090E57"],
[47319, 42969, "00090E57"],
//Белка
[-44314, 7925, "004F60E1"],
[-38149, 6780, "004F60E1"],
[-62133, 8652, "004F60E1"],
[-50700, 13466, "004F60E1"],
[-50787, 12725, "004F60E1"],
[5569, 19459, "004F60E1"],
[5398, 19244, "004F60E1"],
[5776, 19307, "004F60E1"]
//Совенок
	// 1 в локации Яма
];
let anim2_1icons = L.layerGroup().addTo(map);
function Animals2_1OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_1Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "00115EDA") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Бобер").bindTooltip("Бобер", {direction: 'top'}).addTo(anim2_1icons);}}}
	else {anim2_1icons.clearLayers();}
}

let anim2_2icons = L.layerGroup().addTo(map);
function Animals2_2OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_2Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "003DB3D9") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Брамин").bindTooltip("Брамин", {direction: 'top'}).addTo(anim2_2icons);}}}
	else {anim2_2icons.clearLayers();}
}

let anim2_3icons = L.layerGroup().addTo(map);
function Animals2_3OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_3Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "004F60A6") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Кошка").bindTooltip("Кошка", {direction: 'top'}).addTo(anim2_3icons);}}}
	else {anim2_3icons.clearLayers();}
}

let anim2_4icons = L.layerGroup().addTo(map);
function Animals2_4OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_4Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "00424A60") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Курица").bindTooltip("Курица", {direction: 'top'}).addTo(anim2_4icons);}}}
	else {anim2_4icons.clearLayers();}
}

let anim2_5icons = L.layerGroup().addTo(map);
function Animals2_5OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_5Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "0026F9FE") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(animals2[i][3]).bindTooltip(animals2[i][3], {direction: 'top'}).addTo(anim2_5icons);}}}
	else {anim2_5icons.clearLayers();}
}

let anim2_6icons = L.layerGroup().addTo(map);
function Animals2_6OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_6Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "004F60EC") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Лисица").bindTooltip("Лисица", {direction: 'top'}).addTo(anim2_6icons);}}}
	else {anim2_6icons.clearLayers();}
}

let anim2_7icons = L.layerGroup().addTo(map);
function Animals2_7OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_7Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "0026BB4F") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Опоссум").bindTooltip("Опоссум", {direction: 'top'}).addTo(anim2_7icons);}}}
	else {anim2_7icons.clearLayers();}
}

let anim2_8icons = L.layerGroup().addTo(map);
function Animals2_8OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_8Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "004F60DB") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Кролик").bindTooltip("Кролик", {direction: 'top'}).addTo(anim2_8icons);}}}
	else {anim2_8icons.clearLayers();}
}

let anim2_9icons = L.layerGroup().addTo(map);
function Animals2_9OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_9Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "004F60E3") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Лягушка").bindTooltip("Лягушка", {direction: 'top'}).addTo(anim2_9icons);}
			if (animals2[i][2] == "004F60E3_2") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(animals2[i][3]).bindTooltip(animals2[i][3], {direction: 'top'}).addTo(anim2_9icons);}}}
	else {anim2_9icons.clearLayers();}
}

let anim2_10icons = L.layerGroup().addTo(map);
function Animals2_10OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_10Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "0018DFA4" || animals2[i][2] == "0008CA3C" || animals2[i][2] == "0046DBE1" || animals2[i][2] == "00115A8B" || animals2[i][2] == "00090E57") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Рад-олень").bindTooltip("Рад-олень", {direction: 'top'}).addTo(anim2_10icons);}}}
	else {anim2_10icons.clearLayers();}
}

let anim2_11icons = L.layerGroup().addTo(map);
function Animals2_11OnOff() {
	let chbox;
	chbox=document.getElementById('Animals2_11Button');
	if (chbox.checked) {
		for (let i = 0; i < animals2.length; i++) {
			if (animals2[i][2] == "004F60E1") {
			new L.circleMarker([animals2[i][0],animals2[i][1]], {pane: "top", color: "#ffffff"})
			.bindPopup("Белка").bindTooltip("Белка", {direction: 'top'}).addTo(anim2_11icons);}}}
	else {anim2_11icons.clearLayers();}
}
