// Оружейный верстак
let wb1icons = L.layerGroup().addTo(map);
function Wb1OnOff() {
	if (document.getElementById('Wb1Button').checked) {
		let wb1_1 = [[-11837, -68397],[-1364, -128294],[-47475, -118090],[-103772, -121000],[-148681, -57839],[-152108, -72926],[-149191, -125042],[-142213, -105804],[165325, -22112],[189988, -16925],[146829, -56157],[171513, -121687],[152395, -103369],[129781, -27339],[101180, -13913],[92707, -28821],[81842, -20943],[92016, -9761],[47675, -21028],[49939, -44210],[24901, -60490],[26665, -55148],[32345, -38573],[22984, -106987],[-6838, -161567],[-32422, -187347],[-120454, -188586],[-152069, -160999],[-138721, -147160],[-135423, -181011],[76745, -179497],[-97974, 200285],[-13739, 189226],[-38737, 190543],[-91563, 177150],[-1418, 158730],[-5365, 160680],[-37947, 159678],[-35561, 159315],[-109432, 157144],[-37339, 83689],[-65565, 36473],[-25282, 11851],[-47082, 3300],[-148536, 113280],[-132314, 10515],[134697, 127324],[169660, 57405],[27009, 49671],[-70766, 24449],[112219, 139976],[-83945, -28133],[-20650, -44372],[-55394, -60441],[-56989, -59091],[-55548, -48495],[-51729, -46616],[-41987, -38016],[-120367, -64727],[-32163, -129802],[-24364, -114349],[-34326, -114537],[-69316, -105073],[-151152, -102204],[168234, -18231],[135531, -876],[135531, -876],[204846, -92307],[161504, -91545],[103125, -21156],[27559, -31005],[18565, -1669],[62229, -58268],[37602, -42122],[114242, -75672],[67951, -87911],[85140, -83345],[93577, -84351],[44134, -81232],[47387, -66529],[120900, -120107],[125829, -99408],[84061, -109752],[58973, -101821],[20031, -107096],[-7089, -161373],[-95813, -135085],[-82934, -176568],[-122410, -187836],[-114165, -169775],[-132855, -154500],[-145783, -143147],[-146652, -143006],[78972, -154267],[97281, -135165],[73510, -175467],[-23330, 189501],[-55369, 165232],[-60652, 181636],[-83171, 166157],[-95531, 174395],[-94909, 190402],[-146152, 173978],[-158974, 185889],[-178014, 165224],[-163582, 141863],[11499, 183098],[14446, 196303],[70784, 137285],[21543, 135445],[625, 139913],[-16794, 118088],[-58276, 99723],[-8056, 45150],[-100244, 36250],[-42423, 2531],[-34859, 13539],[-46499, 27007],[-180079, 73976],[-155035, 21333],[183594, 110812],[132006, 120907],[202612, 27415],[131386, 21078],[93965, 103382],[25596, 122122],[112512, 79219],[128886, 86299],[28401, 92409],[56776, 54665],[60365, 58131],[15486, 43141],[21281, 44240],[121581, 5234],[100621, 25297]];
		let wb1_2 = [
			["Оружейный верстак - 5 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Оружейный верстак<br>[Внутри здания Восточная региональная тюрьма]", 127398, -29105],
			["Оружейный верстак<br>[Внутри локации Горящая шахта]", -102236, -84358],
			["Оружейный верстак<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Оружейный верстак<br>[Внутри локации Канализация  Дайер Кемикал]", 62784, 176065],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Капитолий Чарлстона]", -57828, -91983],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Оружейный верстак<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Оружейный верстак - 2 шт.<br>[Внутри локации Мезонин]", 14204, 39088],
			["Оружейный верстак<br>[Внутри локации Место захоронения на горе Эммет]", -51807, 56146],
			["Оружейный верстак<br>[Внутри локации Норы]", -3956, 157951],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Обсерватория АТЛАС]", 73912, 79507],
			["Оружейный верстак<br>[Внутри здания Особняк Риверсайд]", -70220, -70715],
			["Оружейный верстак<br>[Внутри локации &quotОтрыжка Бетти&quot]", -82471, -118114],
			["Оружейный верстак<br>[Внутри здания Офис компании &quotЛюмбер&quot, Западная Вирджиния]", 189120, -168814],
			["Оружейный верстак<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Оружейный верстак<br>[Внутри локации Подземный бункер &quotГрафтон стил&quot]", -82471, -118114],
			["Оружейный верстак - 3 шт.<br>[Внутри локации Точка &quotАльфа&quot]", -14505, 80945],
			["Оружейный верстак - 4 шт.<br>[Внутри локации Точка &quotБраво&quot]", 137056, 43038],
			["Оружейный верстак - 4 шт.<br>[Внутри локации Точка &quotЧарли&quot]", -118164, 1654],
			["Оружейный верстак - 4 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Оружейный верстак<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -149488, 112944],
			["Оружейный верстак<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -120808, -44088],
			["Оружейный верстак - 4 шт.<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Университет &quotВолт-Тек&quot]", 82071, -8020],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Форт Дефайанс]", -131600, 107048],
			["Оружейный верстак<br>[Внутри локации Шахта &quotБлэкуотер&quot]", -46520, 28168],
			["Оружейный верстак<br>[Внутри локации Шахта Карлтона]", 158383, 21934],
			["Оружейный верстак<br>[Внутри локации Шахта &quotМононга&quot]", 111115, 58020],
			["Оружейный верстак<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Оружейный верстак<br>[Внутри здания Штаб-квартира &quotХорнрайт индастриал&quot]", -46784, -108174],
			["Оружейный верстак<br>[Внутри здания Шугар гроув]", -15204, 118972],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Электростанция &quotГрозовая гора&quot]", 98395, 192590],
			["Оружейный верстак - 2 шт.<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Оружейный верстак<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032]
		];
		for (let i = 0; i < wb1_1.length; i++) {
			new L.circleMarker([wb1_1[i][0],wb1_1[i][1]], {pane: "top", color: "#85cace"})
			.bindPopup("Оружейный верстак")
			.bindTooltip("Оружейный верстак", {direction: 'top'})
			.addTo(wb1icons);
		}
		for (let i = 0; i < wb1_2.length; i++) {
			new L.circleMarker([wb1_2[i][1],wb1_2[i][2]], {pane: "top", color: "#85cace", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb1_2[i][0])
			.bindTooltip(wb1_2[i][0], {direction: 'top'})
			.addTo(wb1icons);
		}
	}
	else {
		wb1icons.clearLayers();
	}
}
// Верстак для брони
let wb2icons = L.layerGroup().addTo(map);
function Wb2OnOff() {
	if (document.getElementById('Wb2Button').checked) {
		let wb2_1 = [[-20816, -46437],[-38017, -58378],[-46657, -50760],[-55297, -48103],[-41777, -37936],[-117583, -62046],[-119195, -46349],[-12293, -68277],[-84814, -80398],[-115749, -98004],[-126371, -73415],[-1574, -130595],[-48103, -118246],[-69484, -105346],[-112084, -122791],[-148240, -57902],[-140594, -106989],[188247, -29505],[168045, -25712],[179272, -10289],[139544, -907],[139544, -907],[205326, -92028],[158060, -68553],[177822, -123924],[129832, -27982],[129910, -27921],[106143, -21224],[101208, -982],[90972, -30387],[48463, -21867],[4218, -32063],[19782, -1315],[111344, -55540],[49970, -43476],[24766, -60446],[26933, -55065],[56891, -94838],[43845, -80906],[120926, -121243],[86956, -116145],[45637, -113458],[45637, -113458],[17997, -108690],[-2190, -159460],[-32861, -151719],[-82339, -160809],[-14530, -173513],[-82815, -179280],[-114729, -171295],[194808, -145510],[173318, -140260],[188828, -165373],[52976, -149188],[-59209, 181666],[-83272, 165763],[-89895, 181161],[-19601, 145366],[-6901, 146063],[-1762, 158304],[-27078, 162615],[-16776, 163445],[-4183, 161967],[-42704, 137114],[-38873, 160756],[-90165, 147854],[-139208, 173322],[-158361, 186067],[68567, 202664],[15943, 198174],[16399, 189829],[70267, 137540],[-15994, 119532],[-103101, 121642],[-65331, 36429],[-103466, 38407],[-24435, 10147],[-47082, 2488],[-42222, 2611],[-46458, 29068],[-148728, 113792],[-153688, 129872],[-164344, 122744],[182563, 112859],[168908, 59003],[202563, 27590],[136018, 14899],[132766, 17872],[93965, 103774],[25065, 122159],[29440, 120471],[130235, 74396],[129125, 86519],[13801, 42965],[9871, 48545],[16293, 48662],[24172, 47290],[24836, 46951],[97128, -135198],[-132495, -148773]];
		let wb2_2 = [
			["Верстак для брони<br>[Внутри локации Бункер Рейли Клэя]", 59527, 185466],
			["Верстак для брони - 5 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Верстак для брони<br>[Внутри здания Восточная региональная тюрьма]", 127398, -29105],
			["Верстак для брони<br>[Внутри локации Горящая шахта]", -102236, -84358],
			["Верстак для брони<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Верстак для брони - 2 шт.<br>[Внутри локации Зал основателя]", -104134, 38583],
			["Верстак для брони<br>[Внутри здания Национальный исследовательский центр радиоастрономии]", -43120, 112631],
			["Верстак для брони - 2 шт.<br>[Внутри здания Капитолий Чарлстона]", -57828, -91983],
			["Верстак для брони - 2 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Верстак для брони<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Верстак для брони<br>[Внутри локации Мезонин]", 14204, 39088],
			["Верстак для брони<br>[Внутри локации Норы]", -3956, 157951],
			["Верстак для брони<br>[Внутри здания Обсерватория АТЛАС]", 73912, 79507],
			["Верстак для брони - 2 шт.<br>[Внутри здания Особняк Риверсайд]", -70220, -70715],
			["Верстак для брони<br>[Внутри локации &quotОтрыжка Бетти&quot]", -82471, -118114],
			["Верстак для брони<br>[Внутри здания Офис компании &quotЛюмбер&quot, Западная Вирджиния]", 189120, -168814],
			["Верстак для брони<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Верстак для брони<br>[Внутри локации Подземный бункер &quotГрафтон стил&quot]", -82471, -118114],
			["Верстак для брони<br>[Внутри локации Рабочая площадка возле дозорного пункта Кратера]", 199312, -6712],
			["Верстак для брони - 2 шт.<br>[Внутри локации Точка &quotАльфа&quot]", -14505, 80945],
			["Верстак для брони - 2 шт.<br>[Внутри локации Точка &quotБраво&quot]", 137056, 43038],
			["Верстак для брони - 2 шт.<br>[Внутри локации Точка &quotЧарли&quot]", -118164, 1654],
			["Верстак для брони<br>[Внутри локации &quotРжавая кирка&quot]", -74719, -113348],
			["Верстак для брони - 2 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Верстак для брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -149488, 112944],
			["Верстак для брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -120808, -44088],
			["Верстак для брони - 5 шт.<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Верстак для брони - 2 шт.<br>[Внутри здания Университет &quotВолт-Тек&quot]", 82071, -8020],
			["Верстак для брони<br>[Внутри локации Шахта &quotБлэкуотер&quot]", -46520, 28168],
			["Верстак для брони<br>[Внутри локации Шахта &quotГоули&quot]", 62688, -58605],
			["Верстак для брони<br>[Внутри локации Шахта Карлтона]", 158383, 21934],
			["Верстак для брони<br>[Внутри локации Шахта &quotМононга&quot]", 111115, 58020],
			["Верстак для брони<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Верстак для брони<br>[Внутри здания Шугар гроув]", -15204, 118972],
			["Верстак для брони<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Верстак для брони - 2 шт.<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032],
			["Верстак для брони<br>[Внутри локации Ядро Кратера]", 200289, 27587]
		];
		for (let i = 0; i < wb2_1.length; i++) {
			new L.circleMarker([wb2_1[i][0],wb2_1[i][1]], {pane: "top", color: "#b87b4f"})
			.bindPopup("Верстак для брони")
			.bindTooltip("Верстак для брони", {direction: 'top'})
			.addTo(wb2icons);
		}
		for (let i = 0; i < wb2_2.length; i++) {
			new L.circleMarker([wb2_2[i][1],wb2_2[i][2]], {pane: "top", color: "#b87b4f", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb2_2[i][0])
			.bindTooltip(wb2_2[i][0], {direction: 'top'})
			.addTo(wb2icons);
		}
	}
	else {
		wb2icons.clearLayers();
	}
}
// Ремонтный верстак
let wb3icons = L.layerGroup().addTo(map);
function Wb3OnOff() {
	if (document.getElementById('Wb3Button').checked) {
		let wb3_1 = [[-24551, -58992],[-52231, -46475],[-119730, -46725],[-45723, -72600],[-93129, -83532],[-99930, -67002],[-1307, -129174],[-15722, -125143],[-10807, -123513],[-111266, -112390],[-148500, -57821],[-147825, -56911],[-152031, -71728],[-148460, -125838],[-138705, -106225],[199314, -7214],[187870, -16209],[140954, -347],[142366, -59852],[151460, -43868],[197039, -91013],[182829, -93358],[183347, -77244],[160825, -91820],[130004, -27892],[101311, -14175],[90069, -10619],[90134, -9310],[9124, -30580],[50634, -44232],[27026, -62709],[29403, -58721],[26577, -55280],[55955, -65930],[120888, -120296],[69647, -103922],[61031, -99318],[10014, -107371],[22725, -108196],[-1062, -162867],[-81613, -160972],[-95976, -135056],[-124011, -132933],[-5329, -170368],[-113826, -171025],[-139198, -147032],[166363, -149022],[142584, -151455],[131528, -132036],[126020, -154077],[74632, -177137],[78840, -173229],[-61178, 204452],[-95554, 184139],[-4078, 162312],[-42747, 137466],[-35491, 159014],[-105076, 140588],[-150100, 150817],[189057, 230126],[152812, 140453],[68191, 202022],[101126, 192410],[107229, 162064],[71935, 138317],[84842, 151849],[45018, 161859],[14868, 136474],[349, 139642],[-64228, 40482],[-64394, 41843],[-100093, 36421],[-103361, 38581],[-46470, 2707],[-42547, 2379],[-46649, 19858],[-46224, 28809],[-98515, 8088],[-152356, 761],[200001, 46038],[169236, 59097],[160532, 58808],[202410, 27928],[190200, 31179],[132489, 20960],[97375, 103733],[24792, 69427],[53969, 55927],[122245, 4074],[18556, 29],[-101416, -130232]];
		let wb3_2 = [
			["Ремонтный верстак<br>[Внутри локации Бункер Рейли Клэя]", 59527, 185466],
			["Ремонтный верстак - 5 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Ремонтный верстак<br>[Внутри здания Ван Лоу, таксидермист]", -112937, -62704],
			["Ремонтный верстак<br>[Внутри здания Восточная региональная тюрьма]", 127398, -29105],
			["Ремонтный верстак<br>[Внутри локации Горящая шахта]", -102236, -84358],
			["Ремонтный верстак<br>[Внутри здания Дом смотрительницы]", 25824, -55264],
			["Ремонтный верстак<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Ремонтный верстак<br>[Внутри локации Зал основателя]", -104134, 38583],
			["Ремонтный верстак - 4 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Ремонтный верстак<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Ремонтный верстак<br>[Внутри здания Ломбард Графтона]", 146626, -51271],
			["Ремонтный верстак<br>[Внутри локации Мезонин]", 14204, 39088],
			["Ремонтный верстак<br>[Внутри локации Место захоронения на горе Эммет]", -51807, 56146],
			["Ремонтный верстак - 2 шт.<br>[Внутри локации Норы]", -3956, 157951],
			["Ремонтный верстак<br>[Внутри здания Особняк Риверсайд]", -70220, -70715],
			["Ремонтный верстак<br>[Внутри локации &quotОтрыжка Бетти&quot]", -82471, -118114],
			["Ремонтный верстак<br>[Внутри здания Офис компании &quotЛюмбер&quot, Западная Вирджиния]", 189120, -168814],
			["Ремонтный верстак<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Ремонтный верстак<br>[Внутри локации Разграбленный бункер]", 688, 193738],
			["Ремонтный верстак<br>[Внутри локации Точка &quotАльфа&quot]", -14505, 80945],
			["Ремонтный верстак - 2 шт.<br>[Внутри локации Точка &quotБраво&quot]", 137056, 43038],
			["Ремонтный верстак - 2 шт.<br>[Внутри локации Точка &quotЧарли&quot]", -118164, 1654],
			["Ремонтный верстак<br>[Внутри локации &quotРжавая кирка&quot]", -74719, -113348],
			["Ремонтный верстак - 2 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Ремонтный верстак<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Ремонтный верстак<br>[Внутри локации Уединенная пещера]", -142539, 26594],
			["Ремонтный верстак<br>[Внутри здания Форт Дефайанс]", -131600, 107048],
			["Ремонтный верстак<br>[Внутри здания Центр &quotВест-Тек Рисерч&quot]", -60624, 88526],
			["Ремонтный верстак<br>[Внутри локации Шахта &quotМононга&quot]", 111115, 58020],
			["Ремонтный верстак<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Ремонтный верстак<br>[Внутри здания Штаб-квартира &quotХорнрайт индастриал&quot]", -46784, -108174],
			["Ремонтный верстак<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Ремонтный верстак - 2 шт.<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032],
			["Ремонтный верстак<br>[Внутри локации Ядро Кратера]", 200289, 27587]
		];
		for (let i = 0; i < wb3_1.length; i++) {
			new L.circleMarker([wb3_1[i][0],wb3_1[i][1]], {pane: "top", color: "#7fa235"})
			.bindPopup("Ремонтный верстак")
			.bindTooltip("Ремонтный верстак", {direction: 'top'})
			.addTo(wb3icons);
		}
		for (let i = 0; i < wb3_2.length; i++) {
			new L.circleMarker([wb3_2[i][1],wb3_2[i][2]], {pane: "top", color: "#7fa235", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb3_2[i][0])
			.bindTooltip(wb3_2[i][0], {direction: 'top'})
			.addTo(wb3icons);
		}
	}
	else {
		wb3icons.clearLayers();
	}
}
// Химлаборатория
let wb4icons = L.layerGroup().addTo(map);
function Wb4OnOff() {
	if (document.getElementById('Wb4Button').checked) {
		let wb4_1 = [[-28459, -60654],[-15083, -43879],[-39452, -58810],[-61341, -101176],[-82189, -126291],[-79601, -107622],[-151539, -73202],[-149060, -125837],[183373, -92408],[160596, -91863],[153099, -103560],[101479, -29116],[103370, -10538],[50180, -45082],[36174, -41942],[49398, -44255],[50948, -41201],[50926, -41725],[50922, -42747],[50947, -41962],[12213, -60612],[120996, -119914],[21009, -109599],[-124033, -131368],[164393, -150526],[75613, -172551],[-83990, 165744],[-93306, 177584],[-95091, 181108],[-39116, 160048],[-160943, 155489],[15744, 197825],[2847, 182059],[1062, 139424],[7219, 162342],[-12556, 116268],[168851, 58419],[168678, 58974],[95474, 98929],[78788, 52934],[22001, 45255],[16770, 49368],[129329, 20033],[-110563, -61097],[-24356, -73210],[-99567, -82028],[-169234, -23432],[-166874, -14109],[-131584, -114083],[144667, -56859],[148868, -79762],[89874, -29654],[96266, -13964],[97035, -14000],[90126, -56888],[30024, -58048],[26912, -55417],[21249, -109442],[-41129, -176133],[-123398, -185698],[136845, -162858],[187678, -165527],[-59943, 177813],[-91873, 178136],[-91771, 183429],[-97307, 184772],[42222, 177227],[71792, 133512],[89534, 152241],[-88439, 66121],[-64234, 41412],[-100295, 36046],[-46233, 28957],[202493, 27716],[95329, 99012],[95708, 105873],[115189, 69203],[64116, 172949]];
		let wb4_2 = [
			["Химлаборатория<br>[Внутри локации Бункер Сэма Блэквелла]", 26723, 185034],
			["Химлаборатория - 7 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Химлаборатория - 2 шт.<br>[Внутри локации Бункер Эллы Эймс]", 102922, 165802],
			["Химлаборатория<br>[Внутри здания Ван Лоу, таксидермист]", -112937, -62704],
			["Химлаборатория<br>[Внутри здания Восточная региональная тюрьма]", 127398, -29105],
			["Химлаборатория<br>[Внутри здания Дом &quotЭта Пси&quot]", 85875, 5283],
			["Химлаборатория<br>[Внутри локации Заброшенный бункер]", 127372, 154881],
			["Химлаборатория<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Химлаборатория<br>[Внутри локации Зал основателя]", -104134, 38583],
			["Химлаборатория - 2 шт.<br>[Внутри здания Исследовательский центр &quotРобКо&quot]", -64897, 200091],
			["Химлаборатория<br>[Внутри здания Капитолий Чарлстона]", -57828, -91983],
			["Химлаборатория<br>[Внутри здания Капитолий Чарлстона - суд]", -57285, -93883],
			["Химлаборатория - 2 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Химлаборатория<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Химлаборатория - 2 шт.<br>[Внутри здания Медцентр AVR]", -55735, -114894],
			["Химлаборатория<br>[Внутри локации Мезонин]", 14204, 39088],
			["Химлаборатория<br>[Внутри локации Норы]", -3956, 157951],
			["Химлаборатория - 3 шт.<br>[Внутри здания Обсерватория АТЛАС]", 73912, 79507],
			["Химлаборатория<br>[Внутри здания Особняк Риверсайд]", -70220, -70715],
			["Химлаборатория<br>[Внутри локации &quotОтрыжка Бетти&quot]", -82471, -118114],
			["Химлаборатория<br>[Внутри здания Офис компании &quotЛюмбер&quot, Западная Вирджиния]", 189120, -168814],
			["Химлаборатория - 4 шт.<br>[Внутри здания Переработка пищевых продуктов &quotМама Дольче&quot]", 84461, -15851],
			["Химлаборатория<br>[Внутри локации Подвал особняка Бердеттов]", -56961,-59783],
			["Химлаборатория<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Химлаборатория<br>[Внутри локации Подземный бункер &quotГрафтон стил&quot]", -82471, -118114],
			["Химлаборатория<br>[Внутри локации &quotРжавая кирка&quot]", -74719, -113348],
			["Химлаборатория - 3 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Химлаборатория<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -149488, 112944],
			["Химлаборатория<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -120808, -44088],
			["Химлаборатория<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Химлаборатория - 2 шт.<br>[Внутри здания Форт Дефайанс]", -131600, 107048],
			["Химлаборатория - 2 шт.<br>[Внутри здания Центр аграрных исследований &quotВолт-Тек&quot]", 19445, -117195],
			["Химлаборатория - 7 шт.<br>[Внутри здания Центр &quotВест-Тек Рисерч&quot]", -60624, 88526],
			["Химлаборатория<br>[Внутри локации Шахта &quotБлэкуотер&quot]", -46520, 28168],
			["Химлаборатория<br>[Внутри локации Шахта &quotМононга&quot]", 111115, 58020],
			["Химлаборатория<br>[Внутри локации Шахта &quotСчастливая дыра&quot]", -138108, 88917],
			["Химлаборатория - 2 шт.<br>[Внутри здания Школа Ватоги]", -146584, 153175],
			["Химлаборатория<br>[Внутри здания Школа Моргантауна]", 94128, 2135],
			["Химлаборатория<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Химлаборатория - 2 шт.<br>[Внутри здания Штаб-квартира &quotХорнрайт индастриал&quot]", -46784, -108174],
			["Химлаборатория<br>[Внутри здания Электростанция &quotГрозовая гора&quot]", 98395, 192590],
			["Химлаборатория<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Химлаборатория<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032],
			["Химлаборатория<br>[Внутри локации Ядро Кратера]", 200289, 27587]
		];
		for (let i = 0; i < wb4_1.length; i++) {
			new L.circleMarker([wb4_1[i][0],wb4_1[i][1]], {pane: "top", color: "#c1bbb2"})
			.bindPopup("Химлаборатория")
			.bindTooltip("Химлаборатория", {direction: 'top'})
			.addTo(wb4icons);
		}
		for (let i = 0; i < wb4_2.length; i++) {
			new L.circleMarker([wb4_2[i][1],wb4_2[i][2]], {pane: "top", color: "#c1bbb2", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb4_2[i][0])
			.bindTooltip(wb4_2[i][0], {direction: 'top'})
			.addTo(wb4icons);
		}
	}
	else {
		wb4icons.clearLayers();
	}
}
// Пункт обслуживания силовой брони
let wb5icons = L.layerGroup().addTo(map);
function Wb5OnOff() {
	if (document.getElementById('Wb5Button').checked) {
		let wb5_1 = [[-99730, -81941],[-10610, -123823],[-130481, -112250],[-115691, -99092],[-148406, -57419],[-149559, -125757],[-149786, -125757],[171701, -121668],[128978, -28719],[128784, -28160],[128881, -28440],[81813, -21569],[111655, -55856],[91917, -58501],[51928, -44436],[-6540, -161463],[-116945, -136154],[-123946, -133269],[-43086, -173530],[-83193, -178713],[-114926, -170869],[189730, -165860],[189471, -165860],[115115, -157782],[111605, -147319],[76861, -179737],[-16376, 163816],[-39207, 160444],[-39088, 160641],[-169343, 202494],[-155446, 165215],[-145393, 174046],[-140766, 179088],[152028, 140646],[-87955, 67654],[-65613, 34914],[-103807, 35737],[-104008, 35826],[-41976, 2584],[-47055, 26786],[-148999, 113592],[-148999, 113408],[-164097, 121737],[-152955, 123],[202150, 27945],[132822, 17185],[94336, 104706],[130381, 86254],[99062, 91836],[60680, 57405],[122203, 3494]];
		let wb5_2 = [
			["Пункт обслуживания силовой брони - 10 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Пункт обслуживания силовой брони<br>[Внутри локации Горящая шахта]", -102236, -84358],
			["Пункт обслуживания силовой брони<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Пункт обслуживания силовой брони - 3 шт.<br>[Внутри здания Исследовательский центр &quotРобКо&quot]", -64897, 200091],
			["Пункт обслуживания силовой брони<br>[Внутри локации Канализация  Дайер Кемикал]", 62784, 176065],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Пункт обслуживания силовой брони<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Пункт обслуживания силовой брони<br>[Внутри локации Место захоронения на горе Эммет]", -51807, 56146],
			["Пункт обслуживания силовой брони<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Пункт обслуживания силовой брони<br>[Внутри локации Подземный бункер &quotГрафтон стил&quot]", -82471, -118114],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotАльфа&quot]", -14505, 80945],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotБраво&quot]", 137056, 43038],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotЧарли&quot]", -118164, 1654],
			["Пункт обслуживания силовой брони - 4 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Пункт обслуживания силовой брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -149488, 112944],
			["Пункт обслуживания силовой брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -120808, -44088],
			["Пункт обслуживания силовой брони<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Форт Дефайанс]", -131600, 107048],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotГрозовая гора&quot]", 98395, 192590],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032],
			["Пункт обслуживания силовой брони<br>[Внутри локации Ядро Кратера]", 200289, 27587]
		];
		for (let i = 0; i < wb5_1.length; i++) {
			new L.circleMarker([wb5_1[i][0],wb5_1[i][1]], {pane: "top", color: "#f6cb2f"})
			.bindPopup("Пункт обслуживания силовой брони")
			.bindTooltip("Пункт обслуживания силовой брони", {direction: 'top'})
			.addTo(wb5icons);
		}
		for (let i = 0; i < wb5_2.length; i++) {
			new L.circleMarker([wb5_2[i][1],wb5_2[i][2]], {pane: "top", color: "#f6cb2f", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb5_2[i][0])
			.bindTooltip(wb5_2[i][0], {direction: 'top'})
			.addTo(wb5icons);
		}
	}
	else {
		wb5icons.clearLayers();
	}
}