let masloicons = L.layerGroup().addTo(map);
function MasloOnOff() {
	let chbox;
	chbox=document.getElementById('MasloButton');
	if (chbox.checked) {
		let maslo= [
			[-24282, -91240],
			[-42049, -88925],
			[-37724, -83362],
			[-153851, -1157],
			[198380, -42889],
			[145605, -35140],
			[206821, -128733],
			[-1130, -137376],
			[-125095, -192806],
			[-128640, -191832],
			[-124248, -191624],
			[-54589, 175027],
			[-95102, 187317],
			[-156225, 200978],
			[177588, 193910],
			[175893, 139668],
			[145184, 148697],
			[158001, 153492],
			[117084, 200421],
			[78239, 201062],
			[17765, 195531],
			[-27957, 70055],
			[-174109, 129189],
			[-160415, 43627],
			[181803, 113110],
			[125264, 127861],
			[123177, 70249],
			[93736, 92419],
			[127833, 17303],
			[113851, 31826]
		];
		for (let i = 0; i < maslo.length; i++) {
			new L.Marker([maslo[i][0],maslo[i][1]], {icon: icon_maslo})
				.bindPopup("Утечка нефти (Масло)")
				.bindTooltip("Утечка нефти (Масло)", {direction: 'top'})
				.addTo(masloicons);
		}
	}
	else {
		masloicons.clearLayers();
	}
}