let svinecicons = L.layerGroup().addTo(map);
function SvinecOnOff() {
	let chbox;
	chbox=document.getElementById('SvinecButton');
	if (chbox.checked) {
		let svinec = [
			[-28415, -8011],
			[-25916, -62179],
			[-103677, -75755],
			[-43915, -127902],
			[-109568, -101327],
			[-136150, -65671],
			[-77314, 193590],
			[-148177, 186901],
			[186751, 163314],
			[80350, 142322],
			[76914, 158300],
			[38264, 154989],
			[61112, 156736],
			[-130138, 112095],
			[-122176, 110985],
			[-77050, 63937],
			[-10641, 5283],
			[-142466, 50612],
			[-173130, 6591],
			[179460, 108471],
			[194440, 88137],
			[140884, 81560],
			[188996, 36387],
			[181554, 18158],
			[190540, 19400],
			[44753, 114033],
			[24120, 121168],
			[33944, 89760],
			[100019, 59961],
			[126208, 15264],
			[21125, 22283]
		];
		for (let i = 0; i < svinec.length; i++) {
			new L.Marker([svinec[i][0],svinec[i][1]], {icon: icon_svinec})
				.bindPopup("Месторождение свинца")
				.bindTooltip("Месторождение свинца", {direction: 'top'})
				.addTo(svinecicons);
		}
	}
	else {
		svinecicons.clearLayers();
	}
}