let wb5icons = L.layerGroup().addTo(map);
function Wb5OnOff() {
	let chbox;
	chbox=document.getElementById('Wb5Button');
	if (chbox.checked) {
		let wb5_1 = [
			[-99730, -81941],
			[-10610, -123823],
			[-130481, -112250],
			[-115691, -99092],
			[-148406, -57419],
			[-149559, -125757],
			[-149786, -125757],
			[171701, -121668],
			[128978, -28719],
			[128784, -28160],
			[128881, -28440],
			[81813, -21569],
			[111655, -55856],
			[91917, -58501],
			[51928, -44436],
			[-6540, -161463],
			[-116945, -136154],
			[-123946, -133269],
			[-43086, -173530],
			[-83193, -178713],
			[-114926, -170869],
			[189730, -165860],
			[189471, -165860],
			[115115, -157782],
			[111605, -147319],
			[76861, -179737],
			[-16376, 163816],
			[-39207, 160444],
			[-39088, 160641],
			[-169343, 202494],
			[-155446, 165215],
			[-145393, 174046],
			[-140766, 179088],
			[152028, 140646],
			[-87955, 67654],
			[-65613, 34914],
			[-103807, 35737],
			[-104008, 35826],
			[-41976, 2584],
			[-47055, 26786],
			[-148999, 113592],
			[-148999, 113408],
			[-164097, 121737],
			[-152955, 123],
			[202150, 27945],
			[132822, 17185],
			[94336, 104706],
			[130381, 86254],
			[99062, 91836],
			[60680, 57405],
			[122203, 3494]
		];
		let wb5_2 = [
			["Пункт обслуживания силовой брони - 10 шт.<br>[Внутри локации Бункер &quotУайтспринг&quot]", -64373, 4696],
			["Пункт обслуживания силовой брони<br>[Внутри локации Горящая шахта]", -102236, -84358],
			["Пункт обслуживания силовой брони<br>[Внутри здания Завод &quotЯдер-колы&quot — Канова]", -53492, -162144],
			["Пункт обслуживания силовой брони - 3 шт.<br>[Внутри здания Исследовательский центр &quotРобКо&quot]", -64897, 200091],
			["Пункт обслуживания силовой брони<br>[Внутри локации Канализация  Дайер Кемикал]", 62784, 176065],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Курорт &quotУайтспринг&quot]", -52810, 6663],
			["Пункт обслуживания силовой брони<br>[Внутри локации Лаборатория биомов &quotАрктос фарма&quot]", 51382, -42352],
			["Пункт обслуживания силовой брони<br>[Внутри локации Место захоронения на горе Эммет]", -51807, 56146],
			["Пункт обслуживания силовой брони<br>[Внутри локации Подземка Ватоги]", -141432, 152462],
			["Пункт обслуживания силовой брони<br>[Внутри локации Подземный бункер &quotГрафтон стил&quot]", -82471, -118114],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotАльфа&quot]", -14505, 80945],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotБраво&quot]", 137056, 43038],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри локации Точка &quotЧарли&quot]", -118164, 1654],
			["Пункт обслуживания силовой брони - 4 шт.<br>[Внутри здания Терминал аэропорта Моргантауна]", 101313, -19704],
			["Пункт обслуживания силовой брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -149488, 112944],
			["Пункт обслуживания силовой брони<br>[Внутри локации Тоннель &quotБольшой излом&quot]", -120808, -44088],
			["Пункт обслуживания силовой брони<br>[Внутри локации Убежище 79]", 186772, 145375],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Форт Дефайанс]", -131600, 107048],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Штаб-квартира &quotГаррахан майнинг&quot]", -160896, -73687],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotГрозовая гора&quot]", 98395, 192590],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotМононга&quot]", 74024, 39088],
			["Пункт обслуживания силовой брони - 2 шт.<br>[Внутри здания Электростанция &quotПосейдон Энерджи&quot WV-06]", -40971, -132032],
			["Пункт обслуживания силовой брони<br>[Внутри локации Ядро Кратера]", 200289, 27587]
		];
		for (let i = 0; i < wb5_1.length; i++) {
			new L.circleMarker([wb5_1[i][0],wb5_1[i][1]], {pane: "top", color: "#f6cb2f"})
			.bindPopup("Пункт обслуживания силовой брони")
			.bindTooltip("Пункт обслуживания силовой брони", {direction: 'top'})
			.addTo(wb5icons);
		}
		for (let i = 0; i < wb5_2.length; i++) {
			new L.circleMarker([wb5_2[i][1],wb5_2[i][2]], {pane: "top", color: "#f6cb2f", fillColor: "#000000", fillOpacity: "0.8"})
			.bindPopup(wb5_2[i][0])
			.bindTooltip(wb5_2[i][0], {direction: 'top'})
			.addTo(wb5icons);
		}
	}
	else {
		wb5icons.clearLayers();
	}
}