var hlam601icons = L.layerGroup().addTo(map);
function Hlam601OnOff() {
	var chbox601;
	chbox601=document.getElementById('Hlam601Button');
	if (chbox601.checked) {
		var hlam601 = [
			["Тряпка", -8456, -3061],
			["Тряпка", -8547, -3144],
			["Тряпка", -53398, -13684],
			["Тряпка", -51686, -12807],
			["Тряпка", -51680, -12938],
			["Тряпка", -50648, -12801],
			["Тряпка", -50741, -13816],
			["Тряпка", -53194, -13613],
			["Тряпка", -50513, -13524],
			["Тряпка", -50929, -13898],
			["Тряпка", -51906, -13870],
			["Тряпка", -52333, -13946],
			["Тряпка", -52481, -13232],
			["Тряпка", -52466, -12969],
			["Тряпка", -44829, -15776],
			["Тряпка", -44847, -15752],
			["Тряпка", -44832, -15752],
			["Тряпка", -54555, -11621],
			["Тряпка", -47989, -10236],
			["Тряпка", -41351, -1781],
			["Тряпка", -67398, -1200],
			["Тряпка", -24860, -59638],
			["Тряпка", -17382, -46355],
			["Тряпка", -19162, -47086],
			["Тряпка", -19341, -47177],
			["Тряпка", -18093, -44569],
			["Тряпка", -20466, -44186],
			["Тряпка", -61228, -57354],
			["Тряпка", -56384, -60363],
			["Тряпка", -38660, -58139],
			["Тряпка", -60058, -56760],
			["Тряпка", -47440, -51023],
			["Тряпка", -84964, -45632],
			["Тряпка", -18955, -75433],
			["Тряпка", -24198, -73145],
			["Тряпка", -12560, -69920],
			["Тряпка", -31087, -66296],
			["Тряпка", -14059, -66719],
			["Тряпка", -34808, -84248],
			["Тряпка", -58922, -79211],
			["Тряпка", -56277, -78267],
			["Тряпка", -35613, -80599],
			["Тряпка", -35834, -80709],
			["Тряпка", -59038, -72081],
			["Тряпка", -46436, -72854],
			["Тряпка", -84555, -80681],
			["Тряпка", -68257, -71983],
			["Тряпка", -107938, -84983],
			["Тряпка", -126294, -74128],
			["Тряпка", -10055, -123541],
			["Тряпка", -10705, -122879],
			["Тряпка", -6768, -117572],
			["Тряпка", -62065, -129254],
			["Тряпка", -37980, -130687],
			["Тряпка", -38313, -125238],
			["Тряпка", -44127, -107374],
			["Тряпка", -44046, -107556],
			["Тряпка", -63732, -103013],
			["Тряпка", -47617, -101011],
			["Тряпка", -47872, -100708],
			["Тряпка", -93898, -129803],
			["Тряпка", -81791, -126431],
			["Тряпка", -87292, -112552],
			["Тряпка", -80904, -102487],
			["Тряпка", -122882, -123349],
			["Тряпка", -112213, -122548],
			["Тряпка", -111474, -121928],
			["Тряпка", -163144, -55220],
			["Тряпка", -148227, -57179],
			["Тряпка", -149197, -55530],
			["Тряпка", -152253, -74877],
			["Тряпка", -151847, -74710],
			["Тряпка", -150831, -74855],
			["Тряпка", -151162, -75228],
			["Тряпка", -151750, -71989],
			["Тряпка", -131326, -113377],
			["Тряпка", -168959, -116061],
			["Тряпка", -168315, -115736],
			["Тряпка", 167393, -26326],
			["Тряпка", 191788, -28406],
			["Тряпка", 167902, -17907],
			["Тряпка", 173683, -13513],
			["Тряпка", 182079, -13872],
			["Тряпка", 172342, -11560],
			["Тряпка", 180542, -12112],
			["Тряпка", 143208, -58788],
			["Тряпка", 149057, -52530],
			["Тряпка", 148926, -52442],
			["Тряпка", 183989, -93082],
			["Тряпка", 184076, -93713],
			["Тряпка", 161353, -92092],
			["Тряпка", 147473, -78174],
			["Тряпка", 148525, -79672],
			["Тряпка", 148824, -69759],
			["Тряпка", 149885, -67175],
			["Тряпка", 150079, -67472],
			["Тряпка", 158073, -68810],
			["Тряпка", 197842, -127838],
			["Тряпка", 181243, -123112],
			["Тряпка", 152959, -103908],
			["Тряпка", 102188, -12534],
			["Тряпка", 101375, -12276],
			["Тряпка", 102997, -10451],
			["Тряпка", 129997, -2889],
			["Тряпка", 88920, -30990],
			["Тряпка", 90263, -27688],
			["Тряпка", 88300, -21315],
			["Тряпка", 88361, -21215],
			["Тряпка", 88552, -21364],
			["Тряпка", 90469, -9873],
			["Тряпка", 74267, -6574],
			["Тряпка", 88826, -6268],
			["Тряпка", 91097, -6578],
			["Тряпка", 34034, -32666],
			["Тряпка", 34180, -32755],
			["Тряпка", 48783, -22064],
			["Тряпка", 50092, -23391],
			["Тряпка", 28483, -31190],
			["Тряпка", 32114, -21474],
			["Тряпка", 29725, -21581],
			["Тряпка", 29287, -18648],
			["Тряпка", 107821, -54416],
			["Тряпка", 111484, -55324],
			["Тряпка", 111700, -56042],
			["Тряпка", 89677, -56505],
			["Тряпка", 62221, -56867],
			["Тряпка", 35897, -35225],
			["Тряпка", 34102, -36297],
			["Тряпка", 24610, -63819],
			["Тряпка", 24716, -63797],
			["Тряпка", 24707, -63779],
			["Тряпка", 29065, -58140],
			["Тряпка", 32211, -40340],
			["Тряпка", 30832, -33197],
			["Тряпка", 75577, -76592],
			["Тряпка", 8897, -82200],
			["Тряпка", 8224, -84892],
			["Тряпка", 17160, -82465],
			["Тряпка", 12391, -78184],
			["Тряпка", 15836, -79805],
			["Тряпка", 83700, -109643],
			["Тряпка", 13696, -107129],
			["Тряпка", 18553, -106800],
			["Тряпка", 18438, -106820],
			["Тряпка", 18423, -106578],
			["Тряпка", 20191, -107751],
			["Тряпка", 16799, -107212],
			["Тряпка", 17076, -106948],
			["Тряпка", 17811, -108727],
			["Тряпка", 18019, -106369],
			["Тряпка", 17162, -106493],
			["Тряпка", 19852, -104302],
			["Тряпка", -6999, -161555],
			["Тряпка", -61441, -145762],
			["Тряпка", -95335, -146617],
			["Тряпка", -126605, -144636],
			["Тряпка", -126572, -144740],
			["Тряпка", -119349, -135757],
			["Тряпка", -24166, -179938],
			["Тряпка", -43448, -173325],
			["Тряпка", -79864, -181186],
			["Тряпка", -79986, -182366],
			["Тряпка", -95477, -176474],
			["Тряпка", -139755, -144653],
			["Тряпка", -136234, -183947],
			["Тряпка", -135195, -181395],
			["Тряпка", 165716, -148683],
			["Тряпка", 144465, -145539],
			["Тряпка", 131506, -132007],
			["Тряпка", 131601, -132162],
			["Тряпка", 189980, -169744],
			["Тряпка", 195564, -168821],
			["Тряпка", 188638, -164975],
			["Тряпка", 189955, -165134],
			["Тряпка", 115636, -157692],
			["Тряпка", 26391, -137706],
			["Тряпка", 74401, -177008],
			["Тряпка", 74494, -177488],
			["Тряпка", 74251, -176948],
			["Тряпка", 74132, -172451],
			["Тряпка", 74347, -172458],
			["Тряпка", 75191, -172993],
			["Тряпка", -16984, 165142],
			["Тряпка", -13792, 189084],
			["Тряпка", -55314, 165790],
			["Тряпка", -61147, 179956],
			["Тряпка", -60953, 181710],
			["Тряпка", -59713, 180423],
			["Тряпка", -60747, 180558],
			["Тряпка", -60542, 181984],
			["Тряпка", -69242, 170997],
			["Тряпка", -94849, 174738],
			["Тряпка", -96525, 179741],
			["Тряпка", -91511, 176968],
			["Тряпка", -95563, 183984],
			["Тряпка", -94904, 183258],
			["Тряпка", -95309, 183106],
			["Тряпка", -92818, 183718],
			["Тряпка", -93017, 183337],
			["Тряпка", -91573, 183462],
			["Тряпка", -95490, 184415],
			["Тряпка", -19809, 145694],
			["Тряпка", -2125, 157394],
			["Тряпка", -1539, 158633],
			["Тряпка", -17516, 162200],
			["Тряпка", -5744, 161841],
			["Тряпка", -5657, 162054],
			["Тряпка", -6055, 162209],
			["Тряпка", -3508, 162688],
			["Тряпка", -63575, 131373],
			["Тряпка", -40509, 161201],
			["Тряпка", -39686, 163060],
			["Тряпка", -39378, 159788],
			["Тряпка", -154280, 164569],
			["Тряпка", -141105, 170351],
			["Тряпка", -145702, 172608],
			["Тряпка", -146346, 172732],
			["Тряпка", -143560, 178702],
			["Тряпка", -145585, 177393],
			["Тряпка", -160448, 152412],
			["Тряпка", -145802, 153555],
			["Тряпка", 150011, 135125],
			["Тряпка", 151883, 137758],
			["Тряпка", 152019, 137439],
			["Тряпка", 152258, 138871],
			["Тряпка", 152332, 138464],
			["Тряпка", 151570, 138545],
			["Тряпка", 148688, 140753],
			["Тряпка", 152005, 161401],
			["Тряпка", 152287, 161419],
			["Тряпка", 152729, 161641],
			["Тряпка", 152682, 161628],
			["Тряпка", 152665, 161624],
			["Тряпка", 70031, 202562],
			["Тряпка", 69702, 202262],
			["Тряпка", 124705, 168857],
			["Тряпка", 103483, 196306],
			["Тряпка", 91391, 188790],
			["Тряпка", 60251, 173278],
			["Тряпка", 1561, 164421],
			["Тряпка", 2373, 164353],
			["Тряпка", 2573, 164621],
			["Тряпка", 3492, 167943],
			["Тряпка", 2331, 179101],
			["Тряпка", 14934, 188299],
			["Тряпка", 71465, 133041],
			["Тряпка", 85860, 151500],
			["Тряпка", 19063, 134155],
			["Тряпка", 2653, 137831],
			["Тряпка", 2406, 137984],
			["Тряпка", 298, 160092],
			["Тряпка", 372, 160167],
			["Тряпка", 7338, 162680],
			["Тряпка", 6667, 161169],
			["Тряпка", -87736, 115635],
			["Тряпка", -86661, 115698],
			["Тряпка", -104043, 109222],
			["Тряпка", -129439, 119347],
			["Тряпка", -38730, 84345],
			["Тряпка", -41117, 89100],
			["Тряпка", -43652, 90850],
			["Тряпка", -128116, 83993],
			["Тряпка", -17886, 59782],
			["Тряпка", -17631, 60106],
			["Тряпка", -39479, 46374],
			["Тряпка", -37226, 48922],
			["Тряпка", -54741, 57980],
			["Тряпка", -92683, 65017],
			["Тряпка", -88109, 63689],
			["Тряпка", -104639, 41740],
			["Тряпка", -51775, 2880],
			["Тряпка", -47746, 1740],
			["Тряпка", -38698, 3396],
			["Тряпка", -39826, 2349],
			["Тряпка", -33975, 119],
			["Тряпка", -49436, 5792],
			["Тряпка", -49188, 4938],
			["Тряпка", -47405, 7014],
			["Тряпка", -40865, 9082],
			["Тряпка", -46655, 19740],
			["Тряпка", -44120, 28287],
			["Тряпка", -118358, 1785],
			["Тряпка", -99652, 7472],
			["Тряпка", -98753, 7710],
			["Тряпка", -130575, 10527],
			["Тряпка", -98939, 8207],
			["Тряпка", -137376, 88014],
			["Тряпка", -139446, 90996],
			["Тряпка", -179531, 74873],
			["Тряпка", -152031, 570],
			["Тряпка", -152058, 467],
			["Тряпка", -152800, 64],
			["Тряпка", -152094, 339],
			["Тряпка", 182732, 112776],
			["Тряпка", 182803, 111908],
			["Тряпка", 193125, 113052],
			["Тряпка", 135412, 115495],
			["Тряпка", 132775, 126657],
			["Тряпка", 182349, 96925],
			["Тряпка", 198515, 44983],
			["Тряпка", 168287, 58180],
			["Тряпка", 169568, 60090],
			["Тряпка", 191155, 62518],
			["Тряпка", 190837, 62266],
			["Тряпка", 160330, 58515],
			["Тряпка", 160434, 58387],
			["Тряпка", 171139, 1464],
			["Тряпка", 136093, 15581],
			["Тряпка", 136888, 16973],
			["Тряпка", 94559, 98849],
			["Тряпка", 94653, 98921],
			["Тряпка", 94914, 98808],
			["Тряпка", 95336, 103863],
			["Тряпка", 95092, 104084],
			["Тряпка", 94745, 103446],
			["Тряпка", 94732, 103318],
			["Тряпка", 94398, 103416],
			["Тряпка", 74404, 42920],
			["Тряпка", 35140, 40398],
			["Тряпка", 35757, 40399],
			["Тряпка", 14829, 39663],
			["Тряпка", 15087, 39160],
			["Тряпка", 14770, 39331],
			["Тряпка", 7339, 43503],
			["Тряпка", 17128, 41865],
			["Тряпка", 23613, 44271],
			["Тряпка", 16939, 45464],
			["Тряпка", 29105, 53762],
			["Тряпка", 29180, 53931],
			["Тряпка", 128739, 19314],
			["Тряпка", 82375, 15470],
			["Тряпка", 67118, 19387],
			["Тряпка", 71650, 21196],
			["Тряпка", 71728, 21209],
			["Тряпка", 55525, 10315],
			["Тряпка", 59014, 12192],
			["Тряпка", 58679, 10333]
			];
	for (var i = 0; i < hlam601.length; i++) {
				hlam_601 = new L.circleMarker([hlam601[i][1],hlam601[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam601[i][0])
					.bindTooltip(hlam601[i][0], {direction: 'top'})
					.addTo(hlam601icons);
			}
	}
	else {
		hlam601icons.clearLayers();
	}
}
var hlam602icons = L.layerGroup().addTo(map);
function Hlam602OnOff() {
	var chbox602;
	chbox602=document.getElementById('Hlam602Button');
	if (chbox602.checked) {
		var hlam602 = [
			["Туалетная бумага", -52163, -12853],
			["Туалетная бумага", -52198, -12812],
			["Туалетная бумага", -52195, -12801],
			["Туалетная бумага", -55244, -9390],
			["Туалетная бумага", -55055, -9479],
			["Туалетная бумага", -42877, -5773],
			["Туалетная бумага", -42453, -5358],
			["Туалетная бумага", -42444, -5349],
			["Туалетная бумага", -40348, -1640],
			["Туалетная бумага", -40354, -1633],
			["Туалетная бумага", -40354, -1652],
			["Туалетная бумага", -40145, -3026],
			["Туалетная бумага", -40484, -1567],
			["Туалетная бумага", -22930, -58558],
			["Туалетная бумага", -22936, -58563],
			["Туалетная бумага", -56453, -60808],
			["Туалетная бумага", -61715, -56837],
			["Туалетная бумага", -46293, -50077],
			["Туалетная бумага", -89901, -41452],
			["Туалетная бумага", -89936, -41364],
			["Туалетная бумага", -112350, -59230],
			["Туалетная бумага", -14532, -68646],
			["Туалетная бумага", -34266, -114685],
			["Туалетная бумага", -34279, -114658],
			["Туалетная бумага", -34250, -114655],
			["Туалетная бумага", -102066, -114728],
			["Туалетная бумага", -102132, -114717],
			["Туалетная бумага", -114813, -99750],
			["Туалетная бумага", -114647, -99592],
			["Туалетная бумага", -132698, -4637],
			["Туалетная бумага", -151062, -74431],
			["Туалетная бумага", -151091, -74454],
			["Туалетная бумага", -151191, -73007],
			["Туалетная бумага", -151229, -73008],
			["Туалетная бумага", -132122, -112024],
			["Туалетная бумага", -132089, -112085],
			["Туалетная бумага", 167220, -25220],
			["Туалетная бумага", 167204, -25252],
			["Туалетная бумага", 167070, -25192],
			["Туалетная бумага", 179533, -11181],
			["Туалетная бумага", 167204, -288],
			["Туалетная бумага", 167438, -43],
			["Туалетная бумага", 135936, -1178],
			["Туалетная бумага", 142300, -59659],
			["Туалетная бумага", 142309, -59675],
			["Туалетная бумага", 142268, -59666],
			["Туалетная бумага", 159072, -49265],
			["Туалетная бумага", 183720, -93462],
			["Туалетная бумага", 183749, -93413],
			["Туалетная бумага", 183759, -93434],
			["Туалетная бумага", 148565, -80108],
			["Туалетная бумага", 148578, -80184],
			["Туалетная бумага", 149111, -76073],
			["Туалетная бумага", 149145, -76098],
			["Туалетная бумага", 149142, -76100],
			["Туалетная бумага", 150211, -67575],
			["Туалетная бумага", 150242, -67571],
			["Туалетная бумага", 150239, -67573],
			["Туалетная бумага", 180778, -123759],
			["Туалетная бумага", 180775, -123772],
			["Туалетная бумага", 180776, -123773],
			["Туалетная бумага", 178125, -122211],
			["Туалетная бумага", 177665, -122375],
			["Туалетная бумага", 101356, -29264],
			["Туалетная бумага", 101369, -29246],
			["Туалетная бумага", 101371, -29247],
			["Туалетная бумага", 103715, -15275],
			["Туалетная бумага", 103678, -14994],
			["Туалетная бумага", 104070, -13561],
			["Туалетная бумага", 105773, -7060],
			["Туалетная бумага", 105553, -7082],
			["Туалетная бумага", 97209, -21695],
			["Туалетная бумага", 76575, -14754],
			["Туалетная бумага", 84025, -15926],
			["Туалетная бумага", 89291, -8682],
			["Туалетная бумага", 90970, -8652],
			["Туалетная бумага", 91979, -9876],
			["Туалетная бумага", 70218, -5319],
			["Туалетная бумага", 84359, -2023],
			["Туалетная бумага", 84577, -1980],
			["Туалетная бумага", 12141, -60450],
			["Туалетная бумага", 12149, -60470],
			["Туалетная бумага", 12151, -60469],
			["Туалетная бумага", 11194, -87177],
			["Туалетная бумага", 11284, -87241],
			["Туалетная бумага", 11244, -87154],
			["Туалетная бумага", 8973, -85907],
			["Туалетная бумага", 13623, -107254],
			["Туалетная бумага", 20023, -104061],
			["Туалетная бумага", -27665, -131790],
			["Туалетная бумага", -82532, -176603],
			["Туалетная бумага", -82543, -176615],
			["Туалетная бумага", -82522, -176622],
			["Туалетная бумага", -82545, -176599],
			["Туалетная бумага", -108987, -179176],
			["Туалетная бумага", -139261, -144115],
			["Туалетная бумага", -135087, -181334],
			["Туалетная бумага", -135123, -181347],
			["Туалетная бумага", 136098, -155266],
			["Туалетная бумага", 136280, -155158],
			["Туалетная бумага", 196079, -166938],
			["Туалетная бумага", 125681, -152828],
			["Туалетная бумага", 125726, -152818],
			["Туалетная бумага", 125731, -152811],
			["Туалетная бумага", 125722, -152818],
			["Туалетная бумага", 73577, -179291],
			["Туалетная бумага", 73540, -179320],
			["Туалетная бумага", 73528, -179328],
			["Туалетная бумага", 74443, -176610],
			["Туалетная бумага", -6119, 198533],
			["Туалетная бумага", -6112, 198523],
			["Туалетная бумага", -6102, 198550],
			["Туалетная бумага", -5881, 198337],
			["Туалетная бумага", -5759, 198437],
			["Туалетная бумага", -6119, 198536],
			["Туалетная бумага", -6098, 198544],
			["Туалетная бумага", -6126, 198541],
			["Туалетная бумага", -6108, 198544],
			["Туалетная бумага", -6107, 198555],
			["Туалетная бумага", -6450, 198400],
			["Туалетная бумага", -6482, 198327],
			["Туалетная бумага", -4167, 184407],
			["Туалетная бумага", -4155, 184413],
			["Туалетная бумага", -4159, 184397],
			["Туалетная бумага", -4151, 184408],
			["Туалетная бумага", -23313, 188902],
			["Туалетная бумага", -84292, 165669],
			["Туалетная бумага", -84300, 165856],
			["Туалетная бумага", -87835, 184493],
			["Туалетная бумага", -38842, 157126],
			["Туалетная бумага", -38842, 157169],
			["Туалетная бумага", -39785, 162422],
			["Туалетная бумага", -39721, 162400],
			["Туалетная бумага", -40904, 161276],
			["Туалетная бумага", 169543, 239678],
			["Туалетная бумага", 178858, 135917],
			["Туалетная бумага", 178853, 135905],
			["Туалетная бумага", 178814, 135880],
			["Туалетная бумага", 150023, 135118],
			["Туалетная бумага", 150719, 134430],
			["Туалетная бумага", 150714, 134417],
			["Туалетная бумага", 150054, 135240],
			["Туалетная бумага", 150008, 135258],
			["Туалетная бумага", 149256, 135420],
			["Туалетная бумага", 149237, 135427],
			["Туалетная бумага", 149265, 135505],
			["Туалетная бумага", 148361, 135817],
			["Туалетная бумага", 145386, 141489],
			["Туалетная бумага", 15489, 193250],
			["Туалетная бумага", 111947, 141332],
			["Туалетная бумага", 111951, 141356],
			["Туалетная бумага", 86191, 151719],
			["Туалетная бумага", 86302, 151738],
			["Туалетная бумага", -78459, 89825],
			["Туалетная бумага", -78517, 89519],
			["Туалетная бумага", -78515, 89517],
			["Туалетная бумага", -78511, 89528],
			["Туалетная бумага", -78504, 89544],
			["Туалетная бумага", -78516, 89539],
			["Туалетная бумага", -69007, 53914],
			["Туалетная бумага", -119504, 40369],
			["Туалетная бумага", -22705, 12211],
			["Туалетная бумага", -47518, 2339],
			["Туалетная бумага", -47522, 2325],
			["Туалетная бумага", -47751, 2562],
			["Туалетная бумага", -47738, 2555],
			["Туалетная бумага", -48063, 2502],
			["Туалетная бумага", -47597, 1803],
			["Туалетная бумага", -47583, 1856],
			["Туалетная бумага", -47658, 2196],
			["Туалетная бумага", -41358, 2648],
			["Туалетная бумага", -38966, 3280],
			["Туалетная бумага", -33276, 67],
			["Туалетная бумага", -33793, 14429],
			["Туалетная бумага", -172472, 109569],
			["Туалетная бумага", 132562, 126229],
			["Туалетная бумага", 132536, 126200],
			["Туалетная бумага", 133963, 85354],
			["Туалетная бумага", 145139, 87388],
			["Туалетная бумага", 175446, 41306],
			["Туалетная бумага", 135604, 2141],
			["Туалетная бумага", 18314, 122567],
			["Туалетная бумага", 18343, 122544],
			["Туалетная бумага", 18333, 122551],
			["Туалетная бумага", 18364, 122602],
			["Туалетная бумага", 18311, 122672],
			["Туалетная бумага", 100368, 72043],
			["Туалетная бумага", 100391, 72180],
			["Туалетная бумага", 100409, 72169],
			["Туалетная бумага", 130364, 86894],
			["Туалетная бумага", 130333, 86939],
			["Туалетная бумага", 130365, 86920],
			["Туалетная бумага", 130733, 86545],
			["Туалетная бумага", 130729, 86527],
			["Туалетная бумага", 148162, 135315],
			["Туалетная бумага", 148409, 135506],
			["Туалетная бумага", -144699, 154407]
			];
	for (var i = 0; i < hlam602.length; i++) {
				hlam_602 = new L.circleMarker([hlam602[i][1],hlam602[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam602[i][0])
					.bindTooltip(hlam602[i][0], {direction: 'top'})
					.addTo(hlam602icons);
			}
	}
	else {
		hlam602icons.clearLayers();
	}
}
var hlam603icons = L.layerGroup().addTo(map);
function Hlam603OnOff() {
	var chbox603;
	chbox603=document.getElementById('Hlam603Button');
	if (chbox603.checked) {
		var hlam603 = [
			["Увеличительное стекло", -52377, -13891],
			["Увеличительное стекло", -43814, -7443],
			["Увеличительное стекло", -53562, -1923],
			["Увеличительное стекло", -47002, -50958],
			["Увеличительное стекло", -126337, -74109],
			["Увеличительное стекло", -81808, -126476],
			["Увеличительное стекло", -122863, -123310],
			["Увеличительное стекло", -147653, -58768],
			["Увеличительное стекло", -147954, -55386],
			["Увеличительное стекло", -155461, -36620],
			["Увеличительное стекло", -168274, -115713],
			["Увеличительное стекло", 84679, -1948],
			["Увеличительное стекло", 29446, -58545],
			["Увеличительное стекло", 11611, -83638],
			["Увеличительное стекло", -61394, -145769],
			["Увеличительное стекло", 74547, -177278],
			["Увеличительное стекло", -38977, 190433],
			["Увеличительное стекло", -72909, 184581],
			["Увеличительное стекло", -10029, 132169],
			["Увеличительное стекло", -143472, 178723],
			["Увеличительное стекло", 70283, 202275],
			["Увеличительное стекло", -41829, 87488],
			["Увеличительное стекло", -74321, 48847],
			["Увеличительное стекло", -68947, 56149],
			["Увеличительное стекло", -87897, 63819],
			["Увеличительное стекло", -130591, 10571],
			["Увеличительное стекло", 88405, 105797],
			["Увеличительное стекло", 93737, 106653],
			["Увеличительное стекло", 31488, 122919],
			["Увеличительное стекло", 31391, 130181],
			["Увеличительное стекло", 71302, 96635],
			["Увеличительное стекло", 73933, 38333],
			["Увеличительное стекло", -21275, 16442]
			];
	for (var i = 0; i < hlam603.length; i++) {
				hlam_603 = new L.circleMarker([hlam603[i][1],hlam603[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam603[i][0])
					.bindTooltip(hlam603[i][0], {direction: 'top'})
					.addTo(hlam603icons);
			}
	}
	else {
		hlam603icons.clearLayers();
	}
}
var hlam604icons = L.layerGroup().addTo(map);
function Hlam604OnOff() {
	var chbox604;
	chbox604=document.getElementById('Hlam604Button');
	if (chbox604.checked) {
		var hlam604 = [

			];
	for (var i = 0; i < hlam604.length; i++) {
				hlam_604 = new L.circleMarker([hlam604[i][1],hlam604[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam604[i][0])
					.bindTooltip(hlam604[i][0], {direction: 'top'})
					.addTo(hlam604icons);
			}
	}
	else {
		hlam604icons.clearLayers();
	}
}
var hlam605icons = L.layerGroup().addTo(map);
function Hlam605OnOff() {
	var chbox605;
	chbox605=document.getElementById('Hlam605Button');
	if (chbox605.checked) {
		var hlam605 = [
			["Удочка", -9517, -27469],
			["Удочка", -9516, -27491],
			["Удочка", -76711, -14329],
			["Удочка", -120618, -22793],
			["Удочка", -25672, -56868],
			["Удочка", -17347, -46960],
			["Удочка", -39307, -55874],
			["Удочка", -59686, -72118],
			["Удочка", -46595, -72889],
			["Удочка", -46466, -72860],
			["Удочка", -46431, -72862],
			["Удочка", -46823, -70222],
			["Удочка", -46805, -70325],
			["Удочка", -47120, -70362],
			["Удочка", -47106, -70372],
			["Удочка", -45461, -72326],
			["Удочка", -40878, -68986],
			["Удочка", -80489, -102673],
			["Удочка", -144228, -42531],
			["Удочка", 175096, -15364],
			["Удочка", 174206, -13389],
			["Удочка", 176143, -14599],
			["Удочка", 176425, -14904],
			["Удочка", 170158, -4634],
			["Удочка", 168076, -800],
			["Удочка", 194616, -33178],
			["Удочка", 194166, -33302],
			["Удочка", 148631, -58955],
			["Удочка", 174902, -65907],
			["Удочка", 182949, -66770],
			["Удочка", 180002, -123436],
			["Удочка", 87980, -22224],
			["Удочка", 52586, -16967],
			["Удочка", 17942, -27323],
			["Удочка", 17955, -27319],
			["Удочка", 68332, -94963],
			["Удочка", 73745, -104381],
			["Удочка", 15947, -128867],
			["Удочка", 22708, -108169],
			["Удочка", -52262, -133967],
			["Удочка", -31161, -187897],
			["Удочка", -33012, -187636],
			["Удочка", -33072, -187377],
			["Удочка", -33080, -187410],
			["Удочка", -33084, -187428],
			["Удочка", -76512, -185455],
			["Удочка", -118973, -191412],
			["Удочка", -104288, -183849],
			["Удочка", 203008, -138139],
			["Удочка", 187498, -159016],
			["Удочка", 185043, -170534],
			["Удочка", 78310, -154295],
			["Удочка", 1306, -162715],
			["Удочка", 9382, -155296],
			["Удочка", 23390, -148722],
			["Удочка", 50159, -166294],
			["Удочка", 708, -171555],
			["Удочка", 665, -166507],
			["Удочка", -7653, 196247],
			["Удочка", -56416, 183067],
			["Удочка", -176455, 175635],
			["Удочка", 136791, 145659],
			["Удочка", 92786, 201975],
			["Удочка", 83119, 181995],
			["Удочка", 83160, 182104],
			["Удочка", 11524, 166949],
			["Удочка", 16017, 189756],
			["Удочка", 85341, 143846],
			["Удочка", 66883, 149559],
			["Удочка", 35084, 145837],
			["Удочка", 43008, 163304],
			["Удочка", 46681, 161007],
			["Удочка", 22714, 134642],
			["Удочка", -3276, 130452],
			["Удочка", -3141, 130428],
			["Удочка", -49038, 110295],
			["Удочка", -87920, 86981],
			["Удочка", -7663, 40595],
			["Удочка", -38710, 60246],
			["Удочка", -38710, 60153],
			["Удочка", -86088, 45188],
			["Удочка", -120526, 44936],
			["Удочка", -106344, 43633],
			["Удочка", -78351, 18279],
			["Удочка", -91698, 26450],
			["Удочка", -127451, 30735],
			["Удочка", -165385, 122757],
			["Удочка", -164857, 122218],
			["Удочка", -156017, 51496],
			["Удочка", -154692, 49474],
			["Удочка", -159471, 53783],
			["Удочка", 201494, 94281],
			["Удочка", 186280, 68974],
			["Удочка", 136758, 5537],
			["Удочка", 137308, 4835],
			["Удочка", 35169, 100350],
			["Удочка", 75920, 68872],
			["Удочка", 71170, 77308],
			["Удочка", 25953, 84439],
			["Удочка", 47912, 14068],
			["Удочка", -121154, 31338],
			["Удочка", -119892, -109725],
			["Удочка", -104293, 21637]
			];
	for (var i = 0; i < hlam605.length; i++) {
				hlam_605 = new L.circleMarker([hlam605[i][1],hlam605[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam605[i][0])
					.bindTooltip(hlam605[i][0], {direction: 'top'})
					.addTo(hlam605icons);
			}
	}
	else {
		hlam605icons.clearLayers();
	}
}
var hlam606icons = L.layerGroup().addTo(map);
function Hlam606OnOff() {
	var chbox606;
	chbox606=document.getElementById('Hlam606Button');
	if (chbox606.checked) {
		var hlam606 = [
			["Узор с птицами", -21666, -57649],
			["Узор с птицами", -47924, -50189],
			["Узор с птицами", -45895, -50211],
			["Узор с птицами", 183807, -91360],
			["Узор с птицами", 35833, -34865],
			["Узор с птицами", 35554, -34865],
			["Узор с птицами", -27069, -131561],
			["Узор с птицами", -37782, -184557],
			["Узор с птицами", -139757, -144768],
			["Узор с птицами", 164792, -150656],
			["Узор с птицами", -27128, 162540],
			["Узор с птицами", -20743, 16701],
			["Узор с птицами", -20598, 16490],
			["Узор с птицами", -20566, 16543],
			["Узор с птицами", -20736, 16567],
			["Узор с птицами", 196427, 65763],
			["Узор с птицами", 98103, 106354],
			["Узор с птицами", 14494, 48561],
			["Узор с птицами", 14519, 48586],
			["Узор с птицами", 15496, 50518]
			];
	for (var i = 0; i < hlam606.length; i++) {
				hlam_606 = new L.circleMarker([hlam606[i][1],hlam606[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam606[i][0])
					.bindTooltip(hlam606[i][0], {direction: 'top'})
					.addTo(hlam606icons);
			}
	}
	else {
		hlam606icons.clearLayers();
	}
}
var hlam607icons = L.layerGroup().addTo(map);
function Hlam607OnOff() {
	var chbox607;
	chbox607=document.getElementById('Hlam607Button');
	if (chbox607.checked) {
		var hlam607 = [
			["Улучшенная карта наведения", -100168, -66983],
			["Улучшенная карта наведения", -115397, -99766],
			["Улучшенная карта наведения", -149193, -125810],
			["Улучшенная карта наведения", 149486, -75846],
			["Улучшенная карта наведения", 100986, -15357],
			["Улучшенная карта наведения", 90260, -9879],
			["Улучшенная карта наведения", -114295, -169375],
			["Улучшенная карта наведения", 108194, -153476],
			["Улучшенная карта наведения", 107947, -153512],
			["Улучшенная карта наведения", -38977, 190433],
			["Улучшенная карта наведения", 190489, 30883]
			];
	for (var i = 0; i < hlam607.length; i++) {
				hlam_607 = new L.circleMarker([hlam607[i][1],hlam607[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam607[i][0])
					.bindTooltip(hlam607[i][0], {direction: 'top'})
					.addTo(hlam607icons);
			}
	}
	else {
		hlam607icons.clearLayers();
	}
}
var hlam608icons = L.layerGroup().addTo(map);
function Hlam608OnOff() {
	var chbox608;
	chbox608=document.getElementById('Hlam608Button');
	if (chbox608.checked) {
		var hlam608 = [
			["Упаковка изоленты", -15639, -47409],
			["Упаковка изоленты", -84934, -45629],
			["Упаковка изоленты", -120162, -45951],
			["Упаковка изоленты", -29476, -86750],
			["Упаковка изоленты", -84499, -80212],
			["Упаковка изоленты", -85655, -109677],
			["Упаковка изоленты", -85677, -109654],
			["Упаковка изоленты", -85661, -109653],
			["Упаковка изоленты", -124103, -127817],
			["Упаковка изоленты", -124066, -127778],
			["Упаковка изоленты", -124071, -127792],
			["Упаковка изоленты", -115351, -99787],
			["Упаковка изоленты", -148829, -125852],
			["Упаковка изоленты", 188856, -29501],
			["Упаковка изоленты", 81727, -20885],
			["Упаковка изоленты", 8243, -32226],
			["Упаковка изоленты", 89781, -56442],
			["Упаковка изоленты", 50840, -45191],
			["Упаковка изоленты", 18233, -122629],
			["Упаковка изоленты", -47931, -133904],
			["Упаковка изоленты", -100312, -156587],
			["Упаковка изоленты", -6850, -171755],
			["Упаковка изоленты", -53415, -167972],
			["Упаковка изоленты", 115337, -157734],
			["Упаковка изоленты", 27686, -137303],
			["Упаковка изоленты", 74289, -177764],
			["Упаковка изоленты", -31372, 196459],
			["Упаковка изоленты", -6434, 146487],
			["Упаковка изоленты", 153240, 139819],
			["Упаковка изоленты", 181289, 109971],
			["Упаковка изоленты", 183110, 111874],
			["Упаковка изоленты", 143951, 98442],
			["Упаковка изоленты", 154399, 77455],
			["Упаковка изоленты", 153221, 57635],
			["Упаковка изоленты", 134095, 15460],
			["Упаковка изоленты", 111628, 58107],
			["Упаковка изоленты", 16247, 44936]
			];
	for (var i = 0; i < hlam608.length; i++) {
				hlam_608 = new L.circleMarker([hlam608[i][1],hlam608[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam608[i][0])
					.bindTooltip(hlam608[i][0], {direction: 'top'})
					.addTo(hlam608icons);
			}
	}
	else {
		hlam608icons.clearLayers();
	}
}
var hlam609icons = L.layerGroup().addTo(map);
function Hlam609OnOff() {
	var chbox609;
	chbox609=document.getElementById('Hlam609Button');
	if (chbox609.checked) {
		var hlam609 = [
			["Утюг", -44832, -8540],
			["Утюг", -40457, -3166],
			["Утюг", -62685, -129244],
			["Утюг", -61676, -100310],
			["Утюг", -47474, -100721],
			["Утюг", -47622, -101018],
			["Утюг", 92786, -12603],
			["Утюг", 89170, -5869],
			["Утюг", 50690, -22984],
			["Утюг", 105346, 157006],
			["Утюг", -93332, 62249],
			["Утюг", 198441, 44972],
			["Утюг", 168426, 58222],
			["Утюг", 168165, 57757],
			["Утюг", 168208, 57602],
			["Утюг", 16492, 45489]
			];
	for (var i = 0; i < hlam609.length; i++) {
				hlam_609 = new L.circleMarker([hlam609[i][1],hlam609[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam609[i][0])
					.bindTooltip(hlam609[i][0], {direction: 'top'})
					.addTo(hlam609icons);
			}
	}
	else {
		hlam609icons.clearLayers();
	}
}
var hlam610icons = L.layerGroup().addTo(map);
function Hlam610OnOff() {
	var chbox610;
	chbox610=document.getElementById('Hlam610Button');
	if (chbox610.checked) {
		var hlam610 = [
			["Фарфоровая пивная кружка", 34611, -38314],
			["Фарфоровая пивная кружка", 34024, -38512],
			["Фарфоровая пивная кружка", 36858, -37707],
			["Фарфоровая пивная кружка", 33208, -39871],
			["Фарфоровая пивная кружка", 34073, -38807],
			["Фарфоровая пивная кружка", 34325, -38929],
			["Фарфоровая пивная кружка", 34518, -38881],
			["Фарфоровая пивная кружка", 32994, -38454],
			["Фарфоровая пивная кружка", 32991, -39695],
			["Фарфоровая пивная кружка", 34623, -38986],
			["Фарфоровая пивная кружка", 32976, -38883],
			["Фарфоровая пивная кружка", 39252, -37238],
			["Фарфоровая пивная кружка", 39091, -37321],
			["Фарфоровая пивная кружка", 37224, -38664],
			["Фарфоровая пивная кружка", 32907, -33947],
			["Фарфоровая пивная кружка", 35487, -35320],
			["Фарфоровая пивная кружка", 35351, -34883],
			["Фарфоровая пивная кружка", 32872, -34079],
			["Фарфоровая пивная кружка", 37406, -35169],
			["Фарфоровая пивная кружка", 37480, -35007],
			["Фарфоровая пивная кружка", 31757, -35344],
			["Фарфоровая пивная кружка", 31512, -35239]
			];
	for (var i = 0; i < hlam610.length; i++) {
				hlam_610 = new L.circleMarker([hlam610[i][1],hlam610[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam610[i][0])
					.bindTooltip(hlam610[i][0], {direction: 'top'})
					.addTo(hlam610icons);
			}
	}
	else {
		hlam610icons.clearLayers();
	}
}
var hlam611icons = L.layerGroup().addTo(map);
function Hlam611OnOff() {
	var chbox611;
	chbox611=document.getElementById('Hlam611Button');
	if (chbox611.checked) {
		var hlam611 = [
			["Фланец карданной трубы", -82191, -29511],
			["Фланец карданной трубы", -84260, -28934],
			["Фланец карданной трубы", -84036, -29020],
			["Фланец карданной трубы", -83080, -29938],
			["Фланец карданной трубы", -82923, -29095],
			["Фланец карданной трубы", -37757, -58695],
			["Фланец карданной трубы", -91678, -51730],
			["Фланец карданной трубы", -120561, -47130],
			["Фланец карданной трубы", -120575, -45922],
			["Фланец карданной трубы", -120172, -45948],
			["Фланец карданной трубы", -29585, -94035],
			["Фланец карданной трубы", -29696, -94094],
			["Фланец карданной трубы", -29715, -94076],
			["Фланец карданной трубы", -34204, -85026],
			["Фланец карданной трубы", -34131, -85044],
			["Фланец карданной трубы", -34117, -85015],
			["Фланец карданной трубы", -47220, -72267],
			["Фланец карданной трубы", -47119, -72732],
			["Фланец карданной трубы", -43841, -125393],
			["Фланец карданной трубы", -92582, -99839],
			["Фланец карданной трубы", -121698, -112045],
			["Фланец карданной трубы", -121876, -112177],
			["Фланец карданной трубы", -148233, -57604],
			["Фланец карданной трубы", -163099, -55191],
			["Фланец карданной трубы", -146495, -95896],
			["Фланец карданной трубы", -146473, -95892],
			["Фланец карданной трубы", -168098, -112497],
			["Фланец карданной трубы", 196888, -30835],
			["Фланец карданной трубы", 196885, -30858],
			["Фланец карданной трубы", 189318, -30452],
			["Фланец карданной трубы", 167313, -20140],
			["Фланец карданной трубы", 181114, -59373],
			["Фланец карданной трубы", 142355, -59746],
			["Фланец карданной трубы", 130092, -27514],
			["Фланец карданной трубы", 88924, -31254],
			["Фланец карданной трубы", 90283, -29917],
			["Фланец карданной трубы", 81731, -20797],
			["Фланец карданной трубы", 82041, -21248],
			["Фланец карданной трубы", 84631, -19399],
			["Фланец карданной трубы", 70190, -8005],
			["Фланец карданной трубы", 48079, -22198],
			["Фланец карданной трубы", 27686, -31254],
			["Фланец карданной трубы", 111749, -55947],
			["Фланец карданной трубы", 61876, -57316],
			["Фланец карданной трубы", 61894, -57303],
			["Фланец карданной трубы", 25721, -61049],
			["Фланец карданной трубы", 29259, -58602],
			["Фланец карданной трубы", 29274, -58627],
			["Фланец карданной трубы", 39612, -96870],
			["Фланец карданной трубы", 56905, -94387],
			["Фланец карданной трубы", 56903, -94426],
			["Фланец карданной трубы", 37253, -91312],
			["Фланец карданной трубы", 23119, -107041],
			["Фланец карданной трубы", 22736, -101814],
			["Фланец карданной трубы", -59343, -150084],
			["Фланец карданной трубы", -59273, -149878],
			["Фланец карданной трубы", -126399, -135318],
			["Фланец карданной трубы", -116583, -137757],
			["Фланец карданной трубы", -82919, -179133],
			["Фланец карданной трубы", -82698, -178509],
			["Фланец карданной трубы", -82650, -178174],
			["Фланец карданной трубы", -81534, -178675],
			["Фланец карданной трубы", -81902, -179851],
			["Фланец карданной трубы", -146140, -143214],
			["Фланец карданной трубы", -146162, -143239],
			["Фланец карданной трубы", -146227, -143201],
			["Фланец карданной трубы", 187178, -153295],
			["Фланец карданной трубы", 131564, -132191],
			["Фланец карданной трубы", 191716, -169422],
			["Фланец карданной трубы", 189053, -165979],
			["Фланец карданной трубы", 115612, -157731],
			["Фланец карданной трубы", 108074, -153924],
			["Фланец карданной трубы", 111831, -147607],
			["Фланец карданной трубы", 92577, -161085],
			["Фланец карданной трубы", -16482, 164706],
			["Фланец карданной трубы", -22927, 189372],
			["Фланец карданной трубы", -39452, 190266],
			["Фланец карданной трубы", -39438, 190259],
			["Фланец карданной трубы", -79771, 180168],
			["Фланец карданной трубы", -95308, 190052],
			["Фланец карданной трубы", -95033, 190458],
			["Фланец карданной трубы", -94114, 190636],
			["Фланец карданной трубы", -98933, 183486],
			["Фланец карданной трубы", -19815, 145738],
			["Фланец карданной трубы", -143482, 171998],
			["Фланец карданной трубы", -147069, 178597],
			["Фланец карданной трубы", -145676, 177147],
			["Фланец карданной трубы", -171721, 147518],
			["Фланец карданной трубы", 93686, 189043],
			["Фланец карданной трубы", 3108, 182238],
			["Фланец карданной трубы", 19540, 134965],
			["Фланец карданной трубы", -12652, 116536],
			["Фланец карданной трубы", -12658, 116484],
			["Фланец карданной трубы", -38745, 83755],
			["Фланец карданной трубы", -38744, 83779],
			["Фланец карданной трубы", -41091, 90630],
			["Фланец карданной трубы", -25261, 47460],
			["Фланец карданной трубы", -24840, 47816],
			["Фланец карданной трубы", -48913, 54364],
			["Фланец карданной трубы", -90848, 63130],
			["Фланец карданной трубы", -34415, 13619],
			["Фланец карданной трубы", -34430, 13621],
			["Фланец карданной трубы", -46405, 28510],
			["Фланец карданной трубы", -124550, 17613],
			["Фланец карданной трубы", -122904, 18766],
			["Фланец карданной трубы", -148454, 113816],
			["Фланец карданной трубы", -148442, 113567],
			["Фланец карданной трубы", -148776, 113591],
			["Фланец карданной трубы", 181438, 111622],
			["Фланец карданной трубы", 154293, 77673],
			["Фланец карданной трубы", 154167, 77415],
			["Фланец карданной трубы", 154394, 77440],
			["Фланец карданной трубы", 144505, 81520],
			["Фланец карданной трубы", 144183, 82670],
			["Фланец карданной трубы", 153047, 57775],
			["Фланец карданной трубы", 153113, 57786],
			["Фланец карданной трубы", 153223, 57622],
			["Фланец карданной трубы", 170897, 1570],
			["Фланец карданной трубы", 183785, 2596],
			["Фланец карданной трубы", 25718, 71252],
			["Фланец карданной трубы", 111536, 57871],
			["Фланец карданной трубы", 111640, 58103],
			["Фланец карданной трубы", 111443, 58081],
			["Фланец карданной трубы", 113917, 61590]
			];
	for (var i = 0; i < hlam611.length; i++) {
				hlam_611 = new L.circleMarker([hlam611[i][1],hlam611[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam611[i][0])
					.bindTooltip(hlam611[i][0], {direction: 'top'})
					.addTo(hlam611icons);
			}
	}
	else {
		hlam611icons.clearLayers();
	}
}
var hlam612icons = L.layerGroup().addTo(map);
function Hlam612OnOff() {
	var chbox612;
	chbox612=document.getElementById('Hlam612Button');
	if (chbox612.checked) {
		var hlam612 = [
			["Флейта", -147910, -56939]
			];
	for (var i = 0; i < hlam612.length; i++) {
				hlam_612 = new L.circleMarker([hlam612[i][1],hlam612[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam612[i][0])
					.bindTooltip(hlam612[i][0], {direction: 'top'})
					.addTo(hlam612icons);
			}
	}
	else {
		hlam612icons.clearLayers();
	}
}
var hlam613icons = L.layerGroup().addTo(map);
function Hlam613OnOff() {
	var chbox613;
	chbox613=document.getElementById('Hlam613Button');
	if (chbox613.checked) {
		var hlam613 = [
			["Фонарь", -8448, -2362],
			["Фонарь", -9236, -2543],
			["Фонарь", -88570, -1223],
			["Фонарь", -121801, -27334],
			["Фонарь", -122066, -26744],
			["Фонарь", -120366, -13189],
			["Фонарь", -120580, -14234],
			["Фонарь", -108143, -13985],
			["Фонарь", -107890, -14658],
			["Фонарь", -7269, -48872],
			["Фонарь", -37897, -58629],
			["Фонарь", -36164, -59266],
			["Фонарь", -46616, -51101],
			["Фонарь", -41351, -37619],
			["Фонарь", -41417, -37848],
			["Фонарь", -41716, -37804],
			["Фонарь", -120719, -45672],
			["Фонарь", -119851, -45576],
			["Фонарь", -120182, -45938],
			["Фонарь", -119755, -45950],
			["Фонарь", -120540, -47139],
			["Фонарь", -120392, -45560],
			["Фонарь", -114269, -47343],
			["Фонарь", -114554, -46816],
			["Фонарь", -114492, -47242],
			["Фонарь", -29746, -94155],
			["Фонарь", -26864, -89216],
			["Фонарь", -10424, -70856],
			["Фонарь", -30818, -65965],
			["Фонарь", -41921, -86179],
			["Фонарь", -56170, -82892],
			["Фонарь", -72466, -96756],
			["Фонарь", -93392, -83571],
			["Фонарь", -72116, -69908],
			["Фонарь", -100037, -67353],
			["Фонарь", -14068, -129470],
			["Фонарь", -48722, -127844],
			["Фонарь", -48781, -129440],
			["Фонарь", -37288, -112138],
			["Фонарь", -47243, -108041],
			["Фонарь", -47034, -106792],
			["Фонарь", -48080, -106810],
			["Фонарь", -47707, -107539],
			["Фонарь", -47421, -107606],
			["Фонарь", -46385, -105214],
			["Фонарь", -47371, -106283],
			["Фонарь", -93562, -130821],
			["Фонарь", -85608, -106665],
			["Фонарь", -79396, -108096],
			["Фонарь", -79633, -105328],
			["Фонарь", -114709, -99374],
			["Фонарь", -156972, -14386],
			["Фонарь", -155820, -14844],
			["Фонарь", -169120, -23794],
			["Фонарь", -166610, -13290],
			["Фонарь", -179276, -2953],
			["Фонарь", -160612, -41622],
			["Фонарь", -146694, -95801],
			["Фонарь", -131394, -92055],
			["Фонарь", -151759, -74492],
			["Фонарь", -132731, -121778],
			["Фонарь", -169724, -116616],
			["Фонарь", -167986, -115393],
			["Фонарь", -169188, -116260],
			["Фонарь", -167918, -115668],
			["Фонарь", 201209, -27832],
			["Фонарь", 179198, -9949],
			["Фонарь", 140668, -559],
			["Фонарь", 180756, -37672],
			["Фонарь", 184181, -40667],
			["Фонарь", 191780, -34623],
			["Фонарь", 204906, -92518],
			["Фонарь", 204825, -92418],
			["Фонарь", 183756, -93763],
			["Фонарь", 173639, -75488],
			["Фонарь", 183509, -77234],
			["Фонарь", 160513, -92011],
			["Фонарь", 138455, -79140],
			["Фонарь", 152772, -75416],
			["Фонарь", 149727, -67428],
			["Фонарь", 150022, -66968],
			["Фонарь", 127929, -32143],
			["Фонарь", 103427, -22104],
			["Фонарь", 103251, -19590],
			["Фонарь", 108376, -19897],
			["Фонарь", 103998, -14453],
			["Фонарь", 104222, -13656],
			["Фонарь", 119994, -1796],
			["Фонарь", 81727, -21524],
			["Фонарь", 88101, -21657],
			["Фонарь", 84581, -19190],
			["Фонарь", 93490, -13327],
			["Фонарь", 69178, -9643],
			["Фонарь", 95561, -9205],
			["Фонарь", 88801, -5208],
			["Фонарь", 88358, -4719],
			["Фонарь", 93597, -4428],
			["Фонарь", 93317, -4523],
			["Фонарь", 94826, -7845],
			["Фонарь", 59607, -22991],
			["Фонарь", 60314, -23082],
			["Фонарь", 8425, -30260],
			["Фонарь", 29499, -21082],
			["Фонарь", 29299, -21336],
			["Фонарь", 32014, -21376],
			["Фонарь", 107950, -54363],
			["Фонарь", 113576, -56017],
			["Фонарь", 87327, -53416],
			["Фонарь", 71449, -47305],
			["Фонарь", 71406, -47805],
			["Фонарь", 62721, -58625],
			["Фонарь", 62000, -58246],
			["Фонарь", 62231, -58253],
			["Фонарь", 61878, -56994],
			["Фонарь", 61889, -56972],
			["Фонарь", 61945, -56961],
			["Фонарь", 63486, -50341],
			["Фонарь", 32147, -40296],
			["Фонарь", 5804, -32860],
			["Фонарь", 97072, -98231],
			["Фонарь", 94002, -85047],
			["Фонарь", 72286, -75987],
			["Фонарь", 79061, -74964],
			["Фонарь", 11575, -83511],
			["Фонарь", 9599, -82818],
			["Фонарь", 8722, -85992],
			["Фонарь", 10127, -79842],
			["Фонарь", 16376, -79431],
			["Фонарь", 81730, -119381],
			["Фонарь", 89169, -111760],
			["Фонарь", 69368, -102925],
			["Фонарь", 68369, -102048],
			["Фонарь", 69606, -102326],
			["Фонарь", 47323, -104432],
			["Фонарь", 2522, -114310],
			["Фонарь", 12363, -112049],
			["Фонарь", 25721, -99968],
			["Фонарь", -79980, -162584],
			["Фонарь", -117114, -140251],
			["Фонарь", -125900, -135257],
			["Фонарь", -7973, -165406],
			["Фонарь", -1642, -164246],
			["Фонарь", -71795, -164107],
			["Фонарь", -122056, -188040],
			["Фонарь", -123717, -182933],
			["Фонарь", -114025, -169512],
			["Фонарь", -152822, -160387],
			["Фонарь", -133956, -153656],
			["Фонарь", -135515, -132705],
			["Фонарь", -131172, -189181],
			["Фонарь", 197554, -142726],
			["Фонарь", 203100, -138257],
			["Фонарь", 173456, -140149],
			["Фонарь", 136542, -163200],
			["Фонарь", 48642, -152103],
			["Фонарь", 50110, -151103],
			["Фонарь", 50521, -149613],
			["Фонарь", 51698, -148888],
			["Фонарь", 23076, -149102],
			["Фонарь", 23674, -148725],
			["Фонарь", 73835, -177764],
			["Фонарь", 78586, -177400],
			["Фонарь", 75278, -174770],
			["Фонарь", -38411, 201241],
			["Фонарь", -95885, 197117],
			["Фонарь", -86962, 201842],
			["Фонарь", -107777, 203694],
			["Фонарь", -49618, 176063],
			["Фонарь", -38979, 190105],
			["Фонарь", -38680, 190421],
			["Фонарь", -63799, 132290],
			["Фонарь", -63899, 131607],
			["Фонарь", -41928, 158571],
			["Фонарь", -39081, 158170],
			["Фонарь", -41042, 161001],
			["Фонарь", -40923, 161328],
			["Фонарь", -39539, 162210],
			["Фонарь", -37347, 161240],
			["Фонарь", -109356, 158034],
			["Фонарь", -101647, 156863],
			["Фонарь", -146383, 174471],
			["Фонарь", -145391, 174263],
			["Фонарь", -159092, 185867],
			["Фонарь", -161426, 194122],
			["Фонарь", -177935, 165672],
			["Фонарь", -138737, 152475],
			["Фонарь", -163069, 157145],
			["Фонарь", 162679, 206518],
			["Фонарь", 179545, 133837],
			["Фонарь", 179006, 132864],
			["Фонарь", 142901, 139341],
			["Фонарь", 145046, 139686],
			["Фонарь", 42950, 198543],
			["Фонарь", 6049, 164110],
			["Фонарь", 6056, 164134],
			["Фонарь", 11505, 182846],
			["Фонарь", 11622, 184580],
			["Фонарь", 99391, 151436],
			["Фонарь", 127714, 154586],
			["Фонарь", 130782, 152447],
			["Фонарь", 125847, 160916],
			["Фонарь", 126088, 160362],
			["Фонарь", 77507, 150874],
			["Фонарь", 75615, 150705],
			["Фонарь", 75503, 151179],
			["Фонарь", 74951, 151202],
			["Фонарь", 85522, 152559],
			["Фонарь", 85753, 151999],
			["Фонарь", 88408, 158000],
			["Фонарь", 47980, 143300],
			["Фонарь", 58821, 147761],
			["Фонарь", 56858, 152641],
			["Фонарь", 1728, 137794],
			["Фонарь", -14076, 107229],
			["Фонарь", -59536, 122620],
			["Фонарь", -65885, 129571],
			["Фонарь", -129295, 119840],
			["Фонарь", -26257, 72592],
			["Фонарь", -57532, 89017],
			["Фонарь", -37787, 95361],
			["Фонарь", -91081, 65785],
			["Фонарь", -80344, 89566],
			["Фонарь", -39229, 44385],
			["Фонарь", -37121, 46277],
			["Фонарь", -39811, 46474],
			["Фонарь", -36930, 48830],
			["Фонарь", -40696, 50795],
			["Фонарь", -69162, 55549],
			["Фонарь", -122284, 40576],
			["Фонарь", -102933, 37209],
			["Фонарь", -122391, 41340],
			["Фонарь", -64923, 5505],
			["Фонарь", -34793, 13324],
			["Фонарь", -34844, 12894],
			["Фонарь", -55888, 21416],
			["Фонарь", -48026, 27109],
			["Фонарь", -44235, 27734],
			["Фонарь", -50239, 29046],
			["Фонарь", -39430, 30099],
			["Фонарь", -127715, 30601],
			["Фонарь", -148819, 114648],
			["Фонарь", -150416, 113500],
			["Фонарь", -150113, 114454],
			["Фонарь", -148623, 112304],
			["Фонарь", -148621, 112138],
			["Фонарь", -164867, 122105],
			["Фонарь", -163991, 122588],
			["Фонарь", -146227, 65970],
			["Фонарь", -145959, 65957],
			["Фонарь", -139722, 90814],
			["Фонарь", -180361, 73826],
			["Фонарь", -149048, 39776],
			["Фонарь", -142641, 1167],
			["Фонарь", -166100, 9127],
			["Фонарь", 181890, 110265],
			["Фонарь", 183335, 112368],
			["Фонарь", 135596, 115620],
			["Фонарь", 134589, 127396],
			["Фонарь", 198636, 94573],
			["Фонарь", 199210, 94352],
			["Фонарь", 182381, 96908],
			["Фонарь", 156183, 75521],
			["Фонарь", 133039, 84274],
			["Фонарь", 143917, 98231],
			["Фонарь", 196639, 65401],
			["Фонарь", 172214, 39174],
			["Фонарь", 172581, 39762],
			["Фонарь", 173109, 39187],
			["Фонарь", 169875, 60491],
			["Фонарь", 190077, 63746],
			["Фонарь", 160377, 58738],
			["Фонарь", 183042, 3453],
			["Фонарь", 183535, 2247],
			["Фонарь", 183430, 2453],
			["Фонарь", 183124, 2568],
			["Фонарь", 182920, 2488],
			["Фонарь", 173994, 7391],
			["Фонарь", 138335, 3071],
			["Фонарь", 138660, 3344],
			["Фонарь", 141396, 1631],
			["Фонарь", 136989, 5667],
			["Фонарь", 136037, 4258],
			["Фонарь", 140102, 8045],
			["Фонарь", 141307, 7497],
			["Фонарь", 141277, 7968],
			["Фонарь", 113528, 114082],
			["Фонарь", 95988, 106373],
			["Фонарь", 97093, 104238],
			["Фонарь", 94807, 104048],
			["Фонарь", 94312, 103273],
			["Фонарь", 95063, 103360],
			["Фонарь", 45782, 101085],
			["Фонарь", 27482, 127291],
			["Фонарь", 27665, 127467],
			["Фонарь", 25710, 128304],
			["Фонарь", 101595, 69481],
			["Фонарь", 128727, 85860],
			["Фонарь", 128810, 85312],
			["Фонарь", 49148, 85880],
			["Фонарь", 104825, 43789],
			["Фонарь", 105996, 50603],
			["Фонарь", 110341, 55461],
			["Фонарь", 109653, 57466],
			["Фонарь", 78017, 33964],
			["Фонарь", 27978, 48424],
			["Фонарь", 23888, 49600],
			["Фонарь", 28574, 52605],
			["Фонарь", 115678, 13033],
			["Фонарь", 67367, 20088],
			["Фонарь", 67441, 19991],
			["Фонарь", 71140, 20447],
			["Фонарь", 71677, 21125],
			["Фонарь", 77525, 21296],
			["Фонарь", 78244, 20940],
			["Фонарь", 92641, 31903],
			["Фонарь", 5318, 11406],
			["Фонарь", 5491, 11417],
			["Фонарь", -164240, -112511]
			];
	for (var i = 0; i < hlam613.length; i++) {
				hlam_613 = new L.circleMarker([hlam613[i][1],hlam613[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam613[i][0])
					.bindTooltip(hlam613[i][0], {direction: 'top'})
					.addTo(hlam613icons);
			}
	}
	else {
		hlam613icons.clearLayers();
	}
}
var hlam614icons = L.layerGroup().addTo(map);
function Hlam614OnOff() {
	var chbox614;
	chbox614=document.getElementById('Hlam614Button');
	if (chbox614.checked) {
		var hlam614 = [
			["Фонарь", -84029, -106207],
			["Фонарь", 51131, -150004],
			["Фонарь", 111664, 139667]
			];
	for (var i = 0; i < hlam614.length; i++) {
				hlam_614 = new L.circleMarker([hlam614[i][1],hlam614[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam614[i][0])
					.bindTooltip(hlam614[i][0], {direction: 'top'})
					.addTo(hlam614icons);
			}
	}
	else {
		hlam614icons.clearLayers();
	}
}
var hlam615icons = L.layerGroup().addTo(map);
function Hlam615OnOff() {
	var chbox615;
	chbox615=document.getElementById('Hlam615Button');
	if (chbox615.checked) {
		var hlam615 = [
			["Фонарь шахтера", -89532, -42143],
			["Фонарь шахтера", -167830, -102724],
			["Фонарь шахтера", 64762, -58670],
			["Фонарь шахтера", -151207, -160404],
			["Фонарь шахтера", -43512, 28162],
			["Фонарь шахтера", -138886, 88688],
			["Фонарь шахтера", -139707, 91360],
			["Фонарь шахтера", -139370, 91046],
			["Фонарь шахтера", -139602, 90696],
			["Фонарь шахтера", -138801, 90762]
			];
	for (var i = 0; i < hlam615.length; i++) {
				hlam_615 = new L.circleMarker([hlam615[i][1],hlam615[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam615[i][0])
					.bindTooltip(hlam615[i][0], {direction: 'top'})
					.addTo(hlam615icons);
			}
	}
	else {
		hlam615icons.clearLayers();
	}
}
var hlam616icons = L.layerGroup().addTo(map);
function Hlam616OnOff() {
	var chbox616;
	chbox616=document.getElementById('Hlam616Button');
	if (chbox616.checked) {
		var hlam616 = [
			["Фонарь шахтера", -89571, -42117],
			["Фонарь шахтера", 74572, -176900],
			["Фонарь шахтера", -3205, 155291],
			["Фонарь шахтера", -2758, 158362],
			["Фонарь шахтера", -139401, 171829],
			["Фонарь шахтера", 14919, 137400],
			["Фонарь шахтера", 14774, 136883]
			];
	for (var i = 0; i < hlam616.length; i++) {
				hlam_616 = new L.circleMarker([hlam616[i][1],hlam616[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam616[i][0])
					.bindTooltip(hlam616[i][0], {direction: 'top'})
					.addTo(hlam616icons);
			}
	}
	else {
		hlam616icons.clearLayers();
	}
}
var hlam617icons = L.layerGroup().addTo(map);
function Hlam617OnOff() {
	var chbox617;
	chbox617=document.getElementById('Hlam617Button');
	if (chbox617.checked) {
		var hlam617 = [
			["Форма для кекса", -53220, -13578],
			["Форма для кекса", -53220, -13581],
			["Форма для кекса", -19164, -46872],
			["Форма для кекса", -59415, -84630],
			["Форма для кекса", -150830, -74886],
			["Форма для кекса", 142154, -123862],
			["Форма для кекса", 17824, -995],
			["Форма для кекса", 29024, -58157],
			["Форма для кекса", -120700, -189236],
			["Форма для кекса", -120633, -189225],
			["Форма для кекса", -160271, 152550],
			["Форма для кекса", -129355, 119839],
			["Форма для кекса", 172574, 58470],
			["Форма для кекса", 20194, 89857]
			];
	for (var i = 0; i < hlam617.length; i++) {
				hlam_617 = new L.circleMarker([hlam617[i][1],hlam617[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam617[i][0])
					.bindTooltip(hlam617[i][0], {direction: 'top'})
					.addTo(hlam617icons);
			}
	}
	else {
		hlam617icons.clearLayers();
	}
}
var hlam618icons = L.layerGroup().addTo(map);
function Hlam618OnOff() {
	var chbox618;
	chbox618=document.getElementById('Hlam618Button');
	if (chbox618.checked) {
		var hlam618 = [
			["Формованная пластмасса", 69971, 202107],
			["Формованная пластмасса", 129846, 20058]
			];
	for (var i = 0; i < hlam618.length; i++) {
				hlam_618 = new L.circleMarker([hlam618[i][1],hlam618[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam618[i][0])
					.bindTooltip(hlam618[i][0], {direction: 'top'})
					.addTo(hlam618icons);
			}
	}
	else {
		hlam618icons.clearLayers();
	}
}
var hlam619icons = L.layerGroup().addTo(map);
function Hlam619OnOff() {
	var chbox619;
	chbox619=document.getElementById('Hlam619Button');
	if (chbox619.checked) {
		var hlam619 = [
			["Фотография маяка в изящной рамке", -51344, -13801],
			["Фотография маяка в изящной рамке", -51048, -13074],
			["Фотография маяка в изящной рамке", -52076, -14035],
			["Фотография маяка в изящной рамке", -52103, -14032],
			["Фотография маяка в изящной рамке", 195191, -103664]
			];
	for (var i = 0; i < hlam619.length; i++) {
				hlam_619 = new L.circleMarker([hlam619[i][1],hlam619[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam619[i][0])
					.bindTooltip(hlam619[i][0], {direction: 'top'})
					.addTo(hlam619icons);
			}
	}
	else {
		hlam619icons.clearLayers();
	}
}
var hlam620icons = L.layerGroup().addTo(map);
function Hlam620OnOff() {
	var chbox620;
	chbox620=document.getElementById('Hlam620Button');
	if (chbox620.checked) {
		var hlam620 = [
			["Фотография маяка в рамке", -42188, -5716],
			["Фотография маяка в рамке", 148369, -79780],
			["Фотография маяка в рамке", -46413, 19951]
			];
	for (var i = 0; i < hlam620.length; i++) {
				hlam_620 = new L.circleMarker([hlam620[i][1],hlam620[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam620[i][0])
					.bindTooltip(hlam620[i][0], {direction: 'top'})
					.addTo(hlam620icons);
			}
	}
	else {
		hlam620icons.clearLayers();
	}
}
var hlam621icons = L.layerGroup().addTo(map);
function Hlam621OnOff() {
	var chbox621;
	chbox621=document.getElementById('Hlam621Button');
	if (chbox621.checked) {
		var hlam621 = [
			["Фрагмент черепа", 127742, -27447],
			["Фрагмент черепа", 36045, -35323],
			["Фрагмент черепа", 127173, -81038],
			["Фрагмент черепа", -56291, 9170],
			["Фрагмент черепа", -56046, 8994],
			["Фрагмент черепа", -148607, 39842]
			];
	for (var i = 0; i < hlam621.length; i++) {
				hlam_621 = new L.circleMarker([hlam621[i][1],hlam621[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam621[i][0])
					.bindTooltip(hlam621[i][0], {direction: 'top'})
					.addTo(hlam621icons);
			}
	}
	else {
		hlam621icons.clearLayers();
	}
}
var hlam622icons = L.layerGroup().addTo(map);
function Hlam622OnOff() {
	var chbox622;
	chbox622=document.getElementById('Hlam622Button');
	if (chbox622.checked) {
		var hlam622 = [
			["Химическая колба", 144652, -56814],
			["Химическая колба", 50339, -43328],
			["Химическая колба", 18708, -123019],
			["Химическая колба", 102542, -151817],
			["Химическая колба", -84423, 166106],
			["Химическая колба", -83862, 166216],
			["Химическая колба", -97433, 189524],
			["Химическая колба", -90325, 149513],
			["Химическая колба", -88600, 65805],
			["Химическая колба", 87290, 2748]
			];
	for (var i = 0; i < hlam622.length; i++) {
				hlam_622 = new L.circleMarker([hlam622[i][1],hlam622[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam622[i][0])
					.bindTooltip(hlam622[i][0], {direction: 'top'})
					.addTo(hlam622icons);
			}
	}
	else {
		hlam622icons.clearLayers();
	}
}
var hlam623icons = L.layerGroup().addTo(map);
function Hlam623OnOff() {
	var chbox623;
	chbox623=document.getElementById('Hlam623Button');
	if (chbox623.checked) {
		var hlam623 = [
			["Хирургическая пила", -8456, -3095],
			["Хирургическая пила", -19386, -46754],
			["Хирургическая пила", -842, -34890],
			["Хирургическая пила", -31008, -66266],
			["Хирургическая пила", -35618, -80558],
			["Хирургическая пила", -126202, -74219],
			["Хирургическая пила", -61729, -127657],
			["Хирургическая пила", -68836, -105440],
			["Хирургическая пила", 101915, -12358],
			["Хирургическая пила", 113849, -56163],
			["Хирургическая пила", 20529, -109391],
			["Хирургическая пила", -76460, -184209],
			["Хирургическая пила", -82718, -178506],
			["Хирургическая пила", 102365, -151578],
			["Хирургическая пила", 51157, -150075],
			["Хирургическая пила", 53048, -149208],
			["Хирургическая пила", -4654, 185443],
			["Хирургическая пила", -20938, 150696],
			["Хирургическая пила", -5978, 162464],
			["Хирургическая пила", -90362, 149112],
			["Хирургическая пила", 69682, 202211],
			["Хирургическая пила", -80675, 120546],
			["Хирургическая пила", -80485, 120400],
			["Хирургическая пила", -80409, 120482],
			["Хирургическая пила", -21149, 11462],
			["Хирургическая пила", 183562, 3019],
			["Хирургическая пила", 183640, 3389],
			["Хирургическая пила", 34755, 101034],
			["Хирургическая пила", 34836, 100950],
			["Хирургическая пила", 57952, 108231],
			["Хирургическая пила", 57690, 108101],
			["Хирургическая пила", 1925, 100185],
			["Хирургическая пила", 100482, 71880],
			["Хирургическая пила", 20300, 90064],
			["Хирургическая пила", 106941, 51790],
			["Хирургическая пила", 102572, 56946],
			["Хирургическая пила", 78683, 52308],
			["Хирургическая пила", 52362, 3656],
			["Хирургическая пила", 54924, 1481],
			["Хирургическая пила", 54533, 8994],
			["Хирургическая пила", 57951, 9987],
			["Хирургическая пила", 53924, 13043]
			];
	for (var i = 0; i < hlam623.length; i++) {
				hlam_623 = new L.circleMarker([hlam623[i][1],hlam623[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam623[i][0])
					.bindTooltip(hlam623[i][0], {direction: 'top'})
					.addTo(hlam623icons);
			}
	}
	else {
		hlam623icons.clearLayers();
	}
}
var hlam624icons = L.layerGroup().addTo(map);
function Hlam624OnOff() {
	var chbox624;
	chbox624=document.getElementById('Hlam624Button');
	if (chbox624.checked) {
		var hlam624 = [
			["Хладагент", -44855, -15765],
			["Хладагент", -120508, -45884],
			["Хладагент", -29818, -87060],
			["Хладагент", -57661, -85578],
			["Хладагент", -46933, -72945],
			["Хладагент", -101811, -84888],
			["Хладагент", -10270, -123228],
			["Хладагент", -10156, -123805],
			["Хладагент", -163173, -55225],
			["Хладагент", -159460, -40511],
			["Хладагент", 188157, -28951],
			["Хладагент", 194029, -31514],
			["Хладагент", 153043, -103666],
			["Хладагент", 153052, -103689],
			["Хладагент", 152890, -103500],
			["Хладагент", 152962, -103383],
			["Хладагент", 152902, -103340],
			["Хладагент", 81948, -21714],
			["Хладагент", 92951, -13331],
			["Хладагент", 48586, -21886],
			["Хладагент", 62399, -58167],
			["Хладагент", 62182, -56938],
			["Хладагент", 49890, -44348],
			["Хладагент", 13059, -91832],
			["Хладагент", 13075, -91825],
			["Хладагент", 13093, -91804],
			["Хладагент", 9540, -107080],
			["Хладагент", 13832, -107747],
			["Хладагент", -6820, -161106],
			["Хладагент", -7011, -161545],
			["Хладагент", -47930, -133127],
			["Хладагент", -82129, -161261],
			["Хладагент", -123943, -134347],
			["Хладагент", -41643, -175263],
			["Хладагент", -41649, -175270],
			["Хладагент", -41660, -175279],
			["Хладагент", -122426, -187705],
			["Хладагент", 189629, -165965],
			["Хладагент", 115100, -157946],
			["Хладагент", -97206, 184433],
			["Хладагент", -6443, 146496],
			["Хладагент", -27382, 162072],
			["Хладагент", -40463, 161232],
			["Хладагент", -161928, 202670],
			["Хладагент", -146179, 172710],
			["Хладагент", -145591, 177412],
			["Хладагент", -141225, 142920],
			["Хладагент", -145020, 148290],
			["Хладагент", 147682, 137891],
			["Хладагент", 147652, 137915],
			["Хладагент", 102797, 191594],
			["Хладагент", 91907, 189178],
			["Хладагент", 61817, 177130],
			["Хладагент", 2288, 178993],
			["Хладагент", -37517, 83649],
			["Хладагент", -57012, 87393],
			["Хладагент", -43680, 90864],
			["Хладагент", -103855, 38267],
			["Хладагент", -43650, 12936],
			["Хладагент", -46862, 27116],
			["Хладагент", -46752, 27119],
			["Хладагент", -46640, 27096],
			["Хладагент", -48926, 27383],
			["Хладагент", -45557, 28927],
			["Хладагент", -148779, 113605],
			["Хладагент", 182777, 111991],
			["Хладагент", 182687, 111641],
			["Хладагент", 160387, 116009],
			["Хладагент", 154373, 77419],
			["Хладагент", 202898, 55270],
			["Хладагент", 202615, 54497],
			["Хладагент", 153219, 57612],
			["Хладагент", 111645, 58098],
			["Хладагент", 122142, 6323],
			["Хладагент", 87785, 2246]
			];
	for (var i = 0; i < hlam624.length; i++) {
				hlam_624 = new L.circleMarker([hlam624[i][1],hlam624[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam624[i][0])
					.bindTooltip(hlam624[i][0], {direction: 'top'})
					.addTo(hlam624icons);
			}
	}
	else {
		hlam624icons.clearLayers();
	}
}
var hlam625icons = L.layerGroup().addTo(map);
function Hlam625OnOff() {
	var chbox625;
	chbox625=document.getElementById('Hlam625Button');
	if (chbox625.checked) {
		var hlam625 = [
			["Хлебница", -53215, -13220],
			["Хлебница", -19146, -46763],
			["Хлебница", -37869, -59476],
			["Хлебница", -14085, -66705],
			["Хлебница", -47832, -101443],
			["Хлебница", -171482, -11285],
			["Хлебница", 173754, -13754],
			["Хлебница", 138370, -53548],
			["Хлебница", 51038, -19652],
			["Хлебница", 34138, -33102],
			["Хлебница", 29162, -58092],
			["Хлебница", 8326, -84853],
			["Хлебница", 19834, -104167],
			["Хлебница", -7936, -165163],
			["Хлебница", -139719, -144821],
			["Хлебница", -34893, 172733],
			["Хлебница", -144786, 137117],
			["Хлебница", 150089, 138705],
			["Хлебница", 151384, 139265],
			["Хлебница", 48575, 190359],
			["Хлебница", 11645, 183020],
			["Хлебница", 105370, 156832],
			["Хлебница", 169656, 56251],
			["Хлебница", 183479, 2652],
			["Хлебница", 47561, 13858],
			["Хлебница", -45878, -50241]
			];
	for (var i = 0; i < hlam625.length; i++) {
				hlam_625 = new L.circleMarker([hlam625[i][1],hlam625[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam625[i][0])
					.bindTooltip(hlam625[i][0], {direction: 'top'})
					.addTo(hlam625icons);
			}
	}
	else {
		hlam625icons.clearLayers();
	}
}
var hlam626icons = L.layerGroup().addTo(map);
function Hlam626OnOff() {
	var chbox626;
	chbox626=document.getElementById('Hlam626Button');
	if (chbox626.checked) {
		var hlam626 = [
			["Хлопковая пряжа", -44456, -8472],
			["Хлопковая пряжа", -44764, -8331],
			["Хлопковая пряжа", -41712, -3915],
			["Хлопковая пряжа", -41685, -3882],
			["Хлопковая пряжа", -45965, -50228],
			["Хлопковая пряжа", -55625, -48472],
			["Хлопковая пряжа", -148938, -57949],
			["Хлопковая пряжа", 167812, -22751],
			["Хлопковая пряжа", -2262, -159658],
			["Хлопковая пряжа", -2315, -159656],
			["Хлопковая пряжа", -2297, -159653],
			["Хлопковая пряжа", -27037, -131505],
			["Хлопковая пряжа", -14697, -173679],
			["Хлопковая пряжа", -62435, -171385],
			["Хлопковая пряжа", 165101, -150650],
			["Хлопковая пряжа", -40408, 161406],
			["Хлопковая пряжа", 178986, 134033],
			["Хлопковая пряжа", 145054, 139809],
			["Хлопковая пряжа", 1714, 138109],
			["Хлопковая пряжа", -21258, 16431],
			["Хлопковая пряжа", -18783, 17575],
			["Хлопковая пряжа", -47119, 2526],
			["Хлопковая пряжа", -164676, 122465],
			["Хлопковая пряжа", -139595, 90688],
			["Хлопковая пряжа", 172378, 39034],
			["Хлопковая пряжа", 130071, 20103],
			["Хлопковая пряжа", 75719, 9346],
			["Хлопковая пряжа", 20878, 131477]
			];
	for (var i = 0; i < hlam626.length; i++) {
				hlam_626 = new L.circleMarker([hlam626[i][1],hlam626[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam626[i][0])
					.bindTooltip(hlam626[i][0], {direction: 'top'})
					.addTo(hlam626icons);
			}
	}
	else {
		hlam626icons.clearLayers();
	}
}
var hlam627icons = L.layerGroup().addTo(map);
function Hlam627OnOff() {
	var chbox627;
	chbox627=document.getElementById('Hlam627Button');
	if (chbox627.checked) {
		var hlam627 = [
			["Хрустальный графин", -43143, -5840],
			["Хрустальный графин", -53324, -905],
			["Хрустальный графин", -19326, -47179],
			["Хрустальный графин", -20475, -44161],
			["Хрустальный графин", -45597, -104875],
			["Хрустальный графин", -148269, -56965],
			["Хрустальный графин", -152046, -75381],
			["Хрустальный графин", -150834, -75059],
			["Хрустальный графин", 148924, -52484],
			["Хрустальный графин", 149787, -67457],
			["Хрустальный графин", 75101, -8740],
			["Хрустальный графин", 91202, -6688],
			["Хрустальный графин", 51371, -41818],
			["Хрустальный графин", 33685, -33698],
			["Хрустальный графин", 33688, -33687],
			["Хрустальный графин", 33572, -33816],
			["Хрустальный графин", -8344, -165516],
			["Хрустальный графин", -120896, -189615],
			["Хрустальный графин", -72744, 184567],
			["Хрустальный графин", 48490, 190354],
			["Хрустальный графин", 11764, 183143],
			["Хрустальный графин", -128940, 120384],
			["Хрустальный графин", -128685, 120227],
			["Хрустальный графин", -128858, 120300],
			["Хрустальный графин", -128813, 119166],
			["Хрустальный графин", 191428, 61205],
			["Хрустальный графин", 183945, 3046],
			["Хрустальный графин", 183637, 3048],
			["Хрустальный графин", 183627, 2504],
			["Хрустальный графин", 183623, 3066],
			["Хрустальный графин", 186367, 13933],
			["Хрустальный графин", 29028, 53807],
			["Хрустальный графин", 82398, 15607],
			["Хрустальный графин", 71620, 20913]
			];
	for (var i = 0; i < hlam627.length; i++) {
				hlam_627 = new L.circleMarker([hlam627[i][1],hlam627[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam627[i][0])
					.bindTooltip(hlam627[i][0], {direction: 'top'})
					.addTo(hlam627icons);
			}
	}
	else {
		hlam627icons.clearLayers();
	}
}
var hlam628icons = L.layerGroup().addTo(map);
function Hlam628OnOff() {
	var chbox628;
	chbox628=document.getElementById('Hlam628Button');
	if (chbox628.checked) {
		var hlam628 = [
			["Цветочный горшок", -43427, -6548],
			["Цветочный горшок", -43410, -6548],
			["Цветочный горшок", -43445, -6538],
			["Цветочный горшок", -43491, -6508],
			["Цветочный горшок", -43385, -6575],
			["Цветочный горшок", -43456, -6533],
			["Цветочный горшок", -43473, -6520],
			["Цветочный горшок", -43455, -6196],
			["Цветочный горшок", -42995, -6311],
			["Цветочный горшок", -43658, -6411],
			["Цветочный горшок", -43654, -6421],
			["Цветочный горшок", -55665, -59653],
			["Цветочный горшок", -55678, -59652],
			["Цветочный горшок", -55760, -59795],
			["Цветочный горшок", -57935, -48049],
			["Цветочный горшок", -57935, -48062],
			["Цветочный горшок", -57625, -47878],
			["Цветочный горшок", -57476, -48143],
			["Цветочный горшок", -57514, -48162],
			["Цветочный горшок", -57507, -48150],
			["Цветочный горшок", -57398, -47911],
			["Цветочный горшок", -57436, -47808],
			["Цветочный горшок", -73624, -34217],
			["Цветочный горшок", -73399, -34499],
			["Цветочный горшок", -112805, -62081],
			["Цветочный горшок", -112802, -62057],
			["Цветочный горшок", -112703, -62419],
			["Цветочный горшок", -113015, -61853],
			["Цветочный горшок", -112585, -61984],
			["Цветочный горшок", -110152, -64791],
			["Цветочный горшок", -110029, -64871],
			["Цветочный горшок", -109887, -64723],
			["Цветочный горшок", -109994, -64590],
			["Цветочный горшок", -109202, -64979],
			["Цветочный горшок", -109344, -64971],
			["Цветочный горшок", -110029, -64495],
			["Цветочный горшок", -110018, -64482],
			["Цветочный горшок", -110000, -64499],
			["Цветочный горшок", -110010, -64508],
			["Цветочный горшок", -113361, -59652],
			["Цветочный горшок", -111161, -57695],
			["Цветочный горшок", -111325, -57758],
			["Цветочный горшок", -111414, -57789],
			["Цветочный горшок", -111090, -57936],
			["Цветочный горшок", -111255, -57994],
			["Цветочный горшок", -112426, -59693],
			["Цветочный горшок", -112385, -59809],
			["Цветочный горшок", -112003, -59745],
			["Цветочный горшок", -112807, -59548],
			["Цветочный горшок", -112761, -59697],
			["Цветочный горшок", -112664, -61293],
			["Цветочный горшок", -112598, -59072],
			["Цветочный горшок", -112635, -59091],
			["Цветочный горшок", -68424, -83900],
			["Цветочный горшок", -68369, -83881],
			["Цветочный горшок", -82545, -117937],
			["Цветочный горшок", 174448, -41362],
			["Цветочный горшок", 174446, -41384],
			["Цветочный горшок", 174476, -41585],
			["Цветочный горшок", 174399, -41713],
			["Цветочный горшок", 174487, -41486],
			["Цветочный горшок", 174606, -41737],
			["Цветочный горшок", 174841, -41854],
			["Цветочный горшок", 174883, -41828],
			["Цветочный горшок", 174960, -41678],
			["Цветочный горшок", 143107, -56028],
			["Цветочный горшок", 142244, -49934],
			["Цветочный горшок", 141895, -51740],
			["Цветочный горшок", 154431, -46485],
			["Цветочный горшок", 151936, -48281],
			["Цветочный горшок", 155030, -44733],
			["Цветочный горшок", 147315, -78487],
			["Цветочный горшок", 149521, -75780],
			["Цветочный горшок", 180729, -123253],
			["Цветочный горшок", 180533, -123192],
			["Цветочный горшок", 120031, -2054],
			["Цветочный горшок", 91231, -8738],
			["Цветочный горшок", 70728, -7490],
			["Цветочный горшок", 70763, -7497],
			["Цветочный горшок", 70788, -7501],
			["Цветочный горшок", 71069, -1616],
			["Цветочный горшок", 80712, -1510],
			["Цветочный горшок", 85999, -428],
			["Цветочный горшок", 85996, -481],
			["Цветочный горшок", 85996, -503],
			["Цветочный горшок", 84699, -1948],
			["Цветочный горшок", 31192, -20299],
			["Цветочный горшок", 32855, -41120],
			["Цветочный горшок", 32808, -41099],
			["Цветочный горшок", 32783, -41081],
			["Цветочный горшок", 38718, -38185],
			["Цветочный горшок", 38745, -38153],
			["Цветочный горшок", 35374, -34924],
			["Цветочный горшок", 35389, -34910],
			["Цветочный горшок", 35381, -35052],
			["Цветочный горшок", 35645, -35678],
			["Цветочный горшок", 18686, -60089],
			["Цветочный горшок", 32606, -41087],
			["Цветочный горшок", 32649, -41093],
			["Цветочный горшок", 16199, -118804],
			["Цветочный горшок", 16213, -118792],
			["Цветочный горшок", 16070, -118886],
			["Цветочный горшок", 15874, -119020],
			["Цветочный горшок", 15876, -118985],
			["Цветочный горшок", 15859, -118999],
			["Цветочный горшок", 16119, -119402],
			["Цветочный горшок", 16344, -119367],
			["Цветочный горшок", 16837, -118791],
			["Цветочный горшок", 17827, -119211],
			["Цветочный горшок", 16394, -119349],
			["Цветочный горшок", 16666, -118850],
			["Цветочный горшок", 16649, -118869],
			["Цветочный горшок", 16911, -119012],
			["Цветочный горшок", 16850, -119025],
			["Цветочный горшок", 18050, -119378],
			["Цветочный горшок", 18086, -119347],
			["Цветочный горшок", 17654, -119882],
			["Цветочный горшок", 17717, -119871],
			["Цветочный горшок", 18015, -119670],
			["Цветочный горшок", 17365, -120075],
			["Цветочный горшок", 17490, -120027],
			["Цветочный горшок", 17451, -120012],
			["Цветочный горшок", 18122, -119321],
			["Цветочный горшок", 18124, -119291],
			["Цветочный горшок", 18170, -119535],
			["Цветочный горшок", 18313, -119456],
			["Цветочный горшок", 17543, -119697],
			["Цветочный горшок", 17715, -119842],
			["Цветочный горшок", 17663, -119517],
			["Цветочный горшок", 17491, -119742],
			["Цветочный горшок", 17479, -119715],
			["Цветочный горшок", 17774, -119228],
			["Цветочный горшок", 17806, -120994],
			["Цветочный горшок", 17872, -120946],
			["Цветочный горшок", 17832, -120951],
			["Цветочный горшок", 18286, -121017],
			["Цветочный горшок", 18315, -121009],
			["Цветочный горшок", 18094, -120862],
			["Цветочный горшок", 18266, -121007],
			["Цветочный горшок", 18719, -120756],
			["Цветочный горшок", 18706, -120772],
			["Цветочный горшок", 18877, -120645],
			["Цветочный горшок", 18848, -120653],
			["Цветочный горшок", 18691, -120762],
			["Цветочный горшок", 18864, -120621],
			["Цветочный горшок", 18673, -120486],
			["Цветочный горшок", 18570, -120555],
			["Цветочный горшок", 18675, -120456],
			["Цветочный горшок", 18645, -120438],
			["Цветочный горшок", 18431, -120337],
			["Цветочный горшок", 18438, -120299],
			["Цветочный горшок", 19979, -118931],
			["Цветочный горшок", 20054, -118914],
			["Цветочный горшок", 20140, -119008],
			["Цветочный горшок", 20093, -118906],
			["Цветочный горшок", 20085, -118886],
			["Цветочный горшок", 18659, -120018],
			["Цветочный горшок", 18738, -119991],
			["Цветочный горшок", 16743, -118726],
			["Цветочный горшок", 16755, -118744],
			["Цветочный горшок", 16405, -118677],
			["Цветочный горшок", 9486, -109603],
			["Цветочный горшок", 9546, -109400],
			["Цветочный горшок", 9520, -109410],
			["Цветочный горшок", 9477, -109387],
			["Цветочный горшок", 9519, -109338],
			["Цветочный горшок", 9511, -109356],
			["Цветочный горшок", 9177, -108916],
			["Цветочный горшок", 9500, -108996],
			["Цветочный горшок", 9230, -109089],
			["Цветочный горшок", 9240, -109048],
			["Цветочный горшок", 9124, -108864],
			["Цветочный горшок", 9132, -108846],
			["Цветочный горшок", 9436, -108978],
			["Цветочный горшок", -4272, -155966],
			["Цветочный горшок", -4268, -155904],
			["Цветочный горшок", -4263, -155980],
			["Цветочный горшок", -7432, -165566],
			["Цветочный горшок", -7651, -165768],
			["Цветочный горшок", -1990, -164335],
			["Цветочный горшок", -1966, -164349],
			["Цветочный горшок", -1952, -164333],
			["Цветочный горшок", -41167, -175511],
			["Цветочный горшок", -41336, -175424],
			["Цветочный горшок", -41307, -175419],
			["Цветочный горшок", -41058, -175610],
			["Цветочный горшок", -41087, -175615],
			["Цветочный горшок", -41058, -175596],
			["Цветочный горшок", -41299, -175786],
			["Цветочный горшок", -41263, -175772],
			["Цветочный горшок", -41248, -175791],
			["Цветочный горшок", -41429, -175646],
			["Цветочный горшок", -41655, -175755],
			["Цветочный горшок", -41684, -175759],
			["Цветочный горшок", -41646, -175794],
			["Цветочный горшок", -41221, -175825],
			["Цветочный горшок", -41667, -175377],
			["Цветочный горшок", -41634, -175338],
			["Цветочный горшок", -41335, -176027],
			["Цветочный горшок", -41311, -176023],
			["Цветочный горшок", -41181, -175466],
			["Цветочный горшок", -41157, -175462],
			["Цветочный горшок", -42953, -173554],
			["Цветочный горшок", -40962, -175109],
			["Цветочный горшок", -40969, -175080],
			["Цветочный горшок", -40935, -175270],
			["Цветочный горшок", -40906, -175268],
			["Цветочный горшок", -40900, -175292],
			["Цветочный горшок", -40893, -175284],
			["Цветочный горшок", -40723, -175809],
			["Цветочный горшок", -40688, -175772],
			["Цветочный горшок", -40712, -175772],
			["Цветочный горшок", -120295, -189884],
			["Цветочный горшок", -119784, -188876],
			["Цветочный горшок", -122534, -191955],
			["Цветочный горшок", -122565, -191898],
			["Цветочный горшок", -128503, -184235],
			["Цветочный горшок", -133746, -157131],
			["Цветочный горшок", -133729, -157076],
			["Цветочный горшок", -137985, -152689],
			["Цветочный горшок", -137985, -152869],
			["Цветочный горшок", -135532, -151027],
			["Цветочный горшок", 189103, -164715],
			["Цветочный горшок", 71831, -173547],
			["Цветочный горшок", 71807, -173538],
			["Цветочный горшок", 71795, -173555],
			["Цветочный горшок", 71058, -173899],
			["Цветочный горшок", 71173, -174006],
			["Цветочный горшок", 71147, -174021],
			["Цветочный горшок", -82160, 201034],
			["Цветочный горшок", -54405, 192476],
			["Цветочный горшок", -97478, 179145],
			["Цветочный горшок", -99176, 183219],
			["Цветочный горшок", -539, 137243],
			["Цветочный горшок", -536, 137263],
			["Цветочный горшок", -623, 137069],
			["Цветочный горшок", -602, 137090],
			["Цветочный горшок", -517, 137261],
			["Цветочный горшок", -600, 137054],
			["Цветочный горшок", -368, 137029],
			["Цветочный горшок", -311, 137139],
			["Цветочный горшок", -355, 137002],
			["Цветочный горшок", -319, 137000],
			["Цветочный горшок", -84, 137016],
			["Цветочный горшок", -72, 136989],
			["Цветочный горшок", -582, 136861],
			["Цветочный горшок", 170852, 241865],
			["Цветочный горшок", 170934, 241820],
			["Цветочный горшок", 170891, 241836],
			["Цветочный горшок", 181268, 135797],
			["Цветочный горшок", 15149, 197466],
			["Цветочный горшок", 15069, 197496],
			["Цветочный горшок", 9082, 166976],
			["Цветочный горшок", 15548, 188220],
			["Цветочный горшок", 27436, 185474],
			["Цветочный горшок", 14335, 193723],
			["Цветочный горшок", 14385, 193737],
			["Цветочный горшок", 16749, 192846],
			["Цветочный горшок", 16761, 192827],
			["Цветочный горшок", 33047, 132113],
			["Цветочный горшок", 33325, 132092],
			["Цветочный горшок", 21068, 131615],
			["Цветочный горшок", 20900, 131726],
			["Цветочный горшок", 20930, 131706],
			["Цветочный горшок", 2955, 158451],
			["Цветочный горшок", 2930, 158429],
			["Цветочный горшок", 2897, 158396],
			["Цветочный горшок", 2516, 158397],
			["Цветочный горшок", -93138, 66453],
			["Цветочный горшок", -93159, 66496],
			["Цветочный горшок", -93139, 66617],
			["Цветочный горшок", -93143, 66600],
			["Цветочный горшок", -19175, 60147],
			["Цветочный горшок", -18996, 60172],
			["Цветочный горшок", -18985, 60188],
			["Цветочный горшок", -93616, 61305],
			["Цветочный горшок", -93626, 61351],
			["Цветочный горшок", -93580, 61465],
			["Цветочный горшок", -92569, 64951],
			["Цветочный горшок", -92549, 64945],
			["Цветочный горшок", 168540, 56444],
			["Цветочный горшок", 168523, 56420],
			["Цветочный горшок", 170108, 56803],
			["Цветочный горшок", 170100, 56806],
			["Цветочный горшок", 170444, 56761],
			["Цветочный горшок", 170471, 56773],
			["Цветочный горшок", 170438, 56731],
			["Цветочный горшок", 169886, 59282],
			["Цветочный горшок", 169936, 59276],
			["Цветочный горшок", 169963, 59316],
			["Цветочный горшок", 169964, 59243],
			["Цветочный горшок", 170788, 59345],
			["Цветочный горшок", 170789, 59339],
			["Цветочный горшок", 170765, 59321],
			["Цветочный горшок", 20634, 125211],
			["Цветочный горшок", 20675, 125221],
			["Цветочный горшок", 20658, 125209],
			["Цветочный горшок", 20651, 125238],
			["Цветочный горшок", 20709, 125224],
			["Цветочный горшок", 20772, 125136],
			["Цветочный горшок", 78981, 52331],
			["Цветочный горшок", 78933, 52768],
			["Цветочный горшок", 81162, 53078],
			["Цветочный горшок", 93689, 9101]
			];
	for (var i = 0; i < hlam628.length; i++) {
				hlam_628 = new L.circleMarker([hlam628[i][1],hlam628[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam628[i][0])
					.bindTooltip(hlam628[i][0], {direction: 'top'})
					.addTo(hlam628icons);
			}
	}
	else {
		hlam628icons.clearLayers();
	}
}
var hlam629icons = L.layerGroup().addTo(map);
function Hlam629OnOff() {
	var chbox629;
	chbox629=document.getElementById('Hlam629Button');
	if (chbox629.checked) {
		var hlam629 = [
			["Целая бейсбольная перчатка", 149539, -75788]
			];
	for (var i = 0; i < hlam629.length; i++) {
				hlam_629 = new L.circleMarker([hlam629[i][1],hlam629[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam629[i][0])
					.bindTooltip(hlam629[i][0], {direction: 'top'})
					.addTo(hlam629icons);
			}
	}
	else {
		hlam629icons.clearLayers();
	}
}
var hlam630icons = L.layerGroup().addTo(map);
function Hlam630OnOff() {
	var chbox630;
	chbox630=document.getElementById('Hlam630Button');
	if (chbox630.checked) {
		var hlam630 = [
			["Целая пачка сигарет", 84731, -19389],
			["Целая пачка сигарет", 189153, -165968]
			];
	for (var i = 0; i < hlam630.length; i++) {
				hlam_630 = new L.circleMarker([hlam630[i][1],hlam630[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam630[i][0])
					.bindTooltip(hlam630[i][0], {direction: 'top'})
					.addTo(hlam630icons);
			}
	}
	else {
		hlam630icons.clearLayers();
	}
}
var hlam631icons = L.layerGroup().addTo(map);
function Hlam631OnOff() {
	var chbox631;
	chbox631=document.getElementById('Hlam631Button');
	if (chbox631.checked) {
		var hlam631 = [
			["Целое чистящее средство &quotАбраксо&quot", -42428, -5335],
			["Целое чистящее средство &quotАбраксо&quot", -41383, -1830],
			["Целое чистящее средство &quotАбраксо&quot", -41391, -1832],
			["Целое чистящее средство &quotАбраксо&quot", -41270, -1736],
			["Целое чистящее средство &quotАбраксо&quot", -41264, -1729],
			["Целое чистящее средство &quotАбраксо&quot", -40340, -1644],
			["Целое чистящее средство &quotАбраксо&quot", -40336, -1660],
			["Целое чистящее средство &quotАбраксо&quot", 191697, -28446],
			["Целое чистящее средство &quotАбраксо&quot", 191694, -28454],
			["Целое чистящее средство &quotАбраксо&quot", 27463, 131338]
			];
	for (var i = 0; i < hlam631.length; i++) {
				hlam_631 = new L.circleMarker([hlam631[i][1],hlam631[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam631[i][0])
					.bindTooltip(hlam631[i][0], {direction: 'top'})
					.addTo(hlam631icons);
			}
	}
	else {
		hlam631icons.clearLayers();
	}
}
var hlam632icons = L.layerGroup().addTo(map);
function Hlam632OnOff() {
	var chbox632;
	chbox632=document.getElementById('Hlam632Button');
	if (chbox632.checked) {
		var hlam632 = [
			["Целый американский флаг", -51151, -13019],
			["Целый американский флаг", -42934, -6051],
			["Целый американский флаг", -13509, -66638]
			];
	for (var i = 0; i < hlam632.length; i++) {
				hlam_632 = new L.circleMarker([hlam632[i][1],hlam632[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam632[i][0])
					.bindTooltip(hlam632[i][0], {direction: 'top'})
					.addTo(hlam632icons);
			}
	}
	else {
		hlam632icons.clearLayers();
	}
}
var hlam633icons = L.layerGroup().addTo(map);
function Hlam633OnOff() {
	var chbox633;
	chbox633=document.getElementById('Hlam633Button');
	if (chbox633.checked) {
		var hlam633 = [

			];
	for (var i = 0; i < hlam633.length; i++) {
				hlam_633 = new L.circleMarker([hlam633[i][1],hlam633[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam633[i][0])
					.bindTooltip(hlam633[i][0], {direction: 'top'})
					.addTo(hlam633icons);
			}
	}
	else {
		hlam633icons.clearLayers();
	}
}
var hlam634icons = L.layerGroup().addTo(map);
function Hlam634OnOff() {
	var chbox634;
	chbox634=document.getElementById('Hlam634Button');
	if (chbox634.checked) {
		var hlam634 = [
			["Цилиндрическая ваза &quotИва&quot", -21538, -57849],
			["Цилиндрическая ваза &quotИва&quot", -47770, -49154],
			["Цилиндрическая ваза &quotИва&quot", -55197, -47854],
			["Цилиндрическая ваза &quotИва&quot", -52623, -99671],
			["Цилиндрическая ваза &quotИва&quot", -148064, -58782],
			["Цилиндрическая ваза &quotИва&quot", 165148, -7703],
			["Цилиндрическая ваза &quotИва&quot", 148633, -80062],
			["Цилиндрическая ваза &quotИва&quot", 90222, -9752],
			["Цилиндрическая ваза &quotИва&quot", 22199, -105331],
			["Цилиндрическая ваза &quotИва&quot", -139481, -143899],
			["Цилиндрическая ваза &quotИва&quot", 131711, -132069],
			["Цилиндрическая ваза &quotИва&quot", 15057, 191021],
			["Цилиндрическая ваза &quotИва&quot", 72603, 136094],
			["Цилиндрическая ваза &quotИва&quot", 72001, 136349],
			["Цилиндрическая ваза &quotИва&quot", -13916, 119436],
			["Цилиндрическая ваза &quotИва&quot", -104470, 123307],
			["Цилиндрическая ваза &quotИва&quot", -40954, 88151],
			["Цилиндрическая ваза &quotИва&quot", -46467, 19745],
			["Цилиндрическая ваза &quotИва&quot", 131657, 85056],
			["Цилиндрическая ваза &quotИва&quot", 29372, 119928]
			];
	for (var i = 0; i < hlam634.length; i++) {
				hlam_634 = new L.circleMarker([hlam634[i][1],hlam634[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam634[i][0])
					.bindTooltip(hlam634[i][0], {direction: 'top'})
					.addTo(hlam634icons);
			}
	}
	else {
		hlam634icons.clearLayers();
	}
}
var hlam635icons = L.layerGroup().addTo(map);
function Hlam635OnOff() {
	var chbox635;
	chbox635=document.getElementById('Hlam635Button');
	if (chbox635.checked) {
		var hlam635 = [
			["Цилиндрическая ваза &quotЦветы&quot", -79761, -108088],
			["Цилиндрическая ваза &quotЦветы&quot", 142176, -123846],
			["Цилиндрическая ваза &quotЦветы&quot", 13746, -107434],
			["Цилиндрическая ваза &quotЦветы&quot", -1749, -164450],
			["Цилиндрическая ваза &quotЦветы&quot", 43815, 176847]
			];
	for (var i = 0; i < hlam635.length; i++) {
				hlam_635 = new L.circleMarker([hlam635[i][1],hlam635[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam635[i][0])
					.bindTooltip(hlam635[i][0], {direction: 'top'})
					.addTo(hlam635icons);
			}
	}
	else {
		hlam635icons.clearLayers();
	}
}
var hlam636icons = L.layerGroup().addTo(map);
function Hlam636OnOff() {
	var chbox636;
	chbox636=document.getElementById('Hlam636Button');
	if (chbox636.checked) {
		var hlam636 = [
			["Чайник", -53211, -13020],
			["Чайник", -51920, -46013],
			["Чайник", 168371, -24473],
			["Чайник", 183696, -93129],
			["Чайник", 91602, -59340],
			["Чайник", 25105, -59818],
			["Чайник", 9561, -82205],
			["Чайник", 13200, -111300],
			["Чайник", -27380, 162831],
			["Чайник", 105128, 156813],
			["Чайник", 88166, 157199],
			["Чайник", -104914, 123084],
			["Чайник", -46390, 28347],
			["Чайник", 172128, 58076]
			];
	for (var i = 0; i < hlam636.length; i++) {
				hlam_636 = new L.circleMarker([hlam636[i][1],hlam636[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam636[i][0])
					.bindTooltip(hlam636[i][0], {direction: 'top'})
					.addTo(hlam636icons);
			}
	}
	else {
		hlam636icons.clearLayers();
	}
}
var hlam637icons = L.layerGroup().addTo(map);
function Hlam637OnOff() {
	var chbox637;
	chbox637=document.getElementById('Hlam637Button');
	if (chbox637.checked) {
		var hlam637 = [
			["Чайник", -7749, -13601],
			["Чайник", -40044, -1186],
			["Чайник", -33482, -254],
			["Чайник", -126821, -1142],
			["Чайник", -46921, -50902],
			["Чайник", -72397, -98206],
			["Чайник", -69616, -96270],
			["Чайник", -61350, -100025],
			["Чайник", -147816, -56872],
			["Чайник", 149102, -52454],
			["Чайник", 185158, -65683],
			["Чайник", 179976, -121807],
			["Чайник", 142097, -123814],
			["Чайник", 79407, -1597],
			["Чайник", 49972, -23188],
			["Чайник", 35429, -35262],
			["Чайник", 35427, -35424],
			["Чайник", 33485, -34005],
			["Чайник", 34178, -36280],
			["Чайник", -27352, -131382],
			["Чайник", 78114, -153999],
			["Чайник", 60554, -145204],
			["Чайник", 193787, 167297],
			["Чайник", 152397, 138677],
			["Чайник", 84570, 151500],
			["Чайник", 88192, 157145],
			["Чайник", 1988, 137639],
			["Чайник", -128921, 120330],
			["Чайник", -128400, 119907],
			["Чайник", -33973, 457],
			["Чайник", -49675, 5776],
			["Чайник", 168198, 55671],
			["Чайник", 168993, 56274],
			["Чайник", 170741, 56520],
			["Чайник", 170391, 56441],
			["Чайник", 193417, 55818],
			["Чайник", 171007, 58536],
			["Чайник", 171005, 58745],
			["Чайник", 171174, 59860],
			["Чайник", 171444, 60312],
			["Чайник", 170647, 59960],
			["Чайник", 169827, 59771],
			["Чайник", 169766, 60242],
			["Чайник", 170309, 60528],
			["Чайник", 169916, 60422],
			["Чайник", 172542, 57965],
			["Чайник", 140865, 9139],
			["Чайник", 25067, 69522]
			];
	for (var i = 0; i < hlam637.length; i++) {
				hlam_637 = new L.circleMarker([hlam637[i][1],hlam637[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam637[i][0])
					.bindTooltip(hlam637[i][0], {direction: 'top'})
					.addTo(hlam637icons);
			}
	}
	else {
		hlam637icons.clearLayers();
	}
}
var hlam638icons = L.layerGroup().addTo(map);
function Hlam638OnOff() {
	var chbox638;
	chbox638=document.getElementById('Hlam638Button');
	if (chbox638.checked) {
		var hlam638 = [
			["Чайник из злославки", -1254, -163505],
			["Чайник из злославки", -18803, 17575]
			];
	for (var i = 0; i < hlam638.length; i++) {
				hlam_638 = new L.circleMarker([hlam638[i][1],hlam638[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam638[i][0])
					.bindTooltip(hlam638[i][0], {direction: 'top'})
					.addTo(hlam638icons);
			}
	}
	else {
		hlam638icons.clearLayers();
	}
}
var hlam639icons = L.layerGroup().addTo(map);
function Hlam639OnOff() {
	var chbox639;
	chbox639=document.getElementById('Hlam639Button');
	if (chbox639.checked) {
		var hlam639 = [
			["Чарлстон геральд", 202935, -126348],
			["Чарлстон геральд", 152561, -106222],
			["Чарлстон геральд", 91500, -17643],
			["Чарлстон геральд", 128003, -81774],
			["Чарлстон геральд", 25708, -99836],
			["Чарлстон геральд", 175573, -133200],
			["Чарлстон геральд", 181944, -166686],
			["Чарлстон геральд", 80664, -181480],
			["Чарлстон геральд", 74521, -177440],
			["Чарлстон геральд", -59460, 4215],
			["Чарлстон геральд", 22881, 44578]
			];
	for (var i = 0; i < hlam639.length; i++) {
				hlam_639 = new L.circleMarker([hlam639[i][1],hlam639[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam639[i][0])
					.bindTooltip(hlam639[i][0], {direction: 'top'})
					.addTo(hlam639icons);
			}
	}
	else {
		hlam639icons.clearLayers();
	}
}
var hlam640icons = L.layerGroup().addTo(map);
function Hlam640OnOff() {
	var chbox640;
	chbox640=document.getElementById('Hlam640Button');
	if (chbox640.checked) {
		var hlam640 = [
			["Чашка", -7779, -13577],
			["Чашка", -7766, -13604],
			["Чашка", -51964, -13116],
			["Чашка", -44368, -8415],
			["Чашка", -40060, -1193],
			["Чашка", -33469, -237],
			["Чашка", -33458, -225],
			["Чашка", -33450, -213],
			["Чашка", -126833, -1159],
			["Чашка", -10008, -50389],
			["Чашка", -19127, -47065],
			["Чашка", -19200, -46897],
			["Чашка", -19226, -43447],
			["Чашка", -40284, -60201],
			["Чашка", -35588, -58763],
			["Чашка", -46937, -50889],
			["Чашка", -69619, -96541],
			["Чашка", -147856, -57445],
			["Чашка", -147565, -56478],
			["Чашка", 185157, -65653],
			["Чашка", 185127, -65682],
			["Чашка", 185151, -65739],
			["Чашка", 142096, -123769],
			["Чашка", 142144, -123791],
			["Чашка", 142213, -123887],
			["Чашка", 142211, -123951],
			["Чашка", 142168, -123930],
			["Чашка", 142135, -123873],
			["Чашка", 142091, -123798],
			["Чашка", 127944, -32144],
			["Чашка", 88086, -4048],
			["Чашка", 50011, -23182],
			["Чашка", 39795, -38605],
			["Чашка", 35524, -34867],
			["Чашка", 35776, -34863],
			["Чашка", 35546, -35008],
			["Чашка", 35431, -35288],
			["Чашка", 35429, -35312],
			["Чашка", 35429, -35460],
			["Чашка", 33391, -33797],
			["Чашка", 33504, -34023],
			["Чашка", 33471, -34020],
			["Чашка", 13197, -111336],
			["Чашка", -30195, -131840],
			["Чашка", -29559, -131615],
			["Чашка", -30316, -131415],
			["Чашка", -29614, -132476],
			["Чашка", -29589, -132525],
			["Чашка", 60548, -145246],
			["Чашка", 60561, -145219],
			["Чашка", 60528, -145112],
			["Чашка", 60522, -145221],
			["Чашка", -6435, 146501],
			["Чашка", -26968, 162451],
			["Чашка", 152156, 136972],
			["Чашка", 85106, 151368],
			["Чашка", 84583, 151455],
			["Чашка", 88179, 157161],
			["Чашка", -128947, 119714],
			["Чашка", -128899, 119874],
			["Чашка", -129042, 120078],
			["Чашка", -128840, 120287],
			["Чашка", -128356, 119997],
			["Чашка", -128661, 119917],
			["Чашка", -128810, 119176],
			["Чашка", -48169, 2485],
			["Чашка", -33950, 463],
			["Чашка", -33971, 483],
			["Чашка", -49644, 5791],
			["Чашка", -49676, 5762],
			["Чашка", -38303, 4178],
			["Чашка", -46323, 20445],
			["Чашка", 196149, 65622],
			["Чашка", 168182, 55647],
			["Чашка", 170753, 56534],
			["Чашка", 170762, 56519],
			["Чашка", 170423, 56450],
			["Чашка", 193427, 55807],
			["Чашка", 171135, 58661],
			["Чашка", 171184, 58462],
			["Чашка", 171100, 58353],
			["Чашка", 170943, 58318],
			["Чашка", 170773, 58394],
			["Чашка", 170741, 58558],
			["Чашка", 170855, 58714],
			["Чашка", 170824, 58710],
			["Чашка", 171019, 58755],
			["Чашка", 171180, 59876],
			["Чашка", 171194, 59889],
			["Чашка", 171478, 60320],
			["Чашка", 171459, 60319],
			["Чашка", 169941, 60413],
			["Чашка", 170627, 59968],
			["Чашка", 169812, 59782],
			["Чашка", 169844, 59762],
			["Чашка", 169749, 60251],
			["Чашка", 169784, 60236],
			["Чашка", 170297, 60513],
			["Чашка", 169910, 60382],
			["Чашка", 170783, 59130],
			["Чашка", 25048, 69526],
			["Чашка", 25060, 69480],
			["Чашка", 21778, 42873],
			["Чашка", 28830, 53291],
			["Чашка", 167392, -25982],
			["Чашка", 167392, -25982]
			];
	for (var i = 0; i < hlam640.length; i++) {
				hlam_640 = new L.circleMarker([hlam640[i][1],hlam640[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam640[i][0])
					.bindTooltip(hlam640[i][0], {direction: 'top'})
					.addTo(hlam640icons);
			}
	}
	else {
		hlam640icons.clearLayers();
	}
}
var hlam641icons = L.layerGroup().addTo(map);
function Hlam641OnOff() {
	var chbox641;
	chbox641=document.getElementById('Hlam641Button');
	if (chbox641.checked) {
		var hlam641 = [
			["Человеческая челюсть", -61795, -127414],
			["Человеческая челюсть", 191356, -7467],
			["Человеческая челюсть", 191627, -7593],
			["Человеческая челюсть", 191636, -7846],
			["Человеческая челюсть", 153786, -104691],
			["Человеческая челюсть", 153805, -104710],
			["Человеческая челюсть", 153796, -104705],
			["Человеческая челюсть", 153798, -104688],
			["Человеческая челюсть", 153804, -104719],
			["Человеческая челюсть", 127734, -27454],
			["Человеческая челюсть", 36051, -35330],
			["Человеческая челюсть", -102992, -179097],
			["Человеческая челюсть", 68456, 202330],
			["Человеческая челюсть", -56643, 8837],
			["Человеческая челюсть", -56322, 9070],
			["Человеческая челюсть", -56021, 9136],
			["Человеческая челюсть", 183580, 3011]
			];
	for (var i = 0; i < hlam641.length; i++) {
				hlam_641 = new L.circleMarker([hlam641[i][1],hlam641[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam641[i][0])
					.bindTooltip(hlam641[i][0], {direction: 'top'})
					.addTo(hlam641icons);
			}
	}
	else {
		hlam641icons.clearLayers();
	}
}
var hlam642icons = L.layerGroup().addTo(map);
function Hlam642OnOff() {
	var chbox642;
	chbox642=document.getElementById('Hlam642Button');
	if (chbox642.checked) {
		var hlam642 = [
			["Череп", -8463, -2903],
			["Череп", -17564, -46746],
			["Череп", -21860, -44682],
			["Череп", -18176, -44496],
			["Череп", -834, -34943],
			["Череп", -62921, -63802],
			["Череп", -41337, -37580],
			["Череп", -73018, -50879],
			["Череп", -102589, -56813],
			["Череп", -55847, -89809],
			["Череп", -114659, -99580],
			["Череп", -158870, -57811],
			["Череп", -168212, -41997],
			["Череп", -151769, -74584],
			["Череп", 184724, -19236],
			["Череп", 149165, -52580],
			["Череп", 177757, -122486],
			["Череп", 100408, -21663],
			["Череп", 103847, -20779],
			["Череп", 103698, -20755],
			["Череп", 104792, -21936],
			["Череп", 103843, -9243],
			["Череп", 103333, -7404],
			["Череп", 82022, -21095],
			["Череп", 35062, -6465],
			["Череп", 53639, -3335],
			["Череп", 53624, -3339],
			["Череп", 14439, -1547],
			["Череп", 99937, -84511],
			["Череп", 95854, -96315],
			["Череп", 95870, -96292],
			["Череп", 95777, -96323],
			["Череп", 95904, -96361],
			["Череп", 95879, -96360],
			["Череп", 95956, -96308],
			["Череп", 93408, -84141],
			["Череп", 93389, -84167],
			["Череп", 93394, -84100],
			["Череп", 93398, -84128],
			["Череп", 93365, -84122],
			["Череп", 45742, -74867],
			["Череп", 92834, -117176],
			["Череп", 93032, -116983],
			["Череп", 93046, -116951],
			["Череп", 92953, -116982],
			["Череп", 93077, -117020],
			["Череп", 93053, -117019],
			["Череп", 93132, -116966],
			["Череп", 38019, -119373],
			["Череп", -29511, -172610],
			["Череп", -82112, -178736],
			["Череп", -82124, -178745],
			["Череп", -81029, -178263],
			["Череп", -81044, -178259],
			["Череп", -120392, -189925],
			["Череп", -102664, -179627],
			["Череп", -162483, -157108],
			["Череп", -162479, -157095],
			["Череп", -162353, -157167],
			["Череп", -162496, -157106],
			["Череп", -162748, -157144],
			["Череп", -162746, -157131],
			["Череп", -162733, -157136],
			["Череп", 176280, -153802],
			["Череп", 139871, -145467],
			["Череп", 186979, -169736],
			["Череп", 189091, -169233],
			["Череп", 189992, -169069],
			["Череп", 187731, -165232],
			["Череп", 191616, -164514],
			["Череп", 111882, -134232],
			["Череп", 1297, -158093],
			["Череп", -5147, 200413],
			["Череп", -59628, 181308],
			["Череп", -60522, 180681],
			["Череп", -71078, 145695],
			["Череп", -156670, 190964],
			["Череп", 166376, 178080],
			["Череп", 166565, 178077],
			["Череп", 166474, 178332],
			["Череп", 166376, 178810],
			["Череп", 166412, 178619],
			["Череп", 69176, 202460],
			["Череп", 69135, 202582],
			["Череп", 69145, 202607],
			["Череп", 69121, 202588],
			["Череп", 69155, 202588],
			["Череп", 69706, 202133],
			["Череп", 69649, 202521],
			["Череп", 69967, 202136],
			["Череп", 38574, 146076],
			["Череп", 38655, 146197],
			["Череп", 38109, 144745],
			["Череп", 38142, 144846],
			["Череп", 38987, 144697],
			["Череп", 39117, 145989],
			["Череп", 38940, 146283],
			["Череп", 38861, 146227],
			["Череп", 57041, 152490],
			["Череп", 56909, 152386],
			["Череп", -80769, 102898],
			["Череп", -80833, 118158],
			["Череп", -80734, 118125],
			["Череп", -79983, 118138],
			["Череп", -80515, 120400],
			["Череп", -95527, 124268],
			["Череп", -104294, 123468],
			["Череп", -6473, 93226],
			["Череп", -57523, 88679],
			["Череп", -95403, 74081],
			["Череп", -19950, 16811],
			["Череп", -19341, 16704],
			["Череп", -43520, 4501],
			["Череп", -132324, 85315],
			["Череп", -152155, 398],
			["Череп", -151038, 1917],
			["Череп", 144631, 98445],
			["Череп", 144630, 98480],
			["Череп", 131671, 85045],
			["Череп", 168750, 59753],
			["Череп", 170906, 58538],
			["Череп", 170855, 59290],
			["Череп", 183583, 3064],
			["Череп", 183529, 3053],
			["Череп", 183714, 3295],
			["Череп", 94902, 98808],
			["Череп", 52858, 100471],
			["Череп", 43157, 110111],
			["Череп", 51520, 113644],
			["Череп", 129961, 74247],
			["Череп", 128654, 85551],
			["Череп", 99630, 91398],
			["Череп", 99711, 91460],
			["Череп", 99653, 91429],
			["Череп", 99695, 91428],
			["Череп", 41111, 77073],
			["Череп", 41112, 77089],
			["Череп", 50288, 84856],
			["Череп", 50274, 84851],
			["Череп", 26002, 70855],
			["Череп", 25986, 70881],
			["Череп", 25766, 71505],
			["Череп", 20321, 90039],
			["Череп", 20290, 90041],
			["Череп", 102369, 56959],
			["Череп", 103034, 56510],
			["Череп", 35624, 40022],
			["Череп", 35639, 40022],
			["Череп", 53355, 65230],
			["Череп", 14040, 39420],
			["Череп", 7144, 41778],
			["Череп", 7158, 41783],
			["Череп", 8297, 42643],
			["Череп", 8298, 42602],
			["Череп", 129810, 18650],
			["Череп", 52243, 8554],
			["Череп", 52252, 8542],
			["Череп", -101623, 84826],
			["Череп", 167755, -22610],
			["Череп", -101591, 157032],
			["Череп", 38865, 78930]
			];
	for (var i = 0; i < hlam642.length; i++) {
				hlam_642 = new L.circleMarker([hlam642[i][1],hlam642[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam642[i][0])
					.bindTooltip(hlam642[i][0], {direction: 'top'})
					.addTo(hlam642icons);
			}
	}
	else {
		hlam642icons.clearLayers();
	}
}
var hlam643icons = L.layerGroup().addTo(map);
function Hlam643OnOff() {
	var chbox643;
	chbox643=document.getElementById('Hlam643Button');
	if (chbox643.checked) {
		var hlam643 = [
			["Череп без теменной кости", -59142, -79316],
			["Череп без теменной кости", 101859, -12405],
			["Череп без теменной кости", 68459, 202361],
			["Череп без теменной кости", 69672, 202524],
			["Череп без теменной кости", 39018, 144603],
			["Череп без теменной кости", 38792, 146401],
			["Череп без теменной кости", -40379, 61866],
			["Череп без теменной кости", -56752, 8922],
			["Череп без теменной кости", -56023, 9066],
			["Череп без теменной кости", -56635, 8576],
			["Череп без теменной кости", -134116, 59176],
			["Череп без теменной кости", 35343, 40465],
			["Череп без теменной кости", 36257, 39112],
			["Череп без теменной кости", 7487, 43553],
			["Череп без теменной кости", 17133, 41710],
			["Череп без теменной кости", 55516, 10240]
			];
	for (var i = 0; i < hlam643.length; i++) {
				hlam_643 = new L.circleMarker([hlam643[i][1],hlam643[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam643[i][0])
					.bindTooltip(hlam643[i][0], {direction: 'top'})
					.addTo(hlam643icons);
			}
	}
	else {
		hlam643icons.clearLayers();
	}
}
var hlam644icons = L.layerGroup().addTo(map);
function Hlam644OnOff() {
	var chbox644;
	chbox644=document.getElementById('Hlam644Button');
	if (chbox644.checked) {
		var hlam644 = [
			["Череп брамина", -44494, -8147],
			["Череп брамина", -10554, -50651],
			["Череп брамина", -59876, -103840],
			["Череп брамина", 197418, -23124],
			["Череп брамина", 113834, -55919],
			["Череп брамина", 32796, -40609],
			["Череп брамина", 38117, -36015],
			["Череп брамина", 30211, -58434],
			["Череп брамина", 93033, -116994],
			["Череп брамина", -102558, -179901],
			["Череп брамина", -162294, -156897],
			["Череп брамина", -162537, -157233],
			["Череп брамина", 47779, -152886],
			["Череп брамина", 166528, 177890],
			["Череп брамина", 166926, 177823],
			["Череп брамина", 166789, 178024],
			["Череп брамина", 166866, 177725],
			["Череп брамина", 166463, 177549],
			["Череп брамина", 166395, 178455],
			["Череп брамина", 72948, 137035],
			["Череп брамина", -123275, 51008],
			["Череп брамина", -25864, 16961],
			["Череп брамина", 144616, 98462],
			["Череп брамина", 145184, 87480],
			["Череп брамина", 184179, 2743],
			["Череп брамина", 113533, 114412],
			["Череп брамина", 113659, 115561],
			["Череп брамина", 39607, 115391],
			["Череп брамина", 114836, 69166],
			["Череп брамина", 99745, 91469],
			["Череп брамина", 52957, 10983],
			["Череп брамина", -101855, 84779]
			];
	for (var i = 0; i < hlam644.length; i++) {
				hlam_644 = new L.circleMarker([hlam644[i][1],hlam644[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam644[i][0])
					.bindTooltip(hlam644[i][0], {direction: 'top'})
					.addTo(hlam644icons);
			}
	}
	else {
		hlam644icons.clearLayers();
	}
}
var hlam645icons = L.layerGroup().addTo(map);
function Hlam645OnOff() {
	var chbox645;
	chbox645=document.getElementById('Hlam645Button');
	if (chbox645.checked) {
		var hlam645 = [
			["Череп брамина без челюсти", -58970, -79435],
			["Череп брамина без челюсти", -61782, -127435],
			["Череп брамина без челюсти", 29947, -21372],
			["Череп брамина без челюсти", 25882, -60368],
			["Череп брамина без челюсти", 25528, -104733],
			["Череп брамина без челюсти", -76422, -184140],
			["Череп брамина без челюсти", -81551, -178661],
			["Череп брамина без челюсти", -97396, 183827],
			["Череп брамина без челюсти", -95279, 189797],
			["Череп брамина без челюсти", -94490, 189782],
			["Череп брамина без челюсти", -26936, 162793],
			["Череп брамина без челюсти", -27349, 162022],
			["Череп брамина без челюсти", -90295, 149737],
			["Череп брамина без челюсти", -88687, 150647],
			["Череп брамина без челюсти", 166662, 177900],
			["Череп брамина без челюсти", 166704, 179008],
			["Череп брамина без челюсти", 166320, 178816],
			["Череп брамина без челюсти", 3249, 184637],
			["Череп брамина без челюсти", 3004, 184609],
			["Череп брамина без челюсти", 16389, 189634],
			["Череп брамина без челюсти", -176986, 72766],
			["Череп брамина без челюсти", 190853, 115594],
			["Череп брамина без челюсти", 144952, 87482],
			["Череп брамина без челюсти", 198739, 45027],
			["Череп брамина без челюсти", 39325, 115301],
			["Череп брамина без челюсти", 39606, 115588],
			["Череп брамина без челюсти", 39132, 115647],
			["Череп брамина без челюсти", 39143, 115388],
			["Череп брамина без челюсти", 39071, 115622],
			["Череп брамина без челюсти", 130704, 74894],
			["Череп брамина без челюсти", 25652, 69355],
			["Череп брамина без челюсти", 25907, 69338],
			["Череп брамина без челюсти", 35675, 40546],
			["Череп брамина без челюсти", 36264, 38765],
			["Череп брамина без челюсти", 35357, 40403],
			["Череп брамина без челюсти", 35817, 40450],
			["Череп брамина без челюсти", 36417, 38832],
			["Череп брамина без челюсти", 35974, 38687],
			["Череп брамина без челюсти", 36200, 39291],
			["Череп брамина без челюсти", 36098, 39233],
			["Череп брамина без челюсти", 35804, 40055],
			["Череп брамина без челюсти", 34571, 40539],
			["Череп брамина без челюсти", 34565, 40652],
			["Череп брамина без челюсти", 34955, 39852],
			["Череп брамина без челюсти", 34906, 39780],
			["Череп брамина без челюсти", 14809, 40037],
			["Череп брамина без челюсти", 7556, 43453],
			["Череп брамина без челюсти", 7171, 41792],
			["Череп брамина без челюсти", 17018, 41679],
			["Череп брамина без челюсти", 16279, 48601],
			["Череп брамина без челюсти", 55397, 10154],
			["Череп брамина без челюсти", 130750, 86331]
			];
	for (var i = 0; i < hlam645.length; i++) {
				hlam_645 = new L.circleMarker([hlam645[i][1],hlam645[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam645[i][0])
					.bindTooltip(hlam645[i][0], {direction: 'top'})
					.addTo(hlam645icons);
			}
	}
	else {
		hlam645icons.clearLayers();
	}
}
var hlam646icons = L.layerGroup().addTo(map);
function Hlam646OnOff() {
	var chbox646;
	chbox646=document.getElementById('Hlam646Button');
	if (chbox646.checked) {
		var hlam646 = [
			["Черная миска", -155766, -36674],
			["Черная миска", 143381, -151385],
			["Черная миска", 51489, -149723],
			["Черная миска", 51486, -149703],
			["Черная миска", 51249, -149433],
			["Черная миска", 51286, -149489],
			["Черная миска", 29706, 161377],
			["Черная миска", 14223, 39738],
			["Черная миска", 14701, 39699],
			["Черная миска", 9770, 48335]
			];
	for (var i = 0; i < hlam646.length; i++) {
				hlam_646 = new L.circleMarker([hlam646[i][1],hlam646[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam646[i][0])
					.bindTooltip(hlam646[i][0], {direction: 'top'})
					.addTo(hlam646icons);
			}
	}
	else {
		hlam646icons.clearLayers();
	}
}
var hlam647icons = L.layerGroup().addTo(map);
function Hlam647OnOff() {
	var chbox647;
	chbox647=document.getElementById('Hlam647Button');
	if (chbox647.checked) {
		var hlam647 = [
			["Черная салфетка", -155781, -36665],
			["Черная салфетка", 143169, -151130],
			["Черная салфетка", 143166, -151262],
			["Черная салфетка", 143182, -151279],
			["Черная салфетка", 143074, -151178],
			["Черная салфетка", 143065, -151174],
			["Черная салфетка", 143484, -151420],
			["Черная салфетка", 143439, -151403],
			["Черная салфетка", 15040, 38969],
			["Черная салфетка", 14689, 39677],
			["Черная салфетка", 14729, 39701],
			["Черная салфетка", 14949, 39526],
			["Черная салфетка", 15018, 39285],
			["Черная салфетка", 15053, 39271]
			];
	for (var i = 0; i < hlam647.length; i++) {
				hlam_647 = new L.circleMarker([hlam647[i][1],hlam647[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam647[i][0])
					.bindTooltip(hlam647[i][0], {direction: 'top'})
					.addTo(hlam647icons);
			}
	}
	else {
		hlam647icons.clearLayers();
	}
}
var hlam648icons = L.layerGroup().addTo(map);
function Hlam648OnOff() {
	var chbox648;
	chbox648=document.getElementById('Hlam648Button');
	if (chbox648.checked) {
		var hlam648 = [
			["Черный стакан", -155736, -36624],
			["Черный стакан", -168053, -115389],
			["Черный стакан", 88648, -31135],
			["Черный стакан", -76794, -176243],
			["Черный стакан", 143349, -151673],
			["Черный стакан", 143382, -151648],
			["Черный стакан", 143431, -151667],
			["Черный стакан", 74114, -176922],
			["Черный стакан", -72721, 184602],
			["Черный стакан", -72713, 184596],
			["Черный стакан", -146135, 172937],
			["Черный стакан", 152584, 161740],
			["Черный стакан", 152619, 161772],
			["Черный стакан", 15096, 188781],
			["Черный стакан", 171121, 1771],
			["Черный стакан", 15118, 39076],
			["Черный стакан", 15097, 39069],
			["Черный стакан", 15036, 38975],
			["Черный стакан", 14915, 39519],
			["Черный стакан", 14826, 39649],
			["Черный стакан", 14719, 39703],
			["Черный стакан", 14515, 39771],
			["Черный стакан", 14408, 39753],
			["Черный стакан", 14294, 39781]
			];
	for (var i = 0; i < hlam648.length; i++) {
				hlam_648 = new L.circleMarker([hlam648[i][1],hlam648[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam648[i][0])
					.bindTooltip(hlam648[i][0], {direction: 'top'})
					.addTo(hlam648icons);
			}
	}
	else {
		hlam648icons.clearLayers();
	}
}
var hlam649icons = L.layerGroup().addTo(map);
function Hlam649OnOff() {
	var chbox649;
	chbox649=document.getElementById('Hlam649Button');
	if (chbox649.checked) {
		var hlam649 = [
			["Чистая банка из-под кофе", -41646, -80419],
			["Чистая банка из-под кофе", 134988, -727],
			["Чистая банка из-под кофе", 77917, -11621],
			["Чистая банка из-под кофе", -62572, -170636],
			["Чистая банка из-под кофе", -65890, 129471],
			["Чистая банка из-под кофе", -8709, 42309],
			["Чистая банка из-под кофе", -65441, 35917],
			["Чистая банка из-под кофе", -25119, 3995],
			["Чистая банка из-под кофе", -41759, 3150],
			["Чистая банка из-под кофе", -34378, 12969],
			["Чистая банка из-под кофе", -91774, 26853],
			["Чистая банка из-под кофе", 138455, 3124],
			["Чистая банка из-под кофе", 140479, 7473],
			["Чистая банка из-под кофе", 100679, 25919]
			];
	for (var i = 0; i < hlam649.length; i++) {
				hlam_649 = new L.circleMarker([hlam649[i][1],hlam649[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam649[i][0])
					.bindTooltip(hlam649[i][0], {direction: 'top'})
					.addTo(hlam649icons);
			}
	}
	else {
		hlam649icons.clearLayers();
	}
}
var hlam650icons = L.layerGroup().addTo(map);
function Hlam650OnOff() {
	var chbox650;
	chbox650=document.getElementById('Hlam650Button');
	if (chbox650.checked) {
		var hlam650 = [

			];
	for (var i = 0; i < hlam650.length; i++) {
				hlam_650 = new L.circleMarker([hlam650[i][1],hlam650[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam650[i][0])
					.bindTooltip(hlam650[i][0], {direction: 'top'})
					.addTo(hlam650icons);
			}
	}
	else {
		hlam650icons.clearLayers();
	}
}
var hlam651icons = L.layerGroup().addTo(map);
function Hlam651OnOff() {
	var chbox651;
	chbox651=document.getElementById('Hlam651Button');
	if (chbox651.checked) {
		var hlam651 = [
			["Чистая кофейная кружка", -37239, -112671],
			["Чистая кофейная кружка", 93649, -5589],
			["Чистая кофейная кружка", 74109, -176953],
			["Чистая кофейная кружка", 80705, -179031],
			["Чистая кофейная кружка", -132048, 12364],
			["Чистая кофейная кружка", 113812, 6571],
			["Чистая кофейная кружка", 125932, 9845]
			];
	for (var i = 0; i < hlam651.length; i++) {
				hlam_651 = new L.circleMarker([hlam651[i][1],hlam651[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam651[i][0])
					.bindTooltip(hlam651[i][0], {direction: 'top'})
					.addTo(hlam651icons);
			}
	}
	else {
		hlam651icons.clearLayers();
	}
}
var hlam652icons = L.layerGroup().addTo(map);
function Hlam652OnOff() {
	var chbox652;
	chbox652=document.getElementById('Hlam652Button');
	if (chbox652.checked) {
		var hlam652 = [
			["Чистая красная тарелка", 183341, -166192],
			["Чистая красная тарелка", 183288, -166259],
			["Чистая красная тарелка", -49967, 3814],
			["Чистая красная тарелка", -38730, 2892],
			["Чистая красная тарелка", -37847, 2841]
			];
	for (var i = 0; i < hlam652.length; i++) {
				hlam_652 = new L.circleMarker([hlam652[i][1],hlam652[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam652[i][0])
					.bindTooltip(hlam652[i][0], {direction: 'top'})
					.addTo(hlam652icons);
			}
	}
	else {
		hlam652icons.clearLayers();
	}
}
var hlam653icons = L.layerGroup().addTo(map);
function Hlam653OnOff() {
	var chbox653;
	chbox653=document.getElementById('Hlam653Button');
	if (chbox653.checked) {
		var hlam653 = [
			["Чистая миска", 107788, -153945],
			["Чистая миска", -41703, 3160]
			];
	for (var i = 0; i < hlam653.length; i++) {
				hlam_653 = new L.circleMarker([hlam653[i][1],hlam653[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam653[i][0])
					.bindTooltip(hlam653[i][0], {direction: 'top'})
					.addTo(hlam653icons);
			}
	}
	else {
		hlam653icons.clearLayers();
	}
}
var hlam654icons = L.layerGroup().addTo(map);
function Hlam654OnOff() {
	var chbox654;
	chbox654=document.getElementById('Hlam654Button');
	if (chbox654.checked) {
		var hlam654 = [
			["Чистая пепельница", -104563, 38389],
			["Чистая пепельница", 58799, 58279]
			];
	for (var i = 0; i < hlam654.length; i++) {
				hlam_654 = new L.circleMarker([hlam654[i][1],hlam654[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam654[i][0])
					.bindTooltip(hlam654[i][0], {direction: 'top'})
					.addTo(hlam654icons);
			}
	}
	else {
		hlam654icons.clearLayers();
	}
}
var hlam655icons = L.layerGroup().addTo(map);
function Hlam655OnOff() {
	var chbox655;
	chbox655=document.getElementById('Hlam655Button');
	if (chbox655.checked) {
		var hlam655 = [
			["Чистая перечница", -27748, -60150],
			["Чистая перечница", -19362, -47199],
			["Чистая перечница", -105489, -119839],
			["Чистая перечница", -147772, -56844],
			["Чистая перечница", 72863, -7704],
			["Чистая перечница", -120829, -189642],
			["Чистая перечница", -92848, 183524],
			["Чистая перечница", 29249, 53868]
			];
	for (var i = 0; i < hlam655.length; i++) {
				hlam_655 = new L.circleMarker([hlam655[i][1],hlam655[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam655[i][0])
					.bindTooltip(hlam655[i][0], {direction: 'top'})
					.addTo(hlam655icons);
			}
	}
	else {
		hlam655icons.clearLayers();
	}
}
var hlam656icons = L.layerGroup().addTo(map);
function Hlam656OnOff() {
	var chbox656;
	chbox656=document.getElementById('Hlam656Button');
	if (chbox656.checked) {
		var hlam656 = [
			["Чистая подставка для зонтиков", -42828, -5447],
			["Чистая подставка для зонтиков", -125232, -109844],
			["Чистая подставка для зонтиков", 180567, -123132],
			["Чистая подставка для зонтиков", 70623, -7814],
			["Чистая подставка для зонтиков", 52726, -128176],
			["Чистая подставка для зонтиков", 22138, 133323],
			["Чистая подставка для зонтиков", -39011, 4356],
			["Чистая подставка для зонтиков", -38971, 4364]
			];
	for (var i = 0; i < hlam656.length; i++) {
				hlam_656 = new L.circleMarker([hlam656[i][1],hlam656[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam656[i][0])
					.bindTooltip(hlam656[i][0], {direction: 'top'})
					.addTo(hlam656icons);
			}
	}
	else {
		hlam656icons.clearLayers();
	}
}
var hlam657icons = L.layerGroup().addTo(map);
function Hlam657OnOff() {
	var chbox657;
	chbox657=document.getElementById('Hlam657Button');
	if (chbox657.checked) {
		var hlam657 = [

			];
	for (var i = 0; i < hlam657.length; i++) {
				hlam_657 = new L.circleMarker([hlam657[i][1],hlam657[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam657[i][0])
					.bindTooltip(hlam657[i][0], {direction: 'top'})
					.addTo(hlam657icons);
			}
	}
	else {
		hlam657icons.clearLayers();
	}
}
var hlam658icons = L.layerGroup().addTo(map);
function Hlam658OnOff() {
	var chbox658;
	chbox658=document.getElementById('Hlam658Button');
	if (chbox658.checked) {
		var hlam658 = [
			["Чистая солонка", -53796, -4142],
			["Чистая солонка", 88221, -21446],
			["Чистая солонка", 88106, -20861],
			["Чистая солонка", 9443, -82197],
			["Чистая солонка", -17726, 59976]
			];
	for (var i = 0; i < hlam658.length; i++) {
				hlam_658 = new L.circleMarker([hlam658[i][1],hlam658[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam658[i][0])
					.bindTooltip(hlam658[i][0], {direction: 'top'})
					.addTo(hlam658icons);
			}
	}
	else {
		hlam658icons.clearLayers();
	}
}
var hlam659icons = L.layerGroup().addTo(map);
function Hlam659OnOff() {
	var chbox659;
	chbox659=document.getElementById('Hlam659Button');
	if (chbox659.checked) {
		var hlam659 = [
			["Чистая швабра", -120201, -132790],
			["Чистая швабра", -95655, 184346],
			["Чистая швабра", 101584, 196777],
			["Чистая швабра", -65333, 5611],
			["Чистая швабра", 88795, 2829]
			];
	for (var i = 0; i < hlam659.length; i++) {
				hlam_659 = new L.circleMarker([hlam659[i][1],hlam659[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam659[i][0])
					.bindTooltip(hlam659[i][0], {direction: 'top'})
					.addTo(hlam659icons);
			}
	}
	else {
		hlam659icons.clearLayers();
	}
}
var hlam660icons = L.layerGroup().addTo(map);
function Hlam660OnOff() {
	var chbox660;
	chbox660=document.getElementById('Hlam660Button');
	if (chbox660.checked) {
		var hlam660 = [
			["Чистое металлическое ведро", -44736, -15576],
			["Чистое металлическое ведро", -44711, -15569],
			["Чистое металлическое ведро", -112029, -58895],
			["Чистое металлическое ведро", 90956, -31303],
			["Чистое металлическое ведро", 189511, -165379],
			["Чистое металлическое ведро", -103831, 38215],
			["Чистое металлическое ведро", -25121, 11610],
			["Чистое металлическое ведро", -38009, 4862]
			];
	for (var i = 0; i < hlam660.length; i++) {
				hlam_660 = new L.circleMarker([hlam660[i][1],hlam660[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam660[i][0])
					.bindTooltip(hlam660[i][0], {direction: 'top'})
					.addTo(hlam660icons);
			}
	}
	else {
		hlam660icons.clearLayers();
	}
}
var hlam661icons = L.layerGroup().addTo(map);
function Hlam661OnOff() {
	var chbox661;
	chbox661=document.getElementById('Hlam661Button');
	if (chbox661.checked) {
		var hlam661 = [
			["Чистый глобус", 108057, -153260]
			];
	for (var i = 0; i < hlam661.length; i++) {
				hlam_661 = new L.circleMarker([hlam661[i][1],hlam661[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam661[i][0])
					.bindTooltip(hlam661[i][0], {direction: 'top'})
					.addTo(hlam661icons);
			}
	}
	else {
		hlam661icons.clearLayers();
	}
}
var hlam662icons = L.layerGroup().addTo(map);
function Hlam662OnOff() {
	var chbox662;
	chbox662=document.getElementById('Hlam662Button');
	if (chbox662.checked) {
		var hlam662 = [
			["Чистый зонтик", -51247, -12685],
			["Чистый зонтик", -42828, -5447],
			["Чистый зонтик", -117392, -61978],
			["Чистый зонтик", -125259, -109902],
			["Чистый зонтик", 75142, -9535],
			["Чистый зонтик", 70622, -7813],
			["Чистый зонтик", 15030, 197428],
			["Чистый зонтик", -38971, 4364],
			["Чистый зонтик", -43352, 11870]
			];
	for (var i = 0; i < hlam662.length; i++) {
				hlam_662 = new L.circleMarker([hlam662[i][1],hlam662[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam662[i][0])
					.bindTooltip(hlam662[i][0], {direction: 'top'})
					.addTo(hlam662icons);
			}
	}
	else {
		hlam662icons.clearLayers();
	}
}
var hlam663icons = L.layerGroup().addTo(map);
function Hlam663OnOff() {
	var chbox663;
	chbox663=document.getElementById('Hlam663Button');
	if (chbox663.checked) {
		var hlam663 = [
			["Чистый кофейник", -52767, -13345],
			["Чистый кофейник", 107914, -153307]
			];
	for (var i = 0; i < hlam663.length; i++) {
				hlam_663 = new L.circleMarker([hlam663[i][1],hlam663[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam663[i][0])
					.bindTooltip(hlam663[i][0], {direction: 'top'})
					.addTo(hlam663icons);
			}
	}
	else {
		hlam663icons.clearLayers();
	}
}
var hlam664icons = L.layerGroup().addTo(map);
function Hlam664OnOff() {
	var chbox664;
	chbox664=document.getElementById('Hlam664Button');
	if (chbox664.checked) {
		var hlam664 = [

			];
	for (var i = 0; i < hlam664.length; i++) {
				hlam_664 = new L.circleMarker([hlam664[i][1],hlam664[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam664[i][0])
					.bindTooltip(hlam664[i][0], {direction: 'top'})
					.addTo(hlam664icons);
			}
	}
	else {
		hlam664icons.clearLayers();
	}
}
var hlam665icons = L.layerGroup().addTo(map);
function Hlam665OnOff() {
	var chbox665;
	chbox665=document.getElementById('Hlam665Button');
	if (chbox665.checked) {
		var hlam665 = [
			["Чистый стакан", -29798, -172812],
			["Чистый стакан", -29909, -173191],
			["Чистый стакан", -29373, -173381],
			["Чистый стакан", -29536, -173366],
			["Чистый стакан", -29402, -173280],
			["Чистый стакан", -29458, -173174],
			["Чистый стакан", -29378, -173077],
			["Чистый стакан", -29826, -172983],
			["Чистый стакан", -29718, -172997],
			["Чистый стакан", -29569, -172797],
			["Чистый стакан", -29521, -172743],
			["Чистый стакан", -29523, -172755],
			["Чистый стакан", -29533, -172740],
			["Чистый стакан", -29537, -172752],
			["Чистый стакан", -29544, -172739],
			["Чистый стакан", -29550, -172750],
			["Чистый стакан", -29562, -172748],
			["Чистый стакан", -29558, -172736],
			["Чистый стакан", -29569, -172735],
			["Чистый стакан", -29575, -172746],
			["Чистый стакан", 74115, -176912],
			["Чистый стакан", -39354, 4282],
			["Чистый стакан", -39368, 4333],
			["Чистый стакан", -46020, 20415],
			["Чистый стакан", -45993, 20425]
			];
	for (var i = 0; i < hlam665.length; i++) {
				hlam_665 = new L.circleMarker([hlam665[i][1],hlam665[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam665[i][0])
					.bindTooltip(hlam665[i][0], {direction: 'top'})
					.addTo(hlam665icons);
			}
	}
	else {
		hlam665icons.clearLayers();
	}
}
var hlam666icons = L.layerGroup().addTo(map);
function Hlam666OnOff() {
	var chbox666;
	chbox666=document.getElementById('Hlam666Button');
	if (chbox666.checked) {
		var hlam666 = [

			];
	for (var i = 0; i < hlam666.length; i++) {
				hlam_666 = new L.circleMarker([hlam666[i][1],hlam666[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam666[i][0])
					.bindTooltip(hlam666[i][0], {direction: 'top'})
					.addTo(hlam666icons);
			}
	}
	else {
		hlam666icons.clearLayers();
	}
}
var hlam667icons = L.layerGroup().addTo(map);
function Hlam667OnOff() {
	var chbox667;
	chbox667=document.getElementById('Hlam667Button');
	if (chbox667.checked) {
		var hlam667 = [
			["Чистящее средство &quotАбраксо&quot", -49756, -14626],
			["Чистящее средство &quotАбраксо&quot", -49736, -14628],
			["Чистящее средство &quotАбраксо&quot", -68248, -14220],
			["Чистящее средство &quotАбраксо&quot", -72464, -7275],
			["Чистящее средство &quotАбраксо&quot", -72460, -7289],
			["Чистящее средство &quotАбраксо&quot", -17328, -46431],
			["Чистящее средство &quotАбраксо&quot", -19484, -47075],
			["Чистящее средство &quotАбраксо&quot", -19469, -47099],
			["Чистящее средство &quotАбраксо&quot", -20672, -44158],
			["Чистящее средство &quotАбраксо&quot", -49116, -50141],
			["Чистящее средство &quotАбраксо&quot", -55213, -47933],
			["Чистящее средство &quotАбраксо&quot", -52182, -46442],
			["Чистящее средство &quotАбраксо&quot", -120104, -46238],
			["Чистящее средство &quotАбраксо&quot", -29604, -87737],
			["Чистящее средство &quotАбраксо&quot", -58406, -85917],
			["Чистящее средство &quotАбраксо&quot", -59560, -85285],
			["Чистящее средство &quotАбраксо&quot", -15502, -125305],
			["Чистящее средство &quotАбраксо&quot", -62067, -129266],
			["Чистящее средство &quotАбраксо&quot", -62077, -129267],
			["Чистящее средство &quotАбраксо&quot", -44121, -107601],
			["Чистящее средство &quotАбраксо&quot", -47829, -100666],
			["Чистящее средство &quotАбраксо&quot", -47677, -100576],
			["Чистящее средство &quotАбраксо&quot", -48556, -100407],
			["Чистящее средство &quotАбраксо&quot", -105328, -119278],
			["Чистящее средство &quotАбраксо&quot", -114901, -99707],
			["Чистящее средство &quotАбраксо&quot", -148000, -56684],
			["Чистящее средство &quotАбраксо&quot", -149338, -55901],
			["Чистящее средство &quotАбраксо&quot", -152267, -74877],
			["Чистящее средство &quotАбраксо&quot", -151835, -74611],
			["Чистящее средство &quotАбраксо&quot", -151256, -74690],
			["Чистящее средство &quotАбраксо&quot", -151151, -75248],
			["Чистящее средство &quotАбраксо&quot", -151159, -75246],
			["Чистящее средство &quotАбраксо&quot", -151345, -72027],
			["Чистящее средство &quotАбраксо&quot", 188932, -29568],
			["Чистящее средство &quotАбраксо&quot", 194592, -31228],
			["Чистящее средство &quotАбраксо&quot", 167571, -24859],
			["Чистящее средство &quotАбраксо&quot", 192317, -27466],
			["Чистящее средство &quotАбраксо&quot", 138781, -53806],
			["Чистящее средство &quotАбраксо&quot", 149128, -52388],
			["Чистящее средство &quotАбраксо&quot", 150913, -52802],
			["Чистящее средство &quotАбраксо&quot", 150904, -52803],
			["Чистящее средство &quotАбраксо&quot", 182750, -93455],
			["Чистящее средство &quotАбраксо&quot", 148485, -79695],
			["Чистящее средство &quotАбраксо&quot", 153252, -103835],
			["Чистящее средство &quotАбраксо&quot", 101362, -12291],
			["Чистящее средство &quotАбраксо&quot", 90935, -31279],
			["Чистящее средство &quotАбраксо&quot", 81871, -21225],
			["Чистящее средство &quotАбраксо&quot", 67252, -14233],
			["Чистящее средство &quotАбраксо&quot", 72877, -7709],
			["Чистящее средство &quotАбраксо&quot", 88832, -6250],
			["Чистящее средство &quotАбраксо&quot", 72441, -3779],
			["Чистящее средство &quotАбраксо&quot", 48722, -22028],
			["Чистящее средство &quotАбраксо&quot", 50595, -22920],
			["Чистящее средство &quotАбраксо&quot", 27705, -31312],
			["Чистящее средство &quotАбраксо&quot", 49966, -44368],
			["Чистящее средство &quotАбраксо&quot", 51876, -44032],
			["Чистящее средство &quotАбраксо&quot", 33931, -33120],
			["Чистящее средство &quotАбраксо&quot", 33947, -33120],
			["Чистящее средство &quotАбраксо&quot", 9079, -82284],
			["Чистящее средство &quotАбраксо&quot", 9079, -82273],
			["Чистящее средство &quotАбраксо&quot", 9730, -107190],
			["Чистящее средство &quotАбраксо&quot", 9734, -107195],
			["Чистящее средство &quotАбраксо&quot", 13596, -107061],
			["Чистящее средство &quotАбраксо&quot", 19927, -104232],
			["Чистящее средство &quotАбраксо&quot", -7028, -161531],
			["Чистящее средство &quotАбраксо&quot", -4328, -156027],
			["Чистящее средство &quotАбраксо&quot", -6837, -135678],
			["Чистящее средство &quotАбраксо&quot", -130265, -146945],
			["Чистящее средство &quotАбраксо&quot", -119171, -136135],
			["Чистящее средство &quotАбраксо&quot", -62545, -170629],
			["Чистящее средство &quotАбраксо&quot", -95502, -176487],
			["Чистящее средство &quotАбраксо&quot", -95649, -176693],
			["Чистящее средство &quotАбраксо&quot", -95642, -176699],
			["Чистящее средство &quotАбраксо&quot", -76838, -175870],
			["Чистящее средство &quotАбраксо&quot", -76847, -175874],
			["Чистящее средство &quotАбраксо&quot", -130771, -189872],
			["Чистящее средство &quotАбраксо&quot", -132485, -148984],
			["Чистящее средство &quotАбраксо&quot", -135152, -181478],
			["Чистящее средство &quotАбраксо&quot", -136902, -179887],
			["Чистящее средство &quotАбраксо&quot", 166681, -149166],
			["Чистящее средство &quotАбраксо&quot", 131682, -132043],
			["Чистящее средство &quotАбраксо&quot", 189148, -165980],
			["Чистящее средство &quotАбраксо&quot", 26397, -137719],
			["Чистящее средство &quotАбраксо&quot", 30374, -139064],
			["Чистящее средство &quotАбраксо&quot", 28732, -139261],
			["Чистящее средство &quotАбраксо&quot", -4322, 184899],
			["Чистящее средство &quotАбраксо&quot", -23064, 189553],
			["Чистящее средство &quotАбраксо&quot", -60682, 180623],
			["Чистящее средство &quotАбраксо&quot", -60587, 181497],
			["Чистящее средство &quotАбраксо&quot", -84398, 166037],
			["Чистящее средство &quotАбраксо&quot", -84117, 166223],
			["Чистящее средство &quotАбраксо&quot", -97375, 179460],
			["Чистящее средство &quotАбраксо&quot", -41285, 161180],
			["Чистящее средство &quotАбраксо&quot", -90053, 148598],
			["Чистящее средство &quotАбраксо&quot", -140907, 156522],
			["Чистящее средство &quotАбраксо&quot", 151484, 138540],
			["Чистящее средство &quotАбраксо&quot", 142415, 139530],
			["Чистящее средство &quotАбраксо&quot", 68467, 202428],
			["Чистящее средство &quotАбраксо&quot", 68466, 202420],
			["Чистящее средство &quotАбраксо&quot", 69677, 202133],
			["Чистящее средство &quotАбраксо&quot", 60309, 173240],
			["Чистящее средство &quotАбраксо&quot", 64994, 176203],
			["Чистящее средство &quotАбраксо&quot", 65289, 177139],
			["Чистящее средство &quotАбраксо&quot", 48913, 190776],
			["Чистящее средство &quotАбраксо&quot", 26576, 172121],
			["Чистящее средство &quotАбраксо&quot", 3134, 182040],
			["Чистящее средство &quotАбраксо&quot", 3138, 182024],
			["Чистящее средство &quotАбраксо&quot", 14801, 188202],
			["Чистящее средство &quotАбраксо&quot", 84994, 151705],
			["Чистящее средство &quotАбраксо&quot", 84997, 151695],
			["Чистящее средство &quotАбраксо&quot", 45603, 161499],
			["Чистящее средство &quotАбраксо&quot", 45623, 161497],
			["Чистящее средство &quotАбраксо&quot", 2786, 161440],
			["Чистящее средство &quotАбраксо&quot", -59934, 117475],
			["Чистящее средство &quotАбраксо&quot", -104656, 123049],
			["Чистящее средство &quotАбраксо&quot", -37689, 83594],
			["Чистящее средство &quotАбраксо&quot", -43516, 88863],
			["Чистящее средство &quotАбраксо&quot", -41044, 87864],
			["Чистящее средство &quotАбраксо&quot", -43414, 88091],
			["Чистящее средство &quotАбраксо&quot", -87867, 67511],
			["Чистящее средство &quotАбраксо&quot", -87873, 67503],
			["Чистящее средство &quotАбраксо&quot", -91135, 62855],
			["Чистящее средство &quotАбраксо&quot", -99608, 38980],
			["Чистящее средство &quotАбраксо&quot", -51853, 2846],
			["Чистящее средство &quotАбраксо&quot", -47766, 1713],
			["Чистящее средство &quotАбраксо&quot", -47602, 1838],
			["Чистящее средство &quotАбраксо&quot", -33897, 543],
			["Чистящее средство &quotАбраксо&quot", -33900, 538],
			["Чистящее средство &quotАбраксо&quot", -58667, 7083],
			["Чистящее средство &quotАбраксо&quot", -119618, 3465],
			["Чистящее средство &quotАбраксо&quot", -98949, 7685],
			["Чистящее средство &quotАбраксо&quot", -98572, 7590],
			["Чистящее средство &quotАбраксо&quot", -98762, 7722],
			["Чистящее средство &quotАбраксо&quot", -148441, 113828],
			["Чистящее средство &quotАбраксо&quot", -173111, 110498],
			["Чистящее средство &quotАбраксо&quot", -172713, 109556],
			["Чистящее средство &quotАбраксо&quot", 182911, 109852],
			["Чистящее средство &quotАбраксо&quot", 183407, 110930],
			["Чистящее средство &quotАбраксо&quot", 154211, 77319],
			["Чистящее средство &quotАбраксо&quot", 143753, 81700],
			["Чистящее средство &quotАбраксо&quot", 133883, 85455],
			["Чистящее средство &quotАбраксо&quot", 169541, 57281],
			["Чистящее средство &quotАбраксо&quot", 168435, 55449],
			["Чистящее средство &quotАбраксо&quot", 168771, 55747],
			["Чистящее средство &quotАбраксо&quot", 168443, 58224],
			["Чистящее средство &quotАбраксо&quot", 168449, 58214],
			["Чистящее средство &quotАбраксо&quot", 153092, 57492],
			["Чистящее средство &quotАбраксо&quot", 160324, 58683],
			["Чистящее средство &quotАбраксо&quot", 134391, 15982],
			["Чистящее средство &quotАбраксо&quot", 111655, 57878],
			["Чистящее средство &quotАбраксо&quot", 72509, 38345],
			["Чистящее средство &quotАбраксо&quot", 14772, 39346],
			["Чистящее средство &quotАбраксо&quot", 23682, 44241],
			["Чистящее средство &quotАбраксо&quot", 27057, 50317],
			["Чистящее средство &quotАбраксо&quot", 29079, 53961],
			["Чистящее средство &quotАбраксо&quot", 58972, 12082],
			["Чистящее средство &quotАбраксо&quot", 58668, 10322]
			];
	for (var i = 0; i < hlam667.length; i++) {
				hlam_667 = new L.circleMarker([hlam667[i][1],hlam667[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam667[i][0])
					.bindTooltip(hlam667[i][0], {direction: 'top'})
					.addTo(hlam667icons);
			}
	}
	else {
		hlam667icons.clearLayers();
	}
}
var hlam668icons = L.layerGroup().addTo(map);
function Hlam668OnOff() {
	var chbox668;
	chbox668=document.getElementById('Hlam668Button');
	if (chbox668.checked) {
		var hlam668 = [
			["Чудо-клей", -47990, -8079],
			["Чудо-клей", -29356, -49356],
			["Чудо-клей", -37943, -58565],
			["Чудо-клей", -117641, -62242],
			["Чудо-клей", -29374, -94407],
			["Чудо-клей", -84865, -80547],
			["Чудо-клей", -84863, -80571],
			["Чудо-клей", -43131, -127646],
			["Чудо-клей", -95333, -113636],
			["Чудо-клей", -105916, -115674],
			["Чудо-клей", -126631, -114070],
			["Чудо-клей", -126628, -114060],
			["Чудо-клей", -115375, -99260],
			["Чудо-клей", -114891, -99477],
			["Чудо-клей", -149547, -58137],
			["Чудо-клей", -147949, -56669],
			["Чудо-клей", -149113, -125710],
			["Чудо-клей", -132239, -121481],
			["Чудо-клей", -131654, -112321],
			["Чудо-клей", 188926, -30020],
			["Чудо-клей", 167572, -25193],
			["Чудо-клей", 164630, -21493],
			["Чудо-клей", 172287, -43007],
			["Чудо-клей", 182757, -93524],
			["Чудо-клей", 158184, -68796],
			["Чудо-клей", 130022, -27201],
			["Чудо-клей", 101326, -912],
			["Чудо-клей", 48391, -22281],
			["Чудо-клей", 111683, -55264],
			["Чудо-клей", 22684, -60614],
			["Чудо-клей", 29227, -58774],
			["Чудо-клей", 113626, -75376],
			["Чудо-клей", 101280, -100435],
			["Чудо-клей", -4133, -155861],
			["Чудо-клей", -55038, -160575],
			["Чудо-клей", -40789, -157828],
			["Чудо-клей", -61216, -145487],
			["Чудо-клей", -62588, -170652],
			["Чудо-клей", -111294, -177511],
			["Чудо-клей", -111288, -177505],
			["Чудо-клей", -114519, -171311],
			["Чудо-клей", -152778, -160396],
			["Чудо-клей", 174681, -139918],
			["Чудо-клей", 176865, -132493],
			["Чудо-клей", -55385, 165113],
			["Чудо-клей", -10112, 132103],
			["Чудо-клей", -26129, 143842],
			["Чудо-клей", -109296, 157378],
			["Чудо-клей", -143595, 178977],
			["Чудо-клей", -163499, 141977],
			["Чудо-клей", -138866, 152585],
			["Чудо-клей", 137507, 145269],
			["Чудо-клей", 152583, 161860],
			["Чудо-клей", 69673, 202147],
			["Чудо-клей", 16131, 198252],
			["Чудо-клей", 79909, 182236],
			["Чудо-клей", 65429, 177148],
			["Чудо-клей", 88219, 157163],
			["Чудо-клей", 47097, 162002],
			["Чудо-клей", 29955, 133183],
			["Чудо-клей", -38805, 83744],
			["Чудо-клей", -42237, 87417],
			["Чудо-клей", -40655, 88310],
			["Чудо-клей", -87949, 67338],
			["Чудо-клей", -52845, 58144],
			["Чудо-клей", -74207, 49002],
			["Чудо-клей", -47975, 15357],
			["Чудо-клей", -46636, 19742],
			["Чудо-клей", 181257, 109899],
			["Чудо-клей", 182906, 112215],
			["Чудо-клей", 190438, 30878],
			["Чудо-клей", 190433, 30897],
			["Чудо-клей", 131662, 20134],
			["Чудо-клей", 111399, 55770]
			];
	for (var i = 0; i < hlam668.length; i++) {
				hlam_668 = new L.circleMarker([hlam668[i][1],hlam668[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam668[i][0])
					.bindTooltip(hlam668[i][0], {direction: 'top'})
					.addTo(hlam668icons);
			}
	}
	else {
		hlam668icons.clearLayers();
	}
}
var hlam669icons = L.layerGroup().addTo(map);
function Hlam669OnOff() {
	var chbox669;
	chbox669=document.getElementById('Hlam669Button');
	if (chbox669.checked) {
		var hlam669 = [
			["Шар для боулинга", 115386, -63137],
			["Шар для боулинга", 65693, -105622],
			["Шар для боулинга", 65760, -105606],
			["Шар для боулинга", -38247, -173943],
			["Шар для боулинга", -101212, 85702],
			["Шар для боулинга", -101198, 85733],
			["Шар для боулинга", -101246, 85578],
			["Шар для боулинга", -101263, 85568],
			["Шар для боулинга", -101217, 85567],
			["Шар для боулинга", 157725, 67778]
			];
	for (var i = 0; i < hlam669.length; i++) {
				hlam_669 = new L.circleMarker([hlam669[i][1],hlam669[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam669[i][0])
					.bindTooltip(hlam669[i][0], {direction: 'top'})
					.addTo(hlam669icons);
			}
	}
	else {
		hlam669icons.clearLayers();
	}
}
var hlam670icons = L.layerGroup().addTo(map);
function Hlam670OnOff() {
	var chbox670;
	chbox670=document.getElementById('Hlam670Button');
	if (chbox670.checked) {
		var hlam670 = [
			["Шахматная доска", -9585, -27331],
			["Шахматная доска", -53130, -6331],
			["Шахматная доска", -40500, -2918],
			["Шахматная доска", -38546, -59565],
			["Шахматная доска", -39142, -59778],
			["Шахматная доска", -16519, -68707],
			["Шахматная доска", -59057, -85058],
			["Шахматная доска", -47869, -70844],
			["Шахматная доска", -69758, -96402],
			["Шахматная доска", -72157, -69971],
			["Шахматная доска", -147956, -57952],
			["Шахматная доска", -147577, -37799],
			["Шахматная доска", -151141, -71999],
			["Шахматная доска", 182235, -13768],
			["Шахматная доска", 140678, -790],
			["Шахматная доска", 154469, -46512],
			["Шахматная доска", 202443, -127360],
			["Шахматная доска", 128549, -30301],
			["Шахматная доска", 87637, -21944],
			["Шахматная доска", 67603, -14480],
			["Шахматная доска", 92258, -9535],
			["Шахматная доска", 115562, -63036],
			["Шахматная доска", 5071, -33366],
			["Шахматная доска", 30833, -33717],
			["Шахматная доска", 93867, -84849],
			["Шахматная доска", 75717, -76819],
			["Шахматная доска", 10196, -79866],
			["Шахматная доска", 18548, -122937],
			["Шахматная доска", 29247, -100210],
			["Шахматная доска", 143295, -151447],
			["Шахматная доска", 193460, -169126],
			["Шахматная доска", -26345, 144125],
			["Шахматная доска", -143486, 179671],
			["Шахматная доска", -144401, 148603],
			["Шахматная доска", 152860, 161754],
			["Шахматная доска", 15339, 198180],
			["Шахматная доска", 124749, 168790],
			["Шахматная доска", 43981, 163923],
			["Шахматная доска", 44394, 176519],
			["Шахматная доска", 58665, 176828],
			["Шахматная доска", 88173, 157138],
			["Шахматная доска", -86723, 66989],
			["Шахматная доска", -39376, 4306],
			["Шахматная доска", -164536, 122292],
			["Шахматная доска", -146274, 65694],
			["Шахматная доска", -159979, 78354],
			["Шахматная доска", 160645, 116243],
			["Шахматная доска", 189210, 83948],
			["Шахматная доска", 133057, 84962],
			["Шахматная доска", 170816, 59210],
			["Шахматная доска", 183322, 3415],
			["Шахматная доска", 129607, 86002],
			["Шахматная доска", 17474, 75904],
			["Шахматная доска", 74367, 36875],
			["Шахматная доска", 81294, 54736],
			["Шахматная доска", 23231, 43919],
			["Шахматная доска", 28649, 48826],
			["Шахматная доска", 28878, 53028],
			["Шахматная доска", 120351, 5585],
			["Шахматная доска", 121844, 6195],
			["Шахматная доска", 87946, 1759],
			["Шахматная доска", 57785, 9702]
			];
	for (var i = 0; i < hlam670.length; i++) {
				hlam_670 = new L.circleMarker([hlam670[i][1],hlam670[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam670[i][0])
					.bindTooltip(hlam670[i][0], {direction: 'top'})
					.addTo(hlam670icons);
			}
	}
	else {
		hlam670icons.clearLayers();
	}
}
var hlam671icons = L.layerGroup().addTo(map);
function Hlam671OnOff() {
	var chbox671;
	chbox671=document.getElementById('Hlam671Button');
	if (chbox671.checked) {
		var hlam671 = [
			["Швабра", -52646, -13865],
			["Швабра", -43577, -6458],
			["Швабра", -28119, -60540],
			["Швабра", -37974, -58745],
			["Швабра", -39475, -55162],
			["Швабра", -45919, -50470],
			["Швабра", -51672, -46658],
			["Швабра", -91131, -42721],
			["Швабра", -110616, -60795],
			["Швабра", -111020, -58300],
			["Швабра", -119315, -46762],
			["Швабра", -29638, -94133],
			["Швабра", -17561, -68930],
			["Швабра", -13462, -66169],
			["Швабра", -11818, -69113],
			["Швабра", -84491, -80160],
			["Швабра", -31918, -130593],
			["Швабра", -15584, -125194],
			["Швабра", -43397, -127762],
			["Швабра", -38658, -131044],
			["Швабра", -63793, -103533],
			["Швабра", -75579, -113241],
			["Швабра", -68842, -105136],
			["Швабра", -122692, -125514],
			["Швабра", -105955, -115144],
			["Швабра", -162295, -53624],
			["Швабра", -148326, -56401],
			["Швабра", -155352, -36110],
			["Швабра", -152279, -74875],
			["Швабра", -150924, -73041],
			["Швабра", 188776, -29882],
			["Швабра", 167305, -24329],
			["Швабра", 173686, -13561],
			["Швабра", 180492, -12107],
			["Швабра", 171991, -42988],
			["Швабра", 142570, -59927],
			["Швабра", 148957, -51847],
			["Швабра", 202696, -125250],
			["Швабра", 130686, -31811],
			["Швабра", 101325, -12508],
			["Швабра", 81679, -21024],
			["Швабра", 77321, -14832],
			["Швабра", 77029, -15055],
			["Швабра", 70404, -9908],
			["Швабра", 111554, -55433],
			["Швабра", 62269, -57568],
			["Швабра", 37643, -41944],
			["Швабра", 49988, -44556],
			["Швабра", 39789, -37144],
			["Швабра", 56759, -66970],
			["Швабра", 87977, -115351],
			["Швабра", 49510, -98965],
			["Швабра", -72794, -131967],
			["Швабра", -103905, -133533],
			["Швабра", -41554, -175314],
			["Швабра", -78185, -181082],
			["Швабра", -83194, -179404],
			["Швабра", -78246, -176866],
			["Швабра", -81177, -176262],
			["Швабра", -76660, -176577],
			["Швабра", -152426, -160541],
			["Швабра", 189267, -168935],
			["Швабра", 188981, -165979],
			["Швабра", 51730, -148888],
			["Швабра", 26930, -136591],
			["Швабра", 73962, -179444],
			["Швабра", 74300, -176917],
			["Швабра", -65022, 200726],
			["Швабра", -9480, 192784],
			["Швабра", -60961, 182048],
			["Швабра", -79854, 180187],
			["Швабра", -91636, 183389],
			["Швабра", -41439, 161307],
			["Швабра", -38009, 160364],
			["Швабра", -109354, 157351],
			["Швабра", -163543, 200364],
			["Швабра", -138719, 152483],
			["Швабра", 179382, 133916],
			["Швабра", 150051, 135118],
			["Швабра", 149447, 135790],
			["Швабра", 153055, 140640],
			["Швабра", 68505, 202481],
			["Швабра", 6092, 164172],
			["Швабра", 87541, 157561],
			["Швабра", -15084, 119486],
			["Швабра", -59479, 122695],
			["Швабра", -129143, 118978],
			["Швабра", -37999, 84778],
			["Швабра", -41724, 88163],
			["Швабра", -128392, 79981],
			["Швабра", -101797, 85255],
			["Швабра", -17573, 60225],
			["Швабра", -52890, 57026],
			["Швабра", -52726, 58011],
			["Швабра", -103692, 38410],
			["Швабра", -23675, 11158],
			["Швабра", -47202, 2478],
			["Швабра", -45726, 2014],
			["Швабра", -46823, 847],
			["Швабра", -38633, 3053],
			["Швабра", -49969, 6347],
			["Швабра", -43676, 5872],
			["Швабра", -58551, 11994],
			["Швабра", -55286, 9716],
			["Швабра", -47792, 15243],
			["Швабра", -119831, 3500],
			["Швабра", -148737, 113584],
			["Швабра", -139055, 88554],
			["Швабра", 182802, 109892],
			["Швабра", 183087, 111739],
			["Швабра", 137227, 43325],
			["Швабра", 182661, 3626],
			["Швабра", 182425, 3444],
			["Швабра", 132660, 20380],
			["Швабра", 35743, 124902],
			["Швабра", 25082, 124978],
			["Швабра", 26961, 127582],
			["Швабра", 111656, 58310],
			["Швабра", 28640, 48304],
			["Швабра", 100517, 2206],
			["Швабра", 129248, 19933],
			["Швабра", 85391, 5562],
			["Швабра", 57937, 12001],
			["Швабра", 58160, 12045],
			["Швабра", 59020, 12107],
			["Швабра", 59156, 10673],
			["Швабра", 58598, 10287]
			];
	for (var i = 0; i < hlam671.length; i++) {
				hlam_671 = new L.circleMarker([hlam671[i][1],hlam671[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam671[i][0])
					.bindTooltip(hlam671[i][0], {direction: 'top'})
					.addTo(hlam671icons);
			}
	}
	else {
		hlam671icons.clearLayers();
	}
}
var hlam672icons = L.layerGroup().addTo(map);
function Hlam672OnOff() {
	var chbox672;
	chbox672=document.getElementById('Hlam672Button');
	if (chbox672.checked) {
		var hlam672 = [
			["Швабра", -50150, -14642],
			["Швабра", -50011, -14627],
			["Швабра", -52423, -12986],
			["Швабра", -41324, -1796],
			["Швабра", -77713, -21763],
			["Швабра", -19050, -47044],
			["Швабра", -56266, -60232],
			["Швабра", -47057, -51036],
			["Швабра", -112024, -58881],
			["Швабра", -34321, -84166],
			["Швабра", -35600, -81066],
			["Швабра", -46790, -72145],
			["Швабра", -4375, -130446],
			["Швабра", -10931, -123751],
			["Швабра", -5206, -115346],
			["Швабра", -63195, -128955],
			["Швабра", -51163, -111449],
			["Швабра", -117345, -102403],
			["Швабра", -147658, -56121],
			["Швабра", -158408, -44068],
			["Швабра", -151210, -75214],
			["Швабра", -151799, -71848],
			["Швабра", -131307, -113670],
			["Швабра", -131291, -112213],
			["Швабра", 189543, -30085],
			["Швабра", 191699, -28430],
			["Швабра", 167951, -24261],
			["Швабра", 198111, -33669],
			["Швабра", 148812, -51748],
			["Швабра", 149067, -52289],
			["Швабра", 104249, -12799],
			["Швабра", 89030, -21100],
			["Швабра", 84757, -18685],
			["Швабра", 95981, -6782],
			["Швабра", 48419, -22048],
			["Швабра", 48792, -22367],
			["Швабра", 22570, -60854],
			["Швабра", 29435, -58513],
			["Швабра", 18107, -106341],
			["Швабра", 19955, -104288],
			["Швабра", 25642, -104417],
			["Швабра", 28378, -102388],
			["Швабра", 26134, -99782],
			["Швабра", -55448, -160426],
			["Швабра", -93275, -163684],
			["Швабра", -119155, -136090],
			["Швабра", -115729, -136815],
			["Швабра", -121622, -132640],
			["Швабра", -76065, -176686],
			["Швабра", -120242, -189798],
			["Швабра", -134592, -154139],
			["Швабра", -172640, -150000],
			["Швабра", 28698, -139306],
			["Швабра", 28464, -137858],
			["Швабра", 30354, -139090],
			["Швабра", 74404, -177775],
			["Швабра", 74384, -172602],
			["Швабра", -38866, 190372],
			["Швабра", -4979, 160857],
			["Швабра", -109694, 133003],
			["Швабра", -157112, 190956],
			["Швабра", -140838, 156378],
			["Швабра", 70177, 201985],
			["Швабра", 6082, 164163],
			["Швабра", 26758, 172101],
			["Швабра", 10761, 184316],
			["Швабра", 111801, 139526],
			["Швабра", 3008, 160624],
			["Швабра", -129133, 118977],
			["Швабра", -52942, 55651],
			["Швабра", -122826, 51696],
			["Швабра", -41605, 2581],
			["Швабра", -34012, 621],
			["Швабра", -54007, 22319],
			["Швабра", 183267, 110758],
			["Швабра", 167914, 59643],
			["Швабра", 196325, 62637],
			["Швабра", 183673, 2887],
			["Швабра", 95370, 103619],
			["Швабра", 49074, 85824],
			["Швабра", 79529, 55568],
			["Швабра", 16467, 44703],
			["Швабра", 84775, 841],
			["Швабра", 93626, 9065],
			["Швабра", 71710, 21205],
			["Швабра", 58800, 11319],
			["Швабра", 58984, 10896],
			["Швабра", 57981, 10313]
			];
	for (var i = 0; i < hlam672.length; i++) {
				hlam_672 = new L.circleMarker([hlam672[i][1],hlam672[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam672[i][0])
					.bindTooltip(hlam672[i][0], {direction: 'top'})
					.addTo(hlam672icons);
			}
	}
	else {
		hlam672icons.clearLayers();
	}
}
var hlam673icons = L.layerGroup().addTo(map);
function Hlam673OnOff() {
	var chbox673;
	chbox673=document.getElementById('Hlam673Button');
	if (chbox673.checked) {
		var hlam673 = [
			["Шестеренка", -82219, -29548],
			["Шестеренка", -84343, -28960],
			["Шестеренка", -83929, -29162],
			["Шестеренка", -83148, -29837],
			["Шестеренка", -82964, -29089],
			["Шестеренка", -3969, -41820],
			["Шестеренка", -120700, -65197],
			["Шестеренка", -119790, -46889],
			["Шестеренка", -34121, -84684],
			["Шестеренка", -34138, -84685],
			["Шестеренка", -34098, -84672],
			["Шестеренка", -47110, -72614],
			["Шестеренка", -43868, -125409],
			["Шестеренка", -111725, -121817],
			["Шестеренка", -111739, -121827],
			["Шестеренка", -111711, -121795],
			["Шестеренка", -121872, -112194],
			["Шестеренка", -117188, -102336],
			["Шестеренка", -168091, -112474],
			["Шестеренка", 88937, -31273],
			["Шестеренка", 84760, -19385],
			["Шестеренка", 70209, -7895],
			["Шестеренка", 39613, -96708],
			["Шестеренка", 22569, -101997],
			["Шестеренка", -7019, -161546],
			["Шестеренка", -126496, -134125],
			["Шестеренка", -146033, -142887],
			["Шестеренка", -146049, -142883],
			["Шестеренка", -146007, -142882],
			["Шестеренка", 189182, -165964],
			["Шестеренка", 107772, -153938],
			["Шестеренка", -94094, 190630],
			["Шестеренка", -4031, 161263],
			["Шестеренка", -143473, 172008],
			["Шестеренка", -145339, 173537],
			["Шестеренка", -145334, 173553],
			["Шестеренка", -145337, 173511],
			["Шестеренка", -145245, 174845],
			["Шестеренка", -140185, 177885],
			["Шестеренка", -171720, 147531],
			["Шестеренка", 93538, 189153],
			["Шестеренка", 19491, 134797],
			["Шестеренка", -12666, 116528],
			["Шестеренка", -103203, 109860],
			["Шестеренка", -104023, 38617],
			["Шестеренка", -104201, 38499],
			["Шестеренка", -46416, 28432],
			["Шестеренка", -122918, 18760],
			["Шестеренка", -148766, 113493],
			["Шестеренка", -138335, 88017],
			["Шестеренка", 154335, 77662],
			["Шестеренка", 143748, 82208],
			["Шестеренка", 153116, 57787],
			["Шестеренка", 170875, 1566],
			["Шестеренка", 183799, 2617],
			["Шестеренка", 135965, 15010],
			["Шестеренка", 111445, 58081]
			];
	for (var i = 0; i < hlam673.length; i++) {
				hlam_673 = new L.circleMarker([hlam673[i][1],hlam673[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam673[i][0])
					.bindTooltip(hlam673[i][0], {direction: 'top'})
					.addTo(hlam673icons);
			}
	}
	else {
		hlam673icons.clearLayers();
	}
}
var hlam674icons = L.layerGroup().addTo(map);
function Hlam674OnOff() {
	var chbox674;
	chbox674=document.getElementById('Hlam674Button');
	if (chbox674.checked) {
		var hlam674 = [
			["Шестеренки", -69187, -105027],
			["Шестеренки", -148436, -56828],
			["Шестеренки", -148435, -56842],
			["Шестеренки", 50840, -45159],
			["Шестеренки", 93292, -84266],
			["Шестеренки", 189561, -165960],
			["Шестеренки", -96020, 177026],
			["Шестеренки", 92722, 191866],
			["Шестеренки", -103563, 121880],
			["Шестеренки", 114639, 68925],
			["Шестеренки", 16310, 44738]
			];
	for (var i = 0; i < hlam674.length; i++) {
				hlam_674 = new L.circleMarker([hlam674[i][1],hlam674[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam674[i][0])
					.bindTooltip(hlam674[i][0], {direction: 'top'})
					.addTo(hlam674icons);
			}
	}
	else {
		hlam674icons.clearLayers();
	}
}
var hlam675icons = L.layerGroup().addTo(map);
function Hlam675OnOff() {
	var chbox675;
	chbox675=document.getElementById('Hlam675Button');
	if (chbox675.checked) {
		var hlam675 = [
			["Шкура брамина", -10451, -50357],
			["Шкура брамина", -113639, -47272],
			["Шкура брамина", 36073, -35312],
			["Шкура брамина", 10240, -52335],
			["Шкура брамина", -76328, -184330],
			["Шкура брамина", -82836, -178090],
			["Шкура брамина", -81866, -178041],
			["Шкура брамина", -97249, 183943],
			["Шкура брамина", -97249, 183949],
			["Шкура брамина", -97271, 183960],
			["Шкура брамина", -97229, 183913],
			["Шкура брамина", -97259, 183821],
			["Шкура брамина", -98794, 183508],
			["Шкура брамина", -27377, 163121],
			["Шкура брамина", 16378, 189698],
			["Шкура брамина", 15952, 189834],
			["Шкура брамина", 72981, 136963],
			["Шкура брамина", -5430, 33868],
			["Шкура брамина", 7221, 42546],
			["Шкура брамина", 16271, 48573],
			["Шкура брамина", 26299, 54772],
			["Шкура брамина", 53933, 13038]
			];
	for (var i = 0; i < hlam675.length; i++) {
				hlam_675 = new L.circleMarker([hlam675[i][1],hlam675[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam675[i][0])
					.bindTooltip(hlam675[i][0], {direction: 'top'})
					.addTo(hlam675icons);
			}
	}
	else {
		hlam675icons.clearLayers();
	}
}
var hlam676icons = L.layerGroup().addTo(map);
function Hlam676OnOff() {
	var chbox676;
	chbox676=document.getElementById('Hlam676Button');
	if (chbox676.checked) {
		var hlam676 = [
			["Шкура кротокрыса", -117501, -62169],
			["Шкура кротокрыса", 163725, -108041],
			["Шкура кротокрыса", 163718, -108029],
			["Шкура кротокрыса", 101238, -99916],
			["Шкура кротокрыса", -34881, 172376],
			["Шкура кротокрыса", -27602, 162258],
			["Шкура кротокрыса", -27583, 162257],
			["Шкура кротокрыса", -27558, 162259],
			["Шкура кротокрыса", -27529, 162255],
			["Шкура кротокрыса", -27132, 162524],
			["Шкура кротокрыса", -79292, 89092],
			["Шкура кротокрыса", 35130, 39508],
			["Шкура кротокрыса", 36089, 38432],
			["Шкура кротокрыса", 15637, 49635]
			];
	for (var i = 0; i < hlam676.length; i++) {
				hlam_676 = new L.circleMarker([hlam676[i][1],hlam676[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam676[i][0])
					.bindTooltip(hlam676[i][0], {direction: 'top'})
					.addTo(hlam676icons);
			}
	}
	else {
		hlam676icons.clearLayers();
	}
}
var hlam677icons = L.layerGroup().addTo(map);
function Hlam677OnOff() {
	var chbox677;
	chbox677=document.getElementById('Hlam677Button');
	if (chbox677.checked) {
		var hlam677 = [
			["Шкура рад-оленя", -10436, -50376],
			["Шкура рад-оленя", -118225, -84442],
			["Шкура рад-оленя", -85754, -106519],
			["Шкура рад-оленя", -160399, -41775],
			["Шкура рад-оленя", 101342, -923],
			["Шкура рад-оленя", -81823, -178080],
			["Шкура рад-оленя", -97257, 183947],
			["Шкура рад-оленя", -2656, 158358],
			["Шкура рад-оленя", -27257, 163029],
			["Шкура рад-оленя", -27456, 162978],
			["Шкура рад-оленя", -27457, 162954],
			["Шкура рад-оленя", -27461, 162933],
			["Шкура рад-оленя", -27068, 162947],
			["Шкура рад-оленя", -38194, 159658],
			["Шкура рад-оленя", -38207, 159657],
			["Шкура рад-оленя", -139365, 171830],
			["Шкура рад-оленя", -80644, 89394],
			["Шкура рад-оленя", -164305, 123356],
			["Шкура рад-оленя", 192618, 113610],
			["Шкура рад-оленя", 182456, 97118],
			["Шкура рад-оленя", 191446, 61303],
			["Шкура рад-оленя", 9996, 48554]
			];
	for (var i = 0; i < hlam677.length; i++) {
				hlam_677 = new L.circleMarker([hlam677[i][1],hlam677[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam677[i][0])
					.bindTooltip(hlam677[i][0], {direction: 'top'})
					.addTo(hlam677icons);
			}
	}
	else {
		hlam677icons.clearLayers();
	}
}
var hlam678icons = L.layerGroup().addTo(map);
function Hlam678OnOff() {
	var chbox678;
	chbox678=document.getElementById('Hlam678Button');
	if (chbox678.checked) {
		var hlam678 = [
			["Шкура сверхленивца", -143051, 171873]
			];
	for (var i = 0; i < hlam678.length; i++) {
				hlam_678 = new L.circleMarker([hlam678[i][1],hlam678[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam678[i][0])
					.bindTooltip(hlam678[i][0], {direction: 'top'})
					.addTo(hlam678icons);
			}
	}
	else {
		hlam678icons.clearLayers();
	}
}
var hlam679icons = L.layerGroup().addTo(map);
function Hlam679OnOff() {
	var chbox679;
	chbox679=document.getElementById('Hlam679Button');
	if (chbox679.checked) {
		var hlam679 = [
			["Шкура яо-гая", -118202, -84432],
			["Шкура яо-гая", -118050, -84381],
			["Шкура яо-гая", -85350, -106113],
			["Шкура яо-гая", -27572, 162590]
			];
	for (var i = 0; i < hlam679.length; i++) {
				hlam_679 = new L.circleMarker([hlam679[i][1],hlam679[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam679[i][0])
					.bindTooltip(hlam679[i][0], {direction: 'top'})
					.addTo(hlam679icons);
			}
	}
	else {
		hlam679icons.clearLayers();
	}
}
var hlam680icons = L.layerGroup().addTo(map);
function Hlam680OnOff() {
	var chbox680;
	chbox680=document.getElementById('Hlam680Button');
	if (chbox680.checked) {
		var hlam680 = [
			["Штанга 20 кг", -68941, -52086],
			["Штанга 20 кг", -67476, -106408],
			["Штанга 20 кг", -67757, -106309],
			["Штанга 20 кг", -149091, -55326],
			["Штанга 20 кг", -148638, -54478],
			["Штанга 20 кг", 128425, -28868],
			["Штанга 20 кг", 29333, -101059],
			["Штанга 20 кг", 167660, 58763]
			];
	for (var i = 0; i < hlam680.length; i++) {
				hlam_680 = new L.circleMarker([hlam680[i][1],hlam680[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam680[i][0])
					.bindTooltip(hlam680[i][0], {direction: 'top'})
					.addTo(hlam680icons);
			}
	}
	else {
		hlam680icons.clearLayers();
	}
}
var hlam681icons = L.layerGroup().addTo(map);
function Hlam681OnOff() {
	var chbox681;
	chbox681=document.getElementById('Hlam681Button');
	if (chbox681.checked) {
		var hlam681 = [
			["Штанга 35 кг", 128346, -28778],
			["Штанга 35 кг", 89318, -8263],
			["Штанга 35 кг", 29243, -58205],
			["Штанга 35 кг", 29191, -101493],
			["Штанга 35 кг", 167676, 58662]
			];
	for (var i = 0; i < hlam681.length; i++) {
				hlam_681 = new L.circleMarker([hlam681[i][1],hlam681[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam681[i][0])
					.bindTooltip(hlam681[i][0], {direction: 'top'})
					.addTo(hlam681icons);
			}
	}
	else {
		hlam681icons.clearLayers();
	}
}
var hlam682icons = L.layerGroup().addTo(map);
function Hlam682OnOff() {
	var chbox682;
	chbox682=document.getElementById('Hlam682Button');
	if (chbox682.checked) {
		var hlam682 = [
			["Штанга 70 кг", -67791, -106298],
			["Штанга 70 кг", -67616, -106301],
			["Штанга 70 кг", 127970, -28992],
			["Штанга 70 кг", 128176, -28924],
			["Штанга 70 кг", 29186, -101006]
			];
	for (var i = 0; i < hlam682.length; i++) {
				hlam_682 = new L.circleMarker([hlam682[i][1],hlam682[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam682[i][0])
					.bindTooltip(hlam682[i][0], {direction: 'top'})
					.addTo(hlam682icons);
			}
	}
	else {
		hlam682icons.clearLayers();
	}
}
var hlam683icons = L.layerGroup().addTo(map);
function Hlam683OnOff() {
	var chbox683;
	chbox683=document.getElementById('Hlam683Button');
	if (chbox683.checked) {
		var hlam683 = [
			["Штанга с изогнутым грифом 35 кг", -67578, -106370],
			["Штанга с изогнутым грифом 35 кг", 29079, -101064]
			];
	for (var i = 0; i < hlam683.length; i++) {
				hlam_683 = new L.circleMarker([hlam683[i][1],hlam683[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam683[i][0])
					.bindTooltip(hlam683[i][0], {direction: 'top'})
					.addTo(hlam683icons);
			}
	}
	else {
		hlam683icons.clearLayers();
	}
}
var hlam684icons = L.layerGroup().addTo(map);
function Hlam684OnOff() {
	var chbox684;
	chbox684=document.getElementById('Hlam684Button');
	if (chbox684.checked) {
		var hlam684 = [

			];
	for (var i = 0; i < hlam684.length; i++) {
				hlam_684 = new L.circleMarker([hlam684[i][1],hlam684[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam684[i][0])
					.bindTooltip(hlam684[i][0], {direction: 'top'})
					.addTo(hlam684icons);
			}
	}
	else {
		hlam684icons.clearLayers();
	}
}
var hlam685icons = L.layerGroup().addTo(map);
function Hlam685OnOff() {
	var chbox685;
	chbox685=document.getElementById('Hlam685Button');
	if (chbox685.checked) {
		var hlam685 = [
			["Штатив для мензурок", -82285, -126252],
			["Штатив для мензурок", -82763, -126257],
			["Штатив для мензурок", -82622, -126367],
			["Штатив для мензурок", -123449, -131059],
			["Штатив для мензурок", -166549, -14133],
			["Штатив для мензурок", 101175, -12314],
			["Штатив для мензурок", 50224, -44773],
			["Штатив для мензурок", 51079, -41527],
			["Штатив для мензурок", 50207, -41644],
			["Штатив для мензурок", 21241, -109694],
			["Штатив для мензурок", 164858, -150905],
			["Штатив для мензурок", 69079, 202264],
			["Штатив для мензурок", 16482, 197670],
			["Штатив для мензурок", 3394, 182780],
			["Штатив для мензурок", 169066, 58400],
			["Штатив для мензурок", 182827, 2949],
			["Штатив для мензурок", 20186, 89798],
			["Штатив для мензурок", 76607, 37463],
			["Штатив для мензурок", 87265, 2724]
			];
	for (var i = 0; i < hlam685.length; i++) {
				hlam_685 = new L.circleMarker([hlam685[i][1],hlam685[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam685[i][0])
					.bindTooltip(hlam685[i][0], {direction: 'top'})
					.addTo(hlam685icons);
			}
	}
	else {
		hlam685icons.clearLayers();
	}
}
var hlam686icons = L.layerGroup().addTo(map);
function Hlam686OnOff() {
	var chbox686;
	chbox686=document.getElementById('Hlam686Button');
	if (chbox686.checked) {
		var hlam686 = [
			["Штатив для пробирок", -39392, -59022],
			["Штатив для пробирок", -39611, -58837],
			["Штатив для пробирок", -35176, -80622],
			["Штатив для пробирок", -35629, -80587],
			["Штатив для пробирок", -61226, -101162],
			["Штатив для пробирок", 101954, -12349],
			["Штатив для пробирок", 104208, -12810],
			["Штатив для пробирок", 101684, -12147],
			["Штатив для пробирок", 97078, -20996],
			["Штатив для пробирок", 17329, -44608],
			["Штатив для пробирок", 68578, -88354],
			["Штатив для пробирок", 13017, -92359],
			["Штатив для пробирок", 164197, -150404],
			["Штатив для пробирок", 164482, -150389],
			["Штатив для пробирок", 102339, -151824],
			["Штатив для пробирок", 74287, -177796],
			["Штатив для пробирок", -138491, 152469],
			["Штатив для пробирок", 69125, 202235],
			["Штатив для пробирок", 16467, 197715],
			["Штатив для пробирок", 126066, 160560],
			["Штатив для пробирок", 2446, 163037],
			["Штатив для пробирок", 182945, 2764]
			];
	for (var i = 0; i < hlam686.length; i++) {
				hlam_686 = new L.circleMarker([hlam686[i][1],hlam686[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam686[i][0])
					.bindTooltip(hlam686[i][0], {direction: 'top'})
					.addTo(hlam686icons);
			}
	}
	else {
		hlam686icons.clearLayers();
	}
}
var hlam687icons = L.layerGroup().addTo(map);
function Hlam687OnOff() {
	var chbox687;
	chbox687=document.getElementById('Hlam687Button');
	if (chbox687.checked) {
		var hlam687 = [
			["Щербатая миска", -101305, -54953],
			["Щербатая миска", -101310, -54945],
			["Щербатая миска", -76240, -69561],
			["Щербатая миска", 180614, -12185],
			["Щербатая миска", 180514, -12115],
			["Щербатая миска", 41823, 77632]
			];
	for (var i = 0; i < hlam687.length; i++) {
				hlam_687 = new L.circleMarker([hlam687[i][1],hlam687[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam687[i][0])
					.bindTooltip(hlam687[i][0], {direction: 'top'})
					.addTo(hlam687icons);
			}
	}
	else {
		hlam687icons.clearLayers();
	}
}
var hlam688icons = L.layerGroup().addTo(map);
function Hlam688OnOff() {
	var chbox688;
	chbox688=document.getElementById('Hlam688Button');
	if (chbox688.checked) {
		var hlam688 = [
			["Щетка для волос", -9619, -26975],
			["Щетка для волос", -39985, -3060],
			["Щетка для волос", -109000, -21912],
			["Щетка для волос", -117600, -62381],
			["Щетка для волос", -50765, -111498],
			["Щетка для волос", -50943, -111274],
			["Щетка для волос", -51110, -111447],
			["Щетка для волос", -51700, -111517],
			["Щетка для волос", -148519, -55755],
			["Щетка для волос", 77242, -15343],
			["Щетка для волос", 77238, -15075],
			["Щетка для волос", 76908, -15021],
			["Щетка для волос", 115319, -62837],
			["Щетка для волос", 29159, -58106],
			["Щетка для волос", 29375, -58614],
			["Щетка для волос", 29473, -101163],
			["Щетка для волос", -8106, -165519],
			["Щетка для волос", 71886, -175230],
			["Щетка для волос", -144831, 149346],
			["Щетка для волос", -138580, 152467],
			["Щетка для волос", 72219, 133382],
			["Щетка для волос", 72200, 137775],
			["Щетка для волос", 72465, 137839],
			["Щетка для волос", 86127, 151880],
			["Щетка для волос", 2581, 161979],
			["Щетка для волос", -42382, 88720],
			["Щетка для волос", -39791, 46886],
			["Щетка для волос", -30062, 17046],
			["Щетка для волос", -98812, 7613],
			["Щетка для волос", -179492, 74438],
			["Щетка для волос", 133440, 85303],
			["Щетка для волос", 133874, 85469],
			["Щетка для волос", 131203, 86031],
			["Щетка для волос", 169004, 59517],
			["Щетка для волос", 119514, 80904]
			];
	for (var i = 0; i < hlam688.length; i++) {
				hlam_688 = new L.circleMarker([hlam688[i][1],hlam688[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam688[i][0])
					.bindTooltip(hlam688[i][0], {direction: 'top'})
					.addTo(hlam688icons);
			}
	}
	else {
		hlam688icons.clearLayers();
	}
}
var hlam689icons = L.layerGroup().addTo(map);
function Hlam689OnOff() {
	var chbox689;
	chbox689=document.getElementById('Hlam689Button');
	if (chbox689.checked) {
		var hlam689 = [
			["Щипцы", 25839, -60777],
			["Щипцы", 102272, -151796],
			["Щипцы", -60808, 181897],
			["Щипцы", -3946, 161409],
			["Щипцы", -90338, 150733],
			["Щипцы", -141114, 170397],
			["Щипцы", 580, 168069],
			["Щипцы", 1588, 138517],
			["Щипцы", -59637, 117153],
			["Щипцы", -60114, 117178],
			["Щипцы", -37011, 48994],
			["Щипцы", 189196, 57129],
			["Щипцы", 193345, 55932],
			["Щипцы", 188653, 57514],
			["Щипцы", 188979, 57545],
			["Щипцы", 60442, 48597]
			];
	for (var i = 0; i < hlam689.length; i++) {
				hlam_689 = new L.circleMarker([hlam689[i][1],hlam689[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam689[i][0])
					.bindTooltip(hlam689[i][0], {direction: 'top'})
					.addTo(hlam689icons);
			}
	}
	else {
		hlam689icons.clearLayers();
	}
}
var hlam690icons = L.layerGroup().addTo(map);
function Hlam690OnOff() {
	var chbox690;
	chbox690=document.getElementById('Hlam690Button');
	if (chbox690.checked) {
		var hlam690 = [
			["Электросхема штурмотрона", -82888, -29003]
			];
	for (var i = 0; i < hlam690.length; i++) {
				hlam_690 = new L.circleMarker([hlam690[i][1],hlam690[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam690[i][0])
					.bindTooltip(hlam690[i][0], {direction: 'top'})
					.addTo(hlam690icons);
			}
	}
	else {
		hlam690icons.clearLayers();
	}
}
var hlam691icons = L.layerGroup().addTo(map);
function Hlam691OnOff() {
	var chbox691;
	chbox691=document.getElementById('Hlam691Button');
	if (chbox691.checked) {
		var hlam691 = [
			["Эмалированное ведро", -53370, -13608],
			["Эмалированное ведро", -52172, -5705],
			["Эмалированное ведро", -41813, -5362],
			["Эмалированное ведро", -55420, -2268],
			["Эмалированное ведро", -40159, -3053],
			["Эмалированное ведро", -39080, -61482],
			["Эмалированное ведро", -60725, -58186],
			["Эмалированное ведро", -55715, -59736],
			["Эмалированное ведро", -56373, -60325],
			["Эмалированное ведро", -38673, -58128],
			["Эмалированное ведро", -59585, -56729],
			["Эмалированное ведро", -61192, -57338],
			["Эмалированное ведро", -60019, -56868],
			["Эмалированное ведро", -40241, -54601],
			["Эмалированное ведро", -46901, -51006],
			["Эмалированное ведро", -46560, -50066],
			["Эмалированное ведро", -57880, -47870],
			["Эмалированное ведро", -54987, -48090],
			["Эмалированное ведро", -51653, -46621],
			["Эмалированное ведро", -110165, -65061],
			["Эмалированное ведро", -29310, -94405],
			["Эмалированное ведро", -18661, -75740],
			["Эмалированное ведро", -30957, -66173],
			["Эмалированное ведро", -16762, -69546],
			["Эмалированное ведро", -11459, -68844],
			["Эмалированное ведро", -12003, -69112],
			["Эмалированное ведро", -36248, -80858],
			["Эмалированное ведро", -47174, -69883],
			["Эмалированное ведро", -93140, -83218],
			["Эмалированное ведро", -68216, -83775],
			["Эмалированное ведро", -84672, -80704],
			["Эмалированное ведро", -68240, -72005],
			["Эмалированное ведро", -111507, -91356],
			["Эмалированное ведро", -101755, -84905],
			["Эмалированное ведро", -4325, -130442],
			["Эмалированное ведро", -63175, -128953],
			["Эмалированное ведро", -37164, -129314],
			["Эмалированное ведро", -37555, -124527],
			["Эмалированное ведро", -87244, -112519],
			["Эмалированное ведро", -88803, -108945],
			["Эмалированное ведро", -70285, -104692],
			["Эмалированное ведро", -68556, -105447],
			["Эмалированное ведро", -122905, -123600],
			["Эмалированное ведро", -122873, -125293],
			["Эмалированное ведро", -126615, -119396],
			["Эмалированное ведро", -135717, -5874],
			["Эмалированное ведро", -168295, -23741],
			["Эмалированное ведро", -167035, -21960],
			["Эмалированное ведро", -147576, -56035],
			["Эмалированное ведро", -159817, -40829],
			["Эмалированное ведро", -147510, -37783],
			["Эмалированное ведро", 197233, -31315],
			["Эмалированное ведро", 170436, -28745],
			["Эмалированное ведро", 189636, -30110],
			["Эмалированное ведро", 188890, -30072],
			["Эмалированное ведро", 195189, -31566],
			["Эмалированное ведро", 167352, -25574],
			["Эмалированное ведро", 131640, -31878],
			["Эмалированное ведро", 149829, -29685],
			["Эмалированное ведро", 160567, -30145],
			["Эмалированное ведро", 174599, -41674],
			["Эмалированное ведро", 141731, -57772],
			["Эмалированное ведро", 142019, -60198],
			["Эмалированное ведро", 160784, -58368],
			["Эмалированное ведро", 146841, -55925],
			["Эмалированное ведро", 147016, -51807],
			["Эмалированное ведро", 149052, -52299],
			["Эмалированное ведро", 157862, -49630],
			["Эмалированное ведро", 141754, -49123],
			["Эмалированное ведро", 182774, -93453],
			["Эмалированное ведро", 184059, -93713],
			["Эмалированное ведро", 148808, -69760],
			["Эмалированное ведро", 148691, -70027],
			["Эмалированное ведро", 197784, -127975],
			["Эмалированное ведро", 177737, -124184],
			["Эмалированное ведро", 171546, -121972],
			["Эмалированное ведро", 158294, -128063],
			["Эмалированное ведро", 104430, -12837],
			["Эмалированное ведро", 88924, -21271],
			["Эмалированное ведро", 80832, -1541],
			["Эмалированное ведро", 7555, -31589],
			["Эмалированное ведро", 27980, -31359],
			["Эмалированное ведро", 29644, -21232],
			["Эмалированное ведро", 30797, -20322],
			["Эмалированное ведро", 108185, -54327],
			["Эмалированное ведро", 113702, -56204],
			["Эмалированное ведро", 89787, -56930],
			["Эмалированное ведро", 62286, -56809],
			["Эмалированное ведро", 50505, -44011],
			["Эмалированное ведро", 37866, -35374],
			["Эмалированное ведро", 25804, -60790],
			["Эмалированное ведро", 29489, -58460],
			["Эмалированное ведро", 57773, -94678],
			["Эмалированное ведро", 55700, -66062],
			["Эмалированное ведро", 9155, -79295],
			["Эмалированное ведро", 16244, -80103],
			["Эмалированное ведро", 98508, -124688],
			["Эмалированное ведро", 119479, -120923],
			["Эмалированное ведро", 52746, -130392],
			["Эмалированное ведро", 47931, -103686],
			["Эмалированное ведро", 21002, -115093],
			["Эмалированное ведро", 10172, -107198],
			["Эмалированное ведро", 20082, -108684],
			["Эмалированное ведро", 23090, -107063],
			["Эмалированное ведро", 18124, -106366],
			["Эмалированное ведро", 28428, -102415],
			["Эмалированное ведро", 25648, -104434],
			["Эмалированное ведро", 865, -100009],
			["Эмалированное ведро", 8570, -99375],
			["Эмалированное ведро", -27683, -131573],
			["Эмалированное ведро", -58051, -134322],
			["Эмалированное ведро", -40251, -133827],
			["Эмалированное ведро", -72787, -132000],
			["Эмалированное ведро", -100347, -156675],
			["Эмалированное ведро", -124009, -136685],
			["Эмалированное ведро", -126541, -135391],
			["Эмалированное ведро", -119167, -136127],
			["Эмалированное ведро", -115720, -136812],
			["Эмалированное ведро", -123891, -134318],
			["Эмалированное ведро", -121480, -132817],
			["Эмалированное ведро", -30509, -188791],
			["Эмалированное ведро", -14126, -173520],
			["Эмалированное ведро", -7356, -172580],
			["Эмалированное ведро", -7292, -172266],
			["Эмалированное ведро", -5826, -171241],
			["Эмалированное ведро", -5200, -171149],
			["Эмалированное ведро", -42988, -175201],
			["Эмалированное ведро", -42962, -174109],
			["Эмалированное ведро", -42983, -173512],
			["Эмалированное ведро", -95501, -176450],
			["Эмалированное ведро", -95505, -176804],
			["Эмалированное ведро", -82737, -178604],
			["Эмалированное ведро", -71807, -163909],
			["Эмалированное ведро", -120259, -189804],
			["Эмалированное ведро", -108884, -187757],
			["Эмалированное ведро", -172613, -149549],
			["Эмалированное ведро", -172686, -149947],
			["Эмалированное ведро", 165703, -148694],
			["Эмалированное ведро", 131658, -132229],
			["Эмалированное ведро", 195547, -168821],
			["Эмалированное ведро", 193656, -168922],
			["Эмалированное ведро", 187407, -165588],
			["Эмалированное ведро", 189285, -164768],
			["Эмалированное ведро", 115157, -157651],
			["Эмалированное ведро", 102272, -151572],
			["Эмалированное ведро", 22451, -149961],
			["Эмалированное ведро", 26684, -136516],
			["Эмалированное ведро", 73703, -179460],
			["Эмалированное ведро", 74956, -177095],
			["Эмалированное ведро", 74225, -176911],
			["Эмалированное ведро", 74672, -172799],
			["Эмалированное ведро", 75051, -172411],
			["Эмалированное ведро", 75237, -173114],
			["Эмалированное ведро", -62831, 196645],
			["Эмалированное ведро", -65155, 200978],
			["Эмалированное ведро", -67506, 201611],
			["Эмалированное ведро", -8342, 189346],
			["Эмалированное ведро", -60833, 181926],
			["Эмалированное ведро", -71459, 169860],
			["Эмалированное ведро", -68885, 171148],
			["Эмалированное ведро", -94847, 174714],
			["Эмалированное ведро", -95597, 183943],
			["Эмалированное ведро", -93851, 181824],
			["Эмалированное ведро", -91740, 184464],
			["Эмалированное ведро", -89319, 185402],
			["Эмалированное ведро", -89539, 185832],
			["Эмалированное ведро", -88175, 185121],
			["Эмалированное ведро", -87807, 184482],
			["Эмалированное ведро", -95207, 190486],
			["Эмалированное ведро", -260, 137017],
			["Эмалированное ведро", -383, 138759],
			["Эмалированное ведро", -19872, 145607],
			["Эмалированное ведро", -1542, 158582],
			["Эмалированное ведро", -27653, 162233],
			["Эмалированное ведро", -27359, 163034],
			["Эмалированное ведро", -4993, 160847],
			["Эмалированное ведро", -39265, 158500],
			["Эмалированное ведро", -42033, 161904],
			["Эмалированное ведро", -40959, 161657],
			["Эмалированное ведро", -37976, 160322],
			["Эмалированное ведро", -90314, 149846],
			["Эмалированное ведро", -109360, 157406],
			["Эмалированное ведро", -154091, 165114],
			["Эмалированное ведро", -145834, 172393],
			["Эмалированное ведро", -143576, 178491],
			["Эмалированное ведро", -158108, 186476],
			["Эмалированное ведро", -157113, 190969],
			["Эмалированное ведро", -147506, 152016],
			["Эмалированное ведро", -140832, 156366],
			["Эмалированное ведро", 179207, 133423],
			["Эмалированное ведро", 179291, 133122],
			["Эмалированное ведро", 149451, 135749],
			["Эмалированное ведро", 15516, 197542],
			["Эмалированное ведро", 102809, 191818],
			["Эмалированное ведро", 79930, 181748],
			["Эмалированное ведро", 95806, 187125],
			["Эмалированное ведро", 93600, 189262],
			["Эмалированное ведро", 62226, 172884],
			["Эмалированное ведро", 272, 164184],
			["Эмалированное ведро", 3115, 182027],
			["Эмалированное ведро", 111819, 139536],
			["Эмалированное ведро", 99728, 151468],
			["Эмалированное ведро", 126164, 160346],
			["Эмалированное ведро", 86212, 151706],
			["Эмалированное ведро", 88342, 157523],
			["Эмалированное ведро", 47991, 143787],
			["Эмалированное ведро", 48351, 162544],
			["Эмалированное ведро", 45706, 161586],
			["Эмалированное ведро", 1722, 138327],
			["Эмалированное ведро", 2029, 161813],
			["Эмалированное ведро", 362, 160195],
			["Эмалированное ведро", 7386, 162616],
			["Эмалированное ведро", -29108, 125056],
			["Эмалированное ведро", -59807, 122643],
			["Эмалированное ведро", -130262, 109012],
			["Эмалированное ведро", -103713, 121371],
			["Эмалированное ведро", -60977, 85130],
			["Эмалированное ведро", -58279, 89057],
			["Эмалированное ведро", -57224, 87666],
			["Эмалированное ведро", -56341, 89986],
			["Эмалированное ведро", -43137, 87275],
			["Эмалированное ведро", -40842, 87689],
			["Эмалированное ведро", -93085, 67184],
			["Эмалированное ведро", -93121, 67182],
			["Эмалированное ведро", -80465, 89602],
			["Эмалированное ведро", -101685, 85187],
			["Эмалированное ведро", -127124, 88440],
			["Эмалированное ведро", -17566, 60229],
			["Эмалированное ведро", -40645, 50820],
			["Эмалированное ведро", -54724, 57980],
			["Эмалированное ведро", -69045, 56139],
			["Эмалированное ведро", -122885, 51711],
			["Эмалированное ведро", -22756, 12207],
			["Эмалированное ведро", -7304, 21017],
			["Эмалированное ведро", -51800, 2874],
			["Эмалированное ведро", -47543, 2357],
			["Эмалированное ведро", -47200, 1341],
			["Эмалированное ведро", -48674, 4071],
			["Эмалированное ведро", -47707, 1867],
			["Эмалированное ведро", -47208, 2445],
			["Эмалированное ведро", -45706, 2024],
			["Эмалированное ведро", -41615, 2574],
			["Эмалированное ведро", -42390, 813],
			["Эмалированное ведро", -63907, 5212],
			["Эмалированное ведро", -58051, 7294],
			["Эмалированное ведро", -46233, 28368],
			["Эмалированное ведро", -43847, 28874],
			["Эмалированное ведро", -66095, 6203],
			["Эмалированное ведро", -118291, 1860],
			["Эмалированное ведро", -98878, 7634],
			["Эмалированное ведро", -99642, 7475],
			["Эмалированное ведро", -98803, 7816],
			["Эмалированное ведро", -99154, 8353],
			["Эмалированное ведро", -127572, 30481],
			["Эмалированное ведро", -164121, 122451],
			["Эмалированное ведро", -163921, 122072],
			["Эмалированное ведро", -137574, 87983],
			["Эмалированное ведро", -139493, 90792],
			["Эмалированное ведро", -180532, 74874],
			["Эмалированное ведро", -180011, 73919],
			["Эмалированное ведро", -152433, 524],
			["Эмалированное ведро", 182836, 110038],
			["Эмалированное ведро", 182037, 110445],
			["Эмалированное ведро", 183310, 110744],
			["Эмалированное ведро", 183025, 112137],
			["Эмалированное ведро", 186346, 68764],
			["Эмалированное ведро", 198510, 45014],
			["Эмалированное ведро", 202577, 54607],
			["Эмалированное ведро", 190836, 62634],
			["Эмалированное ведро", 196308, 62641],
			["Эмалированное ведро", 170268, 31094],
			["Эмалированное ведро", 140625, 3540],
			["Эмалированное ведро", 132612, 15277],
			["Эмалированное ведро", 131815, 15604],
			["Эмалированное ведро", 136484, 15578],
			["Эмалированное ведро", 132712, 21445],
			["Эмалированное ведро", 113531, 116507],
			["Эмалированное ведро", 93926, 104272],
			["Эмалированное ведро", 93703, 106434],
			["Эмалированное ведро", 95350, 103606],
			["Эмалированное ведро", 96274, 106338],
			["Эмалированное ведро", 37196, 119921],
			["Эмалированное ведро", 34082, 127612],
			["Эмалированное ведро", 34108, 127816],
			["Эмалированное ведро", 34833, 128711],
			["Эмалированное ведро", 130113, 74285],
			["Эмалированное ведро", 128370, 85415],
			["Эмалированное ведро", 41803, 77425],
			["Эмалированное ведро", 41703, 77658],
			["Эмалированное ведро", 42358, 76971],
			["Эмалированное ведро", 49136, 85662],
			["Эмалированное ведро", 50128, 85701],
			["Эмалированное ведро", 25751, 70664],
			["Эмалированное ведро", 25706, 71343],
			["Эмалированное ведро", 26411, 84378],
			["Эмалированное ведро", 111435, 56727],
			["Эмалированное ведро", 72670, 38619],
			["Эмалированное ведро", 73827, 38532],
			["Эмалированное ведро", 81023, 59333],
			["Эмалированное ведро", 34803, 39909],
			["Эмалированное ведро", 37007, 41411],
			["Эмалированное ведро", 37198, 41159],
			["Эмалированное ведро", 60916, 57566],
			["Эмалированное ведро", 7201, 42583],
			["Эмалированное ведро", 6374, 42398],
			["Эмалированное ведро", 13527, 43451],
			["Эмалированное ведро", 16764, 44786],
			["Эмалированное ведро", 16452, 44694],
			["Эмалированное ведро", 122067, 6570],
			["Эмалированное ведро", 122219, 5379],
			["Эмалированное ведро", 115763, 12974],
			["Эмалированное ведро", 129685, 19431],
			["Эмалированное ведро", 129255, 19977],
			["Эмалированное ведро", 72364, 21223],
			["Эмалированное ведро", 52174, 5984],
			["Эмалированное ведро", 55318, 8432],
			["Эмалированное ведро", 54577, 8970],
			["Эмалированное ведро", 55560, 10430],
			["Эмалированное ведро", 57912, 9802],
			["Эмалированное ведро", -90057, 148568]
			];
	for (var i = 0; i < hlam691.length; i++) {
				hlam_691 = new L.circleMarker([hlam691[i][1],hlam691[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam691[i][0])
					.bindTooltip(hlam691[i][0], {direction: 'top'})
					.addTo(hlam691icons);
			}
	}
	else {
		hlam691icons.clearLayers();
	}
}
var hlam692icons = L.layerGroup().addTo(map);
function Hlam692OnOff() {
	var chbox692;
	chbox692=document.getElementById('Hlam692Button');
	if (chbox692.checked) {
		var hlam692 = [
			["Ядерные отходы", -123429, -131034],
			["Ядерные отходы", 107958, -153962],
			["Ядерные отходы", 107946, -153960],
			["Ядерные отходы", 100754, 100167]
			];
	for (var i = 0; i < hlam692.length; i++) {
				hlam_692 = new L.circleMarker([hlam692[i][1],hlam692[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam692[i][0])
					.bindTooltip(hlam692[i][0], {direction: 'top'})
					.addTo(hlam692icons);
			}
	}
	else {
		hlam692icons.clearLayers();
	}
}