var hlam501icons = L.layerGroup().addTo(map);
function Hlam501OnOff() {
	var chbox501;
	chbox501=document.getElementById('Hlam501Button');
	if (chbox501.checked) {
		var hlam501 = [

			];
	for (var i = 0; i < hlam501.length; i++) {
				hlam_501 = new L.circleMarker([hlam501[i][1],hlam501[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam501[i][0])
					.bindTooltip(hlam501[i][0], {direction: 'top'})
					.addTo(hlam501icons);
			}
	}
	else {
		hlam501icons.clearLayers();
	}
}
var hlam502icons = L.layerGroup().addTo(map);
function Hlam502OnOff() {
	var chbox502;
	chbox502=document.getElementById('Hlam502Button');
	if (chbox502.checked) {
		var hlam502 = [
			["Салфетка", -50925, -12439],
			["Салфетка", -50960, -12427],
			["Салфетка", -50709, -12437],
			["Салфетка", -50669, -12432],
			["Салфетка", -50383, -12425],
			["Салфетка", -50751, -12302],
			["Салфетка", -50917, -13911],
			["Салфетка", -50405, -12605],
			["Салфетка", -50861, -12956],
			["Салфетка", -50656, -13274],
			["Салфетка", -50727, -13816],
			["Салфетка", -50879, -14201],
			["Салфетка", -52288, -14015],
			["Салфетка", -53062, -14097],
			["Салфетка", -52079, -12659],
			["Салфетка", -51952, -13191],
			["Салфетка", -52471, -12983],
			["Салфетка", -52533, -13233],
			["Салфетка", -50431, -13673],
			["Салфетка", -52278, -13400],
			["Салфетка", -42747, -5956],
			["Салфетка", -42791, -5845],
			["Салфетка", 90851, -6384],
			["Салфетка", -93920, -175223],
			["Салфетка", -144766, 137091],
			["Салфетка", -144765, 137100],
			["Салфетка", 133850, 85746]
			];
	for (var i = 0; i < hlam502.length; i++) {
				hlam_502 = new L.circleMarker([hlam502[i][1],hlam502[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam502[i][0])
					.bindTooltip(hlam502[i][0], {direction: 'top'})
					.addTo(hlam502icons);
			}
	}
	else {
		hlam502icons.clearLayers();
	}
}
var hlam503icons = L.layerGroup().addTo(map);
function Hlam503OnOff() {
	var chbox503;
	chbox503=document.getElementById('Hlam503Button');
	if (chbox503.checked) {
		var hlam503 = [
			["Самодельный аккумулятор", -55031, -27543],
			["Самодельный аккумулятор", -48645, -58723],
			["Самодельный аккумулятор", -55228, -48584],
			["Самодельный аккумулятор", -85087, -45119],
			["Самодельный аккумулятор", -120486, -45869],
			["Самодельный аккумулятор", -93070, -83446],
			["Самодельный аккумулятор", -61868, -127116],
			["Самодельный аккумулятор", 140267, -2952],
			["Самодельный аккумулятор", 180407, -37361],
			["Самодельный аккумулятор", 180416, -37383],
			["Самодельный аккумулятор", 158046, -68853],
			["Самодельный аккумулятор", 158251, -68626],
			["Самодельный аккумулятор", 129218, -28404],
			["Самодельный аккумулятор", 101629, -13793],
			["Самодельный аккумулятор", 93215, -31330],
			["Самодельный аккумулятор", 81769, -20859],
			["Самодельный аккумулятор", 90053, -9917],
			["Самодельный аккумулятор", 90118, -9554],
			["Самодельный аккумулятор", 47619, -20354],
			["Самодельный аккумулятор", 89860, -53595],
			["Самодельный аккумулятор", 89984, -33206],
			["Самодельный аккумулятор", 17635, -44371],
			["Самодельный аккумулятор", 47113, -104385],
			["Самодельный аккумулятор", 15681, -107574],
			["Самодельный аккумулятор", 22424, -108327],
			["Самодельный аккумулятор", 13960, -105805],
			["Самодельный аккумулятор", 29231, -100059],
			["Самодельный аккумулятор", -35196, -150508],
			["Самодельный аккумулятор", -61613, -145802],
			["Самодельный аккумулятор", -82099, -161087],
			["Самодельный аккумулятор", -100301, -156512],
			["Самодельный аккумулятор", -43225, -173773],
			["Самодельный аккумулятор", -42103, -172932],
			["Самодельный аккумулятор", -92758, -176888],
			["Самодельный аккумулятор", -87128, -166726],
			["Самодельный аккумулятор", -122431, -187707],
			["Самодельный аккумулятор", 115320, -157600],
			["Самодельный аккумулятор", 74313, -176856],
			["Самодельный аккумулятор", -66152, 201247],
			["Самодельный аккумулятор", -60606, 181846],
			["Самодельный аккумулятор", -93883, 180221],
			["Самодельный аккумулятор", -97882, 189416],
			["Самодельный аккумулятор", -94523, 190530],
			["Самодельный аккумулятор", -93687, 190710],
			["Самодельный аккумулятор", -93659, 190697],
			["Самодельный аккумулятор", -98797, 183557],
			["Самодельный аккумулятор", -98490, 189194],
			["Самодельный аккумулятор", -19817, 145390],
			["Самодельный аккумулятор", -27091, 162480],
			["Самодельный аккумулятор", -27153, 162495],
			["Самодельный аккумулятор", -27121, 162487],
			["Самодельный аккумулятор", -38027, 159541],
			["Самодельный аккумулятор", -39691, 163082],
			["Самодельный аккумулятор", -88043, 152456],
			["Самодельный аккумулятор", -108593, 140643],
			["Самодельный аккумулятор", -146012, 175165],
			["Самодельный аккумулятор", 16202, 197797],
			["Самодельный аккумулятор", 103516, 190649],
			["Самодельный аккумулятор", 93767, 191554],
			["Самодельный аккумулятор", 2286, 179026],
			["Самодельный аккумулятор", 2268, 179007],
			["Самодельный аккумулятор", 2792, 182303],
			["Самодельный аккумулятор", 72204, 133729],
			["Самодельный аккумулятор", 89669, 152068],
			["Самодельный аккумулятор", 1714, 138047],
			["Самодельный аккумулятор", -59884, 117189],
			["Самодельный аккумулятор", -128056, 82347],
			["Самодельный аккумулятор", -19732, 58616],
			["Самодельный аккумулятор", -65885, 35800],
			["Самодельный аккумулятор", -123399, 51138],
			["Самодельный аккумулятор", -47100, 3251],
			["Самодельный аккумулятор", -58936, 12274],
			["Самодельный аккумулятор", -46687, 27095],
			["Самодельный аккумулятор", -45158, 29069],
			["Самодельный аккумулятор", -130456, 10396],
			["Самодельный аккумулятор", -127866, 31006],
			["Самодельный аккумулятор", -148451, 113710],
			["Самодельный аккумулятор", -153768, 129956],
			["Самодельный аккумулятор", -180047, 73922],
			["Самодельный аккумулятор", 146006, 107349],
			["Самодельный аккумулятор", 160402, 58768],
			["Самодельный аккумулятор", 183500, 3291],
			["Самодельный аккумулятор", 94607, 104510],
			["Самодельный аккумулятор", 24997, 69454],
			["Самодельный аккумулятор", 17458, 76025],
			["Самодельный аккумулятор", 110758, 58375],
			["Самодельный аккумулятор", 51606, 15322]
			];
	for (var i = 0; i < hlam503.length; i++) {
				hlam_503 = new L.circleMarker([hlam503[i][1],hlam503[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam503[i][0])
					.bindTooltip(hlam503[i][0], {direction: 'top'})
					.addTo(hlam503icons);
			}
	}
	else {
		hlam503icons.clearLayers();
	}
}
var hlam504icons = L.layerGroup().addTo(map);
function Hlam504OnOff() {
	var chbox504;
	chbox504=document.getElementById('Hlam504Button');
	if (chbox504.checked) {
		var hlam504 = [
			["Самодельный клей", -3587, -44933],
			["Самодельный клей", -59030, -39687],
			["Самодельный клей", -120142, -45926],
			["Самодельный клей", -46938, -72922],
			["Самодельный клей", -85218, -107706],
			["Самодельный клей", -69022, -105097],
			["Самодельный клей", -69040, -105107],
			["Самодельный клей", -122947, -123530],
			["Самодельный клей", -122986, -123488],
			["Самодельный клей", -152018, -72819],
			["Самодельный клей", -145535, -126844],
			["Самодельный клей", 173263, -18136],
			["Самодельный клей", 81956, -21165],
			["Самодельный клей", -82116, -161018],
			["Самодельный клей", -121434, -132632],
			["Самодельный клей", -121434, -132624],
			["Самодельный клей", -121685, -132645],
			["Самодельный клей", -121656, -132647],
			["Самодельный клей", 115174, -157921],
			["Самодельный клей", -36173, 171199],
			["Самодельный клей", -36149, 171054],
			["Самодельный клей", -19955, 145762],
			["Самодельный клей", -145559, 177435],
			["Самодельный клей", 103210, 190805],
			["Самодельный клей", 103204, 190800],
			["Самодельный клей", 100612, 195972],
			["Самодельный клей", 100592, 195972],
			["Самодельный клей", -46619, 27115],
			["Самодельный клей", -45557, 28904],
			["Самодельный клей", -45542, 28918],
			["Самодельный клей", -148458, 113839],
			["Самодельный клей", 135415, 115485],
			["Самодельный клей", 183574, 2990],
			["Самодельный клей", 138425, 430],
			["Самодельный клей", 110823, 58403]
			];
	for (var i = 0; i < hlam504.length; i++) {
				hlam_504 = new L.circleMarker([hlam504[i][1],hlam504[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam504[i][0])
					.bindTooltip(hlam504[i][0], {direction: 'top'})
					.addTo(hlam504icons);
			}
	}
	else {
		hlam504icons.clearLayers();
	}
}
var hlam505icons = L.layerGroup().addTo(map);
function Hlam505OnOff() {
	var chbox505;
	chbox505=document.getElementById('Hlam505Button');
	if (chbox505.checked) {
		var hlam505 = [
			["Свежая газета", -120242, -189294]
			];
	for (var i = 0; i < hlam505.length; i++) {
				hlam_505 = new L.circleMarker([hlam505[i][1],hlam505[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam505[i][0])
					.bindTooltip(hlam505[i][0], {direction: 'top'})
					.addTo(hlam505icons);
			}
	}
	else {
		hlam505icons.clearLayers();
	}
}
var hlam506icons = L.layerGroup().addTo(map);
function Hlam506OnOff() {
	var chbox506;
	chbox506=document.getElementById('Hlam506Button');
	if (chbox506.checked) {
		var hlam506 = [
			["Свернутая &quotЧарлстон геральд&quot", -9670, -27193],
			["Свернутая &quotЧарлстон геральд&quot", -48016, -7822],
			["Свернутая &quotЧарлстон геральд&quot", -33817, -95],
			["Свернутая &quotЧарлстон геральд&quot", -62091, -56884],
			["Свернутая &quotЧарлстон геральд&quot", -32525, -66889],
			["Свернутая &quotЧарлстон геральд&quot", -72528, -96715],
			["Свернутая &quotЧарлстон геральд&quot", -72133, -98380],
			["Свернутая &quotЧарлстон геральд&quot", -147562, -55870],
			["Свернутая &quotЧарлстон геральд&quot", -147567, -55838],
			["Свернутая &quotЧарлстон геральд&quot", -147568, -55890],
			["Свернутая &quotЧарлстон геральд&quot", -132094, -112029],
			["Свернутая &quotЧарлстон геральд&quot", 173459, -14162],
			["Свернутая &quotЧарлстон геральд&quot", 173728, -14479],
			["Свернутая &quotЧарлстон геральд&quot", 173818, -14108],
			["Свернутая &quotЧарлстон геральд&quot", 155196, -44929],
			["Свернутая &quotЧарлстон геральд&quot", 178190, -122653],
			["Свернутая &quotЧарлстон геральд&quot", 159295, -127627],
			["Свернутая &quotЧарлстон геральд&quot", 100661, -29296],
			["Свернутая &quotЧарлстон геральд&quot", 127930, -31884],
			["Свернутая &quotЧарлстон геральд&quot", 81349, -21072],
			["Свернутая &quotЧарлстон геральд&quot", 76336, -18950],
			["Свернутая &quotЧарлстон геральд&quot", 83790, -15619],
			["Свернутая &quotЧарлстон геральд&quot", 92711, -13038],
			["Свернутая &quotЧарлстон геральд&quot", 70679, -8877],
			["Свернутая &quotЧарлстон геральд&quot", 70534, -9727],
			["Свернутая &quotЧарлстон геральд&quot", 77508, -11452],
			["Свернутая &quotЧарлстон геральд&quot", 70981, -6690],
			["Свернутая &quotЧарлстон геральд&quot", 70723, -7761],
			["Свернутая &quotЧарлстон геральд&quot", 89679, -6051],
			["Свернутая &quotЧарлстон геральд&quot", 71306, -1721],
			["Свернутая &quotЧарлстон геральд&quot", 71281, -1612],
			["Свернутая &quotЧарлстон геральд&quot", 71336, -1660],
			["Свернутая &quotЧарлстон геральд&quot", 25703, -99819],
			["Свернутая &quotЧарлстон геральд&quot", 25692, -99809],
			["Свернутая &quotЧарлстон геральд&quot", 25678, -99804],
			["Свернутая &quotЧарлстон геральд&quot", 25695, -99857],
			["Свернутая &quotЧарлстон геральд&quot", -2071, -160006],
			["Свернутая &quotЧарлстон геральд&quot", -76803, -176223],
			["Свернутая &quotЧарлстон геральд&quot", -152268, -160870],
			["Свернутая &quotЧарлстон геральд&quot", -136452, -177008],
			["Свернутая &quotЧарлстон геральд&quot", 134245, -146650],
			["Свернутая &quotЧарлстон геральд&quot", 134242, -146646],
			["Свернутая &quotЧарлстон геральд&quot", 134241, -146646],
			["Свернутая &quotЧарлстон геральд&quot", 27800, -137468],
			["Свернутая &quotЧарлстон геральд&quot", 27817, -137527],
			["Свернутая &quotЧарлстон геральд&quot", 73654, -177747],
			["Свернутая &quotЧарлстон геральд&quot", -17034, 164201],
			["Свернутая &quotЧарлстон геральд&quot", -60764, 182963],
			["Свернутая &quotЧарлстон геральд&quot", -149424, 149396],
			["Свернутая &quotЧарлстон геральд&quot", -149354, 149803],
			["Свернутая &quotЧарлстон геральд&quot", 80112, 182442],
			["Свернутая &quotЧарлстон геральд&quot", 20028, 134398],
			["Свернутая &quotЧарлстон геральд&quot", -87822, 67824],
			["Свернутая &quotЧарлстон геральд&quot", -48419, 6628],
			["Свернутая &quotЧарлстон геральд&quot", -46823, 19795],
			["Свернутая &quotЧарлстон геральд&quot", -118461, 925],
			["Свернутая &quotЧарлстон геральд&quot", 180404, 110766],
			["Свернутая &quotЧарлстон геральд&quot", 58392, 53401],
			["Свернутая &quotЧарлстон геральд&quot", 22872, 44510],
			["Свернутая &quotЧарлстон геральд&quot", 27152, 47833],
			["Свернутая &quotЧарлстон геральд&quot", 99924, 1917],
			["Свернутая &quotЧарлстон геральд&quot", 101052, 7028],
			["Свернутая &quotЧарлстон геральд&quot", 100087, 7128],
			["Свернутая &quotЧарлстон геральд&quot", 82451, 340],
			["Свернутая &quotЧарлстон геральд&quot", 84078, 1977],
			["Свернутая &quotЧарлстон геральд&quot", 92554, 32097]
			];
	for (var i = 0; i < hlam506.length; i++) {
				hlam_506 = new L.circleMarker([hlam506[i][1],hlam506[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam506[i][0])
					.bindTooltip(hlam506[i][0], {direction: 'top'})
					.addTo(hlam506icons);
			}
	}
	else {
		hlam506icons.clearLayers();
	}
}
var hlam507icons = L.layerGroup().addTo(map);
function Hlam507OnOff() {
	var chbox507;
	chbox507=document.getElementById('Hlam507Button');
	if (chbox507.checked) {
		var hlam507 = [
			["Сверток шкур", -89934, -42269],
			["Сверток шкур", -121815, -66286],
			["Сверток шкур", 173316, -18050],
			["Сверток шкур", 101388, -99932],
			["Сверток шкур", 84791, -108739],
			["Сверток шкур", -76361, -184317],
			["Сверток шкур", -97290, 183833],
			["Сверток шкур", -98571, 183610],
			["Сверток шкур", -2627, 158363],
			["Сверток шкур", -27282, 162224],
			["Сверток шкур", -27465, 162883],
			["Сверток шкур", -27392, 163123],
			["Сверток шкур", -27448, 162688],
			["Сверток шкур", -27283, 163129],
			["Сверток шкур", 72296, 137411],
			["Сверток шкур", 70405, 137488],
			["Сверток шкур", -127887, 30715],
			["Сверток шкур", -127784, 30949],
			["Сверток шкур", -127475, 30887],
			["Сверток шкур", 192672, 113605],
			["Сверток шкур", 192620, 113608],
			["Сверток шкур", 195448, 65618],
			["Сверток шкур", 191422, 61287],
			["Сверток шкур", 191544, 60590],
			["Сверток шкур", 191544, 60593],
			["Сверток шкур", 189888, 63294],
			["Сверток шкур", 189794, 63752],
			["Сверток шкур", 189827, 63749],
			["Сверток шкур", 189943, 63638],
			["Сверток шкур", 195251, 65419]
			];
	for (var i = 0; i < hlam507.length; i++) {
				hlam_507 = new L.circleMarker([hlam507[i][1],hlam507[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam507[i][0])
					.bindTooltip(hlam507[i][0], {direction: 'top'})
					.addTo(hlam507icons);
			}
	}
	else {
		hlam507icons.clearLayers();
	}
}
var hlam508icons = L.layerGroup().addTo(map);
function Hlam508OnOff() {
	var chbox508;
	chbox508=document.getElementById('Hlam508Button');
	if (chbox508.checked) {
		var hlam508 = [
			["Свинцовый лом", 108298, -153807],
			["Свинцовый лом", 112057, -147488],
			["Свинцовый лом", -42772, 137746]
			];
	for (var i = 0; i < hlam508.length; i++) {
				hlam_508 = new L.circleMarker([hlam508[i][1],hlam508[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam508[i][0])
					.bindTooltip(hlam508[i][0], {direction: 'top'})
					.addTo(hlam508icons);
			}
	}
	else {
		hlam508icons.clearLayers();
	}
}
var hlam509icons = L.layerGroup().addTo(map);
function Hlam509OnOff() {
	var chbox509;
	chbox509=document.getElementById('Hlam509Button');
	if (chbox509.checked) {
		var hlam509 = [
			["Сгоревший комикс &quotТаинственная Госпожа&quot", 74488, -177243],
			["Сгоревший комикс &quotТаинственная Госпожа&quot", 74519, -177415]
			];
	for (var i = 0; i < hlam509.length; i++) {
				hlam_509 = new L.circleMarker([hlam509[i][1],hlam509[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam509[i][0])
					.bindTooltip(hlam509[i][0], {direction: 'top'})
					.addTo(hlam509icons);
			}
	}
	else {
		hlam509icons.clearLayers();
	}
}
var hlam510icons = L.layerGroup().addTo(map);
function Hlam510OnOff() {
	var chbox510;
	chbox510=document.getElementById('Hlam510Button');
	if (chbox510.checked) {
		var hlam510 = [

			];
	for (var i = 0; i < hlam510.length; i++) {
				hlam_510 = new L.circleMarker([hlam510[i][1],hlam510[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam510[i][0])
					.bindTooltip(hlam510[i][0], {direction: 'top'})
					.addTo(hlam510icons);
			}
	}
	else {
		hlam510icons.clearLayers();
	}
}
var hlam511icons = L.layerGroup().addTo(map);
function Hlam511OnOff() {
	var chbox511;
	chbox511=document.getElementById('Hlam511Button');
	if (chbox511.checked) {
		var hlam511 = [

			];
	for (var i = 0; i < hlam511.length; i++) {
				hlam_511 = new L.circleMarker([hlam511[i][1],hlam511[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam511[i][0])
					.bindTooltip(hlam511[i][0], {direction: 'top'})
					.addTo(hlam511icons);
			}
	}
	else {
		hlam511icons.clearLayers();
	}
}
var hlam512icons = L.layerGroup().addTo(map);
function Hlam512OnOff() {
	var chbox512;
	chbox512=document.getElementById('Hlam512Button');
	if (chbox512.checked) {
		var hlam512 = [
			["Сдутый мяч", 131108, -31545],
			["Сдутый мяч", 197561, -127191],
			["Сдутый мяч", 139064, 2749]
			];
	for (var i = 0; i < hlam512.length; i++) {
				hlam_512 = new L.circleMarker([hlam512[i][1],hlam512[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam512[i][0])
					.bindTooltip(hlam512[i][0], {direction: 'top'})
					.addTo(hlam512icons);
			}
	}
	else {
		hlam512icons.clearLayers();
	}
}
var hlam513icons = L.layerGroup().addTo(map);
function Hlam513OnOff() {
	var chbox513;
	chbox513=document.getElementById('Hlam513Button');
	if (chbox513.checked) {
		var hlam513 = [
			["Сенсорный модуль", -120449, -45924],
			["Сенсорный модуль", 201419, -126055],
			["Сенсорный модуль", 101021, -15408],
			["Сенсорный модуль", -4148, -155848],
			["Сенсорный модуль", -121925, -188343],
			["Сенсорный модуль", -65772, 198272],
			["Сенсорный модуль", 152590, 161846],
			["Сенсорный модуль", -148446, 113849],
			["Сенсорный модуль", 111641, 57880]
			];
	for (var i = 0; i < hlam513.length; i++) {
				hlam_513 = new L.circleMarker([hlam513[i][1],hlam513[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam513[i][0])
					.bindTooltip(hlam513[i][0], {direction: 'top'})
					.addTo(hlam513icons);
			}
	}
	else {
		hlam513icons.clearLayers();
	}
}
var hlam514icons = L.layerGroup().addTo(map);
function Hlam514OnOff() {
	var chbox514;
	chbox514=document.getElementById('Hlam514Button');
	if (chbox514.checked) {
		var hlam514 = [
			["Серебряная вилка", -50968, -12439],
			["Серебряная вилка", -50931, -12457],
			["Серебряная вилка", -50711, -12438],
			["Серебряная вилка", -50668, -12442],
			["Серебряная вилка", -50355, -12459],
			["Серебряная вилка", -50381, -12424],
			["Серебряная вилка", 143560, -89112],
			["Серебряная вилка", 143497, -89014]
			];
	for (var i = 0; i < hlam514.length; i++) {
				hlam_514 = new L.circleMarker([hlam514[i][1],hlam514[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam514[i][0])
					.bindTooltip(hlam514[i][0], {direction: 'top'})
					.addTo(hlam514icons);
			}
	}
	else {
		hlam514icons.clearLayers();
	}
}
var hlam515icons = L.layerGroup().addTo(map);
function Hlam515OnOff() {
	var chbox515;
	chbox515=document.getElementById('Hlam515Button');
	if (chbox515.checked) {
		var hlam515 = [
			["Серебряная миска", -42459, -5101],
			["Серебряная миска", -42480, -5130],
			["Серебряная миска", 143575, -89121],
			["Серебряная миска", 143470, -89015],
			["Серебряная миска", -108667, -179048],
			["Серебряная миска", -71211, 145616],
			["Серебряная миска", -123265, 51018],
			["Серебряная миска", -38445, 4184],
			["Серебряная миска", -38440, 4157],
			["Серебряная миска", 171291, 58250],
			["Серебряная миска", 171780, 59442],
			["Серебряная миска", 171783, 59432],
			["Серебряная миска", 171083, 57913],
			["Серебряная миска", 171219, 58315],
			["Серебряная миска", 171091, 58807],
			["Серебряная миска", 172350, 58420],
			["Серебряная миска", 172683, 58849],
			["Серебряная миска", 172285, 59713],
			["Серебряная миска", 172458, 59173],
			["Серебряная миска", 172396, 59397],
			["Серебряная миска", 130226, 74569]
			];
	for (var i = 0; i < hlam515.length; i++) {
				hlam_515 = new L.circleMarker([hlam515[i][1],hlam515[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam515[i][0])
					.bindTooltip(hlam515[i][0], {direction: 'top'})
					.addTo(hlam515icons);
			}
	}
	else {
		hlam515icons.clearLayers();
	}
}
var hlam516icons = L.layerGroup().addTo(map);
function Hlam516OnOff() {
	var chbox516;
	chbox516=document.getElementById('Hlam516Button');
	if (chbox516.checked) {
		var hlam516 = [
			["Серебряная столовая ложка", -42423, -6207],
			["Серебряная столовая ложка", -167933, -115646],
			["Серебряная столовая ложка", 143584, -89090],
			["Серебряная столовая ложка", 143470, -89033],
			["Серебряная столовая ложка", 103612, -21190],
			["Серебряная столовая ложка", 28387, -31035],
			["Серебряная столовая ложка", 28458, -31048],
			["Серебряная столовая ложка", 28492, -31012],
			["Серебряная столовая ложка", 18108, -107033],
			["Серебряная столовая ложка", -92835, 183458],
			["Серебряная столовая ложка", 101501, 193116],
			["Серебряная столовая ложка", 91750, 188870],
			["Серебряная столовая ложка", 91121, 188919],
			["Серебряная столовая ложка", -128913, 120013],
			["Серебряная столовая ложка", -128423, 119858],
			["Серебряная столовая ложка", -55670, 4833]
			];
	for (var i = 0; i < hlam516.length; i++) {
				hlam_516 = new L.circleMarker([hlam516[i][1],hlam516[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam516[i][0])
					.bindTooltip(hlam516[i][0], {direction: 'top'})
					.addTo(hlam516icons);
			}
	}
	else {
		hlam516icons.clearLayers();
	}
}
var hlam517icons = L.layerGroup().addTo(map);
function Hlam517OnOff() {
	var chbox517;
	chbox517=document.getElementById('Hlam517Button');
	if (chbox517.checked) {
		var hlam517 = [
			["Серебряная тарелка", -147753, -56826],
			["Серебряная тарелка", -151844, -74671],
			["Серебряная тарелка", -151845, -74668],
			["Серебряная тарелка", -151062, -74934],
			["Серебряная тарелка", 171022, -24272],
			["Серебряная тарелка", 183672, -93317],
			["Серебряная тарелка", 183646, -93316],
			["Серебряная тарелка", 183237, -68104],
			["Серебряная тарелка", 183575, -67448],
			["Серебряная тарелка", 183542, -67576],
			["Серебряная тарелка", 183204, -67735],
			["Серебряная тарелка", 183239, -67718],
			["Серебряная тарелка", 143570, -89102],
			["Серебряная тарелка", 143486, -89023],
			["Серебряная тарелка", 129378, -31396],
			["Серебряная тарелка", 28446, -31051],
			["Серебряная тарелка", 28390, -31039],
			["Серебряная тарелка", 28486, -31018],
			["Серебряная тарелка", 74812, -83270],
			["Серебряная тарелка", 15951, -79743],
			["Серебряная тарелка", -1832, -159519],
			["Серебряная тарелка", -1942, -159625],
			["Серебряная тарелка", -8197, -165312],
			["Серебряная тарелка", -8068, -165269],
			["Серебряная тарелка", -8138, -165158],
			["Серебряная тарелка", -8182, -165176],
			["Серебряная тарелка", -121034, -189674],
			["Серебряная тарелка", -121010, -189667],
			["Серебряная тарелка", -121013, -189666],
			["Серебряная тарелка", -121012, -189664],
			["Серебряная тарелка", -121012, -189664],
			["Серебряная тарелка", -121014, -189667],
			["Серебряная тарелка", -121014, -189667],
			["Серебряная тарелка", 78131, -154021],
			["Серебряная тарелка", 71549, 137070],
			["Серебряная тарелка", 71679, 136967],
			["Серебряная тарелка", -129153, 119525],
			["Серебряная тарелка", -129004, 119457],
			["Серебряная тарелка", 75190, 9618]
			];
	for (var i = 0; i < hlam517.length; i++) {
				hlam_517 = new L.circleMarker([hlam517[i][1],hlam517[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam517[i][0])
					.bindTooltip(hlam517[i][0], {direction: 'top'})
					.addTo(hlam517icons);
			}
	}
	else {
		hlam517icons.clearLayers();
	}
}
var hlam518icons = L.layerGroup().addTo(map);
function Hlam518OnOff() {
	var chbox518;
	chbox518=document.getElementById('Hlam518Button');
	if (chbox518.checked) {
		var hlam518 = [
			["Серебряные карманные часы", -111762, -62118],
			["Серебряные карманные часы", -13654, -66396],
			["Серебряные карманные часы", -124140, -105105],
			["Серебряные карманные часы", -151418, -72738],
			["Серебряные карманные часы", 167102, -22414],
			["Серебряные карманные часы", 171015, -24270],
			["Серебряные карманные часы", 13719, -107444],
			["Серебряные карманные часы", -1806, -159691],
			["Серебряные карманные часы", 107692, -153543],
			["Серебряные карманные часы", 105235, 156742],
			["Серебряные карманные часы", -128659, 84174],
			["Серебряные карманные часы", -39777, 46790],
			["Серебряные карманные часы", -38730, 2874],
			["Серебряные карманные часы", -98630, 7841],
			["Серебряные карманные часы", 162787, 62437],
			["Серебряные карманные часы", 26354, 125172],
			["Серебряные карманные часы", 75264, 9750]
			];
	for (var i = 0; i < hlam518.length; i++) {
				hlam_518 = new L.circleMarker([hlam518[i][1],hlam518[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam518[i][0])
					.bindTooltip(hlam518[i][0], {direction: 'top'})
					.addTo(hlam518icons);
			}
	}
	else {
		hlam518icons.clearLayers();
	}
}
var hlam519icons = L.layerGroup().addTo(map);
function Hlam519OnOff() {
	var chbox519;
	chbox519=document.getElementById('Hlam519Button');
	if (chbox519.checked) {
		var hlam519 = [
			["Серебряный лом", 108288, -153790],
			["Серебряный лом", 112045, -147474],
			["Серебряный лом", 140706, 9394]
			];
	for (var i = 0; i < hlam519.length; i++) {
				hlam_519 = new L.circleMarker([hlam519[i][1],hlam519[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam519[i][0])
					.bindTooltip(hlam519[i][0], {direction: 'top'})
					.addTo(hlam519icons);
			}
	}
	else {
		hlam519icons.clearLayers();
	}
}
var hlam520icons = L.layerGroup().addTo(map);
function Hlam520OnOff() {
	var chbox520;
	chbox520=document.getElementById('Hlam520Button');
	if (chbox520.checked) {
		var hlam520 = [
			["Серебряный медальон", -44752, -8335],
			["Серебряный медальон", -108989, -21925],
			["Серебряный медальон", -119628, -57354],
			["Серебряный медальон", -52596, -99659],
			["Серебряный медальон", -147561, -55758],
			["Серебряный медальон", 85021, -347],
			["Серебряный медальон", -1770, -159675],
			["Серебряный медальон", 61540, -134081],
			["Серебряный медальон", -144671, 148881],
			["Серебряный медальон", -144709, 150131],
			["Серебряный медальон", 22472, 133453],
			["Серебряный медальон", -59970, 117386],
			["Серебряный медальон", -59728, 123268],
			["Серебряный медальон", -59708, 123246],
			["Серебряный медальон", -47649, 2300],
			["Серебряный медальон", -47163, 20505],
			["Серебряный медальон", -101362, 7924],
			["Серебряный медальон", 183829, 2072],
			["Серебряный медальон", 75251, 9787]
			];
	for (var i = 0; i < hlam520.length; i++) {
				hlam_520 = new L.circleMarker([hlam520[i][1],hlam520[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam520[i][0])
					.bindTooltip(hlam520[i][0], {direction: 'top'})
					.addTo(hlam520icons);
			}
	}
	else {
		hlam520icons.clearLayers();
	}
}
var hlam521icons = L.layerGroup().addTo(map);
function Hlam521OnOff() {
	var chbox521;
	chbox521=document.getElementById('Hlam521Button');
	if (chbox521.checked) {
		var hlam521 = [
			["Серебряный столовый нож", 157142, -128746],
			["Серебряный столовый нож", -7392, -171742],
			["Серебряный столовый нож", -43957, -176860],
			["Серебряный столовый нож", 145314, -156781],
			["Серебряный столовый нож", 131104, -131851],
			["Серебряный столовый нож", 64882, -178010],
			["Серебряный столовый нож", 50211, -166269],
			["Серебряный столовый нож", 11513, 167027],
			["Серебряный столовый нож", 49683, 162411],
			["Серебряный столовый нож", -146546, 65646],
			["Серебряный столовый нож", -146535, 65603],
			["Серебряный столовый нож", -146537, 65616],
			["Серебряный столовый нож", 94811, 103101],
			["Серебряный столовый нож", 94795, 103072],
			["Серебряный столовый нож", 94576, 103202],
			["Серебряный столовый нож", 25196, 77045],
			["Серебряный столовый нож", 127941, 268]
			];
	for (var i = 0; i < hlam521.length; i++) {
				hlam_521 = new L.circleMarker([hlam521[i][1],hlam521[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam521[i][0])
					.bindTooltip(hlam521[i][0], {direction: 'top'})
					.addTo(hlam521icons);
			}
	}
	else {
		hlam521icons.clearLayers();
	}
}
var hlam522icons = L.layerGroup().addTo(map);
function Hlam522OnOff() {
	var chbox522;
	chbox522=document.getElementById('Hlam522Button');
	if (chbox522.checked) {
		var hlam522 = [
			["Сигара", -36122, -18036],
			["Сигара", -46429, -72813],
			["Сигара", -68558, -106785],
			["Сигара", -72771, -98481],
			["Сигара", -111071, -112283],
			["Сигара", -149059, -58200],
			["Сигара", -151016, -75343],
			["Сигара", 143101, -59254],
			["Сигара", 151775, -49859],
			["Сигара", 196744, -91202],
			["Сигара", 143530, -89028],
			["Сигара", 102943, -20203],
			["Сигара", 88460, -31972],
			["Сигара", 36042, -42179],
			["Сигара", 51385, -41875],
			["Сигара", 34505, -37096],
			["Сигара", 98852, -124480],
			["Сигара", -60509, -145561],
			["Сигара", -116971, -163284],
			["Сигара", -116976, -163282],
			["Сигара", -133493, -153265],
			["Сигара", -139579, -144685],
			["Сигара", -25641, 185838],
			["Сигара", 137876, 185036],
			["Сигара", 137876, 185038],
			["Сигара", 60349, 173299],
			["Сигара", 52586, 132002],
			["Сигара", -41716, 87495],
			["Сигара", -128704, 84197],
			["Сигара", -121962, 40748],
			["Сигара", -23338, 11975],
			["Сигара", -19904, 15447],
			["Сигара", -99615, 7471],
			["Сигара", -99622, 7473],
			["Сигара", -99610, 7475],
			["Сигара", 172721, 39769],
			["Сигара", 171709, 57851],
			["Сигара", 169765, 60219],
			["Сигара", 132268, 54950],
			["Сигара", 132262, 54955],
			["Сигара", 29881, 119950],
			["Сигара", 25089, 130474],
			["Сигара", 20331, 90821],
			["Сигара", 109848, 57275],
			["Сигара", 23897, 49120],
			["Сигара", 20454, -108346],
			["Сигара", 18956, -106855],
			["Сигара", 184098, -66357],
			["Сигара", 131213, 85136],
			["Сигара", 41050, -15772],
			["Сигара", -88236, -43012],
			["Сигара", -155930, 51578],
			["Сигара", -129470, 80831],
			["Сигара", 143561, -89061]
			];
	for (var i = 0; i < hlam522.length; i++) {
				hlam_522 = new L.circleMarker([hlam522[i][1],hlam522[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam522[i][0])
					.bindTooltip(hlam522[i][0], {direction: 'top'})
					.addTo(hlam522icons);
			}
	}
	else {
		hlam522icons.clearLayers();
	}
}
var hlam523icons = L.layerGroup().addTo(map);
function Hlam523OnOff() {
	var chbox523;
	chbox523=document.getElementById('Hlam523Button');
	if (chbox523.checked) {
		var hlam523 = [
			["Сигарета", -36148, -17904],
			["Сигарета", -35893, -17902],
			["Сигарета", -41087, -37727],
			["Сигарета", -117778, -63032],
			["Сигарета", -117779, -63032],
			["Сигарета", -117781, -63036],
			["Сигарета", -59005, -91760],
			["Сигарета", -109483, -88833],
			["Сигарета", -48209, -128132],
			["Сигарета", -87350, -112555],
			["Сигарета", -87386, -112544],
			["Сигарета", -105400, -119595],
			["Сигарета", -105784, -115384],
			["Сигарета", -105855, -115344],
			["Сигарета", -105862, -115308],
			["Сигарета", -147742, -37312],
			["Сигарета", -151572, -74001],
			["Сигарета", -151571, -74002],
			["Сигарета", -151574, -74001],
			["Сигарета", -151576, -73999],
			["Сигарета", -151575, -74000],
			["Сигарета", -146927, -70751],
			["Сигарета", -146930, -70753],
			["Сигарета", -168133, -112517],
			["Сигарета", -168128, -112520],
			["Сигарета", -168132, -112515],
			["Сигарета", -168105, -112467],
			["Сигарета", 143229, -59296],
			["Сигарета", 143154, -59288],
			["Сигарета", 102604, -29502],
			["Сигарета", 102601, -29499],
			["Сигарета", 103985, -14469],
			["Сигарета", 101367, -11662],
			["Сигарета", 88931, -31211],
			["Сигарета", 88932, -31217],
			["Сигарета", 88926, -31214],
			["Сигарета", 90562, -29473],
			["Сигарета", 90563, -29479],
			["Сигарета", 90569, -29475],
			["Сигарета", 90318, -27783],
			["Сигарета", 90325, -27784],
			["Сигарета", 90323, -27778],
			["Сигарета", 74332, -18285],
			["Сигарета", 76942, -15458],
			["Сигарета", 70679, -7569],
			["Сигарета", 70671, -7578],
			["Сигарета", 70667, -7577],
			["Сигарета", 70661, -7576],
			["Сигарета", 70663, -7578],
			["Сигарета", 70666, -7582],
			["Сигарета", 70659, -7575],
			["Сигарета", 70668, -7586],
			["Сигарета", 70660, -7581],
			["Сигарета", 70664, -7574],
			["Сигарета", 87392, -6579],
			["Сигарета", 87342, -6650],
			["Сигарета", 87348, -6639],
			["Сигарета", 87351, -6650],
			["Сигарета", 87344, -6647],
			["Сигарета", 87351, -6645],
			["Сигарета", 87339, -6649],
			["Сигарета", 87342, -6642],
			["Сигарета", 87344, -6648],
			["Сигарета", 87350, -6647],
			["Сигарета", 87344, -6640],
			["Сигарета", 87350, -6642],
			["Сигарета", 87344, -6645],
			["Сигарета", 87347, -6647],
			["Сигарета", 93586, -7925],
			["Сигарета", 85368, -2735],
			["Сигарета", 39727, -37954],
			["Сигарета", 13845, -62092],
			["Сигарета", 24686, -63646],
			["Сигарета", 54277, -128602],
			["Сигарета", 54279, -128611],
			["Сигарета", 19960, -103860],
			["Сигарета", 20020, -103829],
			["Сигарета", 19960, -103770],
			["Сигарета", 19941, -103804],
			["Сигарета", 19970, -103823],
			["Сигарета", 19983, -103781],
			["Сигарета", 19322, -104521],
			["Сигарета", 19444, -104545],
			["Сигарета", 19439, -104551],
			["Сигарета", 19688, -104225],
			["Сигарета", 19671, -104214],
			["Сигарета", 20212, -103976],
			["Сигарета", 20185, -104134],
			["Сигарета", 20181, -104151],
			["Сигарета", 19984, -104076],
			["Сигарета", 19988, -104077],
			["Сигарета", 19944, -104241],
			["Сигарета", 19948, -104272],
			["Сигарета", 19937, -104251],
			["Сигарета", 19931, -104236],
			["Сигарета", 19935, -104235],
			["Сигарета", 19739, -104386],
			["Сигарета", 29173, -101485],
			["Сигарета", 29170, -101485],
			["Сигарета", 29391, -101305],
			["Сигарета", -61362, -145482],
			["Сигарета", -61362, -145486],
			["Сигарета", -61363, -145479],
			["Сигарета", -38939, -132685],
			["Сигарета", -38939, -132681],
			["Сигарета", -53655, -167978],
			["Сигарета", -53666, -167958],
			["Сигарета", -53658, -167956],
			["Сигарета", -53663, -167965],
			["Сигарета", -53658, -167965],
			["Сигарета", -53655, -167966],
			["Сигарета", -53065, -168147],
			["Сигарета", -74803, -176063],
			["Сигарета", -127913, -165565],
			["Сигарета", -127912, -165564],
			["Сигарета", -127916, -165554],
			["Сигарета", -123437, -166542],
			["Сигарета", 143436, -148964],
			["Сигарета", 107668, -153503],
			["Сигарета", 74488, -177861],
			["Сигарета", 74232, -177025],
			["Сигарета", -97314, 199931],
			["Сигарета", -93709, 180037],
			["Сигарета", -10006, 132185],
			["Сигарета", -10003, 132185],
			["Сигарета", -10004, 132186],
			["Сигарета", -156652, 190962],
			["Сигарета", -156689, 190964],
			["Сигарета", -156693, 190964],
			["Сигарета", -156681, 190966],
			["Сигарета", -156684, 190964],
			["Сигарета", -156686, 190965],
			["Сигарета", -156683, 190965],
			["Сигарета", -156696, 190968],
			["Сигарета", -156691, 190965],
			["Сигарета", -156698, 190966],
			["Сигарета", -177908, 165671],
			["Сигарета", -143099, 138579],
			["Сигарета", 149381, 135451],
			["Сигарета", 66326, 176832],
			["Сигарета", 66325, 176869],
			["Сигарета", 66335, 176865],
			["Сигарета", 86168, 151914],
			["Сигарета", 47886, 143522],
			["Сигарета", 47700, 143496],
			["Сигарета", -129201, 119777],
			["Сигарета", -47833, 15374],
			["Сигарета", -47835, 15378],
			["Сигарета", -47825, 15375],
			["Сигарета", -47736, 20557],
			["Сигарета", -130656, 10302],
			["Сигарета", -130658, 10298],
			["Сигарета", -130657, 10298],
			["Сигарета", 191225, 115682],
			["Сигарета", 191226, 115676],
			["Сигарета", 144349, 106207],
			["Сигарета", 153544, 105579],
			["Сигарета", 135661, 115564],
			["Сигарета", 171692, 57859],
			["Сигарета", 171694, 57860],
			["Сигарета", 171696, 57860],
			["Сигарета", 171699, 57860],
			["Сигарета", 171709, 57860],
			["Сигарета", 169757, 60225],
			["Сигарета", 170975, 1538],
			["Сигарета", 170981, 1542],
			["Сигарета", 170977, 1541],
			["Сигарета", 133371, 20626],
			["Сигарета", 100090, 91196],
			["Сигарета", 100090, 91192],
			["Сигарета", 100088, 91199],
			["Сигарета", 9679, 50343],
			["Сигарета", 78142, 77],
			["Сигарета", 66382, 176879],
			["Сигарета", 7473, -31694],
			["Сигарета", 131713, 54798],
			["Сигарета", -38958, -132673],
			["Сигарета", 153003, -104535],
			["Сигарета", 27223, 171675],
			["Сигарета", 27085, 171706],
			["Сигарета", -121389, 143220],
			["Сигарета", -37861, -15910]
			];
	for (var i = 0; i < hlam523.length; i++) {
				hlam_523 = new L.circleMarker([hlam523[i][1],hlam523[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam523[i][0])
					.bindTooltip(hlam523[i][0], {direction: 'top'})
					.addTo(hlam523icons);
			}
	}
	else {
		hlam523icons.clearLayers();
	}
}
var hlam524icons = L.layerGroup().addTo(map);
function Hlam524OnOff() {
	var chbox524;
	chbox524=document.getElementById('Hlam524Button');
	if (chbox524.checked) {
		var hlam524 = [
			["Сине-зеленая ваза-бутон", -47714, -49683],
			["Сине-зеленая ваза-бутон", -48683, -117739],
			["Сине-зеленая ваза-бутон", -46287, -104764],
			["Сине-зеленая ваза-бутон", 183831, -91583],
			["Сине-зеленая ваза-бутон", 148314, -79819],
			["Сине-зеленая ваза-бутон", 22804, -149402],
			["Сине-зеленая ваза-бутон", -60065, 182216],
			["Сине-зеленая ваза-бутон", -61309, 182209],
			["Сине-зеленая ваза-бутон", -61343, 181953],
			["Сине-зеленая ваза-бутон", -61069, 182180],
			["Сине-зеленая ваза-бутон", 11757, 183180],
			["Сине-зеленая ваза-бутон", -40965, 87675],
			["Сине-зеленая ваза-бутон", 171078, 58833],
			["Сине-зеленая ваза-бутон", 183538, 2757],
			["Сине-зеленая ваза-бутон", 138543, 696],
			["Сине-зеленая ваза-бутон", 26568, 127462],
			["Сине-зеленая ваза-бутон", 100443, 25348]
			];
	for (var i = 0; i < hlam524.length; i++) {
				hlam_524 = new L.circleMarker([hlam524[i][1],hlam524[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam524[i][0])
					.bindTooltip(hlam524[i][0], {direction: 'top'})
					.addTo(hlam524icons);
			}
	}
	else {
		hlam524icons.clearLayers();
	}
}
var hlam525icons = L.layerGroup().addTo(map);
function Hlam525OnOff() {
	var chbox525;
	chbox525=document.getElementById('Hlam525Button');
	if (chbox525.checked) {
		var hlam525 = [
			["Сине-зеленая ваза-купол", -110326, -58964],
			["Сине-зеленая ваза-купол", 77755, -11202],
			["Сине-зеленая ваза-купол", 11175, -88431],
			["Сине-зеленая ваза-купол", 19498, -104204],
			["Сине-зеленая ваза-купол", -14040, 119134],
			["Сине-зеленая ваза-купол", -38662, 3630],
			["Сине-зеленая ваза-купол", -42841, 12020],
			["Сине-зеленая ваза-купол", -179791, 73974]
			];
	for (var i = 0; i < hlam525.length; i++) {
				hlam_525 = new L.circleMarker([hlam525[i][1],hlam525[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam525[i][0])
					.bindTooltip(hlam525[i][0], {direction: 'top'})
					.addTo(hlam525icons);
			}
	}
	else {
		hlam525icons.clearLayers();
	}
}
var hlam526icons = L.layerGroup().addTo(map);
function Hlam526OnOff() {
	var chbox526;
	chbox526=document.getElementById('Hlam526Button');
	if (chbox526.checked) {
		var hlam526 = [
			["Сине-зеленая округлая ваза", -50922, -13611],
			["Сине-зеленая округлая ваза", -42261, -5633],
			["Сине-зеленая округлая ваза", 22341, -110211],
			["Сине-зеленая округлая ваза", 21787, -105740],
			["Сине-зеленая округлая ваза", 22205, -105523],
			["Сине-зеленая округлая ваза", -60525, 181972],
			["Сине-зеленая округлая ваза", 33083, 132087],
			["Сине-зеленая округлая ваза", -41022, 88163],
			["Сине-зеленая округлая ваза", -39655, 47278],
			["Сине-зеленая округлая ваза", -38387, 4320],
			["Сине-зеленая округлая ваза", 171068, 58776],
			["Сине-зеленая округлая ваза", 129962, 74253]
			];
	for (var i = 0; i < hlam526.length; i++) {
				hlam_526 = new L.circleMarker([hlam526[i][1],hlam526[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam526[i][0])
					.bindTooltip(hlam526[i][0], {direction: 'top'})
					.addTo(hlam526icons);
			}
	}
	else {
		hlam526icons.clearLayers();
	}
}
var hlam527icons = L.layerGroup().addTo(map);
function Hlam527OnOff() {
	var chbox527;
	chbox527=document.getElementById('Hlam527Button');
	if (chbox527.checked) {
		var hlam527 = [
			["Сине-зеленая расширяющаяся ваза", -55758, -61039],
			["Сине-зеленая расширяющаяся ваза", 13346, -107045],
			["Сине-зеленая расширяющаяся ваза", 22176, -105350],
			["Сине-зеленая расширяющаяся ваза", 131715, -132082],
			["Сине-зеленая расширяющаяся ваза", -47237, 2980],
			["Сине-зеленая расширяющаяся ваза", -39965, 5791],
			["Сине-зеленая расширяющаяся ваза", 171807, 59440],
			["Сине-зеленая расширяющаяся ваза", 171102, 57868],
			["Сине-зеленая расширяющаяся ваза", 171189, 58349],
			["Сине-зеленая расширяющаяся ваза", 172303, 58434],
			["Сине-зеленая расширяющаяся ваза", 172671, 58801],
			["Сине-зеленая расширяющаяся ваза", 172238, 59726],
			["Сине-зеленая расширяющаяся ваза", 172469, 59221],
			["Сине-зеленая расширяющаяся ваза", 172400, 59423]
			];
	for (var i = 0; i < hlam527.length; i++) {
				hlam_527 = new L.circleMarker([hlam527[i][1],hlam527[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam527[i][0])
					.bindTooltip(hlam527[i][0], {direction: 'top'})
					.addTo(hlam527icons);
			}
	}
	else {
		hlam527icons.clearLayers();
	}
}
var hlam528icons = L.layerGroup().addTo(map);
function Hlam528OnOff() {
	var chbox528;
	chbox528=document.getElementById('Hlam528Button');
	if (chbox528.checked) {
		var hlam528 = [
			["Сине-зеленая цилиндрическая ваза", -40141, -1335],
			["Сине-зеленая цилиндрическая ваза", -55433, -60527],
			["Сине-зеленая цилиндрическая ваза", -149289, -56394],
			["Сине-зеленая цилиндрическая ваза", 16916, -44455],
			["Сине-зеленая цилиндрическая ваза", 22014, -110219],
			["Сине-зеленая цилиндрическая ваза", 148830, -149070],
			["Сине-зеленая цилиндрическая ваза", -20901, 16624]
			];
	for (var i = 0; i < hlam528.length; i++) {
				hlam_528 = new L.circleMarker([hlam528[i][1],hlam528[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam528[i][0])
					.bindTooltip(hlam528[i][0], {direction: 'top'})
					.addTo(hlam528icons);
			}
	}
	else {
		hlam528icons.clearLayers();
	}
}
var hlam529icons = L.layerGroup().addTo(map);
function Hlam529OnOff() {
	var chbox529;
	chbox529=document.getElementById('Hlam529Button');
	if (chbox529.checked) {
		var hlam529 = [
			["Синий садовый гном", -55149, -12235],
			["Синий садовый гном", -123728, -17251],
			["Синий садовый гном", -120031, -14258],
			["Синий садовый гном", -27473, -62850],
			["Синий садовый гном", -27491, -61423],
			["Синий садовый гном", -10408, -50463],
			["Синий садовый гном", -38638, -58067],
			["Синий садовый гном", -57907, -48083],
			["Синий садовый гном", -70510, -97531],
			["Синий садовый гном", -62405, -129243],
			["Синий садовый гном", -163641, -55158],
			["Синий садовый гном", 183196, -15824],
			["Синий садовый гном", 70048, -5867],
			["Синий садовый гном", 85714, -1427],
			["Синий садовый гном", 48821, -21467],
			["Синий садовый гном", 89794, -53511],
			["Синий садовый гном", 37517, -34830],
			["Синий садовый гном", 37479, -35084],
			["Синий садовый гном", 13569, -59383],
			["Синий садовый гном", 18458, -59594],
			["Синий садовый гном", 18493, -59767],
			["Синий садовый гном", 62020, -97100],
			["Синий садовый гном", 16254, -118776],
			["Синий садовый гном", 9478, -109628],
			["Синий садовый гном", -61257, -145719],
			["Синий садовый гном", -154146, -168152],
			["Синий садовый гном", -152400, -166425],
			["Синий садовый гном", -154615, -166965],
			["Синий садовый гном", -154704, -167057],
			["Синий садовый гном", 52072, -148568],
			["Синий садовый гном", 60345, -145442],
			["Синий садовый гном", -58986, 177647],
			["Синий садовый гном", -58618, 177727],
			["Синий садовый гном", -58677, 177327],
			["Синий садовый гном", -59793, 177365],
			["Синий садовый гном", -58753, 177603],
			["Синий садовый гном", -69016, 171387],
			["Синий садовый гном", -56, 138730],
			["Синий садовый гном", -27070, 163005],
			["Синий садовый гном", -90313, 150182],
			["Синий садовый гном", -149073, 150742],
			["Синий садовый гном", -138347, 152885],
			["Синий садовый гном", 152425, 138869],
			["Синий садовый гном", 46329, 160620],
			["Синий садовый гном", 10723, 160738],
			["Синий садовый гном", -13954, 107579],
			["Синий садовый гном", -70040, 110986],
			["Синий садовый гном", -95586, 124225],
			["Синий садовый гном", -6472, 93156],
			["Синий садовый гном", -49209, 86253],
			["Синий садовый гном", -92325, 65930],
			["Синий садовый гном", -92293, 65899],
			["Синий садовый гном", -92655, 66572],
			["Синий садовый гном", -129123, 88464],
			["Синий садовый гном", -19163, 59524],
			["Синий садовый гном", -74240, 48874],
			["Синий садовый гном", -19892, 15497],
			["Синий садовый гном", -118577, 4561],
			["Синий садовый гном", -130703, 10666],
			["Синий садовый гном", -138523, 113128],
			["Синий садовый гном", -138564, 113099],
			["Синий садовый гном", -142359, 1338],
			["Синий садовый гном", 201913, 93601],
			["Синий садовый гном", 140400, 86424],
			["Синий садовый гном", 139753, 86232],
			["Синий садовый гном", 145266, 87322],
			["Синий садовый гном", 167369, 1],
			["Синий садовый гном", 94790, 98772],
			["Синий садовый гном", 52840, 100464],
			["Синий садовый гном", 64369, 76914],
			["Синий садовый гном", 20869, 89872],
			["Синий садовый гном", 109302, 56513],
			["Синий садовый гном", 109294, 56473],
			["Синий садовый гном", 109331, 56474],
			["Синий садовый гном", 115160, 63082],
			["Синий садовый гном", 100232, 2005],
			["Синий садовый гном", 23869, 15194],
			["Синий садовый гном", 13186, 25271],
			["Синий садовый гном", -46594, -51534],
			["Синий садовый гном", 128918, 85282],
			["Синий садовый гном", -144694, 154408],
			["Синий садовый гном", -163622, 200307],
			["Синий садовый гном", 14286, 44426],
			["Синий садовый гном", 51603, -69423],
			["Синий садовый гном", -81490, 46810],
			["Синий садовый гном", -11832, 196848]
			];
	for (var i = 0; i < hlam529.length; i++) {
				hlam_529 = new L.circleMarker([hlam529[i][1],hlam529[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam529[i][0])
					.bindTooltip(hlam529[i][0], {direction: 'top'})
					.addTo(hlam529icons);
			}
	}
	else {
		hlam529icons.clearLayers();
	}
}
var hlam530icons = L.layerGroup().addTo(map);
function Hlam530OnOff() {
	var chbox530;
	chbox530=document.getElementById('Hlam530Button');
	if (chbox530.checked) {
		var hlam530 = [
			["Синяя краска", -34471, -84442],
			["Синяя краска", -83841, -106217],
			["Синяя краска", -149891, -125760],
			["Синяя краска", -131758, -113548],
			["Синяя краска", 188095, -28894],
			["Синяя краска", 188489, -29754],
			["Синяя краска", 167264, -25458],
			["Синяя краска", 149079, -51872],
			["Синяя краска", 149062, -51882],
			["Синяя краска", 130167, -27761],
			["Синяя краска", 101166, -15604],
			["Синяя краска", 84760, -18874],
			["Синяя краска", 90582, -9826],
			["Синяя краска", 94552, -12118],
			["Синяя краска", 94384, -12126],
			["Синяя краска", 94338, -12163],
			["Синяя краска", 29515, -58458],
			["Синяя краска", 17366, -44264],
			["Синяя краска", 17355, -44247],
			["Синяя краска", 85584, -118029],
			["Синяя краска", 17922, -108457],
			["Синяя краска", 22674, -106821],
			["Синяя краска", -130709, -189889],
			["Синяя краска", 115004, -157712],
			["Синяя краска", 115012, -157688],
			["Синяя краска", 107697, -153527],
			["Синяя краска", -6707, 146352],
			["Синяя краска", -26982, 162563],
			["Синяя краска", -27144, 162407],
			["Синяя краска", -27021, 162555],
			["Синяя краска", -26981, 162564],
			["Синяя краска", -38251, 159869],
			["Синяя краска", 1568, 164177],
			["Синяя краска", 105093, 156607],
			["Синяя краска", 72145, 132988],
			["Синяя краска", 88363, 157478],
			["Синяя краска", -37761, 84748],
			["Синяя краска", -61225, 89273],
			["Синяя краска", -61145, 89568],
			["Синяя краска", -61802, 90488],
			["Синяя краска", -25129, 12011],
			["Синяя краска", -148460, 113364],
			["Синяя краска", 183471, 112368],
			["Синяя краска", 136093, 124147],
			["Синяя краска", 140876, 9079],
			["Синяя краска", 49882, 85161],
			["Синяя краска", 111388, 55791]
			];
	for (var i = 0; i < hlam530.length; i++) {
				hlam_530 = new L.circleMarker([hlam530[i][1],hlam530[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam530[i][0])
					.bindTooltip(hlam530[i][0], {direction: 'top'})
					.addTo(hlam530icons);
			}
	}
	else {
		hlam530icons.clearLayers();
	}
}
var hlam531icons = L.layerGroup().addTo(map);
function Hlam531OnOff() {
	var chbox531;
	chbox531=document.getElementById('Hlam531Button');
	if (chbox531.checked) {
		var hlam531 = [
			["Синяя настольная лампа", -9654, -27002],
			["Синяя настольная лампа", -44996, -8832],
			["Синяя настольная лампа", -44317, -7863],
			["Синяя настольная лампа", -44274, -8012],
			["Синяя настольная лампа", -21607, -57716],
			["Синяя настольная лампа", -21624, -58545],
			["Синяя настольная лампа", -55490, -61638],
			["Синяя настольная лампа", -47418, -49336],
			["Синяя настольная лампа", -54681, -48330],
			["Синяя настольная лампа", -51055, -98299],
			["Синяя настольная лампа", -61925, -100532],
			["Синяя настольная лампа", -60750, -100512],
			["Синяя настольная лампа", -47240, -101746],
			["Синяя настольная лампа", -48309, -100166],
			["Синяя настольная лампа", -152266, -75384],
			["Синяя настольная лампа", -151751, -74905],
			["Синяя настольная лампа", -152407, -73985],
			["Синяя настольная лампа", -152296, -73088],
			["Синяя настольная лампа", -152220, -71952],
			["Синяя настольная лампа", -151127, -71660],
			["Синяя настольная лампа", 170578, -28489],
			["Синяя настольная лампа", 164996, -10423],
			["Синяя настольная лампа", 88602, -6670],
			["Синяя настольная лампа", 88412, -5480],
			["Синяя настольная лампа", 89737, -56968],
			["Синяя настольная лампа", 51768, -41384],
			["Синяя настольная лампа", 39801, -38589],
			["Синяя настольная лампа", 29542, -58422],
			["Синяя настольная лампа", 28892, -101200],
			["Синяя настольная лампа", 29202, -100907],
			["Синяя настольная лампа", -120475, -190022],
			["Синяя настольная лампа", 80031, 182480],
			["Синяя настольная лампа", 85933, 151713],
			["Синяя настольная лампа", 86961, 157630],
			["Синяя настольная лампа", 87524, 159352],
			["Синяя настольная лампа", -84553, 66209],
			["Синяя настольная лампа", -98577, 8222],
			["Синяя настольная лампа", 131547, 86009],
			["Синяя настольная лампа", 133783, 85030],
			["Синяя настольная лампа", 134133, 85516],
			["Синяя настольная лампа", 168779, 57112],
			["Синяя настольная лампа", 168547, 59392],
			["Синяя настольная лампа", 172553, 58489],
			["Синяя настольная лампа", 186904, 13780],
			["Синяя настольная лампа", 46257, 101073],
			["Синяя настольная лампа", 24399, 122335],
			["Синяя настольная лампа", 128655, 85524],
			["Синяя настольная лампа", 23392, 43810],
			["Синяя настольная лампа", 23107, 44038],
			["Синяя настольная лампа", 23050, 43952],
			["Синяя настольная лампа", 22336, 47688],
			["Синяя настольная лампа", 22637, 47705],
			["Синяя настольная лампа", 24743, 46423],
			["Синяя настольная лампа", 24741, 45918],
			["Синяя настольная лампа", 25013, 45883],
			["Синяя настольная лампа", 23701, 49712],
			["Синяя настольная лампа", 100275, 25977],
			["Синяя настольная лампа", 87325, 7306],
			["Синяя настольная лампа", 71382, 21317],
			["Синяя настольная лампа", 70845, 21664]
			];
	for (var i = 0; i < hlam531.length; i++) {
				hlam_531 = new L.circleMarker([hlam531[i][1],hlam531[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam531[i][0])
					.bindTooltip(hlam531[i][0], {direction: 'top'})
					.addTo(hlam531icons);
			}
	}
	else {
		hlam531icons.clearLayers();
	}
}
var hlam532icons = L.layerGroup().addTo(map);
function Hlam532OnOff() {
	var chbox532;
	chbox532=document.getElementById('Hlam532Button');
	if (chbox532.checked) {
		var hlam532 = [
			["Скальпель", -35277, -80387],
			["Скальпель", -35624, -80380],
			["Скальпель", -76253, -69541],
			["Скальпель", -49246, -100056],
			["Скальпель", -49050, -100207],
			["Скальпель", 101934, -12365],
			["Скальпель", 102143, -12378],
			["Скальпель", 102299, -151782],
			["Скальпель", 102382, -151576],
			["Скальпель", -20929, 150701],
			["Скальпель", 16151, 197885],
			["Скальпель", 126077, 160424],
			["Скальпель", 193180, 113308],
			["Скальпель", 183628, 3038],
			["Скальпель", 78796, 52984]
			];
	for (var i = 0; i < hlam532.length; i++) {
				hlam_532 = new L.circleMarker([hlam532[i][1],hlam532[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam532[i][0])
					.bindTooltip(hlam532[i][0], {direction: 'top'})
					.addTo(hlam532icons);
			}
	}
	else {
		hlam532icons.clearLayers();
	}
}
var hlam533icons = L.layerGroup().addTo(map);
function Hlam533OnOff() {
	var chbox533;
	chbox533=document.getElementById('Hlam533Button');
	if (chbox533.checked) {
		var hlam533 = [
			["Скальпель", -93908, -129797],
			["Скальпель", -152233, -73304],
			["Скальпель", 101957, -12436],
			["Скальпель", 104169, -12806],
			["Скальпель", 101656, -12200],
			["Скальпель", -72480, -132636],
			["Скальпель", 144456, -145547],
			["Скальпель", 74946, -176960],
			["Скальпель", 74120, -172456],
			["Скальпель", 74331, -172454],
			["Скальпель", 74763, -172741],
			["Скальпель", 70228, 202162],
			["Скальпель", 2612, 164250],
			["Скальпель", 2553, 164635],
			["Скальпель", 88155, 157344],
			["Скальпель", 190314, 30939]
			];
	for (var i = 0; i < hlam533.length; i++) {
				hlam_533 = new L.circleMarker([hlam533[i][1],hlam533[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam533[i][0])
					.bindTooltip(hlam533[i][0], {direction: 'top'})
					.addTo(hlam533icons);
			}
	}
	else {
		hlam533icons.clearLayers();
	}
}
var hlam534icons = L.layerGroup().addTo(map);
function Hlam534OnOff() {
	var chbox534;
	chbox534=document.getElementById('Hlam534Button');
	if (chbox534.checked) {
		var hlam534 = [
			["Скипидар", -77749, -21657],
			["Скипидар", -60034, -56850],
			["Скипидар", -119767, -46697],
			["Скипидар", -33408, -93387],
			["Скипидар", -34001, -84746],
			["Скипидар", -111583, -121821],
			["Скипидар", -127924, -112170],
			["Скипидар", -126762, -114088],
			["Скипидар", -115268, -99154],
			["Скипидар", -155636, -36234],
			["Скипидар", 188681, -29389],
			["Скипидар", 131430, -31742],
			["Скипидар", 192019, -34135],
			["Скипидар", 184263, -92756],
			["Скипидар", 149539, -76317],
			["Скипидар", 149965, -67210],
			["Скипидар", 158107, -68797],
			["Скипидар", 82048, -21236],
			["Скипидар", 74775, -17523],
			["Скипидар", 108049, -54982],
			["Скипидар", 113846, -56143],
			["Скипидар", 36057, -35421],
			["Скипидар", 72143, -75931],
			["Скипидар", 15725, -107566],
			["Скипидар", -82099, -161152],
			["Скипидар", -126659, -135545],
			["Скипидар", -121126, -132813],
			["Скипидар", -121085, -132668],
			["Скипидар", -41686, -175325],
			["Скипидар", -120579, -188626],
			["Скипидар", -120310, -188910],
			["Скипидар", -120360, -189797],
			["Скипидар", -114626, -171311],
			["Скипидар", -143045, -159752],
			["Скипидар", -145932, -142987],
			["Скипидар", 174258, -139299],
			["Скипидар", 131690, -132455],
			["Скипидар", 196100, -168718],
			["Скипидар", 75521, -174768],
			["Скипидар", 75413, -173387],
			["Скипидар", -23349, 188874],
			["Скипидар", -39054, 190436],
			["Скипидар", -83248, 165938],
			["Скипидар", -83924, 165656],
			["Скипидар", -1730, 158445],
			["Скипидар", -3938, 161429],
			["Скипидар", -40896, 161686],
			["Скипидар", -155130, 164529],
			["Скипидар", -145475, 173442],
			["Скипидар", 156610, 184631],
			["Скипидар", 101751, 196692],
			["Скипидар", 70299, 202278],
			["Скипидар", 111840, 139497],
			["Скипидар", 88487, 156937],
			["Скипидар", 2703, 163077],
			["Скипидар", 3858, 160272],
			["Скипидар", 7044, 162374],
			["Скипидар", -37521, 84808],
			["Скипидар", -61072, 89475],
			["Скипидар", -59539, 88980],
			["Скипидар", -40979, 87954],
			["Скипидар", -40942, 87968],
			["Скипидар", -33278, 92074],
			["Скипидар", -54859, 57692],
			["Скипидар", -46139, 1711],
			["Скипидар", -47848, 1223],
			["Скипидар", -44204, 28266],
			["Скипидар", -47092, 28988],
			["Скипидар", -98558, 7602],
			["Скипидар", -153522, 129668],
			["Скипидар", -164474, 123387],
			["Скипидар", -138737, 90734],
			["Скипидар", -154355, 49282],
			["Скипидар", 182537, 109786],
			["Скипидар", 181180, 109837],
			["Скипидар", 198074, 46682],
			["Скипидар", 183528, 2938],
			["Скипидар", 100734, 100075],
			["Скипидар", 96080, 106270],
			["Скипидар", 95945, 106118],
			["Скипидар", 110894, 58364]
			];
	for (var i = 0; i < hlam534.length; i++) {
				hlam_534 = new L.circleMarker([hlam534[i][1],hlam534[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam534[i][0])
					.bindTooltip(hlam534[i][0], {direction: 'top'})
					.addTo(hlam534icons);
			}
	}
	else {
		hlam534icons.clearLayers();
	}
}
var hlam535icons = L.layerGroup().addTo(map);
function Hlam535OnOff() {
	var chbox535;
	chbox535=document.getElementById('Hlam535Button');
	if (chbox535.checked) {
		var hlam535 = [
			["Сковорода", -8619, -3011],
			["Сковорода", -53211, -13512],
			["Сковорода", -27951, -60045],
			["Сковорода", -21787, -58267],
			["Сковорода", -19258, -47112],
			["Сковорода", -55906, -60300],
			["Сковорода", -59414, -84677],
			["Сковорода", -41441, -69978],
			["Сковорода", -48827, -128373],
			["Сковорода", -50969, -106867],
			["Сковорода", -61413, -100340],
			["Сковорода", -70308, -104851],
			["Сковорода", -147836, -56938],
			["Сковорода", 180662, -12215],
			["Сковорода", 149486, -52004],
			["Сковорода", 183607, -93136],
			["Сковорода", 183224, -66982],
			["Сковорода", 91170, -32635],
			["Сковорода", 94519, -3973],
			["Сковорода", 17907, -853],
			["Сковорода", 18002, -860],
			["Сковорода", 68050, -88166],
			["Сковорода", 9458, -82205],
			["Сковорода", 99331, -124441],
			["Сковорода", 18149, -106522],
			["Сковорода", 19755, -104352],
			["Сковорода", -115724, -136986],
			["Сковорода", -121042, -189604],
			["Сковорода", -31697, 195195],
			["Сковорода", -138418, 152465],
			["Сковорода", 105348, 156590],
			["Сковорода", 71787, 137206],
			["Сковорода", -104881, 123111],
			["Сковорода", -128529, 80198],
			["Сковорода", 133421, 126835],
			["Сковорода", 134034, 85996],
			["Сковорода", 169031, 56093],
			["Сковорода", 171760, 59171],
			["Сковорода", 89326, 55382],
			["Сковорода", 82940, 57735]
			];
	for (var i = 0; i < hlam535.length; i++) {
				hlam_535 = new L.circleMarker([hlam535[i][1],hlam535[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam535[i][0])
					.bindTooltip(hlam535[i][0], {direction: 'top'})
					.addTo(hlam535icons);
			}
	}
	else {
		hlam535icons.clearLayers();
	}
}
var hlam536icons = L.layerGroup().addTo(map);
function Hlam536OnOff() {
	var chbox536;
	chbox536=document.getElementById('Hlam536Button');
	if (chbox536.checked) {
		var hlam536 = [
			["Скрипка", -7814, -13465],
			["Скрипка", -44443, -8063],
			["Скрипка", -149393, -54718],
			["Скрипка", -75322, 89513],
			["Скрипка", -50006, 3806]
			];
	for (var i = 0; i < hlam536.length; i++) {
				hlam_536 = new L.circleMarker([hlam536[i][1],hlam536[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam536[i][0])
					.bindTooltip(hlam536[i][0], {direction: 'top'})
					.addTo(hlam536icons);
			}
	}
	else {
		hlam536icons.clearLayers();
	}
}
var hlam537icons = L.layerGroup().addTo(map);
function Hlam537OnOff() {
	var chbox537;
	chbox537=document.getElementById('Hlam537Button');
	if (chbox537.checked) {
		var hlam537 = [
			["Сложенный американский флаг", -50839, -14130],
			["Сложенный американский флаг", -43770, -6746],
			["Сложенный американский флаг", -42561, -5717],
			["Сложенный американский флаг", -12356, -69431],
			["Сложенный американский флаг", -13021, -69466],
			["Сложенный американский флаг", 168756, -24320],
			["Сложенный американский флаг", 92178, -58998],
			["Сложенный американский флаг", 11942, -83544],
			["Сложенный американский флаг", -156530, 190935],
			["Сложенный американский флаг", 14465, 193898],
			["Сложенный американский флаг", -42193, 88515],
			["Сложенный американский флаг", -19377, 17051],
			["Сложенный американский флаг", -38692, 3626],
			["Сложенный американский флаг", 193690, 56178]
			];
	for (var i = 0; i < hlam537.length; i++) {
				hlam_537 = new L.circleMarker([hlam537[i][1],hlam537[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam537[i][0])
					.bindTooltip(hlam537[i][0], {direction: 'top'})
					.addTo(hlam537icons);
			}
	}
	else {
		hlam537icons.clearLayers();
	}
}
var hlam538icons = L.layerGroup().addTo(map);
function Hlam538OnOff() {
	var chbox538;
	chbox538=document.getElementById('Hlam538Button');
	if (chbox538.checked) {
		var hlam538 = [
			["Сломанная бедренная кость", -61794, -127320],
			["Сломанная бедренная кость", -133523, 164219],
			["Сломанная бедренная кость", 166475, 178646],
			["Сломанная бедренная кость", 68452, 202377],
			["Сломанная бедренная кость", -80953, 102897],
			["Сломанная бедренная кость", -19508, 16654]
			];
	for (var i = 0; i < hlam538.length; i++) {
				hlam_538 = new L.circleMarker([hlam538[i][1],hlam538[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam538[i][0])
					.bindTooltip(hlam538[i][0], {direction: 'top'})
					.addTo(hlam538icons);
			}
	}
	else {
		hlam538icons.clearLayers();
	}
}
var hlam539icons = L.layerGroup().addTo(map);
function Hlam539OnOff() {
	var chbox539;
	chbox539=document.getElementById('Hlam539Button');
	if (chbox539.checked) {
		var hlam539 = [
			["Сломанная берцовая кость", 191444, -7734],
			["Сломанная берцовая кость", 191578, -7696],
			["Сломанная берцовая кость", 191625, -7886],
			["Сломанная берцовая кость", -76433, -184141],
			["Сломанная берцовая кость", -88698, 150671],
			["Сломанная берцовая кость", -133513, 164155],
			["Сломанная берцовая кость", 166560, 178008],
			["Сломанная берцовая кость", 166548, 177586],
			["Сломанная берцовая кость", 166652, 177819],
			["Сломанная берцовая кость", 166306, 178734],
			["Сломанная берцовая кость", 68509, 202741],
			["Сломанная берцовая кость", 68452, 202391],
			["Сломанная берцовая кость", -80735, 102786],
			["Сломанная берцовая кость", -80219, 117883],
			["Сломанная берцовая кость", 183783, 3236],
			["Сломанная берцовая кость", 100479, 71910],
			["Сломанная берцовая кость", 101790, 3362],
			["Сломанная берцовая кость", 54922, 1466]
			];
	for (var i = 0; i < hlam539.length; i++) {
				hlam_539 = new L.circleMarker([hlam539[i][1],hlam539[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam539[i][0])
					.bindTooltip(hlam539[i][0], {direction: 'top'})
					.addTo(hlam539icons);
			}
	}
	else {
		hlam539icons.clearLayers();
	}
}
var hlam540icons = L.layerGroup().addTo(map);
function Hlam540OnOff() {
	var chbox540;
	chbox540=document.getElementById('Hlam540Button');
	if (chbox540.checked) {
		var hlam540 = [
			["Сломанная камера", -109107, -23453],
			["Сломанная камера", -46931, -50832],
			["Сломанная камера", -91818, -51879],
			["Сломанная камера", -91241, -42973],
			["Сломанная камера", -109257, -60483],
			["Сломанная камера", 191712, -25858],
			["Сломанная камера", 140128, -2775],
			["Сломанная камера", 183427, -93834],
			["Сломанная камера", 195453, -103570],
			["Сломанная камера", 89670, -10054],
			["Сломанная камера", 89866, -56718],
			["Сломанная камера", 29387, -58655],
			["Сломанная камера", 31317, -33716],
			["Сломанная камера", 16725, -82305],
			["Сломанная камера", 9925, -79262],
			["Сломанная камера", -40406, -158006],
			["Сломанная камера", -61111, -145508],
			["Сломанная камера", -7942, -165175],
			["Сломанная камера", -129187, -189107],
			["Сломанная камера", -111313, -177451],
			["Сломанная камера", -114211, -169211],
			["Сломанная камера", -152785, -160384],
			["Сломанная камера", -177863, -146268],
			["Сломанная камера", 173404, -140138],
			["Сломанная камера", 144118, -148590],
			["Сломанная камера", 108130, -153300],
			["Сломанная камера", 74504, -177273],
			["Сломанная камера", -38891, 190419],
			["Сломанная камера", -145626, 176993],
			["Сломанная камера", 81666, 184200],
			["Сломанная камера", 58805, 176680],
			["Сломанная камера", 33103, 131825],
			["Сломанная камера", 22670, 133361],
			["Сломанная камера", -41122, 87664],
			["Сломанная камера", -74230, 48966],
			["Сломанная камера", -98946, 8212],
			["Сломанная камера", -105418, 15527],
			["Сломанная камера", -159298, 55857],
			["Сломанная камера", 149747, 33512],
			["Сломанная камера", 174570, 7439],
			["Сломанная камера", 31017, 121441],
			["Сломанная камера", 29730, 67668],
			["Сломанная камера", 104625, 41824],
			["Сломанная камера", 109247, 56411],
			["Сломанная камера", 14124, 39118],
			["Сломанная камера", 22689, 47221],
			["Сломанная камера", 27561, 49998],
			["Сломанная камера", 66562, 19878],
			["Сломанная камера", 71143, 20414],
			["Сломанная камера", 78058, 20862]
			];
	for (var i = 0; i < hlam540.length; i++) {
				hlam_540 = new L.circleMarker([hlam540[i][1],hlam540[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam540[i][0])
					.bindTooltip(hlam540[i][0], {direction: 'top'})
					.addTo(hlam540icons);
			}
	}
	else {
		hlam540icons.clearLayers();
	}
}
var hlam541icons = L.layerGroup().addTo(map);
function Hlam541OnOff() {
	var chbox541;
	chbox541=document.getElementById('Hlam541Button');
	if (chbox541.checked) {
		var hlam541 = [
			["Сломанная камера", -45152, -2831],
			["Сломанная камера", -46622, 2594],
			["Сломанная камера", -41468, 3058],
			["Сломанная камера", -38720, 3632]
			];
	for (var i = 0; i < hlam541.length; i++) {
				hlam_541 = new L.circleMarker([hlam541[i][1],hlam541[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam541[i][0])
					.bindTooltip(hlam541[i][0], {direction: 'top'})
					.addTo(hlam541icons);
			}
	}
	else {
		hlam541icons.clearLayers();
	}
}
var hlam542icons = L.layerGroup().addTo(map);
function Hlam542OnOff() {
	var chbox542;
	chbox542=document.getElementById('Hlam542Button');
	if (chbox542.checked) {
		var hlam542 = [
			["Сломанная кукла", -147050, -143404]
			];
	for (var i = 0; i < hlam542.length; i++) {
				hlam_542 = new L.circleMarker([hlam542[i][1],hlam542[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam542[i][0])
					.bindTooltip(hlam542[i][0], {direction: 'top'})
					.addTo(hlam542icons);
			}
	}
	else {
		hlam542icons.clearLayers();
	}
}
var hlam543icons = L.layerGroup().addTo(map);
function Hlam543OnOff() {
	var chbox543;
	chbox543=document.getElementById('Hlam543Button');
	if (chbox543.checked) {
		var hlam543 = [
			["Сломанная кукла", -73527, -179588],
			["Сломанная кукла", 179003, 134046],
			["Сломанная кукла", -38430, 3996]
			];
	for (var i = 0; i < hlam543.length; i++) {
				hlam_543 = new L.circleMarker([hlam543[i][1],hlam543[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam543[i][0])
					.bindTooltip(hlam543[i][0], {direction: 'top'})
					.addTo(hlam543icons);
			}
	}
	else {
		hlam543icons.clearLayers();
	}
}
var hlam544icons = L.layerGroup().addTo(map);
function Hlam544OnOff() {
	var chbox544;
	chbox544=document.getElementById('Hlam544Button');
	if (chbox544.checked) {
		var hlam544 = [
			["Сломанная кукла", -109837, -23514],
			["Сломанная кукла", 179613, -122212],
			["Сломанная кукла", -93900, -175203],
			["Сломанная кукла", -74745, -175961],
			["Сломанная кукла", -165790, 122466]
			];
	for (var i = 0; i < hlam544.length; i++) {
				hlam_544 = new L.circleMarker([hlam544[i][1],hlam544[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam544[i][0])
					.bindTooltip(hlam544[i][0], {direction: 'top'})
					.addTo(hlam544icons);
			}
	}
	else {
		hlam544icons.clearLayers();
	}
}
var hlam545icons = L.layerGroup().addTo(map);
function Hlam545OnOff() {
	var chbox545;
	chbox545=document.getElementById('Hlam545Button');
	if (chbox545.checked) {
		var hlam545 = [
			["Сломанная лампа", -27703, -60405],
			["Сломанная лампа", -24071, -59896],
			["Сломанная лампа", -24299, -59918],
			["Сломанная лампа", -24471, -60290],
			["Сломанная лампа", -17383, -46692],
			["Сломанная лампа", -21248, -43961],
			["Сломанная лампа", -21149, -44216],
			["Сломанная лампа", -21413, -44694],
			["Сломанная лампа", -14161, -43375],
			["Сломанная лампа", -13673, -43652],
			["Сломанная лампа", -55850, -61454],
			["Сломанная лампа", -55085, -60243],
			["Сломанная лампа", -48284, -49321],
			["Сломанная лампа", -51762, -46236],
			["Сломанная лампа", -59732, -85442],
			["Сломанная лампа", -41520, -69456],
			["Сломанная лампа", -63187, -129228],
			["Сломанная лампа", -47902, -117973],
			["Сломанная лампа", -61443, -100113],
			["Сломанная лампа", -48593, -100613],
			["Сломанная лампа", -70333, -103780],
			["Сломанная лампа", -103997, -123561],
			["Сломанная лампа", -149173, -58792],
			["Сломанная лампа", -149169, -57980],
			["Сломанная лампа", -147993, -57917],
			["Сломанная лампа", -147645, -58867],
			["Сломанная лампа", -147984, -57525],
			["Сломанная лампа", -147549, -56805],
			["Сломанная лампа", -159992, -74133],
			["Сломанная лампа", -152295, -74891],
			["Сломанная лампа", -151043, -74884],
			["Сломанная лампа", -152275, -73254],
			["Сломанная лампа", -151190, -71932],
			["Сломанная лампа", 167312, -22019],
			["Сломанная лампа", 165263, -7330],
			["Сломанная лампа", 149390, -51481],
			["Сломанная лампа", 183512, -92321],
			["Сломанная лампа", 127831, -31539],
			["Сломанная лампа", 128604, -30939],
			["Сломанная лампа", 74260, -11686],
			["Сломанная лампа", 69870, -7694],
			["Сломанная лампа", 48007, -22314],
			["Сломанная лампа", 108239, -54677],
			["Сломанная лампа", 113812, -55774],
			["Сломанная лампа", 32965, -40649],
			["Сломанная лампа", 34648, -36914],
			["Сломанная лампа", 39006, -38267],
			["Сломанная лампа", 30947, -33520],
			["Сломанная лампа", 75218, -76770],
			["Сломанная лампа", 46213, -66135],
			["Сломанная лампа", 19319, -104531],
			["Сломанная лампа", -109037, -134803],
			["Сломанная лампа", -8521, -165432],
			["Сломанная лампа", -62643, -170705],
			["Сломанная лампа", -76756, -176239],
			["Сломанная лампа", -134261, -153812],
			["Сломанная лампа", -138140, -180836],
			["Сломанная лампа", -136795, -176960],
			["Сломанная лампа", 115475, -158157],
			["Сломанная лампа", 74550, -177202],
			["Сломанная лампа", -55065, 192004],
			["Сломанная лампа", -87655, 183928],
			["Сломанная лампа", -91095, 185502],
			["Сломанная лампа", -89395, 185595],
			["Сломанная лампа", -1392, 157992],
			["Сломанная лампа", -63741, 131303],
			["Сломанная лампа", -41244, 161799],
			["Сломанная лампа", 179438, 133979],
			["Сломанная лампа", 125108, 169208],
			["Сломанная лампа", 48750, 190968],
			["Сломанная лампа", 1572, 165224],
			["Сломанная лампа", 85963, 152567],
			["Сломанная лампа", 87923, 156838],
			["Сломанная лампа", 43033, 163441],
			["Сломанная лампа", 45705, 161586],
			["Сломанная лампа", 27362, 133668],
			["Сломанная лампа", 27882, 133222],
			["Сломанная лампа", 8764, 161610],
			["Сломанная лампа", -129327, 119823],
			["Сломанная лампа", -128854, 119969],
			["Сломанная лампа", -104506, 123612],
			["Сломанная лампа", -41113, 87701],
			["Сломанная лампа", -90860, 65386],
			["Сломанная лампа", -41891, 2813],
			["Сломанная лампа", -42662, 28671],
			["Сломанная лампа", -99268, 8087],
			["Сломанная лампа", 180284, 110696],
			["Сломанная лампа", 172849, 39750],
			["Сломанная лампа", 168147, 56864],
			["Сломанная лампа", 172009, 59226],
			["Сломанная лампа", 173653, 7713],
			["Сломанная лампа", 34204, 127366],
			["Сломанная лампа", 88610, 52923],
			["Сломанная лампа", 55139, 51736],
			["Сломанная лампа", 23536, 49083],
			["Сломанная лампа", 27828, 47167],
			["Сломанная лампа", 28517, 48897],
			["Сломанная лампа", 25700, 54969],
			["Сломанная лампа", 25232, 54926],
			["Сломанная лампа", 71089, 21668],
			["Сломанная лампа", 71339, 21692],
			["Сломанная лампа", 78155, 20769],
			["Сломанная лампа", 52330, 3648],
			["Сломанная лампа", 57503, 76]
			];
	for (var i = 0; i < hlam545.length; i++) {
				hlam_545 = new L.circleMarker([hlam545[i][1],hlam545[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam545[i][0])
					.bindTooltip(hlam545[i][0], {direction: 'top'})
					.addTo(hlam545icons);
			}
	}
	else {
		hlam545icons.clearLayers();
	}
}
var hlam546icons = L.layerGroup().addTo(map);
function Hlam546OnOff() {
	var chbox546;
	chbox546=document.getElementById('Hlam546Button');
	if (chbox546.checked) {
		var hlam546 = [
			["Сломанная фотокамера &quotПро-Щелк&quot", -151115, -74362],
			["Сломанная фотокамера &quotПро-Щелк&quot", 183529, -67451],
			["Сломанная фотокамера &quotПро-Щелк&quot", -95280, -176185],
			["Сломанная фотокамера &quotПро-Щелк&quot", 135528, -156432],
			["Сломанная фотокамера &quotПро-Щелк&quot", 108213, -153686],
			["Сломанная фотокамера &quotПро-Щелк&quot", -90649, 149876],
			["Сломанная фотокамера &quotПро-Щелк&quot", -81470, 46806],
			["Сломанная фотокамера &quotПро-Щелк&quot", -104046, 38666],
			["Сломанная фотокамера &quotПро-Щелк&quot", -142692, 33362],
			["Сломанная фотокамера &quotПро-Щелк&quot", 131093, 112180],
			["Сломанная фотокамера &quotПро-Щелк&quot", 193726, 58022],
			["Сломанная фотокамера &quotПро-Щелк&quot", 190818, 31035],
			["Сломанная фотокамера &quotПро-Щелк&quot", 29177, 129629],
			["Сломанная фотокамера &quotПро-Щелк&quot", 53491, 65374]
			];
	for (var i = 0; i < hlam546.length; i++) {
				hlam_546 = new L.circleMarker([hlam546[i][1],hlam546[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam546[i][0])
					.bindTooltip(hlam546[i][0], {direction: 'top'})
					.addTo(hlam546icons);
			}
	}
	else {
		hlam546icons.clearLayers();
	}
}
var hlam547icons = L.layerGroup().addTo(map);
function Hlam547OnOff() {
	var chbox547;
	chbox547=document.getElementById('Hlam547Button');
	if (chbox547.checked) {
		var hlam547 = [
			["Сломанный садовый гном", -160167, -92527],
			["Сломанный садовый гном", 81751, -1595],
			["Сломанный садовый гном", 5978, -33039],
			["Сломанный садовый гном", 58843, -77002],
			["Сломанный садовый гном", 867, -86663],
			["Сломанный садовый гном", 101592, -98831],
			["Сломанный садовый гном", 23243, -124114],
			["Сломанный садовый гном", 22487, -124713],
			["Сломанный садовый гном", 17978, -119684],
			["Сломанный садовый гном", -154127, -168057],
			["Сломанный садовый гном", -154120, -168088],
			["Сломанный садовый гном", -152387, -166444],
			["Сломанный садовый гном", 10835, 160923],
			["Сломанный садовый гном", -25687, 98958],
			["Сломанный садовый гном", -36546, 120730],
			["Сломанный садовый гном", -95636, 124342],
			["Сломанный садовый гном", -6495, 93223],
			["Сломанный садовый гном", -49205, 86331],
			["Сломанный садовый гном", -92359, 65955],
			["Сломанный садовый гном", -92299, 65957],
			["Сломанный садовый гном", 138699, 86249],
			["Сломанный садовый гном", 52886, 100465],
			["Сломанный садовый гном", 129167, 87030],
			["Сломанный садовый гном", 64896, 77006],
			["Сломанный садовый гном", 20757, 89892],
			["Сломанный садовый гном", 84223, 55327],
			["Сломанный садовый гном", 84158, 55503],
			["Сломанный садовый гном", 23834, 15136],
			["Сломанный садовый гном", 30005, 15159]
			];
	for (var i = 0; i < hlam547.length; i++) {
				hlam_547 = new L.circleMarker([hlam547[i][1],hlam547[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam547[i][0])
					.bindTooltip(hlam547[i][0], {direction: 'top'})
					.addTo(hlam547icons);
			}
	}
	else {
		hlam547icons.clearLayers();
	}
}
var hlam548icons = L.layerGroup().addTo(map);
function Hlam548OnOff() {
	var chbox548;
	chbox548=document.getElementById('Hlam548Button');
	if (chbox548.checked) {
		var hlam548 = [

			];
	for (var i = 0; i < hlam548.length; i++) {
				hlam_548 = new L.circleMarker([hlam548[i][1],hlam548[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam548[i][0])
					.bindTooltip(hlam548[i][0], {direction: 'top'})
					.addTo(hlam548icons);
			}
	}
	else {
		hlam548icons.clearLayers();
	}
}
var hlam549icons = L.layerGroup().addTo(map);
function Hlam549OnOff() {
	var chbox549;
	chbox549=document.getElementById('Hlam549Button');
	if (chbox549.checked) {
		var hlam549 = [
			["Смазочно-охлаждающая жидкость", -43390, -6558],
			["Смазочно-охлаждающая жидкость", -76214, -69468],
			["Смазочно-охлаждающая жидкость", 142460, -59542],
			["Смазочно-охлаждающая жидкость", 52079, -149181]
			];
	for (var i = 0; i < hlam549.length; i++) {
				hlam_549 = new L.circleMarker([hlam549[i][1],hlam549[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam549[i][0])
					.bindTooltip(hlam549[i][0], {direction: 'top'})
					.addTo(hlam549icons);
			}
	}
	else {
		hlam549icons.clearLayers();
	}
}
var hlam550icons = L.layerGroup().addTo(map);
function Hlam550OnOff() {
	var chbox550;
	chbox550=document.getElementById('Hlam550Button');
	if (chbox550.checked) {
		var hlam550 = [
			["Смычок", -75330, 89521]
			];
	for (var i = 0; i < hlam550.length; i++) {
				hlam_550 = new L.circleMarker([hlam550[i][1],hlam550[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam550[i][0])
					.bindTooltip(hlam550[i][0], {direction: 'top'})
					.addTo(hlam550icons);
			}
	}
	else {
		hlam550icons.clearLayers();
	}
}
var hlam551icons = L.layerGroup().addTo(map);
function Hlam551OnOff() {
	var chbox551;
	chbox551=document.getElementById('Hlam551Button');
	if (chbox551.checked) {
		var hlam551 = [
			["Собачья миска", -1967, -5226],
			["Собачья миска", -17311, -46472],
			["Собачья миска", -20703, -44222],
			["Собачья миска", -38373, -59329],
			["Собачья миска", -52145, -46609],
			["Собачья миска", -47160, -72967],
			["Собачья миска", -63599, -103088],
			["Собачья миска", -61481, -100696],
			["Собачья миска", -147877, -57439],
			["Собачья миска", -151110, -74974],
			["Собачья миска", 197229, -23257],
			["Собачья миска", 143261, -58742],
			["Собачья миска", 153117, -46943],
			["Собачья миска", 160203, -92400],
			["Собачья миска", 150058, -66978],
			["Собачья миска", 181263, -123263],
			["Собачья миска", 77020, -17704],
			["Собачья миска", 81818, -18987],
			["Собачья миска", 28735, -31143],
			["Собачья миска", 31970, -21640],
			["Собачья миска", 107814, -54590],
			["Собачья миска", 92438, -58545],
			["Собачья миска", 50331, -43878],
			["Собачья миска", 50324, -44429],
			["Собачья миска", 32832, -33912],
			["Собачья миска", 33895, -32800],
			["Собачья миска", 68570, -88409],
			["Собачья миска", 60836, -96271],
			["Собачья миска", 59475, -84151],
			["Собачья миска", -8326, -165145],
			["Собачья миска", -133960, -153936],
			["Собачья миска", -138115, -180391],
			["Собачья миска", -134703, -184243],
			["Собачья миска", 132062, -132808],
			["Собачья миска", -69083, 171583],
			["Собачья миска", -90389, 149109],
			["Собачья миска", -90186, 149099],
			["Собачья миска", -138361, 152553],
			["Собачья миска", 193985, 167489],
			["Собачья миска", 178785, 134187],
			["Собачья миска", 68501, 202741],
			["Собачья миска", 60186, 173353],
			["Собачья миска", 5831, 180033],
			["Собачья миска", 88344, 158732],
			["Собачья миска", 45424, 161501],
			["Собачья миска", 2911, 158363],
			["Собачья миска", -69620, 110870],
			["Собачья миска", -39123, 84726],
			["Собачья миска", -85050, 66191],
			["Собачья миска", -20427, 59949],
			["Собачья миска", -119015, 40025],
			["Собачья миска", -99646, 39761],
			["Собачья миска", -123553, 51065],
			["Собачья миска", -42120, 2579],
			["Собачья миска", -148621, 112450],
			["Собачья миска", -164246, 122576],
			["Собачья миска", 143958, 98598],
			["Собачья миска", 133352, 126848],
			["Собачья миска", 186297, 14152],
			["Собачья миска", 39505, 115421],
			["Собачья миска", 36267, 128100],
			["Собачья миска", 35446, 128847],
			["Собачья миска", 111556, 55989],
			["Собачья миска", 23241, 44308],
			["Собачья миска", 27210, 50080],
			["Собачья миска", 101621, 3515],
			["Собачья миска", 101052, 7806],
			["Собачья миска", 78444, 11],
			["Собачья миска", 84571, 323]
			];
	for (var i = 0; i < hlam551.length; i++) {
				hlam_551 = new L.circleMarker([hlam551[i][1],hlam551[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam551[i][0])
					.bindTooltip(hlam551[i][0], {direction: 'top'})
					.addTo(hlam551icons);
			}
	}
	else {
		hlam551icons.clearLayers();
	}
}
var hlam552icons = L.layerGroup().addTo(map);
function Hlam552OnOff() {
	var chbox552;
	chbox552=document.getElementById('Hlam552Button');
	if (chbox552.checked) {
		var hlam552 = [
			["Соединительный прут", -82170, -29679],
			["Соединительный прут", -84270, -29019],
			["Соединительный прут", -83915, -29172],
			["Соединительный прут", -83141, -29783],
			["Соединительный прут", -82956, -29037],
			["Соединительный прут", -4041, -41820],
			["Соединительный прут", -37728, -58639],
			["Соединительный прут", -92058, -51672],
			["Соединительный прут", -29685, -94081],
			["Соединительный прут", -34119, -85074],
			["Соединительный прут", -47035, -72189],
			["Соединительный прут", -47134, -72610],
			["Соединительный прут", -46700, -72909],
			["Соединительный прут", -117467, -103447],
			["Соединительный прут", -117070, -103409],
			["Соединительный прут", -148245, -57604],
			["Соединительный прут", -163107, -55171],
			["Соединительный прут", -146480, -95903],
			["Соединительный прут", -146523, -95960],
			["Соединительный прут", 142363, -59732],
			["Соединительный прут", 128831, -28579],
			["Соединительный прут", 130120, -27499],
			["Соединительный прут", 90421, -30417],
			["Соединительный прут", 81934, -21217],
			["Соединительный прут", 48094, -22181],
			["Соединительный прут", 111642, -56065],
			["Соединительный прут", 111280, -55543],
			["Соединительный прут", 61878, -57238],
			["Соединительный прут", 34835, -48745],
			["Соединительный прут", 29266, -58611],
			["Соединительный прут", 29258, -58625],
			["Соединительный прут", 39640, -96812],
			["Соединительный прут", 56672, -94611],
			["Соединительный прут", 56664, -94623],
			["Соединительный прут", 22720, -101800],
			["Соединительный прут", 22705, -101863],
			["Соединительный прут", -6749, -161775],
			["Соединительный прут", -126565, -134106],
			["Соединительный прут", -42896, -173534],
			["Соединительный прут", -43526, -173428],
			["Соединительный прут", -43254, -173722],
			["Соединительный прут", -43733, -173833],
			["Соединительный прут", -82581, -178087],
			["Соединительный прут", -81822, -178086],
			["Соединительный прут", -81768, -178409],
			["Соединительный прут", -146158, -143271],
			["Соединительный прут", 191732, -169371],
			["Соединительный прут", 189297, -164732],
			["Соединительный прут", -79716, 180158],
			["Соединительный прут", -96928, 184386],
			["Соединительный прут", -94081, 190630],
			["Соединительный прут", -143557, 172044],
			["Соединительный прут", -145699, 177138],
			["Соединительный прут", -171777, 147509],
			["Соединительный прут", 15499, 197678],
			["Соединительный прут", 93685, 189010],
			["Соединительный прут", 19356, 134961],
			["Соединительный прут", -12651, 116489],
			["Соединительный прут", -38549, 83454],
			["Соединительный прут", -25315, 47464],
			["Соединительный прут", -48936, 54446],
			["Соединительный прут", -46392, 28494],
			["Соединительный прут", -138282, 88056],
			["Соединительный прут", 181469, 111629],
			["Соединительный прут", 183844, 2550],
			["Соединительный прут", 25687, 71322],
			["Соединительный прут", 120280, 5368]
			];
	for (var i = 0; i < hlam552.length; i++) {
				hlam_552 = new L.circleMarker([hlam552[i][1],hlam552[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam552[i][0])
					.bindTooltip(hlam552[i][0], {direction: 'top'})
					.addTo(hlam552icons);
			}
	}
	else {
		hlam552icons.clearLayers();
	}
}
var hlam553icons = L.layerGroup().addTo(map);
function Hlam553OnOff() {
	var chbox553;
	chbox553=document.getElementById('Hlam553Button');
	if (chbox553.checked) {
		var hlam553 = [
			["Солонка", -50694, -12444],
			["Солонка", -72284, -98427],
			["Солонка", 89814, -57109],
			["Солонка", -115720, -136919],
			["Солонка", -34780, 172704],
			["Солонка", -60774, 181069],
			["Солонка", -160288, 152548],
			["Солонка", 151539, 136932],
			["Солонка", 150697, 136181],
			["Солонка", 150926, 135501],
			["Солонка", 151675, 138765],
			["Солонка", 152254, 137063],
			["Солонка", 151937, 136359],
			["Солонка", 2676, 137902],
			["Солонка", -18061, 60051],
			["Солонка", -39689, 44557],
			["Солонка", -98515, 8214],
			["Солонка", 94968, 98748],
			["Солонка", 14240, 39753],
			["Солонка", 14825, 39680],
			["Солонка", 14495, 48639],
			["Солонка", -61152, 181544]
			];
	for (var i = 0; i < hlam553.length; i++) {
				hlam_553 = new L.circleMarker([hlam553[i][1],hlam553[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam553[i][0])
					.bindTooltip(hlam553[i][0], {direction: 'top'})
					.addTo(hlam553icons);
			}
	}
	else {
		hlam553icons.clearLayers();
	}
}
var hlam554icons = L.layerGroup().addTo(map);
function Hlam554OnOff() {
	var chbox554;
	chbox554=document.getElementById('Hlam554Button');
	if (chbox554.checked) {
		var hlam554 = [
			["Спасательный круг", -54726, -11355],
			["Спасательный круг", -54737, -11425],
			["Спасательный круг", -29141, -60115],
			["Спасательный круг", -28232, -59715],
			["Спасательный круг", -28600, -60772],
			["Спасательный круг", -25623, -57787],
			["Спасательный круг", -25457, -57329],
			["Спасательный круг", -48580, -70338],
			["Спасательный круг", -45057, -69928],
			["Спасательный круг", -45201, -70113],
			["Спасательный круг", -46979, -70382],
			["Спасательный круг", -47184, -70025],
			["Спасательный круг", -45959, -70615],
			["Спасательный круг", -47947, -70149],
			["Спасательный круг", -44161, -71428],
			["Спасательный круг", -42581, -70535],
			["Спасательный круг", -52580, -66025],
			["Спасательный круг", -52457, -65749],
			["Спасательный круг", -52593, -66194],
			["Спасательный круг", -47584, -69481],
			["Спасательный круг", -42570, -69201],
			["Спасательный круг", -42313, -68823],
			["Спасательный круг", -44960, -67147],
			["Спасательный круг", -120585, -112399],
			["Спасательный круг", 197467, -31480],
			["Спасательный круг", 197935, -28357],
			["Спасательный круг", 197782, -27029],
			["Спасательный круг", 196503, -32396],
			["Спасательный круг", 190722, -25864],
			["Спасательный круг", 190686, -28496],
			["Спасательный круг", 194382, -26037],
			["Спасательный круг", 189931, -17108],
			["Спасательный круг", 170743, -868],
			["Спасательный круг", 197915, -33406],
			["Спасательный круг", 158203, -128072],
			["Спасательный круг", 157074, -128788],
			["Спасательный круг", 88229, -21218],
			["Спасательный круг", 14036, -77377],
			["Спасательный круг", 13631, -74737],
			["Спасательный круг", 15004, -75839],
			["Спасательный круг", 28301, -102625],
			["Спасательный круг", 28305, -102621],
			["Спасательный круг", 28292, -102633],
			["Спасательный круг", 27475, -101483],
			["Спасательный круг", -51525, -132385],
			["Спасательный круг", -32585, -187334],
			["Спасательный круг", -32587, -187337],
			["Спасательный круг", -30473, -188111],
			["Спасательный круг", -30231, -188285],
			["Спасательный круг", -31608, -188140],
			["Спасательный круг", -31518, -188217],
			["Спасательный круг", -31681, -187621],
			["Спасательный круг", -26100, -185361],
			["Спасательный круг", -26944, -184955],
			["Спасательный круг", -24395, -186693],
			["Спасательный круг", -7470, -171721],
			["Спасательный круг", -5882, -171271],
			["Спасательный круг", -32807, -187158],
			["Спасательный круг", -32838, -187149],
			["Спасательный круг", -32817, -187156],
			["Спасательный круг", -33286, -187681],
			["Спасательный круг", -43886, -176897],
			["Спасательный круг", -85275, -181505],
			["Спасательный круг", 145393, -156779],
			["Спасательный круг", 95183, -163301],
			["Спасательный круг", 129718, -170074],
			["Спасательный круг", 129672, -169796],
			["Спасательный круг", 95072, -163982],
			["Спасательный круг", 64945, -177962],
			["Спасательный круг", 370, -166639],
			["Спасательный круг", -4176, 184410],
			["Спасательный круг", 14336, 196359],
			["Спасательный круг", 105089, 156790],
			["Спасательный круг", 49760, 162391],
			["Спасательный круг", -13793, 79674],
			["Спасательный круг", -89783, 82857],
			["Спасательный круг", -153072, 49491],
			["Спасательный круг", 183492, 112115],
			["Спасательный круг", 137465, 4875],
			["Спасательный круг", 106723, 51371],
			["Спасательный круг", 128020, 265],
			["Спасательный круг", 59615, 11526],
			["Спасательный круг", 59222, 11414],
			["Спасательный круг", 58996, 11708],
			["Спасательный круг", 58675, 11471],
			["Спасательный круг", 58673, 11472],
			["Спасательный круг", 58665, 11464],
			["Спасательный круг", 58737, 11404]
			];
	for (var i = 0; i < hlam554.length; i++) {
				hlam_554 = new L.circleMarker([hlam554[i][1],hlam554[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam554[i][0])
					.bindTooltip(hlam554[i][0], {direction: 'top'})
					.addTo(hlam554icons);
			}
	}
	else {
		hlam554icons.clearLayers();
	}
}
var hlam555icons = L.layerGroup().addTo(map);
function Hlam555OnOff() {
	var chbox555;
	chbox555=document.getElementById('Hlam555Button');
	if (chbox555.checked) {
		var hlam555 = [
			["Спущенный мяч", -3705, -129014],
			["Спущенный мяч", 142882, -58384],
			["Спущенный мяч", 198056, -127111],
			["Спущенный мяч", 36023, -35162],
			["Спущенный мяч", -2588, -159662],
			["Спущенный мяч", -1544, -164406],
			["Спущенный мяч", -42179, -172866],
			["Спущенный мяч", -140826, 178643],
			["Спущенный мяч", -142706, 176898],
			["Спущенный мяч", -142278, 176331],
			["Спущенный мяч", -144701, 149475],
			["Спущенный мяч", 14529, 193901],
			["Спущенный мяч", 85338, 151809],
			["Спущенный мяч", 121734, 118145],
			["Спущенный мяч", 58172, 10714],
			["Спущенный мяч", 58829, 9330],
			["Спущенный мяч", 58011, 13992]
			];
	for (var i = 0; i < hlam555.length; i++) {
				hlam_555 = new L.circleMarker([hlam555[i][1],hlam555[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam555[i][0])
					.bindTooltip(hlam555[i][0], {direction: 'top'})
					.addTo(hlam555icons);
			}
	}
	else {
		hlam555icons.clearLayers();
	}
}
var hlam556icons = L.layerGroup().addTo(map);
function Hlam556OnOff() {
	var chbox556;
	chbox556=document.getElementById('Hlam556Button');
	if (chbox556.checked) {
		var hlam556 = [
			["Стакан", -50916, -13888],
			["Стакан", -50905, -13896],
			["Стакан", -50843, -13980],
			["Стакан", -50749, -13785],
			["Стакан", -50862, -13602],
			["Стакан", -50725, -13033],
			["Стакан", -50439, -13702],
			["Стакан", -50447, -13627],
			["Стакан", -50868, -14188],
			["Стакан", -51057, -13089],
			["Стакан", -52064, -13897],
			["Стакан", -53106, -6335],
			["Стакан", -42833, -5849],
			["Стакан", -42724, -5928],
			["Стакан", -40848, -2433],
			["Стакан", 101326, -12021],
			["Стакан", 101893, -11723],
			["Стакан", 18953, -106890],
			["Стакан", 18817, -106899],
			["Стакан", 19452, -107084],
			["Стакан", 19000, -106965],
			["Стакан", 18661, -107158],
			["Стакан", 18117, -107125],
			["Стакан", 18664, -106784],
			["Стакан", -145271, 139879],
			["Стакан", -37870, 2849],
			["Стакан", -38755, 2898],
			["Стакан", -38132, 3171],
			["Стакан", -54863, 5613],
			["Стакан", -54881, 5666],
			["Стакан", -39803, 5489],
			["Стакан", -40159, 6431],
			["Стакан", 94163, 103025],
			["Стакан", 94346, 104097],
			["Стакан", 94706, 104011],
			["Стакан", 95099, 103951],
			["Стакан", -51891, -14321]
			];
	for (var i = 0; i < hlam556.length; i++) {
				hlam_556 = new L.circleMarker([hlam556[i][1],hlam556[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam556[i][0])
					.bindTooltip(hlam556[i][0], {direction: 'top'})
					.addTo(hlam556icons);
			}
	}
	else {
		hlam556icons.clearLayers();
	}
}
var hlam557icons = L.layerGroup().addTo(map);
function Hlam557OnOff() {
	var chbox557;
	chbox557=document.getElementById('Hlam557Button');
	if (chbox557.checked) {
		var hlam557 = [
			["Стаканчик для Ядер-колы", -55063, -12591],
			["Стаканчик для Ядер-колы", -55049, -12598],
			["Стаканчик для Ядер-колы", -55274, -12309],
			["Стаканчик для Ядер-колы", -55001, -12480],
			["Стаканчик для Ядер-колы", -50259, -14686],
			["Стаканчик для Ядер-колы", -50250, -14666],
			["Стаканчик для Ядер-колы", -50287, -14668],
			["Стаканчик для Ядер-колы", -50237, -14651],
			["Стаканчик для Ядер-колы", -51827, -13140],
			["Стаканчик для Ядер-колы", -51900, -12985],
			["Стаканчик для Ядер-колы", -51892, -12989],
			["Стаканчик для Ядер-колы", -51925, -13038],
			["Стаканчик для Ядер-колы", -49527, -14283],
			["Стаканчик для Ядер-колы", -49516, -14264],
			["Стаканчик для Ядер-колы", -52682, -13791],
			["Стаканчик для Ядер-колы", -52596, -13913],
			["Стаканчик для Ядер-колы", -56389, -11184],
			["Стаканчик для Ядер-колы", -54909, -11641],
			["Стаканчик для Ядер-колы", -54928, -11708],
			["Стаканчик для Ядер-колы", -54793, -11868],
			["Стаканчик для Ядер-колы", -55852, -10250],
			["Стаканчик для Ядер-колы", -55838, -10257],
			["Стаканчик для Ядер-колы", -56419, -10572],
			["Стаканчик для Ядер-колы", -56852, -11205],
			["Стаканчик для Ядер-колы", -56310, -10973],
			["Стаканчик для Ядер-колы", -56015, -10852],
			["Стаканчик для Ядер-колы", -54893, -9609],
			["Стаканчик для Ядер-колы", -54864, -9614],
			["Стаканчик для Ядер-колы", -53381, -10806],
			["Стаканчик для Ядер-колы", -53285, -10856],
			["Стаканчик для Ядер-колы", -53422, -10891],
			["Стаканчик для Ядер-колы", -55592, -11479],
			["Стаканчик для Ядер-колы", -54980, -11088],
			["Стаканчик для Ядер-колы", -54892, -10836],
			["Стаканчик для Ядер-колы", -54872, -10843],
			["Стаканчик для Ядер-колы", -50358, -9750],
			["Стаканчик для Ядер-колы", -50347, -9731],
			["Стаканчик для Ядер-колы", -50404, -10521],
			["Стаканчик для Ядер-колы", -50376, -9500],
			["Стаканчик для Ядер-колы", -53182, -11871],
			["Стаканчик для Ядер-колы", -53171, -11852],
			["Стаканчик для Ядер-колы", -51960, -244],
			["Стаканчик для Ядер-колы", -51841, -185],
			["Стаканчик для Ядер-колы", -34081, -1822],
			["Стаканчик для Ядер-колы", -34108, -1855],
			["Стаканчик для Ядер-колы", -34076, -1858],
			["Стаканчик для Ядер-колы", -34114, -1858],
			["Стаканчик для Ядер-колы", -34088, -1883],
			["Стаканчик для Ядер-колы", -55848, -60783],
			["Стаканчик для Ядер-колы", -55845, -60797],
			["Стаканчик для Ядер-колы", -55746, -60680],
			["Стаканчик для Ядер-колы", -52280, -46489],
			["Стаканчик для Ядер-колы", -51690, -46481],
			["Стаканчик для Ядер-колы", -91328, -43537],
			["Стаканчик для Ядер-колы", -91363, -42848],
			["Стаканчик для Ядер-колы", -91303, -42300],
			["Стаканчик для Ядер-колы", -90958, -42511],
			["Стаканчик для Ядер-колы", -89325, -41510],
			["Стаканчик для Ядер-колы", -109460, -59596],
			["Стаканчик для Ядер-колы", -109386, -59653],
			["Стаканчик для Ядер-колы", -109220, -59603],
			["Стаканчик для Ядер-колы", -109247, -59739],
			["Стаканчик для Ядер-колы", -108916, -60045],
			["Стаканчик для Ядер-колы", -108349, -58971],
			["Стаканчик для Ядер-колы", -109001, -59744],
			["Стаканчик для Ядер-колы", -108705, -59773],
			["Стаканчик для Ядер-колы", -108469, -59390],
			["Стаканчик для Ядер-колы", -108637, -59446],
			["Стаканчик для Ядер-колы", -108382, -59509],
			["Стаканчик для Ядер-колы", -108836, -59318],
			["Стаканчик для Ядер-колы", -108826, -59331],
			["Стаканчик для Ядер-колы", -108691, -60058],
			["Стаканчик для Ядер-колы", -108383, -59782],
			["Стаканчик для Ядер-колы", -108252, -59973],
			["Стаканчик для Ядер-колы", -108075, -59791],
			["Стаканчик для Ядер-колы", -107781, -59241],
			["Стаканчик для Ядер-колы", -114525, -47336],
			["Стаканчик для Ядер-колы", -113912, -47468],
			["Стаканчик для Ядер-колы", -32216, -129903],
			["Стаканчик для Ядер-колы", -81196, -110403],
			["Стаканчик для Ядер-колы", -147913, -59193],
			["Стаканчик для Ядер-колы", -148681, -55991],
			["Стаканчик для Ядер-колы", -152042, -74656],
			["Стаканчик для Ядер-колы", -151658, -71822],
			["Стаканчик для Ядер-колы", -151089, -72011],
			["Стаканчик для Ядер-колы", 197469, -31781],
			["Стаканчик для Ядер-колы", 199253, -29704],
			["Стаканчик для Ядер-колы", 199203, -29688],
			["Стаканчик для Ядер-колы", 199226, -29691],
			["Стаканчик для Ядер-колы", 198059, -26904],
			["Стаканчик для Ядер-колы", 192380, -29520],
			["Стаканчик для Ядер-колы", 192171, -29080],
			["Стаканчик для Ядер-колы", 191112, -30878],
			["Стаканчик для Ядер-колы", 190651, -31201],
			["Стаканчик для Ядер-колы", 191290, -30481],
			["Стаканчик для Ядер-колы", 190952, -31704],
			["Стаканчик для Ядер-колы", 196403, -31943],
			["Стаканчик для Ядер-колы", 195809, -31444],
			["Стаканчик для Ядер-колы", 192590, -29503],
			["Стаканчик для Ядер-колы", 193554, -29571],
			["Стаканчик для Ядер-колы", 192072, -28480],
			["Стаканчик для Ядер-колы", 191211, -34265],
			["Стаканчик для Ядер-колы", 101662, -30805],
			["Стаканчик для Ядер-колы", 88437, -21071],
			["Стаканчик для Ядер-колы", 75732, -18252],
			["Стаканчик для Ядер-колы", 18113, -843],
			["Стаканчик для Ядер-колы", 18513, -1705],
			["Стаканчик для Ядер-колы", 17937, -1025],
			["Стаканчик для Ядер-колы", 18239, -1012],
			["Стаканчик для Ядер-колы", 18177, -1008],
			["Стаканчик для Ядер-колы", 17738, -1467],
			["Стаканчик для Ядер-колы", 115590, -63284],
			["Стаканчик для Ядер-колы", 10106, -52434],
			["Стаканчик для Ядер-колы", 10049, -52403],
			["Стаканчик для Ядер-колы", 13318, -78771],
			["Стаканчик для Ядер-колы", 13034, -79037],
			["Стаканчик для Ядер-колы", 13317, -79068],
			["Стаканчик для Ядер-колы", 36816, -119330],
			["Стаканчик для Ядер-колы", 27054, -102225],
			["Стаканчик для Ядер-колы", 27594, -101323],
			["Стаканчик для Ядер-колы", 27323, -100837],
			["Стаканчик для Ядер-колы", 28948, -100360],
			["Стаканчик для Ядер-колы", -27500, -131489],
			["Стаканчик для Ядер-колы", -79675, -180972],
			["Стаканчик для Ядер-колы", -79845, -180654],
			["Стаканчик для Ядер-колы", -79237, -180807],
			["Стаканчик для Ядер-колы", -77895, -181234],
			["Стаканчик для Ядер-колы", -78434, -180830],
			["Стаканчик для Ядер-колы", -77747, -180537],
			["Стаканчик для Ядер-колы", -77703, -180540],
			["Стаканчик для Ядер-колы", -77712, -181247],
			["Стаканчик для Ядер-колы", -76261, -180629],
			["Стаканчик для Ядер-колы", -76641, -181232],
			["Стаканчик для Ядер-колы", -76211, -181014],
			["Стаканчик для Ядер-колы", -79181, -178986],
			["Стаканчик для Ядер-колы", -78582, -179043],
			["Стаканчик для Ядер-колы", -78378, -179173],
			["Стаканчик для Ядер-колы", -78208, -178980],
			["Стаканчик для Ядер-колы", -78081, -178978],
			["Стаканчик для Ядер-колы", -78982, -179220],
			["Стаканчик для Ядер-колы", -78663, -179294],
			["Стаканчик для Ядер-колы", -74866, -178806],
			["Стаканчик для Ядер-колы", -74667, -179504],
			["Стаканчик для Ядер-колы", -73969, -179799],
			["Стаканчик для Ядер-колы", -74051, -179415],
			["Стаканчик для Ядер-колы", -76064, -177964],
			["Стаканчик для Ядер-колы", -76107, -177042],
			["Стаканчик для Ядер-колы", -76981, -176906],
			["Стаканчик для Ядер-колы", -73643, -179153],
			["Стаканчик для Ядер-колы", -73715, -179200],
			["Стаканчик для Ядер-колы", 140577, -157633],
			["Стаканчик для Ядер-колы", 140685, -157675],
			["Стаканчик для Ядер-колы", 140541, -158032],
			["Стаканчик для Ядер-колы", 140390, -158495],
			["Стаканчик для Ядер-колы", 140385, -158091],
			["Стаканчик для Ядер-колы", 140324, -157854],
			["Стаканчик для Ядер-колы", 140120, -157973],
			["Стаканчик для Ядер-колы", 140092, -158597],
			["Стаканчик для Ядер-колы", 140032, -158827],
			["Стаканчик для Ядер-колы", 138041, -147487],
			["Стаканчик для Ядер-колы", 137961, -148269],
			["Стаканчик для Ядер-колы", 138083, -148221],
			["Стаканчик для Ядер-колы", 138859, -147728],
			["Стаканчик для Ядер-колы", 138993, -147741],
			["Стаканчик для Ядер-колы", 143232, -149663],
			["Стаканчик для Ядер-колы", 143034, -149294],
			["Стаканчик для Ядер-колы", 142270, -147634],
			["Стаканчик для Ядер-колы", 142511, -148004],
			["Стаканчик для Ядер-колы", 142833, -148422],
			["Стаканчик для Ядер-колы", 143008, -148921],
			["Стаканчик для Ядер-колы", 142642, -148688],
			["Стаканчик для Ядер-колы", 142179, -148442],
			["Стаканчик для Ядер-колы", 143145, -147668],
			["Стаканчик для Ядер-колы", 141715, -149598],
			["Стаканчик для Ядер-колы", 141782, -149413],
			["Стаканчик для Ядер-колы", 142373, -149935],
			["Стаканчик для Ядер-колы", 142675, -149665],
			["Стаканчик для Ядер-колы", 139989, -149278],
			["Стаканчик для Ядер-колы", 140301, -148961],
			["Стаканчик для Ядер-колы", 140722, -149474],
			["Стаканчик для Ядер-колы", 140974, -149245],
			["Стаканчик для Ядер-колы", 142147, -149344],
			["Стаканчик для Ядер-колы", 141866, -149646],
			["Стаканчик для Ядер-колы", 141169, -149292],
			["Стаканчик для Ядер-колы", 141153, -149451],
			["Стаканчик для Ядер-колы", 143166, -147663],
			["Стаканчик для Ядер-колы", 142663, -147585],
			["Стаканчик для Ядер-колы", 142807, -147530],
			["Стаканчик для Ядер-колы", 142401, -147510],
			["Стаканчик для Ядер-колы", 140318, -147462],
			["Стаканчик для Ядер-колы", 140656, -147910],
			["Стаканчик для Ядер-колы", 141007, -147608],
			["Стаканчик для Ядер-колы", 140690, -148157],
			["Стаканчик для Ядер-колы", 140734, -148340],
			["Стаканчик для Ядер-колы", 140713, -148642],
			["Стаканчик для Ядер-колы", 140632, -148438],
			["Стаканчик для Ядер-колы", 140910, -147880],
			["Стаканчик для Ядер-колы", 140856, -147700],
			["Стаканчик для Ядер-колы", 139671, -148168],
			["Стаканчик для Ядер-колы", 140275, -147643],
			["Стаканчик для Ядер-колы", 139710, -148004],
			["Стаканчик для Ядер-колы", 139735, -148875],
			["Стаканчик для Ядер-колы", 140053, -149007],
			["Стаканчик для Ядер-колы", 140142, -147722],
			["Стаканчик для Ядер-колы", 140196, -147901],
			["Стаканчик для Ядер-колы", 139839, -148533],
			["Стаканчик для Ядер-колы", 139919, -148460],
			["Стаканчик для Ядер-колы", 140015, -148666],
			["Стаканчик для Ядер-колы", 145871, -149911],
			["Стаканчик для Ядер-колы", 145835, -150249],
			["Стаканчик для Ядер-колы", 145097, -150606],
			["Стаканчик для Ядер-колы", 145611, -150667],
			["Стаканчик для Ядер-колы", 145271, -150697],
			["Стаканчик для Ядер-колы", 144781, -150039],
			["Стаканчик для Ядер-колы", 147066, -147527],
			["Стаканчик для Ядер-колы", 145639, -148247],
			["Стаканчик для Ядер-колы", 145871, -147467],
			["Стаканчик для Ядер-колы", 145386, -147934],
			["Стаканчик для Ядер-колы", 145574, -147964],
			["Стаканчик для Ядер-колы", 145297, -147856],
			["Стаканчик для Ядер-колы", 145616, -148598],
			["Стаканчик для Ядер-колы", 145629, -149172],
			["Стаканчик для Ядер-колы", 145460, -148268],
			["Стаканчик для Ядер-колы", 145714, -148527],
			["Стаканчик для Ядер-колы", 145478, -149316],
			["Стаканчик для Ядер-колы", 143471, -149164],
			["Стаканчик для Ядер-колы", 143631, -149408],
			["Стаканчик для Ядер-колы", 144176, -149215],
			["Стаканчик для Ядер-колы", 144159, -149616],
			["Стаканчик для Ядер-колы", 144480, -149447],
			["Стаканчик для Ядер-колы", 144070, -149469],
			["Стаканчик для Ядер-колы", 143507, -149279],
			["Стаканчик для Ядер-колы", 143665, -149470],
			["Стаканчик для Ядер-колы", 144713, -149504],
			["Стаканчик для Ядер-колы", 144235, -149555],
			["Стаканчик для Ядер-колы", 143716, -148152],
			["Стаканчик для Ядер-колы", 143524, -148023],
			["Стаканчик для Ядер-колы", 143446, -148134],
			["Стаканчик для Ядер-колы", 143943, -147985],
			["Стаканчик для Ядер-колы", 144368, -147893],
			["Стаканчик для Ядер-колы", 143589, -147765],
			["Стаканчик для Ядер-колы", 143689, -148979],
			["Стаканчик для Ядер-колы", 143567, -148534],
			["Стаканчик для Ядер-колы", 143716, -148766],
			["Стаканчик для Ядер-колы", 137646, -147340],
			["Стаканчик для Ядер-колы", 139046, -146765],
			["Стаканчик для Ядер-колы", 139315, -147088],
			["Стаканчик для Ядер-колы", 141197, -144544],
			["Стаканчик для Ядер-колы", 140988, -144354],
			["Стаканчик для Ядер-колы", 141034, -144598],
			["Стаканчик для Ядер-колы", 140839, -144555],
			["Стаканчик для Ядер-колы", 142022, -144706],
			["Стаканчик для Ядер-колы", 142185, -144567],
			["Стаканчик для Ядер-колы", 141964, -144450],
			["Стаканчик для Ядер-колы", 142246, -144403],
			["Стаканчик для Ядер-колы", 143263, -146186],
			["Стаканчик для Ядер-колы", 143254, -145972],
			["Стаканчик для Ядер-колы", 142775, -144736],
			["Стаканчик для Ядер-колы", 142944, -144605],
			["Стаканчик для Ядер-колы", 142685, -144632],
			["Стаканчик для Ядер-колы", 142961, -147098],
			["Стаканчик для Ядер-колы", 143280, -146837],
			["Стаканчик для Ядер-колы", 142241, -146807],
			["Стаканчик для Ядер-колы", 142213, -146748],
			["Стаканчик для Ядер-колы", 140296, -144960],
			["Стаканчик для Ядер-колы", 140105, -144949],
			["Стаканчик для Ядер-колы", 140294, -144617],
			["Стаканчик для Ядер-колы", 140627, -144948],
			["Стаканчик для Ядер-колы", 139921, -145497],
			["Стаканчик для Ядер-колы", 140075, -145534],
			["Стаканчик для Ядер-колы", 141450, -146202],
			["Стаканчик для Ядер-колы", 141680, -146545],
			["Стаканчик для Ядер-колы", 141168, -147076],
			["Стаканчик для Ядер-колы", 141233, -147100],
			["Стаканчик для Ядер-колы", 141806, -145092],
			["Стаканчик для Ядер-колы", 142110, -145381],
			["Стаканчик для Ядер-колы", 141675, -146034],
			["Стаканчик для Ядер-колы", 141785, -146066],
			["Стаканчик для Ядер-колы", 140239, -146857],
			["Стаканчик для Ядер-колы", 140117, -146812],
			["Стаканчик для Ядер-колы", 140711, -146298],
			["Стаканчик для Ядер-колы", 140489, -145937],
			["Стаканчик для Ядер-колы", 140031, -147423],
			["Стаканчик для Ядер-колы", 140003, -147195],
			["Стаканчик для Ядер-колы", 140475, -146711],
			["Стаканчик для Ядер-колы", 140449, -146567],
			["Стаканчик для Ядер-колы", 139941, -147412],
			["Стаканчик для Ядер-колы", 144097, -146857],
			["Стаканчик для Ядер-колы", 144285, -147187],
			["Стаканчик для Ядер-колы", 143883, -146323],
			["Стаканчик для Ядер-колы", 144052, -146723],
			["Стаканчик для Ядер-колы", 146078, -147172],
			["Стаканчик для Ядер-колы", 146426, -147036],
			["Стаканчик для Ядер-колы", 145614, -147190],
			["Стаканчик для Ядер-колы", 146085, -147250],
			["Стаканчик для Ядер-колы", 144479, -146713],
			["Стаканчик для Ядер-колы", 144597, -146716],
			["Стаканчик для Ядер-колы", 143525, -146215],
			["Стаканчик для Ядер-колы", 143447, -146016],
			["Стаканчик для Ядер-колы", 143730, -144785],
			["Стаканчик для Ядер-колы", 143740, -144999],
			["Стаканчик для Ядер-колы", 143925, -144829],
			["Стаканчик для Ядер-колы", 144003, -145029],
			["Стаканчик для Ядер-колы", 143856, -147297],
			["Стаканчик для Ядер-колы", 143870, -147224],
			["Стаканчик для Ядер-колы", -37627, 160025],
			["Стаканчик для Ядер-колы", -37636, 160021],
			["Стаканчик для Ядер-колы", -144383, 149457],
			["Стаканчик для Ядер-колы", 149585, 134785],
			["Стаканчик для Ядер-колы", 146892, 139865],
			["Стаканчик для Ядер-колы", 146949, 139886],
			["Стаканчик для Ядер-колы", 146872, 139889],
			["Стаканчик для Ядер-колы", 74996, 151292],
			["Стаканчик для Ядер-колы", 84278, 151938],
			["Стаканчик для Ядер-колы", 85998, 151870],
			["Стаканчик для Ядер-колы", 87686, 159197],
			["Стаканчик для Ядер-колы", 88052, 156865],
			["Стаканчик для Ядер-колы", -17901, 59246],
			["Стаканчик для Ядер-колы", -17856, 59338],
			["Стаканчик для Ядер-колы", -17818, 59310],
			["Стаканчик для Ядер-колы", -18233, 60237],
			["Стаканчик для Ядер-колы", -18208, 60252],
			["Стаканчик для Ядер-колы", -56961, 3666],
			["Стаканчик для Ядер-колы", -56933, 3669],
			["Стаканчик для Ядер-колы", -56973, 3665],
			["Стаканчик для Ядер-колы", -56979, 3672],
			["Стаканчик для Ядер-колы", -56961, 3666],
			["Стаканчик для Ядер-колы", -47299, 987],
			["Стаканчик для Ядер-колы", -47195, 2953],
			["Стаканчик для Ядер-колы", -46661, 1711],
			["Стаканчик для Ядер-колы", -46640, 1686],
			["Стаканчик для Ядер-колы", -46648, 1688],
			["Стаканчик для Ядер-колы", -46733, 1712],
			["Стаканчик для Ядер-колы", -41774, 3155],
			["Стаканчик для Ядер-колы", -56146, 4343],
			["Стаканчик для Ядер-колы", -56139, 4339],
			["Стаканчик для Ядер-колы", -49949, 6355],
			["Стаканчик для Ядер-колы", -49949, 6332],
			["Стаканчик для Ядер-колы", -44057, 8139],
			["Стаканчик для Ядер-колы", -43981, 8083],
			["Стаканчик для Ядер-колы", -43992, 8102],
			["Стаканчик для Ядер-колы", 183505, 3395],
			["Стаканчик для Ядер-колы", 136132, 17933],
			["Стаканчик для Ядер-колы", 25501, 54604],
			["Стаканчик для Ядер-колы", 26066, 54805],
			["Стаканчик для Ядер-колы", 25646, 55378],
			["Стаканчик для Ядер-колы", 25683, 55301],
			["Стаканчик для Ядер-колы", 25718, 55450],
			["Стаканчик для Ядер-колы", 25678, 55267],
			["Стаканчик для Ядер-колы", 25963, 55188],
			["Стаканчик для Ядер-колы", 26230, 55175],
			["Стаканчик для Ядер-колы", 26150, 54997],
			["Стаканчик для Ядер-колы", 26192, 54963],
			["Стаканчик для Ядер-колы", 26214, 54813],
			["Стаканчик для Ядер-колы", 58091, 9979],
			["Стаканчик для Ядер-колы", 57809, 13120],
			["Стаканчик для Ядер-колы", 57717, 13174]
			];
	for (var i = 0; i < hlam557.length; i++) {
				hlam_557 = new L.circleMarker([hlam557[i][1],hlam557[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam557[i][0])
					.bindTooltip(hlam557[i][0], {direction: 'top'})
					.addTo(hlam557icons);
			}
	}
	else {
		hlam557icons.clearLayers();
	}
}
var hlam558icons = L.layerGroup().addTo(map);
function Hlam558OnOff() {
	var chbox558;
	chbox558=document.getElementById('Hlam558Button');
	if (chbox558.checked) {
		var hlam558 = [
			["Стаканчик для Ядер-колы с соломинкой", -50258, -14622],
			["Стаканчик для Ядер-колы с соломинкой", -50268, -14656],
			["Стаканчик для Ядер-колы с соломинкой", -50255, -14664],
			["Стаканчик для Ядер-колы с соломинкой", -50265, -14633],
			["Стаканчик для Ядер-колы с соломинкой", -54449, -10016],
			["Стаканчик для Ядер-колы с соломинкой", -55877, -10160],
			["Стаканчик для Ядер-колы с соломинкой", -56412, -10835],
			["Стаканчик для Ядер-колы с соломинкой", -56367, -10203],
			["Стаканчик для Ядер-колы с соломинкой", -52107, -10970],
			["Стаканчик для Ядер-колы с соломинкой", -34112, -1816],
			["Стаканчик для Ядер-колы с соломинкой", -34133, -1812],
			["Стаканчик для Ядер-колы с соломинкой", -34048, -1894],
			["Стаканчик для Ядер-колы с соломинкой", -86787, -13346],
			["Стаканчик для Ядер-колы с соломинкой", -109068, -21948],
			["Стаканчик для Ядер-колы с соломинкой", -52010, -46542],
			["Стаканчик для Ядер-колы с соломинкой", -91262, -43505],
			["Стаканчик для Ядер-колы с соломинкой", -91298, -42816],
			["Стаканчик для Ядер-колы с соломинкой", -91594, -42471],
			["Стаканчик для Ядер-колы с соломинкой", -89129, -41265],
			["Стаканчик для Ядер-колы с соломинкой", -107759, -59335],
			["Стаканчик для Ядер-колы с соломинкой", -107819, -59096],
			["Стаканчик для Ядер-колы с соломинкой", -32146, -129923],
			["Стаканчик для Ядер-колы с соломинкой", -62373, -129241],
			["Стаканчик для Ядер-колы с соломинкой", -34393, -116150],
			["Стаканчик для Ядер-колы с соломинкой", 197413, -32244],
			["Стаканчик для Ядер-колы с соломинкой", 198041, -27922],
			["Стаканчик для Ядер-колы с соломинкой", 191063, -31552],
			["Стаканчик для Ядер-колы с соломинкой", 195841, -31418],
			["Стаканчик для Ядер-колы с соломинкой", 192763, -29254],
			["Стаканчик для Ядер-колы с соломинкой", 194005, -29308],
			["Стаканчик для Ядер-колы с соломинкой", 194321, -33143],
			["Стаканчик для Ядер-колы с соломинкой", 149712, -76103],
			["Стаканчик для Ядер-колы с соломинкой", 149744, -76008],
			["Стаканчик для Ядер-колы с соломинкой", 101660, -30878],
			["Стаканчик для Ядер-колы с соломинкой", 88357, -21192],
			["Стаканчик для Ядер-колы с соломинкой", 81851, -1193],
			["Стаканчик для Ядер-колы с соломинкой", 18635, -1449],
			["Стаканчик для Ядер-колы с соломинкой", 115722, -63378],
			["Стаканчик для Ядер-колы с соломинкой", 37278, -38865],
			["Стаканчик для Ядер-колы с соломинкой", 10061, -52425],
			["Стаканчик для Ядер-колы с соломинкой", 36884, -119356],
			["Стаканчик для Ядер-колы с соломинкой", 9530, -107410],
			["Стаканчик для Ядер-колы с соломинкой", -79553, -180999],
			["Стаканчик для Ядер-колы с соломинкой", -79259, -181014],
			["Стаканчик для Ядер-колы с соломинкой", -78167, -180923],
			["Стаканчик для Ядер-колы с соломинкой", -77812, -180512],
			["Стаканчик для Ядер-колы с соломинкой", -77544, -180976],
			["Стаканчик для Ядер-колы с соломинкой", -76602, -180848],
			["Стаканчик для Ядер-колы с соломинкой", -76344, -180904],
			["Стаканчик для Ядер-колы с соломинкой", -79130, -179079],
			["Стаканчик для Ядер-колы с соломинкой", -78896, -179030],
			["Стаканчик для Ядер-колы с соломинкой", -78059, -178958],
			["Стаканчик для Ядер-колы с соломинкой", -78044, -178946],
			["Стаканчик для Ядер-колы с соломинкой", -78049, -179088],
			["Стаканчик для Ядер-колы с соломинкой", -78186, -179069],
			["Стаканчик для Ядер-колы с соломинкой", -78324, -179195],
			["Стаканчик для Ядер-колы с соломинкой", -78640, -179287],
			["Стаканчик для Ядер-колы с соломинкой", -75645, -179993],
			["Стаканчик для Ядер-колы с соломинкой", -74865, -179097],
			["Стаканчик для Ядер-колы с соломинкой", -74179, -179874],
			["Стаканчик для Ядер-колы с соломинкой", -76286, -177804],
			["Стаканчик для Ядер-колы с соломинкой", -76291, -177992],
			["Стаканчик для Ядер-колы с соломинкой", -76515, -177468],
			["Стаканчик для Ядер-колы с соломинкой", -76188, -176998],
			["Стаканчик для Ядер-колы с соломинкой", -76087, -177266],
			["Стаканчик для Ядер-колы с соломинкой", -76756, -177133],
			["Стаканчик для Ядер-колы с соломинкой", -74748, -176372],
			["Стаканчик для Ядер-колы с соломинкой", -73695, -179393],
			["Стаканчик для Ядер-колы с соломинкой", -93951, -175199],
			["Стаканчик для Ядер-колы с соломинкой", -74678, -175940],
			["Стаканчик для Ядер-колы с соломинкой", 140307, -158462],
			["Стаканчик для Ядер-колы с соломинкой", 140483, -158539],
			["Стаканчик для Ядер-колы с соломинкой", 140447, -158152],
			["Стаканчик для Ядер-колы с соломинкой", 140459, -148982],
			["Стаканчик для Ядер-колы с соломинкой", 143303, -148878],
			["Стаканчик для Ядер-колы с соломинкой", 140031, -145941],
			["Стаканчик для Ядер-колы с соломинкой", 144688, -145719],
			["Стаканчик для Ядер-колы с соломинкой", -13277, 189609],
			["Стаканчик для Ядер-колы с соломинкой", -9493, 192679],
			["Стаканчик для Ядер-колы с соломинкой", -10325, 193296],
			["Стаканчик для Ядер-колы с соломинкой", -9642, 193162],
			["Стаканчик для Ядер-колы с соломинкой", -9940, 192833],
			["Стаканчик для Ядер-колы с соломинкой", -144451, 149523],
			["Стаканчик для Ядер-колы с соломинкой", 84321, 151879],
			["Стаканчик для Ядер-колы с соломинкой", 87756, 159217],
			["Стаканчик для Ядер-колы с соломинкой", -37768, 95693],
			["Стаканчик для Ядер-колы с соломинкой", -17891, 59226],
			["Стаканчик для Ядер-колы с соломинкой", -17858, 59227],
			["Стаканчик для Ядер-колы с соломинкой", -17822, 59287],
			["Стаканчик для Ядер-колы с соломинкой", -17797, 59268],
			["Стаканчик для Ядер-колы с соломинкой", -47241, 1015],
			["Стаканчик для Ядер-колы с соломинкой", -47024, 2794],
			["Стаканчик для Ядер-колы с соломинкой", -47409, 2874],
			["Стаканчик для Ядер-колы с соломинкой", -41897, 2828],
			["Стаканчик для Ядер-колы с соломинкой", -49420, 6848],
			["Стаканчик для Ядер-колы с соломинкой", -49204, 6814],
			["Стаканчик для Ядер-колы с соломинкой", 33282, 128934],
			["Стаканчик для Ядер-колы с соломинкой", 28699, 128246],
			["Стаканчик для Ядер-колы с соломинкой", 28765, 128374],
			["Стаканчик для Ядер-колы с соломинкой", 49108, 85696],
			["Стаканчик для Ядер-колы с соломинкой", 49213, 85804],
			["Стаканчик для Ядер-колы с соломинкой", 37058, 41414],
			["Стаканчик для Ядер-колы с соломинкой", 37149, 41142],
			["Стаканчик для Ядер-колы с соломинкой", 7228, 42627],
			["Стаканчик для Ядер-колы с соломинкой", 13382, 43395],
			["Стаканчик для Ядер-колы с соломинкой", 96921, 596],
			["Стаканчик для Ядер-колы с соломинкой", 52104, 6020],
			["Стаканчик для Ядер-колы с соломинкой", -17910, 59183],
			["Стаканчик для Ядер-колы с соломинкой", -71733, -177076],
			["Стаканчик для Ядер-колы с соломинкой", -71733, -177076]
			];
	for (var i = 0; i < hlam558.length; i++) {
				hlam_558 = new L.circleMarker([hlam558[i][1],hlam558[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam558[i][0])
					.bindTooltip(hlam558[i][0], {direction: 'top'})
					.addTo(hlam558icons);
			}
	}
	else {
		hlam558icons.clearLayers();
	}
}
var hlam559icons = L.layerGroup().addTo(map);
function Hlam559OnOff() {
	var chbox559;
	chbox559=document.getElementById('Hlam559Button');
	if (chbox559.checked) {
		var hlam559 = [
			["Стальной лом", -60976, -83501],
			["Стальной лом", -121517, -132671],
			["Стальной лом", 107967, -153798],
			["Стальной лом", 108306, -153784],
			["Стальной лом", 107963, -153787],
			["Стальной лом", 112063, -147468],
			["Стальной лом", 103287, 190795],
			["Стальной лом", 13704, 30740]
			];
	for (var i = 0; i < hlam559.length; i++) {
				hlam_559 = new L.circleMarker([hlam559[i][1],hlam559[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam559[i][0])
					.bindTooltip(hlam559[i][0], {direction: 'top'})
					.addTo(hlam559icons);
			}
	}
	else {
		hlam559icons.clearLayers();
	}
}
var hlam560icons = L.layerGroup().addTo(map);
function Hlam560OnOff() {
	var chbox560;
	chbox560=document.getElementById('Hlam560Button');
	if (chbox560.checked) {
		var hlam560 = [
			["Старинный столовый нож", -6270, -171446],
			["Старинный столовый нож", 6310, -165040],
			["Старинный столовый нож", -18044, 60053],
			["Старинный столовый нож", -18062, 60131]
			];
	for (var i = 0; i < hlam560.length; i++) {
				hlam_560 = new L.circleMarker([hlam560[i][1],hlam560[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam560[i][0])
					.bindTooltip(hlam560[i][0], {direction: 'top'})
					.addTo(hlam560icons);
			}
	}
	else {
		hlam560icons.clearLayers();
	}
}
var hlam561icons = L.layerGroup().addTo(map);
function Hlam561OnOff() {
	var chbox561;
	chbox561=document.getElementById('Hlam561Button');
	if (chbox561.checked) {
		var hlam561 = [
		
			];
	for (var i = 0; i < hlam561.length; i++) {
				hlam_561 = new L.circleMarker([hlam561[i][1],hlam561[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam561[i][0])
					.bindTooltip(hlam561[i][0], {direction: 'top'})
					.addTo(hlam561icons);
			}
	}
	else {
		hlam561icons.clearLayers();
	}
}
var hlam562icons = L.layerGroup().addTo(map);
function Hlam562OnOff() {
	var chbox562;
	chbox562=document.getElementById('Hlam562Button');
	if (chbox562.checked) {
		var hlam562 = [
			["Стеклянная банка", -43124, -6193],
			["Стеклянная банка", -43447, -6518],
			["Стеклянная банка", -43312, -6613],
			["Стеклянная банка", -107702, -30636],
			["Стеклянная банка", -27486, -62840],
			["Стеклянная банка", -51838, -96475],
			["Стеклянная банка", -71319, -69202],
			["Стеклянная банка", -135891, -5685],
			["Стеклянная банка", -135930, -6049],
			["Стеклянная банка", -167918, -115175],
			["Стеклянная банка", 193138, -31064],
			["Стеклянная банка", 193135, -31052],
			["Стеклянная банка", 193139, -31033],
			["Стеклянная банка", 193136, -31058],
			["Стеклянная банка", 193125, -31022],
			["Стеклянная банка", 173377, -13424],
			["Стеклянная банка", 180557, -12166],
			["Стеклянная банка", 174437, -41542],
			["Стеклянная банка", 174837, -41872],
			["Стеклянная банка", 174605, -41717],
			["Стеклянная банка", 194497, -33631],
			["Стеклянная банка", 194453, -33409],
			["Стеклянная банка", 194437, -33406],
			["Стеклянная банка", 194470, -33436],
			["Стеклянная банка", 194489, -33441],
			["Стеклянная банка", 194387, -33328],
			["Стеклянная банка", 194425, -33423],
			["Стеклянная банка", 194452, -33454],
			["Стеклянная банка", 194474, -33461],
			["Стеклянная банка", 194500, -33482],
			["Стеклянная банка", 194420, -33443],
			["Стеклянная банка", 194407, -33427],
			["Стеклянная банка", 194471, -33478],
			["Стеклянная банка", 194484, -33493],
			["Стеклянная банка", 194383, -33448],
			["Стеклянная банка", 194420, -33472],
			["Стеклянная банка", 194434, -33480],
			["Стеклянная банка", 194453, -33502],
			["Стеклянная банка", 194472, -33513],
			["Стеклянная банка", 194442, -33515],
			["Стеклянная банка", 194417, -33496],
			["Стеклянная банка", 194394, -33477],
			["Стеклянная банка", 194385, -33467],
			["Стеклянная банка", 88594, -31262],
			["Стеклянная банка", 93103, -8897],
			["Стеклянная банка", 72194, -75920],
			["Стеклянная банка", 8373, -84848],
			["Стеклянная банка", 84819, -109233],
			["Стеклянная банка", 12204, -111833],
			["Стеклянная банка", 13038, -111271],
			["Стеклянная банка", 17935, -108534],
			["Стеклянная банка", 25865, -99754],
			["Стеклянная банка", -2432, -160067],
			["Стеклянная банка", -29994, -132584],
			["Стеклянная банка", -58064, -134109],
			["Стеклянная банка", -71257, -163298],
			["Стеклянная банка", -71237, -163301],
			["Стеклянная банка", -72451, -132798],
			["Стеклянная банка", -26726, -176321],
			["Стеклянная банка", 143527, -148671],
			["Стеклянная банка", 143511, -148661],
			["Стеклянная банка", 143466, -148688],
			["Стеклянная банка", 143479, -148660],
			["Стеклянная банка", 143467, -148674],
			["Стеклянная банка", 143547, -148667],
			["Стеклянная банка", 143556, -148681],
			["Стеклянная банка", 143509, -148682],
			["Стеклянная банка", 143493, -148686],
			["Стеклянная банка", 143531, -148701],
			["Стеклянная банка", 143524, -148712],
			["Стеклянная банка", 143506, -148699],
			["Стеклянная банка", 143489, -148703],
			["Стеклянная банка", 143493, -148718],
			["Стеклянная банка", 143470, -148718],
			["Стеклянная банка", 143473, -148735],
			["Стеклянная банка", 143475, -148750],
			["Стеклянная банка", 143492, -148748],
			["Стеклянная банка", 143498, -148768],
			["Стеклянная банка", 143520, -148762],
			["Стеклянная банка", 143521, -148743],
			["Стеклянная банка", 143516, -148729],
			["Стеклянная банка", 143535, -148732],
			["Стеклянная банка", 143540, -148766],
			["Стеклянная банка", 143573, -148764],
			["Стеклянная банка", 143557, -148743],
			["Стеклянная банка", 143559, -148728],
			["Стеклянная банка", 143550, -148712],
			["Стеклянная банка", 143553, -148696],
			["Стеклянная банка", 79246, -153117],
			["Стеклянная банка", 71333, -173917],
			["Стеклянная банка", -97413, 183816],
			["Стеклянная банка", -59, 139113],
			["Стеклянная банка", -139354, 171843],
			["Стеклянная банка", -157323, 191367],
			["Стеклянная банка", -160527, 155610],
			["Стеклянная банка", -160537, 155597],
			["Стеклянная банка", -160608, 155280],
			["Стеклянная банка", -160660, 155272],
			["Стеклянная банка", -160623, 155284],
			["Стеклянная банка", -160841, 155543],
			["Стеклянная банка", -160797, 155557],
			["Стеклянная банка", -160861, 155647],
			["Стеклянная банка", -160457, 155703],
			["Стеклянная банка", -160438, 155727],
			["Стеклянная банка", -160510, 155766],
			["Стеклянная банка", -160465, 155741],
			["Стеклянная банка", -160477, 155756],
			["Стеклянная банка", -160854, 155660],
			["Стеклянная банка", -160872, 155649],
			["Стеклянная банка", -160794, 155673],
			["Стеклянная банка", -160807, 155677],
			["Стеклянная банка", -160790, 155685],
			["Стеклянная банка", -160705, 155675],
			["Стеклянная банка", -163049, 157083],
			["Стеклянная банка", -163017, 157084],
			["Стеклянная банка", -163048, 157131],
			["Стеклянная банка", -163152, 157131],
			["Стеклянная банка", -163135, 157145],
			["Стеклянная банка", 14723, 193485],
			["Стеклянная банка", 14642, 193494],
			["Стеклянная банка", 14524, 193308],
			["Стеклянная банка", 14675, 193286],
			["Стеклянная банка", 14489, 193247],
			["Стеклянная банка", 14477, 193237],
			["Стеклянная банка", 14565, 193179],
			["Стеклянная банка", 126047, 160433],
			["Стеклянная банка", -103429, 121489],
			["Стеклянная банка", -43097, 87324],
			["Стеклянная банка", -43025, 87365],
			["Стеклянная банка", -37557, 49117],
			["Стеклянная банка", -40851, 9090],
			["Стеклянная банка", -43328, 12342],
			["Стеклянная банка", -47642, 32623],
			["Стеклянная банка", -98606, 7720],
			["Стеклянная банка", -98486, 7705],
			["Стеклянная банка", -153861, 129768],
			["Стеклянная банка", -153923, 129652],
			["Стеклянная банка", 143624, 98408],
			["Стеклянная банка", 132872, 84176],
			["Стеклянная банка", 144000, 98249],
			["Стеклянная банка", 171028, 1874],
			["Стеклянная банка", 93784, 106159],
			["Стеклянная банка", 93795, 106160],
			["Стеклянная банка", 93729, 106413],
			["Стеклянная банка", 95948, 106322],
			["Стеклянная банка", 95940, 106303],
			["Стеклянная банка", 95747, 106118],
			["Стеклянная банка", 95782, 106124],
			["Стеклянная банка", 95786, 106168],
			["Стеклянная банка", 130106, 86450]
			];
	for (var i = 0; i < hlam562.length; i++) {
				hlam_562 = new L.circleMarker([hlam562[i][1],hlam562[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam562[i][0])
					.bindTooltip(hlam562[i][0], {direction: 'top'})
					.addTo(hlam562icons);
			}
	}
	else {
		hlam562icons.clearLayers();
	}
}
var hlam563icons = L.layerGroup().addTo(map);
function Hlam563OnOff() {
	var chbox563;
	chbox563=document.getElementById('Hlam563Button');
	if (chbox563.checked) {
		var hlam563 = [
			["Стеклянная миска", -101343, -54972],
			["Стеклянная миска", -46778, -72912],
			["Стеклянная миска", -14228, -125255],
			["Стеклянная миска", -97786, -126134],
			["Стеклянная миска", -68533, -105413],
			["Стеклянная миска", -122934, -122930],
			["Стеклянная миска", -101905, -114604],
			["Стеклянная миска", -151833, -74694],
			["Стеклянная миска", 181036, -123221],
			["Стеклянная миска", 35885, -34863],
			["Стеклянная миска", 35469, -34866],
			["Стеклянная миска", 188790, -165981],
			["Стеклянная миска", 22779, -149418],
			["Стеклянная миска", -145696, 173031],
			["Стеклянная миска", 95864, 187204],
			["Стеклянная миска", -43842, 28964],
			["Стеклянная миска", 182954, 2785],
			["Стеклянная миска", 138197, 744],
			["Стеклянная миска", 77999, 33851]
			];
	for (var i = 0; i < hlam563.length; i++) {
				hlam_563 = new L.circleMarker([hlam563[i][1],hlam563[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam563[i][0])
					.bindTooltip(hlam563[i][0], {direction: 'top'})
					.addTo(hlam563icons);
			}
	}
	else {
		hlam563icons.clearLayers();
	}
}
var hlam564icons = L.layerGroup().addTo(map);
function Hlam564OnOff() {
	var chbox564;
	chbox564=document.getElementById('Hlam564Button');
	if (chbox564.checked) {
		var hlam564 = [
			["Стеклянные осколки", 118198, -4993],
			["Стеклянные осколки", -96007, 176982],
			["Стеклянные осколки", -42800, 137737]
			];
	for (var i = 0; i < hlam564.length; i++) {
				hlam_564 = new L.circleMarker([hlam564[i][1],hlam564[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam564[i][0])
					.bindTooltip(hlam564[i][0], {direction: 'top'})
					.addTo(hlam564icons);
			}
	}
	else {
		hlam564icons.clearLayers();
	}
}
var hlam565icons = L.layerGroup().addTo(map);
function Hlam565OnOff() {
	var chbox565;
	chbox565=document.getElementById('Hlam565Button');
	if (chbox565.checked) {
		var hlam565 = [
			["Стеклянный кувшин", -51100, -12498],
			["Стеклянный кувшин", -52078, -12747],
			["Стеклянный кувшин", -50820, -14008],
			["Стеклянный кувшин", -50742, -14256],
			["Стеклянный кувшин", -50502, -13511],
			["Стеклянный кувшин", -50684, -12793],
			["Стеклянный кувшин", -52947, -13319],
			["Стеклянный кувшин", -52316, -13929],
			["Стеклянный кувшин", -49576, -14375],
			["Стеклянный кувшин", -56312, -11024],
			["Стеклянный кувшин", -56345, -11145],
			["Стеклянный кувшин", -56382, -10942],
			["Стеклянный кувшин", -53446, -10829],
			["Стеклянный кувшин", -53524, -4575],
			["Стеклянный кувшин", -43299, -6253],
			["Стеклянный кувшин", -53237, -1528],
			["Стеклянный кувшин", -41166, -3067],
			["Стеклянный кувшин", -19194, -47025],
			["Стеклянный кувшин", -55555, -61322],
			["Стеклянный кувшин", -55974, -61055],
			["Стеклянный кувшин", -37936, -58576],
			["Стеклянный кувшин", -37863, -58813],
			["Стеклянный кувшин", -46955, -51139],
			["Стеклянный кувшин", -47621, -50193],
			["Стеклянный кувшин", -84909, -45433],
			["Стеклянный кувшин", -111169, -61122],
			["Стеклянный кувшин", -13427, -66182],
			["Стеклянный кувшин", -63134, -128972],
			["Стеклянный кувшин", -50751, -111503],
			["Стеклянный кувшин", -56619, -108562],
			["Стеклянный кувшин", -50620, -100987],
			["Стеклянный кувшин", -48690, -100264],
			["Стеклянный кувшин", -148258, -57182],
			["Стеклянный кувшин", -151098, -75011],
			["Стеклянный кувшин", -152242, -72478],
			["Стеклянный кувшин", -167899, -115767],
			["Стеклянный кувшин", -167900, -114864],
			["Стеклянный кувшин", 167685, -24235],
			["Стеклянный кувшин", 167379, -24359],
			["Стеклянный кувшин", 167618, -22627],
			["Стеклянный кувшин", 168689, -24243],
			["Стеклянный кувшин", 168090, -18411],
			["Стеклянный кувшин", 182930, -93610],
			["Стеклянный кувшин", 183387, -67183],
			["Стеклянный кувшин", 183567, -67585],
			["Стеклянный кувшин", 183824, -66623],
			["Стеклянный кувшин", 75193, -9499],
			["Стеклянный кувшин", 72954, -7756],
			["Стеклянный кувшин", 50137, -23416],
			["Стеклянный кувшин", 29666, -21361],
			["Стеклянный кувшин", 113428, -55837],
			["Стеклянный кувшин", 91864, -59383],
			["Стеклянный кувшин", 89802, -57067],
			["Стеклянный кувшин", 33672, -33111],
			["Стеклянный кувшин", 33668, -33062],
			["Стеклянный кувшин", 33688, -33096],
			["Стеклянный кувшин", 29354, -58324],
			["Стеклянный кувшин", 46244, -66143],
			["Стеклянный кувшин", 12249, -77961],
			["Стеклянный кувшин", 11907, -78019],
			["Стеклянный кувшин", 11767, -77499],
			["Стеклянный кувшин", 120337, -121200],
			["Стеклянный кувшин", 18274, -106593],
			["Стеклянный кувшин", 16961, -107257],
			["Стеклянный кувшин", -1871, -159552],
			["Стеклянный кувшин", -29599, -172740],
			["Стеклянный кувшин", -62311, -171190],
			["Стеклянный кувшин", -121037, -189272],
			["Стеклянный кувшин", -120870, -188786],
			["Стеклянный кувшин", -121084, -189377],
			["Стеклянный кувшин", -133831, -153759],
			["Стеклянный кувшин", -137024, -175442],
			["Стеклянный кувшин", 190689, -169471],
			["Стеклянный кувшин", 79310, -154180],
			["Стеклянный кувшин", -64003, 203006],
			["Стеклянный кувшин", -60802, 181980],
			["Стеклянный кувшин", -60578, 181975],
			["Стеклянный кувшин", -60977, 181206],
			["Стеклянный кувшин", -61400, 181868],
			["Стеклянный кувшин", -61286, 182256],
			["Стеклянный кувшин", -92812, 183329],
			["Стеклянный кувшин", -93249, 183871],
			["Стеклянный кувшин", -92637, 183833],
			["Стеклянный кувшин", -93668, 183822],
			["Стеклянный кувшин", -91810, 183555],
			["Стеклянный кувшин", -96539, 189864],
			["Стеклянный кувшин", -26133, 143854],
			["Стеклянный кувшин", -1371, 158068],
			["Стеклянный кувшин", -139383, 139117],
			["Стеклянный кувшин", -145389, 139977],
			["Стеклянный кувшин", -140990, 156299],
			["Стеклянный кувшин", 150069, 137025],
			["Стеклянный кувшин", 149566, 137012],
			["Стеклянный кувшин", 151319, 136392],
			["Стеклянный кувшин", 151782, 136861],
			["Стеклянный кувшин", 151863, 137717],
			["Стеклянный кувшин", 152027, 137701],
			["Стеклянный кувшин", 152161, 138037],
			["Стеклянный кувшин", 152678, 161820],
			["Стеклянный кувшин", 69085, 202285],
			["Стеклянный кувшин", 91683, 188821],
			["Стеклянный кувшин", 91270, 188702],
			["Стеклянный кувшин", 91054, 188870],
			["Стеклянный кувшин", 1417, 164420],
			["Стеклянный кувшин", 87783, 157388],
			["Стеклянный кувшин", 47085, 162005],
			["Стеклянный кувшин", 2676, 137880],
			["Стеклянный кувшин", 2674, 137336],
			["Стеклянный кувшин", 2857, 163487],
			["Стеклянный кувшин", 3970, 160877],
			["Стеклянный кувшин", 3744, 160310],
			["Стеклянный кувшин", -128908, 119099],
			["Стеклянный кувшин", -128708, 119833],
			["Стеклянный кувшин", -105025, 123317],
			["Стеклянный кувшин", -56465, 88576],
			["Стеклянный кувшин", -18079, 60257],
			["Стеклянный кувшин", -18081, 60138],
			["Стеклянный кувшин", -16674, 60407],
			["Стеклянный кувшин", -39670, 44541],
			["Стеклянный кувшин", -68639, 55754],
			["Стеклянный кувшин", -50737, 2894],
			["Стеклянный кувшин", -33526, 2],
			["Стеклянный кувшин", -55558, 5158],
			["Стеклянный кувшин", -55763, 4854],
			["Стеклянный кувшин", -42325, 10867],
			["Стеклянный кувшин", -39529, 30249],
			["Стеклянный кувшин", -153719, 128531],
			["Стеклянный кувшин", -154824, 51681],
			["Стеклянный кувшин", 133283, 126686],
			["Стеклянный кувшин", 169714, 56264],
			["Стеклянный кувшин", 169367, 56170],
			["Стеклянный кувшин", 169893, 57001],
			["Стеклянный кувшин", 170043, 56378],
			["Стеклянный кувшин", 184002, 2794],
			["Стеклянный кувшин", 183560, 2681],
			["Стеклянный кувшин", 94152, 103046],
			["Стеклянный кувшин", 94301, 103063],
			["Стеклянный кувшин", 94746, 103429],
			["Стеклянный кувшин", 94390, 103631],
			["Стеклянный кувшин", 94692, 103981],
			["Стеклянный кувшин", 95145, 103838],
			["Стеклянный кувшин", 95091, 104103],
			["Стеклянный кувшин", 95304, 104295],
			["Стеклянный кувшин", 129160, 85313],
			["Стеклянный кувшин", 30461, 66258],
			["Стеклянный кувшин", 53559, 52602],
			["Стеклянный кувшин", 60343, 57526],
			["Стеклянный кувшин", 14202, 39368],
			["Стеклянный кувшин", 14273, 39356],
			["Стеклянный кувшин", 14542, 39748],
			["Стеклянный кувшин", 14533, 39760],
			["Стеклянный кувшин", 15076, 39288],
			["Стеклянный кувшин", 27084, 50365],
			["Стеклянный кувшин", 29037, 53791],
			["Стеклянный кувшин", 93614, 9007],
			["Стеклянный кувшин", 71555, 20943],
			["Стеклянный кувшин", 57261, 10758],
			["Стеклянный кувшин", 59183, 12318]
			];
	for (var i = 0; i < hlam565.length; i++) {
				hlam_565 = new L.circleMarker([hlam565[i][1],hlam565[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam565[i][0])
					.bindTooltip(hlam565[i][0], {direction: 'top'})
					.addTo(hlam565icons);
			}
	}
	else {
		hlam565icons.clearLayers();
	}
}
var hlam566icons = L.layerGroup().addTo(map);
function Hlam566OnOff() {
	var chbox566;
	chbox566=document.getElementById('Hlam566Button');
	if (chbox566.checked) {
		var hlam566 = [
			["Стил-гитара", 75740, -18136],
			["Стил-гитара", -121713, 187453],
			["Стил-гитара", 157235, 13607]
			];
	for (var i = 0; i < hlam566.length; i++) {
				hlam_566 = new L.circleMarker([hlam566[i][1],hlam566[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam566[i][0])
					.bindTooltip(hlam566[i][0], {direction: 'top'})
					.addTo(hlam566icons);
			}
	}
	else {
		hlam566icons.clearLayers();
	}
}
var hlam567icons = L.layerGroup().addTo(map);
function Hlam567OnOff() {
	var chbox567;
	chbox567=document.getElementById('Hlam567Button');
	if (chbox567.checked) {
		var hlam567 = [
			["Столовая ложка", -7786, -13568],
			["Столовая ложка", -7806, -13632],
			["Столовая ложка", -8560, -3121],
			["Столовая ложка", -52062, -12681],
			["Столовая ложка", -41266, -3196],
			["Столовая ложка", -27968, -60885],
			["Столовая ложка", -8367, -56991],
			["Столовая ложка", -19321, -43498],
			["Столовая ложка", -19281, -43498],
			["Столовая ложка", -45457, -70308],
			["Столовая ложка", -48950, -128731],
			["Столовая ложка", 173693, -14491],
			["Столовая ложка", 173658, -14477],
			["Столовая ложка", 173709, -13489],
			["Столовая ложка", 173525, -13355],
			["Столовая ложка", 173353, -13437],
			["Столовая ложка", 179492, -11138],
			["Столовая ложка", 180625, -12197],
			["Столовая ложка", 180596, -12174],
			["Столовая ложка", 180569, -12159],
			["Столовая ложка", 181078, -123090],
			["Столовая ложка", 181037, -123200],
			["Столовая ложка", 113646, -56038],
			["Столовая ложка", 35428, -35467],
			["Столовая ложка", 34053, -36326],
			["Столовая ложка", 11568, -60336],
			["Столовая ложка", 13840, -58980],
			["Столовая ложка", 13602, -59396],
			["Столовая ложка", 15944, -79743],
			["Столовая ложка", 19833, -104336],
			["Столовая ложка", -99385, -132097],
			["Столовая ложка", -6637, -171290],
			["Столовая ложка", -92868, 183477],
			["Столовая ложка", -149104, 150725],
			["Столовая ложка", 6333, 164454],
			["Столовая ложка", 45695, 162585],
			["Столовая ложка", 7195, 161422],
			["Столовая ложка", -59858, 117433],
			["Столовая ложка", -18034, 60046],
			["Столовая ложка", -18004, 60121],
			["Столовая ложка", -20883, 16604],
			["Столовая ложка", -118354, 1774],
			["Столовая ложка", -127947, 30724],
			["Столовая ложка", -138463, 89163],
			["Столовая ложка", 133259, 126664],
			["Столовая ложка", 136947, 42904],
			["Столовая ложка", 72518, 37754],
			["Столовая ложка", 14772, 39343],
			["Столовая ложка", 14769, 39351],
			["Столовая ложка", 14298, 39368],
			["Столовая ложка", 14395, 39789],
			["Столовая ложка", 14679, 39722],
			["Столовая ложка", 14714, 39675],
			["Столовая ложка", 15026, 39287],
			["Столовая ложка", 14878, 39594],
			["Столовая ложка", 14258, 44446],
			["Столовая ложка", 26642, 48470],
			["Столовая ложка", 27137, 47782],
			["Столовая ложка", 27128, 47853],
			["Столовая ложка", 25402, -109268]
			];
	for (var i = 0; i < hlam567.length; i++) {
				hlam_567 = new L.circleMarker([hlam567[i][1],hlam567[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam567[i][0])
					.bindTooltip(hlam567[i][0], {direction: 'top'})
					.addTo(hlam567icons);
			}
	}
	else {
		hlam567icons.clearLayers();
	}
}
var hlam568icons = L.layerGroup().addTo(map);
function Hlam568OnOff() {
	var chbox568;
	chbox568=document.getElementById('Hlam568Button');
	if (chbox568.checked) {
		var hlam568 = [
			["Столовый нож", -7801, -13622],
			["Столовый нож", -7808, -13568],
			["Столовый нож", -52475, -12945],
			["Столовый нож", -52453, -13013],
			["Столовый нож", -51965, -13135],
			["Столовый нож", -53076, -14159],
			["Столовый нож", -53071, -14109],
			["Столовый нож", -52674, -14007],
			["Столовый нож", -50882, -14174],
			["Столовый нож", -50235, -13712],
			["Столовый нож", -50459, -13645],
			["Столовый нож", -50418, -12606],
			["Столовый нож", -50686, -13272],
			["Столовый нож", -14053, -66698],
			["Столовый нож", -75709, -69741],
			["Столовый нож", -75729, -69720],
			["Столовый нож", -76240, -69576],
			["Столовый нож", -76261, -69585],
			["Столовый нож", -75773, -69631],
			["Столовый нож", -61853, -127621],
			["Столовый нож", -152028, -74743],
			["Столовый нож", -168059, -115393],
			["Столовый нож", 173927, -13692],
			["Столовый нож", 173811, -14413],
			["Столовый нож", 173877, -14222],
			["Столовый нож", 173641, -14473],
			["Столовый нож", 143582, -89094],
			["Столовый нож", 143474, -89030],
			["Столовый нож", 88654, -31132],
			["Столовый нож", 53458, -3051],
			["Столовый нож", 57341, 0],
			["Столовый нож", 57354, 0],
			["Столовый нож", 35429, -35481],
			["Столовый нож", 46211, -66207],
			["Столовый нож", -82314, -177803],
			["Столовый нож", -82334, -177761],
			["Столовый нож", -82351, -178204],
			["Столовый нож", 140833, -147232],
			["Столовый нож", 2448, -140135],
			["Столовый нож", 74198, -177239],
			["Столовый нож", -17625, 162440],
			["Столовый нож", -146140, 172933],
			["Столовый нож", 111609, 139766],
			["Столовый нож", 88104, 157974],
			["Столовый нож", -114006, 112813],
			["Столовый нож", -17664, 60244],
			["Столовый нож", -100372, 36310],
			["Столовый нож", -48832, 19816],
			["Столовый нож", -158152, 56183],
			["Столовый нож", 168825, 56532],
			["Столовый нож", 133090, 54752],
			["Столовый нож", 171121, 1765],
			["Столовый нож", 94819, 103092],
			["Столовый нож", 94791, 103071],
			["Столовый нож", 94805, 103078],
			["Столовый нож", 94793, 103122],
			["Столовый нож", 94804, 103106],
			["Столовый нож", 94573, 103218],
			["Столовый нож", 94569, 103204],
			["Столовый нож", 7556, 44342],
			["Столовый нож", 7545, 44348],
			["Столовый нож", 7576, 44118],
			["Столовый нож", 7565, 44123],
			["Столовый нож", 7488, 43895],
			["Столовый нож", 7533, 43872],
			["Столовый нож", 27139, 47789],
			["Столовый нож", 51886, 1311],
			["Столовый нож", 51918, 1350],
			["Столовый нож", 54884, 1431],
			["Столовый нож", 51506, 12118],
			["Столовый нож", 51475, 12078],
			["Столовый нож", 55529, 10228],
			["Столовый нож", 55530, 10223],
			["Столовый нож", 55993, 12763],
			["Столовый нож", 55981, 12761],
			["Столовый нож", 94505, -3963],
			["Столовый нож", -9573, 193061]
			];
	for (var i = 0; i < hlam568.length; i++) {
				hlam_568 = new L.circleMarker([hlam568[i][1],hlam568[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam568[i][0])
					.bindTooltip(hlam568[i][0], {direction: 'top'})
					.addTo(hlam568icons);
			}
	}
	else {
		hlam568icons.clearLayers();
	}
}
var hlam569icons = L.layerGroup().addTo(map);
function Hlam569OnOff() {
	var chbox569;
	chbox569=document.getElementById('Hlam569Button');
	if (chbox569.checked) {
		var hlam569 = [
			["Столярный молоток", 24916, -63553],
			["Столярный молоток", 101277, -100419],
			["Столярный молоток", 80894, 184517],
			["Столярный молоток", 551, 168097],
			["Столярный молоток", 189063, 57145]
			];
	for (var i = 0; i < hlam569.length; i++) {
				hlam_569 = new L.circleMarker([hlam569[i][1],hlam569[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam569[i][0])
					.bindTooltip(hlam569[i][0], {direction: 'top'})
					.addTo(hlam569icons);
			}
	}
	else {
		hlam569icons.clearLayers();
	}
}
var hlam570icons = L.layerGroup().addTo(map);
function Hlam570OnOff() {
	var chbox570;
	chbox570=document.getElementById('Hlam570Button');
	if (chbox570.checked) {
		var hlam570 = [
			["Столярный молоток", -31433, -65908],
			["Столярный молоток", 68674, -10430],
			["Столярный молоток", -93673, 183926],
			["Столярный молоток", -5718, 160608],
			["Столярный молоток", -143567, 173968],
			["Столярный молоток", -123362, 51066],
			["Столярный молоток", -46961, 2340],
			["Столярный молоток", 182820, 112441],
			["Столярный молоток", 189078, 57152],
			["Столярный молоток", 136309, 14653],
			["Столярный молоток", 130637, 74448],
			["Столярный молоток", 110644, 55901],
			["Столярный молоток", 80121, 55473]
			];
	for (var i = 0; i < hlam570.length; i++) {
				hlam_570 = new L.circleMarker([hlam570[i][1],hlam570[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam570[i][0])
					.bindTooltip(hlam570[i][0], {direction: 'top'})
					.addTo(hlam570icons);
			}
	}
	else {
		hlam570icons.clearLayers();
	}
}
var hlam571icons = L.layerGroup().addTo(map);
function Hlam571OnOff() {
	var chbox571;
	chbox571=document.getElementById('Hlam571Button');
	if (chbox571.checked) {
		var hlam571 = [
			["Стопка", -24561, -3115],
			["Стопка", -24536, -3063],
			["Стопка", -24542, -2924],
			["Стопка", -43643, -7033],
			["Стопка", -43643, -7044],
			["Стопка", -42465, -5109],
			["Стопка", -42486, -5137],
			["Стопка", -43027, -5666],
			["Стопка", -29380, -49407],
			["Стопка", -12560, -51608],
			["Стопка", -12541, -51627],
			["Стопка", -39374, -54693],
			["Стопка", -39440, -54501],
			["Стопка", -68878, -51997],
			["Стопка", -108413, -58951],
			["Стопка", -120446, -45856],
			["Стопка", -12586, -69941],
			["Стопка", -4012, -113745],
			["Стопка", -148448, -57549],
			["Стопка", -148575, -57545],
			["Стопка", -149499, -54907],
			["Стопка", -149112, -55634],
			["Стопка", -149120, -55641],
			["Стопка", -149154, -55502],
			["Стопка", -149210, -55506],
			["Стопка", 167305, -22486],
			["Стопка", 154393, -32289],
			["Стопка", 160803, -58259],
			["Стопка", 160796, -58269],
			["Стопка", 160796, -58279],
			["Стопка", 149512, -52131],
			["Стопка", 148488, -79677],
			["Стопка", 149094, -76169],
			["Стопка", 149812, -67368],
			["Стопка", 105634, -8599],
			["Стопка", 82348, -21034],
			["Стопка", 90835, -6557],
			["Стопка", 91231, -6242],
			["Стопка", 84760, -2235],
			["Стопка", 84751, -2246],
			["Стопка", 51663, -41000],
			["Стопка", 51427, -40603],
			["Стопка", 35801, -34859],
			["Стопка", 21809, -105148],
			["Стопка", 29603, -101296],
			["Стопка", -118832, -136160],
			["Стопка", -123624, -133437],
			["Стопка", -61886, -170796],
			["Стопка", -53402, -168164],
			["Стопка", -139280, -144406],
			["Стопка", -72723, 184591],
			["Стопка", -72730, 184596],
			["Стопка", -95227, 190241],
			["Стопка", -38934, 158895],
			["Стопка", -144999, 139871],
			["Стопка", -138544, 152648],
			["Стопка", 70669, 137831],
			["Стопка", 71008, 137657],
			["Стопка", 70998, 137668],
			["Стопка", 71014, 137669],
			["Стопка", -104210, 38490],
			["Стопка", -104501, 38785],
			["Стопка", -38499, 3577],
			["Стопка", -38478, 3581],
			["Стопка", -38713, 3544],
			["Стопка", -46091, 20304],
			["Стопка", -46108, 20302],
			["Стопка", -148470, 113445],
			["Стопка", 180707, 111084],
			["Стопка", 172149, 58015],
			["Стопка", 172146, 58033],
			["Стопка", 172142, 57981],
			["Стопка", 172160, 57982],
			["Стопка", 132628, 15844],
			["Стопка", 95113, 103885],
			["Стопка", 110032, 57434],
			["Стопка", 27230, 48085],
			["Стопка", 165047, -8724]
			];
	for (var i = 0; i < hlam571.length; i++) {
				hlam_571 = new L.circleMarker([hlam571[i][1],hlam571[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam571[i][0])
					.bindTooltip(hlam571[i][0], {direction: 'top'})
					.addTo(hlam571icons);
			}
	}
	else {
		hlam571icons.clearLayers();
	}
}
var hlam572icons = L.layerGroup().addTo(map);
function Hlam572OnOff() {
	var chbox572;
	chbox572=document.getElementById('Hlam572Button');
	if (chbox572.checked) {
		var hlam572 = [
			["Страхомишка", -120040, -14286],
			["Страхомишка", -59001, -79357],
			["Страхомишка", -59083, -72078],
			["Страхомишка", 159904, -51737],
			["Страхомишка", 129975, -2895],
			["Страхомишка", -4748, -155809],
			["Страхомишка", -137245, -149149],
			["Страхомишка", 142697, -148149],
			["Страхомишка", 75102, -179181],
			["Страхомишка", -5122, 200563],
			["Страхомишка", -4052, 184451],
			["Страхомишка", -93939, 180368],
			["Страхомишка", -5999, 160821],
			["Страхомишка", -144280, 149512],
			["Страхомишка", 13829, 191589],
			["Страхомишка", -95638, 124249],
			["Страхомишка", -6522, 93185],
			["Страхомишка", -6366, 93338],
			["Страхомишка", -49194, 86232],
			["Страхомишка", -49593, 86270],
			["Страхомишка", -142291, 1383],
			["Страхомишка", 121222, 116260],
			["Страхомишка", 52914, 100448],
			["Страхомишка", 42878, 109672],
			["Страхомишка", 20327, 90036],
			["Страхомишка", 86981, 55434],
			["Страхомишка", 23420, 42384],
			["Страхомишка", 28608, 48618],
			["Страхомишка", 58664, 11001],
			["Страхомишка", 58882, 176777],
			["Страхомишка", 82161, -21649],
			["Страхомишка", 82124, -21650],
			["Страхомишка", -121392, 143224],
			["Страхомишка", -170605, -60115],
			["Страхомишка", -93452, -83534]
			];
	for (var i = 0; i < hlam572.length; i++) {
				hlam_572 = new L.circleMarker([hlam572[i][1],hlam572[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam572[i][0])
					.bindTooltip(hlam572[i][0], {direction: 'top'})
					.addTo(hlam572icons);
			}
	}
	else {
		hlam572icons.clearLayers();
	}
}
var hlam573icons = L.layerGroup().addTo(map);
function Hlam573OnOff() {
	var chbox573;
	chbox573=document.getElementById('Hlam573Button');
	if (chbox573.checked) {
		var hlam573 = [
			["Строительный молоток", 92921, -8595],
			["Строительный молоток", -141128, 170404],
			["Строительный молоток", 533, 168114],
			["Строительный молоток", -52132, 58494],
			["Строительный молоток", 188969, 57573],
			["Строительный молоток", 110637, 55796],
			["Строительный молоток", 57626, 9940]
			];
	for (var i = 0; i < hlam573.length; i++) {
				hlam_573 = new L.circleMarker([hlam573[i][1],hlam573[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam573[i][0])
					.bindTooltip(hlam573[i][0], {direction: 'top'})
					.addTo(hlam573icons);
			}
	}
	else {
		hlam573icons.clearLayers();
	}
}
var hlam574icons = L.layerGroup().addTo(map);
function Hlam574OnOff() {
	var chbox574;
	chbox574=document.getElementById('Hlam574Button');
	if (chbox574.checked) {
		var hlam574 = [
			["Сувенир с маяка", 71983, -76220],
			["Сувенир с маяка", 72017, -75961],
			["Сувенир с маяка", 71940, -75972],
			["Сувенир с маяка", 71925, -75983],
			["Сувенир с маяка", 72061, -75931],
			["Сувенир с маяка", 71973, -75951],
			["Сувенир с маяка", -128853, 119106]
			];
	for (var i = 0; i < hlam574.length; i++) {
				hlam_574 = new L.circleMarker([hlam574[i][1],hlam574[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam574[i][0])
					.bindTooltip(hlam574[i][0], {direction: 'top'})
					.addTo(hlam574icons);
			}
	}
	else {
		hlam574icons.clearLayers();
	}
}
var hlam575icons = L.layerGroup().addTo(map);
function Hlam575OnOff() {
	var chbox575;
	chbox575=document.getElementById('Hlam575Button');
	if (chbox575.checked) {
		var hlam575 = [
			["Сувенирная кофейная кружка", 77737, -12051]
			];
	for (var i = 0; i < hlam575.length; i++) {
				hlam_575 = new L.circleMarker([hlam575[i][1],hlam575[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam575[i][0])
					.bindTooltip(hlam575[i][0], {direction: 'top'})
					.addTo(hlam575icons);
			}
	}
	else {
		hlam575icons.clearLayers();
	}
}
var hlam576icons = L.layerGroup().addTo(map);
function Hlam576OnOff() {
	var chbox576;
	chbox576=document.getElementById('Hlam576Button');
	if (chbox576.checked) {
		var hlam576 = [
			["Сувенирная машинка", -61309, -100904],
			["Сувенирная машинка", -72376, -98358],
			["Сувенирная машинка", -72376, -98358],
			["Сувенирная машинка", -144351, 148506],
			["Сувенирная машинка", 93414, 1044]
			];
	for (var i = 0; i < hlam576.length; i++) {
				hlam_576 = new L.circleMarker([hlam576[i][1],hlam576[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam576[i][0])
					.bindTooltip(hlam576[i][0], {direction: 'top'})
					.addTo(hlam576icons);
			}
	}
	else {
		hlam576icons.clearLayers();
	}
}
var hlam577icons = L.layerGroup().addTo(map);
function Hlam577OnOff() {
	var chbox577;
	chbox577=document.getElementById('Hlam577Button');
	if (chbox577.checked) {
		var hlam577 = [
			["Сувенирная пластмассовая миска", 64872, -58616]
			];
	for (var i = 0; i < hlam577.length; i++) {
				hlam_577 = new L.circleMarker([hlam577[i][1],hlam577[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam577[i][0])
					.bindTooltip(hlam577[i][0], {direction: 'top'})
					.addTo(hlam577icons);
			}
	}
	else {
		hlam577icons.clearLayers();
	}
}
var hlam578icons = L.layerGroup().addTo(map);
function Hlam578OnOff() {
	var chbox578;
	chbox578=document.getElementById('Hlam578Button');
	if (chbox578.checked) {
		var hlam578 = [
			["Сувенирный ленивец", -109412, -23168],
			["Сувенирный ленивец", -151550, -72636],
			["Сувенирный ленивец", 151447, -52041],
			["Сувенирный ленивец", 13875, 193846],
			["Сувенирный ленивец", -92526, 65002],
			["Сувенирный ленивец", -123522, 51091],
			["Сувенирный ленивец", -48741, 18263],
			["Сувенирный ленивец", -146530, 65595],
			["Сувенирный ленивец", 64846, -58631],
			["Сувенирный ленивец", -93432, -83584]
			];
	for (var i = 0; i < hlam578.length; i++) {
				hlam_578 = new L.circleMarker([hlam578[i][1],hlam578[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam578[i][0])
					.bindTooltip(hlam578[i][0], {direction: 'top'})
					.addTo(hlam578icons);
			}
	}
	else {
		hlam578icons.clearLayers();
	}
}
var hlam579icons = L.layerGroup().addTo(map);
function Hlam579OnOff() {
	var chbox579;
	chbox579=document.getElementById('Hlam579Button');
	if (chbox579.checked) {
		var hlam579 = [
			["Сувенирный магнит в виде коровы", 22979, -149585]
			];
	for (var i = 0; i < hlam579.length; i++) {
				hlam_579 = new L.circleMarker([hlam579[i][1],hlam579[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam579[i][0])
					.bindTooltip(hlam579[i][0], {direction: 'top'})
					.addTo(hlam579icons);
			}
	}
	else {
		hlam579icons.clearLayers();
	}
}
var hlam580icons = L.layerGroup().addTo(map);
function Hlam580OnOff() {
	var chbox580;
	chbox580=document.getElementById('Hlam580Button');
	if (chbox580.checked) {
		var hlam580 = [
			["Сувенирный медвежонок", 167816, -22764],
			["Сувенирный медвежонок", 19481, -104259],
			["Сувенирный медвежонок", -139653, 140740],
			["Сувенирный медвежонок", -164236, 122639],
			["Сувенирный медвежонок", 58109, 9958]
			];
	for (var i = 0; i < hlam580.length; i++) {
				hlam_580 = new L.circleMarker([hlam580[i][1],hlam580[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam580[i][0])
					.bindTooltip(hlam580[i][0], {direction: 'top'})
					.addTo(hlam580icons);
			}
	}
	else {
		hlam580icons.clearLayers();
	}
}
var hlam581icons = L.layerGroup().addTo(map);
function Hlam581OnOff() {
	var chbox581;
	chbox581=document.getElementById('Hlam581Button');
	if (chbox581.checked) {
		var hlam581 = [
			["Сувенирный медвежонок", -109146, -22070],
			["Сувенирный медвежонок", 194345, -22712],
			["Сувенирный медвежонок", 64832, -58605],
			["Сувенирный медвежонок", 16737, -44880],
			["Сувенирный медвежонок", -20482, 59929]
			];
	for (var i = 0; i < hlam581.length; i++) {
				hlam_581 = new L.circleMarker([hlam581[i][1],hlam581[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam581[i][0])
					.bindTooltip(hlam581[i][0], {direction: 'top'})
					.addTo(hlam581icons);
			}
	}
	else {
		hlam581icons.clearLayers();
	}
}
var hlam582icons = L.layerGroup().addTo(map);
function Hlam582OnOff() {
	var chbox582;
	chbox582=document.getElementById('Hlam582Button');
	if (chbox582.checked) {
		var hlam582 = [

			];
	for (var i = 0; i < hlam582.length; i++) {
				hlam_582 = new L.circleMarker([hlam582[i][1],hlam582[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam582[i][0])
					.bindTooltip(hlam582[i][0], {direction: 'top'})
					.addTo(hlam582icons);
			}
	}
	else {
		hlam582icons.clearLayers();
	}
}
var hlam583icons = L.layerGroup().addTo(map);
function Hlam583OnOff() {
	var chbox583;
	chbox583=document.getElementById('Hlam583Button');
	if (chbox583.checked) {
		var hlam583 = [
			["Сушилка для пищи", -150929, -74629],
			["Сушилка для пищи", 173614, -13699],
			["Сушилка для пищи", 180037, -121978],
			["Сушилка для пищи", 34322, -36450],
			["Сушилка для пищи", -1138, -164778],
			["Сушилка для пищи", 2704, 161380]
			];
	for (var i = 0; i < hlam583.length; i++) {
				hlam_583 = new L.circleMarker([hlam583[i][1],hlam583[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam583[i][0])
					.bindTooltip(hlam583[i][0], {direction: 'top'})
					.addTo(hlam583icons);
			}
	}
	else {
		hlam583icons.clearLayers();
	}
}
var hlam584icons = L.layerGroup().addTo(map);
function Hlam584OnOff() {
	var chbox584;
	chbox584=document.getElementById('Hlam584Button');
	if (chbox584.checked) {
		var hlam584 = [
			["Схемы", -151796, -73668],
			["Схемы", 29235, -58496],
			["Схемы", 93232, -84324],
			["Схемы", 189562, -164985],
			["Схемы", 115223, -157936],
			["Схемы", -65777, 198271],
			["Схемы", -65745, 198275],
			["Схемы", -19930, 145558],
			["Схемы", -19961, 145757],
			["Схемы", -42844, 137716],
			["Схемы", 9077, 166930],
			["Схемы", 9064, 166947],
			["Схемы", -127704, 80898],
			["Схемы", -46817, 2720],
			["Схемы", 114818, 68851],
			["Схемы", -163626, 200306]
			];
	for (var i = 0; i < hlam584.length; i++) {
				hlam_584 = new L.circleMarker([hlam584[i][1],hlam584[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam584[i][0])
					.bindTooltip(hlam584[i][0], {direction: 'top'})
					.addTo(hlam584icons);
			}
	}
	else {
		hlam584icons.clearLayers();
	}
}
var hlam585icons = L.layerGroup().addTo(map);
function Hlam585OnOff() {
	var chbox585;
	chbox585=document.getElementById('Hlam585Button');
	if (chbox585.checked) {
		var hlam585 = [
			["Тарелка", -150999, -75557],
			["Тарелка", 35434, -35405],
			["Тарелка", -60974, 181198]
			];
	for (var i = 0; i < hlam585.length; i++) {
				hlam_585 = new L.circleMarker([hlam585[i][1],hlam585[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam585[i][0])
					.bindTooltip(hlam585[i][0], {direction: 'top'})
					.addTo(hlam585icons);
			}
	}
	else {
		hlam585icons.clearLayers();
	}
}
var hlam586icons = L.layerGroup().addTo(map);
function Hlam586OnOff() {
	var chbox586;
	chbox586=document.getElementById('Hlam586Button');
	if (chbox586.checked) {
		var hlam586 = [
			["Тарелка с желтой каемкой", -50735, 2878],
			["Тарелка с желтой каемкой", -50734, 2880]
			];
	for (var i = 0; i < hlam586.length; i++) {
				hlam_586 = new L.circleMarker([hlam586[i][1],hlam586[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam586[i][0])
					.bindTooltip(hlam586[i][0], {direction: 'top'})
					.addTo(hlam586icons);
			}
	}
	else {
		hlam586icons.clearLayers();
	}
}
var hlam587icons = L.layerGroup().addTo(map);
function Hlam587OnOff() {
	var chbox587;
	chbox587=document.getElementById('Hlam587Button');
	if (chbox587.checked) {
		var hlam587 = [
			["Телефон", -50613, -13628],
			["Телефон", -50741, -13685],
			["Телефон", -52761, -13587],
			["Телефон", -54501, -10334],
			["Телефон", -43796, -7399],
			["Телефон", -42635, -5727],
			["Телефон", -52925, -946],
			["Телефон", -67545, -1213],
			["Телефон", -27841, -60130],
			["Телефон", -21692, -44352],
			["Телефон", -47776, -49174],
			["Телефон", -90375, -42747],
			["Телефон", -88994, -41408],
			["Телефон", -56159, -78794],
			["Телефон", -117974, -85307],
			["Телефон", -4495, -130151],
			["Телефон", -56565, -108868],
			["Телефон", -46953, -106896],
			["Телефон", -44110, -107391],
			["Телефон", -46111, -103926],
			["Телефон", -61052, -100172],
			["Телефон", -61338, -100191],
			["Телефон", -48238, -100125],
			["Телефон", -68497, -106565],
			["Телефон", -68514, -106628],
			["Телефон", -68534, -106684],
			["Телефон", -147693, -56485],
			["Телефон", -148137, -55457],
			["Телефон", -155461, -36437],
			["Телефон", -152281, -74909],
			["Телефон", -151663, -72225],
			["Телефон", 169764, -26398],
			["Телефон", 167325, -24401],
			["Телефон", 168726, -22151],
			["Телефон", 173230, -13600],
			["Телефон", 172650, -41164],
			["Телефон", 190782, -35138],
			["Телефон", 147385, -52707],
			["Телефон", 149404, -51470],
			["Телефон", 149331, -52411],
			["Телефон", 149133, -52289],
			["Телефон", 183353, -66131],
			["Телефон", 148398, -79752],
			["Телефон", 128009, -32121],
			["Телефон", 81351, -21041],
			["Телефон", 76650, -14727],
			["Телефон", 97099, -13781],
			["Телефон", 74222, -6585],
			["Телефон", 93375, -4203],
			["Телефон", 93171, -4245],
			["Телефон", 91223, -6570],
			["Телефон", 48448, -22759],
			["Телефон", 28082, -31671],
			["Телефон", 18619, -996],
			["Телефон", 108251, -54604],
			["Телефон", 111686, -55109],
			["Телефон", 50308, -42562],
			["Телефон", 50326, -41722],
			["Телефон", 50326, -42197],
			["Телефон", 51562, -41701],
			["Телефон", 29486, -58273],
			["Телефон", 12806, -83181],
			["Телефон", 29149, -100515],
			["Телефон", -24099, -179971],
			["Телефон", -133932, -153679],
			["Телефон", -138306, -180970],
			["Телефон", -135202, -183020],
			["Телефон", 193444, -169092],
			["Телефон", 189135, -165974],
			["Телефон", 74510, -177763],
			["Телефон", 74229, -177141],
			["Телефон", 74503, -177228],
			["Телефон", -10132, 193412],
			["Телефон", -34886, 172546],
			["Телефон", -93194, 183866],
			["Телефон", -93261, 183723],
			["Телефон", -93266, 183557],
			["Телефон", -17628, 162064],
			["Телефон", -90522, 150138],
			["Телефон", -144678, 137332],
			["Телефон", -141837, 143528],
			["Телефон", -142237, 143534],
			["Телефон", -140857, 156527],
			["Телефон", -141111, 156277],
			["Телефон", 149641, 138781],
			["Телефон", 148112, 137851],
			["Телефон", 153148, 139956],
			["Телефон", 152678, 161861],
			["Телефон", 58649, 176862],
			["Телефон", 11742, 183049],
			["Телефон", 24441, 131492],
			["Телефон", -128918, 120015],
			["Телефон", -42727, 87217],
			["Телефон", -41957, 88173],
			["Телефон", -41587, 88190],
			["Телефон", -41476, 88179],
			["Телефон", -41559, 88147],
			["Телефон", -41575, 87923],
			["Телефон", -41404, 87972],
			["Телефон", -42206, 87317],
			["Телефон", -42969, 88437],
			["Телефон", -41058, 87677],
			["Телефон", -40707, 87763],
			["Телефон", -52886, 56872],
			["Телефон", -19435, 16822],
			["Телефон", -42009, 3228],
			["Телефон", -38029, 3696],
			["Телефон", -35535, 2394],
			["Телефон", -33676, 117],
			["Телефон", -39261, 4782],
			["Телефон", -58884, 12179],
			["Телефон", -46764, 13132],
			["Телефон", -99506, 8147],
			["Телефон", -131989, 12583],
			["Телефон", 181554, 109692],
			["Телефон", 180683, 110975],
			["Телефон", 143507, 98687],
			["Телефон", 131335, 85939],
			["Телефон", 182887, 3473],
			["Телефон", 183489, 2728],
			["Телефон", 46276, 101002],
			["Телефон", 34104, 127798],
			["Телефон", 24306, 122032],
			["Телефон", 25127, 124407],
			["Телефон", 129093, 85669],
			["Телефон", 58820, 58294],
			["Телефон", 28854, 53037],
			["Телефон", 100378, 25054],
			["Телефон", 58291, 10635]
			];
	for (var i = 0; i < hlam587.length; i++) {
				hlam_587 = new L.circleMarker([hlam587[i][1],hlam587[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam587[i][0])
					.bindTooltip(hlam587[i][0], {direction: 'top'})
					.addTo(hlam587icons);
			}
	}
	else {
		hlam587icons.clearLayers();
	}
}
var hlam588icons = L.layerGroup().addTo(map);
function Hlam588OnOff() {
	var chbox588;
	chbox588=document.getElementById('Hlam588Button');
	if (chbox588.checked) {
		var hlam588 = [
			["Тело робопони &quotЛютик&quot", 89478, -53029],
			["Тело робопони &quotЛютик&quot", -129556, 131094]
			];
	for (var i = 0; i < hlam588.length; i++) {
				hlam_588 = new L.circleMarker([hlam588[i][1],hlam588[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam588[i][0])
					.bindTooltip(hlam588[i][0], {direction: 'top'})
					.addTo(hlam588icons);
			}
	}
	else {
		hlam588icons.clearLayers();
	}
}
var hlam589icons = L.layerGroup().addTo(map);
function Hlam589OnOff() {
	var chbox589;
	chbox589=document.getElementById('Hlam589Button');
	if (chbox589.checked) {
		var hlam589 = [
			["Теменная кость", -61811, -127276],
			["Теменная кость", 36052, -35348],
			["Теменная кость", -116208, -137148],
			["Теменная кость", -116216, -137154],
			["Теменная кость", -116210, -137150],
			["Теменная кость", 191829, -166213],
			["Теменная кость", 6737, -154953],
			["Теменная кость", 6737, -154953],
			["Теменная кость", 68454, 202314],
			["Теменная кость", -134113, 59159],
			["Теменная кость", -134144, 59149],
			["Теменная кость", 129271, 19529]
			];
	for (var i = 0; i < hlam589.length; i++) {
				hlam_589 = new L.circleMarker([hlam589[i][1],hlam589[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam589[i][0])
					.bindTooltip(hlam589[i][0], {direction: 'top'})
					.addTo(hlam589icons);
			}
	}
	else {
		hlam589icons.clearLayers();
	}
}
var hlam590icons = L.layerGroup().addTo(map);
function Hlam590OnOff() {
	var chbox590;
	chbox590=document.getElementById('Hlam590Button');
	if (chbox590.checked) {
		var hlam590 = [
			["Товарищ Михаил", -120011, -14215],
			["Товарищ Михаил", -21723, -44018],
			["Товарищ Михаил", -68696, -51640],
			["Товарищ Михаил", -117368, -62682],
			["Товарищ Михаил", -29173, -130247],
			["Товарищ Михаил", -76145, -113811],
			["Товарищ Михаил", 74113, -16865],
			["Товарищ Михаил", -74910, -179158],
			["Товарищ Михаил", -75614, -178703],
			["Товарищ Михаил", -126740, -184004],
			["Товарищ Михаил", 146196, -147950],
			["Товарищ Михаил", 139714, -146438],
			["Товарищ Михаил", 75261, -179409],
			["Товарищ Михаил", 156438, 139188],
			["Товарищ Михаил", -68563, 8676],
			["Товарищ Михаил", -158603, 81771],
			["Товарищ Михаил", 199987, 46249],
			["Товарищ Михаил", 202573, 54551],
			["Товарищ Михаил", 187946, 60794],
			["Товарищ Михаил", 98088, 106401],
			["Товарищ Михаил", 10189, 48872],
			["Товарищ Михаил", -61794, -55661],
			["Товарищ Михаил", -128002, 84937]
			];
	for (var i = 0; i < hlam590.length; i++) {
				hlam_590 = new L.circleMarker([hlam590[i][1],hlam590[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam590[i][0])
					.bindTooltip(hlam590[i][0], {direction: 'top'})
					.addTo(hlam590icons);
			}
	}
	else {
		hlam590icons.clearLayers();
	}
}
var hlam591icons = L.layerGroup().addTo(map);
function Hlam591OnOff() {
	var chbox591;
	chbox591=document.getElementById('Hlam591Button');
	if (chbox591.checked) {
		var hlam591 = [
			["Тонкая мензурка", 144625, -56828],
			["Тонкая мензурка", 96312, -13987],
			["Тонкая мензурка", -84425, 166118],
			["Тонкая мензурка", -84202, 166214],
			["Тонкая мензурка", -83839, 166223],
			["Тонкая мензурка", -97400, 189514],
			["Тонкая мензурка", -97411, 189510],
			["Тонкая мензурка", -97420, 189519],
			["Тонкая мензурка", 101641, 196804],
			["Тонкая мензурка", 100588, 196001],
			["Тонкая мензурка", -90892, 67021],
			["Тонкая мензурка", -88596, 65825]
			];
	for (var i = 0; i < hlam591.length; i++) {
				hlam_591 = new L.circleMarker([hlam591[i][1],hlam591[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam591[i][0])
					.bindTooltip(hlam591[i][0], {direction: 'top'})
					.addTo(hlam591icons);
			}
	}
	else {
		hlam591icons.clearLayers();
	}
}
var hlam592icons = L.layerGroup().addTo(map);
function Hlam592OnOff() {
	var chbox592;
	chbox592=document.getElementById('Hlam592Button');
	if (chbox592.checked) {
		var hlam592 = [
			["Топливный бак", -22002, -58170],
			["Топливный бак", -116208, -59844],
			["Топливный бак", -70992, -69177],
			["Топливный бак", -98165, -126697],
			["Топливный бак", -124337, -129071],
			["Топливный бак", -101785, -115330],
			["Топливный бак", -149088, -58914],
			["Топливный бак", -148063, -58034],
			["Топливный бак", -148105, -58007],
			["Топливный бак", -150824, -56215],
			["Топливный бак", 167287, -21474],
			["Топливный бак", 158184, -68612],
			["Топливный бак", 88645, -20902],
			["Топливный бак", 96206, -12019],
			["Топливный бак", 88230, -3731],
			["Топливный бак", 55102, -66863],
			["Топливный бак", -95375, -146644],
			["Топливный бак", 164478, -150308],
			["Топливный бак", 189690, -165371],
			["Топливный бак", 189891, -164733],
			["Топливный бак", 73349, -174745],
			["Топливный бак", -97343, 184225],
			["Топливный бак", -25836, 143864],
			["Топливный бак", -27046, 144854],
			["Топливный бак", -40865, 161883],
			["Топливный бак", -155271, 164528],
			["Топливный бак", -158920, 186041],
			["Топливный бак", -148514, 149645],
			["Топливный бак", 151172, 134675],
			["Топливный бак", 151147, 134461],
			["Топливный бак", 152243, 140416],
			["Топливный бак", 153642, 160771],
			["Топливный бак", 153617, 160794],
			["Топливный бак", 153607, 160872],
			["Топливный бак", 114631, 199924],
			["Топливный бак", 15524, 197685],
			["Топливный бак", 81442, 181759],
			["Топливный бак", 85401, 184109],
			["Топливный бак", 80030, 184444],
			["Топливный бак", 71798, 137279],
			["Топливный бак", 88498, 156957],
			["Топливный бак", 2600, 138497],
			["Топливный бак", -57489, 88668],
			["Топливный бак", -128487, 80187],
			["Топливный бак", -25506, 11345],
			["Топливный бак", -23063, 11932],
			["Топливный бак", -33984, 80],
			["Топливный бак", 143986, 97864],
			["Топливный бак", 195361, 65529],
			["Топливный бак", 132384, 19099],
			["Топливный бак", 39712, 115673],
			["Топливный бак", 39253, 115364],
			["Топливный бак", 39538, 115335],
			["Топливный бак", 104714, 43494],
			["Топливный бак", 14329, 44057]
			];
	for (var i = 0; i < hlam592.length; i++) {
				hlam_592 = new L.circleMarker([hlam592[i][1],hlam592[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam592[i][0])
					.bindTooltip(hlam592[i][0], {direction: 'top'})
					.addTo(hlam592icons);
			}
	}
	else {
		hlam592icons.clearLayers();
	}
}
var hlam593icons = L.layerGroup().addTo(map);
function Hlam593OnOff() {
	var chbox593;
	chbox593=document.getElementById('Hlam593Button');
	if (chbox593.checked) {
		var hlam593 = [
			["Топливо для Мистера Помощника", -44667, -15615],
			["Топливо для Мистера Помощника", -44667, -15649],
			["Топливо для Мистера Помощника", -53882, -5843],
			["Топливо для Мистера Помощника", -53852, -5836],
			["Топливо для Мистера Помощника", -47306, -6311],
			["Топливо для Мистера Помощника", -100226, -67260],
			["Топливо для Мистера Помощника", -42508, -125771],
			["Топливо для Мистера Помощника", -79697, -108026],
			["Топливо для Мистера Помощника", -151964, -72008],
			["Топливо для Мистера Помощника", -132687, -121572],
			["Топливо для Мистера Помощника", 202369, -127286],
			["Топливо для Мистера Помощника", 129176, -28420],
			["Топливо для Мистера Помощника", 92170, -59620],
			["Топливо для Мистера Помощника", 89632, -56747],
			["Топливо для Мистера Помощника", 35951, -35206],
			["Топливо для Мистера Помощника", 29267, -58167],
			["Топливо для Мистера Помощника", 9621, -107559],
			["Топливо для Мистера Помощника", 9672, -107534],
			["Топливо для Мистера Помощника", 9669, -107577],
			["Топливо для Мистера Помощника", 10033, -106730],
			["Топливо для Мистера Помощника", -2529, -159979],
			["Топливо для Мистера Помощника", -4303, -155984],
			["Топливо для Мистера Помощника", -3983, -155764],
			["Топливо для Мистера Помощника", -3954, -155740],
			["Топливо для Мистера Помощника", -27051, -131881],
			["Топливо для Мистера Помощника", -115671, -137012],
			["Топливо для Мистера Помощника", -62614, -171204],
			["Топливо для Мистера Помощника", -80392, -182255],
			["Топливо для Мистера Помощника", -80397, -182292],
			["Топливо для Мистера Помощника", -80391, -182349],
			["Топливо для Мистера Помощника", -75829, -180014],
			["Топливо для Мистера Помощника", 108784, -161474],
			["Топливо для Мистера Помощника", -66848, 197056],
			["Топливо для Мистера Помощника", -22969, 189437],
			["Топливо для Мистера Помощника", -95769, 190222],
			["Топливо для Мистера Помощника", -95799, 190216],
			["Топливо для Мистера Помощника", -95839, 190205],
			["Топливо для Мистера Помощника", -27280, 162839],
			["Топливо для Мистера Помощника", -41110, 161908],
			["Топливо для Мистера Помощника", -37903, 95596],
			["Топливо для Мистера Помощника", -104220, 38167],
			["Топливо для Мистера Помощника", -47103, 3157],
			["Топливо для Мистера Помощника", -46152, 1588],
			["Топливо для Мистера Помощника", -53997, 11854],
			["Топливо для Мистера Помощника", -98663, 7639],
			["Топливо для Мистера Помощника", 133494, 17587],
			["Топливо для Мистера Помощника", 36200, 38603],
			["Топливо для Мистера Помощника", 19787, 729]
			];
	for (var i = 0; i < hlam593.length; i++) {
				hlam_593 = new L.circleMarker([hlam593[i][1],hlam593[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam593[i][0])
					.bindTooltip(hlam593[i][0], {direction: 'top'})
					.addTo(hlam593icons);
			}
	}
	else {
		hlam593icons.clearLayers();
	}
}
var hlam594icons = L.layerGroup().addTo(map);
function Hlam594OnOff() {
	var chbox594;
	chbox594=document.getElementById('Hlam594Button');
	if (chbox594.checked) {
		var hlam594 = [

			];
	for (var i = 0; i < hlam594.length; i++) {
				hlam_594 = new L.circleMarker([hlam594[i][1],hlam594[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam594[i][0])
					.bindTooltip(hlam594[i][0], {direction: 'top'})
					.addTo(hlam594icons);
			}
	}
	else {
		hlam594icons.clearLayers();
	}
}
var hlam595icons = L.layerGroup().addTo(map);
function Hlam595OnOff() {
	var chbox595;
	chbox595=document.getElementById('Hlam595Button');
	if (chbox595.checked) {
		var hlam595 = [
			["Тостер", -137164, -179933]
			];
	for (var i = 0; i < hlam595.length; i++) {
				hlam_595 = new L.circleMarker([hlam595[i][1],hlam595[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam595[i][0])
					.bindTooltip(hlam595[i][0], {direction: 'top'})
					.addTo(hlam595icons);
			}
	}
	else {
		hlam595icons.clearLayers();
	}
}
var hlam596icons = L.layerGroup().addTo(map);
function Hlam596OnOff() {
	var chbox596;
	chbox596=document.getElementById('Hlam596Button');
	if (chbox596.checked) {
		var hlam596 = [
			["Тостер", -9649, -27357],
			["Тостер", -53218, -13423],
			["Тостер", -24881, -59863],
			["Тостер", -19191, -47097],
			["Тостер", -20508, -44097],
			["Тостер", -37593, -59472],
			["Тостер", -39979, -60052],
			["Тостер", -35927, -58842],
			["Тостер", -14070, -66672],
			["Тостер", -61114, -100089],
			["Тостер", -70344, -104650],
			["Тостер", -72580, -98315],
			["Тостер", -104849, -118027],
			["Тостер", -147754, -56227],
			["Тостер", -150804, -74939],
			["Тостер", 167525, -24061],
			["Тостер", 149133, -52330],
			["Тостер", 48711, -21992],
			["Тостер", 50080, -23367],
			["Тостер", 28204, -31047],
			["Тостер", 108006, -54321],
			["Тостер", 91652, -59418],
			["Тостер", 93939, -84813],
			["Тостер", 22830, -149391],
			["Тостер", -4343, 184904],
			["Тостер", -60598, 181913],
			["Тостер", -92844, 183332],
			["Тостер", -178658, 192173],
			["Тостер", -138590, 152470],
			["Тостер", 151958, 139073],
			["Тостер", 6246, 164143],
			["Тостер", 26733, 172119],
			["Тостер", 26752, 172124],
			["Тостер", 26765, 172122],
			["Тостер", 2665, 137991],
			["Тостер", 2989, 162504],
			["Тостер", -27323, 124603],
			["Тостер", -27313, 124585],
			["Тостер", -27268, 124579],
			["Тостер", -27296, 124676],
			["Тостер", -27277, 124656],
			["Тостер", -27373, 124652],
			["Тостер", -128972, 120049],
			["Тостер", -39430, 46650],
			["Тостер", -179769, 74890],
			["Тостер", 23518, 44324],
			["Тостер", 27008, 50163],
			["Тостер", 24922, 54876],
			["Тостер", 29343, 53820]
			];
	for (var i = 0; i < hlam596.length; i++) {
				hlam_596 = new L.circleMarker([hlam596[i][1],hlam596[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam596[i][0])
					.bindTooltip(hlam596[i][0], {direction: 'top'})
					.addTo(hlam596icons);
			}
	}
	else {
		hlam596icons.clearLayers();
	}
}
var hlam597icons = L.layerGroup().addTo(map);
function Hlam597OnOff() {
	var chbox597;
	chbox597=document.getElementById('Hlam597Button');
	if (chbox597.checked) {
		var hlam597 = [
			["Треснутая стеклянная миска", -122952, -122938],
			["Треснутая стеклянная миска", 148475, -79852],
			["Треснутая стеклянная миска", 154067, -104529],
			["Треснутая стеклянная миска", 153614, -104694],
			["Треснутая стеклянная миска", 82570, -20998],
			["Треснутая стеклянная миска", 35859, -34866],
			["Треснутая стеклянная миска", -126548, -135364],
			["Треснутая стеклянная миска", -25045, 185659],
			["Треснутая стеклянная миска", -145692, 173012],
			["Треснутая стеклянная миска", -146216, 172624],
			["Треснутая стеклянная миска", -147115, 178657],
			["Треснутая стеклянная миска", 95858, 187215],
			["Треснутая стеклянная миска", 93485, 189104],
			["Треснутая стеклянная миска", -99846, 39626],
			["Треснутая стеклянная миска", -48826, 19787],
			["Треснутая стеклянная миска", 182838, 2947],
			["Треснутая стеклянная миска", 109657, 57489]
			];
	for (var i = 0; i < hlam597.length; i++) {
				hlam_597 = new L.circleMarker([hlam597[i][1],hlam597[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam597[i][0])
					.bindTooltip(hlam597[i][0], {direction: 'top'})
					.addTo(hlam597icons);
			}
	}
	else {
		hlam597icons.clearLayers();
	}
}
var hlam598icons = L.layerGroup().addTo(map);
function Hlam598OnOff() {
	var chbox598;
	chbox598=document.getElementById('Hlam598Button');
	if (chbox598.checked) {
		var hlam598 = [
			["Треугольник", -49836, -12853],
			["Треугольник", -43780, -6964],
			["Треугольник", -70147, -103657],
			["Треугольник", -148438, -55595],
			["Треугольник", -151729, -75242],
			["Треугольник", -151219, -75181],
			["Треугольник", 147878, -48817],
			["Треугольник", 149271, -75759],
			["Треугольник", 88022, -21777],
			["Треугольник", 88146, -22027],
			["Треугольник", 74936, -9463],
			["Треугольник", 29513, -58485],
			["Треугольник", 19416, -106789],
			["Треугольник", 19435, -106492],
			["Треугольник", 171123, 56588],
			["Треугольник", 183035, 3338],
			["Треугольник", 22366, 47509],
			["Треугольник", 58773, 10875]
			];
	for (var i = 0; i < hlam598.length; i++) {
				hlam_598 = new L.circleMarker([hlam598[i][1],hlam598[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam598[i][0])
					.bindTooltip(hlam598[i][0], {direction: 'top'})
					.addTo(hlam598icons);
			}
	}
	else {
		hlam598icons.clearLayers();
	}
}
var hlam599icons = L.layerGroup().addTo(map);
function Hlam599OnOff() {
	var chbox599;
	chbox599=document.getElementById('Hlam599Button');
	if (chbox599.checked) {
		var hlam599 = [

			];
	for (var i = 0; i < hlam599.length; i++) {
				hlam_599 = new L.circleMarker([hlam599[i][1],hlam599[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam599[i][0])
					.bindTooltip(hlam599[i][0], {direction: 'top'})
					.addTo(hlam599icons);
			}
	}
	else {
		hlam599icons.clearLayers();
	}
}
var hlam600icons = L.layerGroup().addTo(map);
function Hlam600OnOff() {
	var chbox600;
	chbox600=document.getElementById('Hlam600Button');
	if (chbox600.checked) {
		var hlam600 = [
			["Труба", -121914, 187523],
			["Труба", 16341, 193272]
			];
	for (var i = 0; i < hlam600.length; i++) {
				hlam_600 = new L.circleMarker([hlam600[i][1],hlam600[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam600[i][0])
					.bindTooltip(hlam600[i][0], {direction: 'top'})
					.addTo(hlam600icons);
			}
	}
	else {
		hlam600icons.clearLayers();
	}
}