var hlam201icons = L.layerGroup().addTo(map);
function Hlam201OnOff() {
	var chbox201;
	chbox201=document.getElementById('Hlam201Button');
	if (chbox201.checked) {
		var hlam201 = [
			["Коробка с капсюлями", -46585, -51561],
			["Коробка с капсюлями", -129614, -91361],
			["Коробка с капсюлями", -93123, -131068],
			["Коробка с капсюлями", -84675, -121187],
			["Коробка с капсюлями", -122498, -125267],
			["Коробка с капсюлями", -148791, -56002],
			["Коробка с капсюлями", -146286, -95565],
			["Коробка с капсюлями", -146115, -95996],
			["Коробка с капсюлями", -151857, -72989],
			["Коробка с капсюлями", -149886, -99390],
			["Коробка с капсюлями", -150869, -102089],
			["Коробка с капсюлями", -27624, -131802],
			["Коробка с капсюлями", -117096, -140238],
			["Коробка с капсюлями", -117125, -140221],
			["Коробка с капсюлями", -124381, -136624],
			["Коробка с капсюлями", -124538, -136305],
			["Коробка с капсюлями", -122040, -135675],
			["Коробка с капсюлями", -121837, -136353],
			["Коробка с капсюлями", -123652, -131256],
			["Коробка с капсюлями", -123650, -134154],
			["Коробка с капсюлями", -124414, -131525],
			["Коробка с капсюлями", -108284, -134107],
			["Коробка с капсюлями", -108616, -187743],
			["Коробка с капсюлями", -108913, -187352],
			["Коробка с капсюлями", -95865, 197079],
			["Коробка с капсюлями", -95876, 197150],
			["Коробка с капсюлями", -97725, 200550],
			["Коробка с капсюлями", -97681, 200519],
			["Коробка с капсюлями", -38627, 158518],
			["Коробка с капсюлями", -40326, 158299],
			["Коробка с капсюлями", -114115, 155625],
			["Коробка с капсюлями", -114154, 155604],
			["Коробка с капсюлями", -109307, 157316],
			["Коробка с капсюлями", -109686, 157187],
			["Коробка с капсюлями", -109707, 157815],
			["Коробка с капсюлями", -109328, 157629],
			["Коробка с капсюлями", -109652, 157624],
			["Коробка с капсюлями", 68786, 203401],
			["Коробка с капсюлями", 112127, 140033],
			["Коробка с капсюлями", 373, 137954],
			["Коробка с капсюлями", -104022, 109125],
			["Коробка с капсюлями", -56173, 10549],
			["Коробка с капсюлями", 129750, 119627],
			["Коробка с капсюлями", 129768, 119631],
			["Коробка с капсюлями", -129927, -156085],
			["Коробка с капсюлями", -129926, -156087],
			["Коробка с капсюлями", -138206, -139788]
			];
	for (var i = 0; i < hlam201.length; i++) {
				hlam_201 = new L.circleMarker([hlam201[i][1],hlam201[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam201[i][0])
					.bindTooltip(hlam201[i][0], {direction: 'top'})
					.addTo(hlam201icons);
			}
	}
	else {
		hlam201icons.clearLayers();
	}
}
var hlam202icons = L.layerGroup().addTo(map);
function Hlam202OnOff() {
	var chbox202;
	chbox202=document.getElementById('Hlam202Button');
	if (chbox202.checked) {
		var hlam202 = [
			["Коробка с летучими веществами", -120253, -45916],
			["Коробка с летучими веществами", -119310, -46798],
			["Коробка с летучими веществами", -119708, -46907],
			["Коробка с летучими веществами", -101661, -85041],
			["Коробка с летучими веществами", -75816, -113928],
			["Коробка с летучими веществами", -78625, -108521],
			["Коробка с летучими веществами", -77466, -108403],
			["Коробка с летучими веществами", -152971, -1411],
			["Коробка с летучими веществами", -152327, -1],
			["Коробка с летучими веществами", 100961, -24312],
			["Коробка с летучими веществами", 48206, -21692],
			["Коробка с летучими веществами", 48775, -22261],
			["Коробка с летучими веществами", 48168, -20868],
			["Коробка с летучими веществами", 68028, -88617],
			["Коробка с летучими веществами", -136955, -181063],
			["Коробка с летучими веществами", 190931, -169629],
			["Коробка с летучими веществами", 188985, -165402],
			["Коробка с летучими веществами", 108310, -161244],
			["Коробка с летучими веществами", -38673, 158767],
			["Коробка с летучими веществами", -37804, 159755],
			["Коробка с летучими веществами", -40621, 161604],
			["Коробка с летучими веществами", -154086, 165138],
			["Коробка с летучими веществами", -63848, 130992],
			["Коробка с летучими веществами", -86516, 115678],
			["Коробка с летучими веществами", -52511, 57267],
			["Коробка с летучими веществами", -23497, 10490],
			["Коробка с летучими веществами", -24268, 10189],
			["Коробка с летучими веществами", -56133, 10566],
			["Коробка с летучими веществами", -43124, 26672],
			["Коробка с летучими веществами", -68381, 3091],
			["Коробка с летучими веществами", -148438, 113457],
			["Коробка с летучими веществами", -148304, 112348],
			["Коробка с летучими веществами", -153367, 385],
			["Коробка с летучими веществами", 91651, 114971],
			["Коробка с летучими веществами", 75075, 46437],
			["Коробка с летучими веществами", -143431, 153372]
			];
	for (var i = 0; i < hlam202.length; i++) {
				hlam_202 = new L.circleMarker([hlam202[i][1],hlam202[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam202[i][0])
					.bindTooltip(hlam202[i][0], {direction: 'top'})
					.addTo(hlam202icons);
			}
	}
	else {
		hlam202icons.clearLayers();
	}
}
var hlam203icons = L.layerGroup().addTo(map);
function Hlam203OnOff() {
	var chbox203;
	chbox203=document.getElementById('Hlam203Button');
	if (chbox203.checked) {
		var hlam203 = [
			["Коробка сигар", -36196, -17930],
			["Коробка сигар", -51897, -13705],
			["Коробка сигар", -50563, -13626],
			["Коробка сигар", -50739, -13647],
			["Коробка сигар", -43418, -6691],
			["Коробка сигар", -33467, -209],
			["Коробка сигар", -20975, -44366],
			["Коробка сигар", -55713, -59963],
			["Коробка сигар", -56437, -60800],
			["Коробка сигар", -88086, -43133],
			["Коробка сигар", -112462, -59201],
			["Коробка сигар", -58971, -89310],
			["Коробка сигар", -46674, -72894],
			["Коробка сигар", -52561, -65922],
			["Коробка сигар", -68223, -83733],
			["Коробка сигар", -72803, -98460],
			["Коробка сигар", -111071, -112265],
			["Коробка сигар", -133547, -5996],
			["Коробка сигар", -149050, -58207],
			["Коробка сигар", -148661, -55977],
			["Коробка сигар", -157942, -43565],
			["Коробка сигар", -152043, -74624],
			["Коробка сигар", -152292, -75092],
			["Коробка сигар", -151320, -72026],
			["Коробка сигар", 166920, -25862],
			["Коробка сигар", 152000, -49363],
			["Коробка сигар", 147755, -48944],
			["Коробка сигар", 196726, -91185],
			["Коробка сигар", 183158, -65952],
			["Коробка сигар", 143565, -89004],
			["Коробка сигар", 92239, -31753],
			["Коробка сигар", 77595, -15413],
			["Коробка сигар", 96695, -13885],
			["Коробка сигар", 74967, -8768],
			["Коробка сигар", 73344, -6889],
			["Коробка сигар", 87556, -5834],
			["Коробка сигар", 51353, -41870],
			["Коробка сигар", 39737, -37941],
			["Коробка сигар", 25738, -60594],
			["Коробка сигар", 31327, -33440],
			["Коробка сигар", 98854, -124466],
			["Коробка сигар", 2455, -113875],
			["Коробка сигар", -29613, -132658],
			["Коробка сигар", -60524, -145561],
			["Коробка сигар", -117081, -163325],
			["Коробка сигар", -126387, -135316],
			["Коробка сигар", -125936, -134198],
			["Коробка сигар", -126580, -134122],
			["Коробка сигар", -134382, -153825],
			["Коробка сигар", -139689, -143907],
			["Коробка сигар", 135528, -156639],
			["Коробка сигар", -4024, 184582],
			["Коробка сигар", -49368, 175968],
			["Коробка сигар", -60440, 181325],
			["Коробка сигар", -92973, 180602],
			["Коробка сигар", -39129, 158728],
			["Коробка сигар", -143677, 178717],
			["Коробка сигар", 150315, 138248],
			["Коробка сигар", 101747, 196622],
			["Коробка сигар", 103249, 191138],
			["Коробка сигар", 95980, 187317],
			["Коробка сигар", 44183, 164139],
			["Коробка сигар", 59924, 173172],
			["Коробка сигар", -25859, 99318],
			["Коробка сигар", -25856, 99307],
			["Коробка сигар", -128842, 120339],
			["Коробка сигар", -129462, 119883],
			["Коробка сигар", -128671, 119806],
			["Коробка сигар", -41741, 87557],
			["Коробка сигар", -43781, 90885],
			["Коробка сигар", -41073, 90616],
			["Коробка сигар", -79312, 88919],
			["Коробка сигар", -121959, 40732],
			["Коробка сигар", -104634, 41791],
			["Коробка сигар", -23316, 11980],
			["Коробка сигар", -38780, 3915],
			["Коробка сигар", -40054, 6499],
			["Коробка сигар", -47734, 20570],
			["Коробка сигар", -43683, 29267],
			["Коробка сигар", -99429, 7862],
			["Коробка сигар", -99639, 7451],
			["Коробка сигар", 161287, 112849],
			["Коробка сигар", 132536, 126222],
			["Коробка сигар", 196166, 65792],
			["Коробка сигар", 131341, 85239],
			["Коробка сигар", 193622, 56174],
			["Коробка сигар", 169784, 60259],
			["Коробка сигар", 128911, 85242],
			["Коробка сигар", 88950, 53198],
			["Коробка сигар", 88669, 53042],
			["Коробка сигар", 13915, 38620],
			["Коробка сигар", 104169, 6848],
			["Коробка сигар", -155952, 51631]
			];
	for (var i = 0; i < hlam203.length; i++) {
				hlam_203 = new L.circleMarker([hlam203[i][1],hlam203[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam203[i][0])
					.bindTooltip(hlam203[i][0], {direction: 'top'})
					.addTo(hlam203icons);
			}
	}
	else {
		hlam203icons.clearLayers();
	}
}
var hlam204icons = L.layerGroup().addTo(map);
function Hlam204OnOff() {
	var chbox204;
	chbox204=document.getElementById('Hlam204Button');
	if (chbox204.checked) {
		var hlam204 = [
			["Кости левой ноги", -22260, -45569],
			["Кости левой ноги", -18265, -44504],
			["Кости левой ноги", -72201, -77884],
			["Кости левой ноги", -72167, -77999],
			["Кости левой ноги", -158773, -57822],
			["Кости левой ноги", -168141, -42046],
			["Кости левой ноги", 191157, -7531],
			["Кости левой ноги", 191621, -7671],
			["Кости левой ноги", 191571, -7993],
			["Кости левой ноги", 34878, -6354],
			["Кости левой ноги", -76521, -184074],
			["Кости левой ноги", -81596, -178202],
			["Кости левой ноги", 165618, -132843],
			["Кости левой ноги", 189203, -169506],
			["Кости левой ноги", 72500, -180823],
			["Кости левой ноги", -143445, 172208],
			["Кости левой ноги", -142828, 173192],
			["Кости левой ноги", -158488, 185696],
			["Кости левой ноги", 68842, 202670],
			["Кости левой ноги", 40820, 133378],
			["Кости левой ноги", 38148, 144719],
			["Кости левой ноги", -19467, 16597],
			["Кости левой ноги", -56651, 8821],
			["Кости левой ноги", -56133, 8915],
			["Кости левой ноги", -152060, 455],
			["Кости левой ноги", 183780, 2996],
			["Кости левой ноги", 129765, 74219],
			["Кости левой ноги", 129843, 74229],
			["Кости левой ноги", 129953, 74350],
			["Кости левой ноги", 103317, 57141],
			["Кости левой ноги", 102416, 56988],
			["Кости левой ноги", 51945, 1331],
			["Кости левой ноги", -101633, 84871]
			];
	for (var i = 0; i < hlam204.length; i++) {
				hlam_204 = new L.circleMarker([hlam204[i][1],hlam204[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam204[i][0])
					.bindTooltip(hlam204[i][0], {direction: 'top'})
					.addTo(hlam204icons);
			}
	}
	else {
		hlam204icons.clearLayers();
	}
}
var hlam205icons = L.layerGroup().addTo(map);
function Hlam205OnOff() {
	var chbox205;
	chbox205=document.getElementById('Hlam205Button');
	if (chbox205.checked) {
		var hlam205 = [
			["Кости левой руки", -18256, -44461],
			["Кости левой руки", -96024, -60212],
			["Кости левой руки", -52464, -96518],
			["Кости левой руки", -158784, -57835],
			["Кости левой руки", -168252, -42041],
			["Кости левой руки", 103689, -20788],
			["Кости левой руки", 56277, -2127],
			["Кости левой руки", 189081, -169264],
			["Кости левой руки", 187685, -165229],
			["Кости левой руки", 111860, -134416],
			["Кости левой руки", 2460, -140138],
			["Кости левой руки", 72537, -180791],
			["Кости левой руки", -93594, 183992],
			["Кости левой руки", -20947, 150676],
			["Кости левой руки", -143104, 138584],
			["Кости левой руки", 166567, 177969],
			["Кости левой руки", 166767, 177551],
			["Кости левой руки", 166480, 177507],
			["Кости левой руки", 166515, 178034],
			["Кости левой руки", 166479, 177754],
			["Кости левой руки", 166346, 179000],
			["Кости левой руки", 166510, 178388],
			["Кости левой руки", 166464, 178739],
			["Кости левой руки", 166480, 178478],
			["Кости левой руки", 68890, 202560],
			["Кости левой руки", 68742, 202670],
			["Кости левой руки", 68757, 202685],
			["Кости левой руки", 68902, 202690],
			["Кости левой руки", 69788, 202909],
			["Кости левой руки", 69962, 202161],
			["Кости левой руки", 57236, 191232],
			["Кости левой руки", -80743, 102715],
			["Кости левой руки", -80243, 118333],
			["Кости левой руки", -152120, 387],
			["Кости левой руки", 183528, 3171],
			["Кости левой руки", 183747, 3255],
			["Кости левой руки", 100465, 71917],
			["Кости левой руки", 130374, 86476],
			["Кости левой руки", 53497, 65369],
			["Кости левой руки", 54944, 1725],
			["Кости левой руки", 148401, 135505],
			["Кости левой руки", -101645, 84861],
			["Кости левой руки", -121153, 31341],
			["Кости левой руки", -143431, 153370],
			["Кости левой руки", 111752, -164463]
			];
	for (var i = 0; i < hlam205.length; i++) {
				hlam_205 = new L.circleMarker([hlam205[i][1],hlam205[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam205[i][0])
					.bindTooltip(hlam205[i][0], {direction: 'top'})
					.addTo(hlam205icons);
			}
	}
	else {
		hlam205icons.clearLayers();
	}
}
var hlam206icons = L.layerGroup().addTo(map);
function Hlam206OnOff() {
	var chbox206;
	chbox206=document.getElementById('Hlam206Button');
	if (chbox206.checked) {
		var hlam206 = [
			["Кости левой руки", -18230, -44467],
			["Кости левой руки", -72100, -78179],
			["Кости левой руки", -72206, -78062],
			["Кости левой руки", -72100, -78062],
			["Кости левой руки", -158834, -57824],
			["Кости левой руки", -168180, -41997],
			["Кости левой руки", 103678, -20756],
			["Кости левой руки", 104778, -21951],
			["Кости левой руки", 34966, -6412],
			["Кости левой руки", -76476, -184095],
			["Кости левой руки", 165636, -132988],
			["Кости левой руки", 187042, -169730],
			["Кости левой руки", 191846, -166215],
			["Кости левой руки", 72498, -180789],
			["Кости левой руки", 166593, 177897],
			["Кости левой руки", 148367, 135511],
			["Кости левой руки", 68850, 202687],
			["Кости левой руки", -152088, 390],
			["Кости левой руки", 131293, 85178],
			["Кости левой руки", 183672, 2995],
			["Кости левой руки", 183798, 3020],
			["Кости левой руки", 94863, 98948],
			["Кости левой руки", 129741, 74206],
			["Кости левой руки", 129942, 74384],
			["Кости левой руки", 54897, 1607],
			["Кости левой руки", 130383, 86507],
			["Кости левой руки", -101622, 84919],
			["Кости левой руки", -101623, 84923],
			["Кости левой руки", -121153, 31336]
			];
	for (var i = 0; i < hlam206.length; i++) {
				hlam_206 = new L.circleMarker([hlam206[i][1],hlam206[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam206[i][0])
					.bindTooltip(hlam206[i][0], {direction: 'top'})
					.addTo(hlam206icons);
			}
	}
	else {
		hlam206icons.clearLayers();
	}
}
var hlam207icons = L.layerGroup().addTo(map);
function Hlam207OnOff() {
	var chbox207;
	chbox207=document.getElementById('Hlam207Button');
	if (chbox207.checked) {
		var hlam207 = [
			["Кости левой стопы", -18313, -44522],
			["Кости левой стопы", -85069, -45692],
			["Кости левой стопы", -126198, -74237],
			["Кости левой стопы", -158722, -57822],
			["Кости левой стопы", 190786, -7632],
			["Кости левой стопы", 191645, -7511],
			["Кости левой стопы", 191617, -7830],
			["Кости левой стопы", -102498, -179744],
			["Кости левой стопы", 165770, -132953],
			["Кости левой стопы", 191621, -164534],
			["Кости левой стопы", 49587, -148129],
			["Кости левой стопы", 72541, -180837],
			["Кости левой стопы", -61282, 182521],
			["Кости левой стопы", -108702, 140536],
			["Кости левой стопы", -158437, 185667],
			["Кости левой стопы", 69158, 202450],
			["Кости левой стопы", 68928, 202658],
			["Кости левой стопы", 68796, 202673],
			["Кости левой стопы", 69986, 202087],
			["Кости левой стопы", -57617, 88733],
			["Кости левой стопы", -128026, 85531],
			["Кости левой стопы", -56713, 8973],
			["Кости левой стопы", -56788, 8773],
			["Кости левой стопы", -152086, 496],
			["Кости левой стопы", 131381, 85084],
			["Кости левой стопы", 183624, 2991],
			["Кости левой стопы", 129927, 74403],
			["Кости левой стопы", 129813, 74175],
			["Кости левой стопы", 103457, 57200],
			["Кости левой стопы", 56119, 54853],
			["Кости левой стопы", 14217, 39502],
			["Кости левой стопы", 101751, 3369],
			["Кости левой стопы", 130056, 18745],
			["Кости левой стопы", 55184, 1469],
			["Кости левой стопы", -101646, 84910]
			];
	for (var i = 0; i < hlam207.length; i++) {
				hlam_207 = new L.circleMarker([hlam207[i][1],hlam207[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam207[i][0])
					.bindTooltip(hlam207[i][0], {direction: 'top'})
					.addTo(hlam207icons);
			}
	}
	else {
		hlam207icons.clearLayers();
	}
}
var hlam208icons = L.layerGroup().addTo(map);
function Hlam208OnOff() {
	var chbox208;
	chbox208=document.getElementById('Hlam208Button');
	if (chbox208.checked) {
		var hlam208 = [
			["Кости правой ноги", -18262, -44552],
			["Кости правой ноги", -31066, -66295],
			["Кости правой ноги", -158749, -57796],
			["Кости правой ноги", -168159, -42079],
			["Кости правой ноги", 191320, -7648],
			["Кости правой ноги", 191685, -7603],
			["Кости правой ноги", 191510, -7915],
			["Кости правой ноги", 109585, -20766],
			["Кости правой ноги", 34973, -6189],
			["Кости правой ноги", 56315, -2229],
			["Кости правой ноги", -103076, -179146],
			["Кости правой ноги", 192061, -168599],
			["Кости правой ноги", 72407, -180786],
			["Кости правой ноги", 166604, 178356],
			["Кости правой ноги", 68805, 202662],
			["Кости правой ноги", 68870, 202646],
			["Кости правой ноги", 69706, 202206],
			["Кости правой ноги", 70241, 202116],
			["Кости правой ноги", 26606, 184651],
			["Кости правой ноги", -56483, 8751],
			["Кости правой ноги", -56839, 8430],
			["Кости правой ноги", -152126, 469],
			["Кости правой ноги", -151013, 1957],
			["Кости правой ноги", 94959, 98972],
			["Кости правой ноги", 130038, 74282],
			["Кости правой ноги", 130018, 74420],
			["Кости правой ноги", 101612, 3295],
			["Кости правой ноги", -101617, 84870]
			];
	for (var i = 0; i < hlam208.length; i++) {
				hlam_208 = new L.circleMarker([hlam208[i][1],hlam208[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam208[i][0])
					.bindTooltip(hlam208[i][0], {direction: 'top'})
					.addTo(hlam208icons);
			}
	}
	else {
		hlam208icons.clearLayers();
	}
}
var hlam209icons = L.layerGroup().addTo(map);
function Hlam209OnOff() {
	var chbox209;
	chbox209=document.getElementById('Hlam209Button');
	if (chbox209.checked) {
		var hlam209 = [
			["Кости правой руки", -18113, -44482],
			["Кости правой руки", -68866, -51986],
			["Кости правой руки", -68340, -77614],
			["Кости правой руки", -126211, -74232],
			["Кости правой руки", -158798, -57788],
			["Кости правой руки", -168140, -42008],
			["Кости правой руки", 79869, -2503],
			["Кости правой руки", 34830, -6433],
			["Кости правой руки", 164361, -150113],
			["Кости правой руки", 165640, -132820],
			["Кости правой руки", 144111, -148591],
			["Кости правой руки", 72405, -180737],
			["Кости правой руки", 68794, 202692],
			["Кости правой руки", 68889, 202695],
			["Кости правой руки", -57544, 88683],
			["Кости правой руки", -105432, 43713],
			["Кости правой руки", -152186, 449],
			["Кости правой руки", 129865, 18607],
			["Кости правой руки", 51290, 474],
			["Кости правой руки", 129240, 85690],
			["Кости правой руки", -101606, 84866],
			["Кости правой руки", -128271, 82366]
			];
	for (var i = 0; i < hlam209.length; i++) {
				hlam_209 = new L.circleMarker([hlam209[i][1],hlam209[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam209[i][0])
					.bindTooltip(hlam209[i][0], {direction: 'top'})
					.addTo(hlam209icons);
			}
	}
	else {
		hlam209icons.clearLayers();
	}
}
var hlam210icons = L.layerGroup().addTo(map);
function Hlam210OnOff() {
	var chbox210;
	chbox210=document.getElementById('Hlam210Button');
	if (chbox210.checked) {
		var hlam210 = [
			["Кости правой руки", -59238, -22818],
			["Кости правой руки", -18145, -44503],
			["Кости правой руки", -72074, -77962],
			["Кости правой руки", -72220, -77944],
			["Кости правой руки", -72266, -77995],
			["Кости правой руки", -72268, -77855],
			["Кости правой руки", -125102, -116142],
			["Кости правой руки", -158832, -57793],
			["Кости правой руки", -168224, -42032],
			["Кости правой руки", 99948, -20949],
			["Кости правой руки", 100425, -21676],
			["Кости правой руки", 109665, -20744],
			["Кости правой руки", 102090, -18259],
			["Кости правой руки", 103666, -20367],
			["Кости правой руки", 105136, -8670],
			["Кости правой руки", 103791, -12262],
			["Кости правой руки", 79837, -2491],
			["Кости правой руки", 34847, -6406],
			["Кости правой руки", 99938, -84544],
			["Кости правой руки", 99946, -84550],
			["Кости правой руки", 38072, -119285],
			["Кости правой руки", -102621, -179593],
			["Кости правой руки", 189089, -169328],
			["Кости правой руки", 189986, -169018],
			["Кости правой руки", 111837, -134393],
			["Кости правой руки", 72433, -180762],
			["Кости правой руки", -59645, 181391],
			["Кости правой руки", -60527, 181001],
			["Кости правой руки", -61087, 182209],
			["Кости правой руки", 166528, 178547],
			["Кости правой руки", 68934, 202619],
			["Кости правой руки", 69170, 202436],
			["Кости правой руки", 68856, 202664],
			["Кости правой руки", 38888, 144584],
			["Кости правой руки", -80288, 118401],
			["Кости правой руки", -80986, 118022],
			["Кости правой руки", -105404, 43705],
			["Кости правой руки", -19892, 16842],
			["Кости правой руки", -56538, 8735],
			["Кости правой руки", -152162, 431],
			["Кости правой руки", 148882, 32989],
			["Кости правой руки", 183759, 3216],
			["Кости правой руки", 130007, 74315],
			["Кости правой руки", 129833, 74209],
			["Кости правой руки", 129744, 74280],
			["Кости правой руки", 20310, 90049],
			["Кости правой руки", 102342, 57001],
			["Кости правой руки", 103384, 57244],
			["Кости правой руки", 14146, 39377],
			["Кости правой руки", 129893, 18622],
			["Кости правой руки", 82253, 15492],
			["Кости правой руки", -101633, 84922],
			["Кости правой руки", -101632, 84917],
			["Кости правой руки", -128288, 82381]
			];
	for (var i = 0; i < hlam210.length; i++) {
				hlam_210 = new L.circleMarker([hlam210[i][1],hlam210[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam210[i][0])
					.bindTooltip(hlam210[i][0], {direction: 'top'})
					.addTo(hlam210icons);
			}
	}
	else {
		hlam210icons.clearLayers();
	}
}
var hlam211icons = L.layerGroup().addTo(map);
function Hlam211OnOff() {
	var chbox211;
	chbox211=document.getElementById('Hlam211Button');
	if (chbox211.checked) {
		var hlam211 = [
			["Кости правой стопы", -59040, -22947],
			["Кости правой стопы", -18303, -44571],
			["Кости правой стопы", -158787, -57771],
			["Кости правой стопы", -168108, -42074],
			["Кости правой стопы", 191499, -8213],
			["Кости правой стопы", 191523, -7775],
			["Кости правой стопы", 191611, -7705],
			["Кости правой стопы", 34969, -6146],
			["Кости правой стопы", 56299, -2273],
			["Кости правой стопы", -81668, -178151],
			["Кости правой стопы", 165576, -132901],
			["Кости правой стопы", 189187, -169519],
			["Кости правой стопы", 191969, -168619],
			["Кости правой стопы", 6853, -154935],
			["Кости правой стопы", 6853, -154935],
			["Кости правой стопы", 72369, -180754],
			["Кости правой стопы", 166328, 178564],
			["Кости правой стопы", 148318, 135591],
			["Кости правой стопы", 68912, 202652],
			["Кости правой стопы", 68787, 202676],
			["Кости правой стопы", 70213, 202118],
			["Кости правой стопы", 26858, 184962],
			["Кости правой стопы", 26672, 184851],
			["Кости правой стопы", -80868, 118122],
			["Кости правой стопы", -57611, 88702],
			["Кости правой стопы", -66044, 4817],
			["Кости правой стопы", -152073, 436],
			["Кости правой стопы", 131247, 85233],
			["Кости правой стопы", 129919, 74380],
			["Кости правой стопы", 130009, 74368],
			["Кости правой стопы", 102359, 57078],
			["Кости правой стопы", 55968, 12780],
			["Кости правой стопы", 29899, 15242],
			["Кости правой стопы", -101604, 84879]
			];
	for (var i = 0; i < hlam211.length; i++) {
				hlam_211 = new L.circleMarker([hlam211[i][1],hlam211[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam211[i][0])
					.bindTooltip(hlam211[i][0], {direction: 'top'})
					.addTo(hlam211icons);
			}
	}
	else {
		hlam211icons.clearLayers();
	}
}
var hlam212icons = L.layerGroup().addTo(map);
function Hlam212OnOff() {
	var chbox212;
	chbox212=document.getElementById('Hlam212Button');
	if (chbox212.checked) {
		var hlam212 = [
			["Кости таза", -48552, -58727],
			["Кости таза", -102583, -56797],
			["Кости таза", -114632, -99563],
			["Кости таза", -168175, -42042],
			["Кости таза", 142631, -59927],
			["Кости таза", 97418, -22628],
			["Кости таза", 165633, -132829],
			["Кости таза", 2347, -140114],
			["Кости таза", -59794, 181488],
			["Кости таза", 69116, 202595],
			["Кости таза", 69107, 202623],
			["Кости таза", 69656, 202540],
			["Кости таза", 57303, 191210],
			["Кости таза", 37687, 145875],
			["Кости таза", 38046, 144856],
			["Кости таза", 38877, 144637],
			["Кости таза", 38943, 146315],
			["Кости таза", 39125, 146031],
			["Кости таза", -80849, 102943],
			["Кости таза", -80209, 118304],
			["Кости таза", -80110, 117680],
			["Кости таза", -55977, 9095],
			["Кости таза", -56610, 8495],
			["Кости таза", -65883, 4844],
			["Кости таза", -65859, 4800],
			["Кости таза", 183761, 3243],
			["Кости таза", 130004, 18718],
			["Кости таза", -101626, 84891]
			];
	for (var i = 0; i < hlam212.length; i++) {
				hlam_212 = new L.circleMarker([hlam212[i][1],hlam212[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam212[i][0])
					.bindTooltip(hlam212[i][0], {direction: 'top'})
					.addTo(hlam212icons);
			}
	}
	else {
		hlam212icons.clearLayers();
	}
}
var hlam213icons = L.layerGroup().addTo(map);
function Hlam213OnOff() {
	var chbox213;
	chbox213=document.getElementById('Hlam213Button');
	if (chbox213.checked) {
		var hlam213 = [
			["Косторез", -8551, -3156],
			["Косторез", -36176, -80842],
			["Косторез", -35608, -80596],
			["Косторез", -35805, -80587],
			["Косторез", -93777, -129770],
			["Косторез", -68860, -105431],
			["Косторез", 149010, -51907],
			["Косторез", 102186, -12556],
			["Косторез", 101666, -12196],
			["Косторез", 89893, -124850],
			["Косторез", 20513, -109116],
			["Косторез", 144505, -145825],
			["Косторез", 131451, -132217],
			["Косторез", 115228, -157588],
			["Косторез", 102647, -151407],
			["Косторез", 74224, -172348],
			["Косторез", 74331, -172237],
			["Косторез", -90262, 149111],
			["Косторез", 70037, 202586],
			["Косторез", 69994, 202331],
			["Косторез", 2473, 164202],
			["Косторез", 2496, 164657]
			];
	for (var i = 0; i < hlam213.length; i++) {
				hlam_213 = new L.circleMarker([hlam213[i][1],hlam213[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam213[i][0])
					.bindTooltip(hlam213[i][0], {direction: 'top'})
					.addTo(hlam213icons);
			}
	}
	else {
		hlam213icons.clearLayers();
	}
}
var hlam214icons = L.layerGroup().addTo(map);
function Hlam214OnOff() {
	var chbox214;
	chbox214=document.getElementById('Hlam214Button');
	if (chbox214.checked) {
		var hlam214 = [
			["Кофейная кружка", -9693, -27198],
			["Кофейная кружка", -9658, -27179],
			["Кофейная кружка", -52211, -13353],
			["Кофейная кружка", -52188, -13365],
			["Кофейная кружка", -52199, -13356],
			["Кофейная кружка", -52201, -13345],
			["Кофейная кружка", -52196, -13350],
			["Кофейная кружка", -52771, -13284],
			["Кофейная кружка", -52741, -14167],
			["Кофейная кружка", -52731, -14163],
			["Кофейная кружка", -52746, -14243],
			["Кофейная кружка", -54580, -9888],
			["Кофейная кружка", -54415, -10334],
			["Кофейная кружка", -56417, -10940],
			["Кофейная кружка", -56409, -10941],
			["Кофейная кружка", -47923, -8020],
			["Кофейная кружка", -67556, -1232],
			["Кофейная кружка", -27812, -60235],
			["Кофейная кружка", -28331, -60706],
			["Кофейная кружка", -28223, -60869],
			["Кофейная кружка", -27953, -60882],
			["Кофейная кружка", -17923, -46712],
			["Кофейная кружка", -20833, -44050],
			["Кофейная кружка", -18815, -43249],
			["Кофейная кружка", -55595, -61573],
			["Кофейная кружка", -55598, -61558],
			["Кофейная кружка", -55535, -61259],
			["Кофейная кружка", -37861, -58827],
			["Кофейная кружка", -39610, -58807],
			["Кофейная кружка", -39612, -59205],
			["Кофейная кружка", -47147, -50648],
			["Кофейная кружка", -47210, -50564],
			["Кофейная кружка", -47232, -50557],
			["Кофейная кружка", -47676, -50156],
			["Кофейная кружка", -51744, -46476],
			["Кофейная кружка", -41174, -37703],
			["Кофейная кружка", -41128, -37686],
			["Кофейная кружка", -73441, -61519],
			["Кофейная кружка", -89123, -48851],
			["Кофейная кружка", -70721, -39471],
			["Кофейная кружка", -117767, -63029],
			["Кофейная кружка", -112301, -58789],
			["Кофейная кружка", -112501, -59000],
			["Кофейная кружка", -112389, -58869],
			["Кофейная кружка", -112459, -59142],
			["Кофейная кружка", -111031, -58826],
			["Кофейная кружка", -110370, -58094],
			["Кофейная кружка", -120544, -45939],
			["Кофейная кружка", -29433, -94450],
			["Кофейная кружка", -31351, -88001],
			["Кофейная кружка", -31668, -87775],
			["Кофейная кружка", -31342, -88179],
			["Кофейная кружка", -13105, -66309],
			["Кофейная кружка", -44392, -86560],
			["Кофейная кружка", -44436, -86505],
			["Кофейная кружка", -57713, -85898],
			["Кофейная кружка", -56227, -78282],
			["Кофейная кружка", -56353, -78593],
			["Кофейная кружка", -41573, -80578],
			["Кофейная кружка", -46839, -72901],
			["Кофейная кружка", -72115, -98164],
			["Кофейная кружка", -93315, -83639],
			["Кофейная кружка", -126373, -74168],
			["Кофейная кружка", -125251, -74249],
			["Кофейная кружка", -126193, -74232],
			["Кофейная кружка", -120700, -73803],
			["Кофейная кружка", -120722, -73771],
			["Кофейная кружка", -100340, -67303],
			["Кофейная кружка", -100356, -66922],
			["Кофейная кружка", -31955, -129909],
			["Кофейная кружка", -61790, -127517],
			["Кофейная кружка", -62268, -129112],
			["Кофейная кружка", -61793, -127654],
			["Кофейная кружка", -48591, -127447],
			["Кофейная кружка", -48551, -127445],
			["Кофейная кружка", -48873, -128323],
			["Кофейная кружка", -48881, -128316],
			["Кофейная кружка", -48894, -128329],
			["Кофейная кружка", -48867, -128345],
			["Кофейная кружка", -48796, -128391],
			["Кофейная кружка", -47564, -117916],
			["Кофейная кружка", -47563, -117883],
			["Кофейная кружка", -47617, -117722],
			["Кофейная кружка", -51658, -111906],
			["Кофейная кружка", -51666, -111913],
			["Кофейная кружка", -51061, -111846],
			["Кофейная кружка", -36865, -112690],
			["Кофейная кружка", -36899, -112689],
			["Кофейная кружка", -37018, -112667],
			["Кофейная кружка", -37069, -112648],
			["Кофейная кружка", -56689, -108401],
			["Кофейная кружка", -56671, -108403],
			["Кофейная кружка", -56663, -108393],
			["Кофейная кружка", -56386, -108181],
			["Кофейная кружка", -56443, -108319],
			["Кофейная кружка", -56482, -108256],
			["Кофейная кружка", -46957, -106754],
			["Кофейная кружка", -44223, -107605],
			["Кофейная кружка", -44097, -107123],
			["Кофейная кружка", -44068, -107105],
			["Кофейная кружка", -44135, -107401],
			["Кофейная кружка", -43718, -106991],
			["Кофейная кружка", -43957, -107058],
			["Кофейная кружка", -43904, -107046],
			["Кофейная кружка", -43877, -107317],
			["Кофейная кружка", -43970, -107297],
			["Кофейная кружка", -43972, -107488],
			["Кофейная кружка", -45995, -104125],
			["Кофейная кружка", -46108, -104100],
			["Кофейная кружка", -46149, -104197],
			["Кофейная кружка", -46505, -104201],
			["Кофейная кружка", -46552, -104487],
			["Кофейная кружка", -61535, -100663],
			["Кофейная кружка", -61563, -100628],
			["Кофейная кружка", -61597, -100586],
			["Кофейная кружка", -61611, -100571],
			["Кофейная кружка", -61628, -100552],
			["Кофейная кружка", -61404, -100073],
			["Кофейная кружка", -49424, -99858],
			["Кофейная кружка", -50625, -101000],
			["Кофейная кружка", -48682, -99618],
			["Кофейная кружка", -48663, -99617],
			["Кофейная кружка", -48054, -101366],
			["Кофейная кружка", -95670, -127156],
			["Кофейная кружка", -80159, -128051],
			["Кофейная кружка", -98058, -126502],
			["Кофейная кружка", -89552, -126542],
			["Кофейная кружка", -82075, -126718],
			["Кофейная кружка", -82322, -126254],
			["Кофейная кружка", -82542, -126319],
			["Кофейная кружка", -95400, -113366],
			["Кофейная кружка", -79717, -108115],
			["Кофейная кружка", -79651, -107764],
			["Кофейная кружка", -68168, -106805],
			["Кофейная кружка", -68142, -106736],
			["Кофейная кружка", -68179, -106790],
			["Кофейная кружка", -68569, -105464],
			["Кофейная кружка", -102300, -129694],
			["Кофейная кружка", -122883, -123315],
			["Кофейная кружка", -122924, -122950],
			["Кофейная кружка", -122838, -123562],
			["Кофейная кружка", -113059, -124895],
			["Кофейная кружка", -112569, -121343],
			["Кофейная кружка", -103862, -121732],
			["Кофейная кружка", -105054, -118909],
			["Кофейная кружка", -101892, -115062],
			["Кофейная кружка", -126669, -114274],
			["Кофейная кружка", -126658, -114273],
			["Кофейная кружка", -110987, -112650],
			["Кофейная кружка", -168413, -24223],
			["Кофейная кружка", -168417, -24243],
			["Кофейная кружка", -148974, -58964],
			["Кофейная кружка", -149522, -58190],
			["Кофейная кружка", -149154, -57929],
			["Кофейная кружка", -147698, -57414],
			["Кофейная кружка", -147849, -59159],
			["Кофейная кружка", -148245, -59088],
			["Кофейная кружка", -147746, -57674],
			["Кофейная кружка", -148455, -57450],
			["Кофейная кружка", -147698, -57945],
			["Кофейная кружка", -147714, -56992],
			["Кофейная кружка", -147581, -56546],
			["Кофейная кружка", -147582, -56556],
			["Кофейная кружка", -147556, -56498],
			["Кофейная кружка", -148268, -57066],
			["Кофейная кружка", -148377, -55967],
			["Кофейная кружка", -148099, -54480],
			["Кофейная кружка", -148118, -54497],
			["Кофейная кружка", -147899, -54866],
			["Кофейная кружка", -148090, -54866],
			["Кофейная кружка", -147871, -54945],
			["Кофейная кружка", -149310, -56236],
			["Кофейная кружка", -148618, -57326],
			["Кофейная кружка", -159448, -40746],
			["Кофейная кружка", -155715, -36654],
			["Кофейная кружка", -137827, -97626],
			["Кофейная кружка", -137879, -96944],
			["Кофейная кружка", -137860, -96925],
			["Кофейная кружка", -138287, -97290],
			["Кофейная кружка", -131100, -92400],
			["Кофейная кружка", -161966, -73883],
			["Кофейная кружка", -152048, -74361],
			["Кофейная кружка", -151060, -74884],
			["Кофейная кружка", -151308, -74836],
			["Кофейная кружка", -151517, -75309],
			["Кофейная кружка", -151052, -75382],
			["Кофейная кружка", -161923, -73477],
			["Кофейная кружка", -161849, -73526],
			["Кофейная кружка", -152547, -73611],
			["Кофейная кружка", -151587, -71834],
			["Кофейная кружка", -152098, -72214],
			["Кофейная кружка", -151112, -72012],
			["Кофейная кружка", -151349, -72019],
			["Кофейная кружка", -150870, -72889],
			["Кофейная кружка", -146917, -70744],
			["Кофейная кружка", -132757, -121473],
			["Кофейная кружка", -132405, -121386],
			["Кофейная кружка", -167838, -114941],
			["Кофейная кружка", -167862, -114886],
			["Кофейная кружка", -168220, -112837],
			["Кофейная кружка", 188826, -29731],
			["Кофейная кружка", 167573, -26261],
			["Кофейная кружка", 167347, -26396],
			["Кофейная кружка", 167354, -26378],
			["Кофейная кружка", 167454, -22485],
			["Кофейная кружка", 167436, -22492],
			["Кофейная кружка", 165114, -21908],
			["Кофейная кружка", 167674, -24244],
			["Кофейная кружка", 167326, -24352],
			["Кофейная кружка", 167604, -22630],
			["Кофейная кружка", 167867, -18104],
			["Кофейная кружка", 191163, -18933],
			["Кофейная кружка", 173656, -14474],
			["Кофейная кружка", 173396, -13425],
			["Кофейная кружка", 173356, -13629],
			["Кофейная кружка", 173656, -13760],
			["Кофейная кружка", 173507, -14142],
			["Кофейная кружка", 173840, -14097],
			["Кофейная кружка", 173862, -14093],
			["Кофейная кружка", 182092, -13884],
			["Кофейная кружка", 172993, -10962],
			["Кофейная кружка", 173213, -11010],
			["Кофейная кружка", 172521, -11426],
			["Кофейная кружка", 172270, -11600],
			["Кофейная кружка", 172277, -11580],
			["Кофейная кружка", 172736, -10522],
			["Кофейная кружка", 172852, -10438],
			["Кофейная кружка", 173393, -11482],
			["Кофейная кружка", 173410, -11520],
			["Кофейная кружка", 173358, -11541],
			["Кофейная кружка", 173320, -11534],
			["Кофейная кружка", 179464, -9560],
			["Кофейная кружка", 178979, -9942],
			["Кофейная кружка", 143124, -59842],
			["Кофейная кружка", 143030, -58556],
			["Кофейная кружка", 138731, -53813],
			["Кофейная кружка", 148971, -52317],
			["Кофейная кружка", 148941, -52294],
			["Кофейная кружка", 151982, -49394],
			["Кофейная кружка", 157333, -49363],
			["Кофейная кружка", 157314, -49342],
			["Кофейная кружка", 144161, -48350],
			["Кофейная кружка", 154483, -46488],
			["Кофейная кружка", 183293, -67161],
			["Кофейная кружка", 183277, -67152],
			["Кофейная кружка", 183269, -67181],
			["Кофейная кружка", 183250, -67174],
			["Кофейная кружка", 161342, -92100],
			["Кофейная кружка", 143560, -89158],
			["Кофейная кружка", 143576, -89149],
			["Кофейная кружка", 147395, -78395],
			["Кофейная кружка", 148354, -80109],
			["Кофейная кружка", 147481, -78255],
			["Кофейная кружка", 147620, -78318],
			["Кофейная кружка", 149117, -75738],
			["Кофейная кружка", 153097, -75511],
			["Кофейная кружка", 150201, -67629],
			["Кофейная кружка", 150108, -67146],
			["Кофейная кружка", 198628, -112793],
			["Кофейная кружка", 178140, -122218],
			["Кофейная кружка", 99941, -29967],
			["Кофейная кружка", 128737, -31279],
			["Кофейная кружка", 129338, -31305],
			["Кофейная кружка", 128748, -26099],
			["Кофейная кружка", 99817, -16488],
			["Кофейная кружка", 99897, -16415],
			["Кофейная кружка", 102304, -12458],
			["Кофейная кружка", 102192, -12581],
			["Кофейная кружка", 101639, -13790],
			["Кофейная кружка", 101718, -13798],
			["Кофейная кружка", 102612, -12653],
			["Кофейная кружка", 119944, -2071],
			["Кофейная кружка", 88741, -30931],
			["Кофейная кружка", 88778, -31293],
			["Кофейная кружка", 88671, -31121],
			["Кофейная кружка", 90074, -32159],
			["Кофейная кружка", 89814, -31347],
			["Кофейная кружка", 90152, -29981],
			["Кофейная кружка", 90600, -29293],
			["Кофейная кружка", 81192, -21098],
			["Кофейная кружка", 84757, -19212],
			["Кофейная кружка", 82414, -18641],
			["Кофейная кружка", 77669, -15043],
			["Кофейная кружка", 77777, -15193],
			["Кофейная кружка", 77500, -15395],
			["Кофейная кружка", 84490, -15439],
			["Кофейная кружка", 84509, -15458],
			["Кофейная кружка", 77750, -12010],
			["Кофейная кружка", 77918, -11658],
			["Кофейная кружка", 77902, -11658],
			["Кофейная кружка", 77903, -11647],
			["Кофейная кружка", 92292, -9770],
			["Кофейная кружка", 90388, -9899],
			["Кофейная кружка", 95304, -8321],
			["Кофейная кружка", 73261, -7130],
			["Кофейная кружка", 74384, -6096],
			["Кофейная кружка", 74192, -6190],
			["Кофейная кружка", 74185, -6213],
			["Кофейная кружка", 74243, -6332],
			["Кофейная кружка", 74442, -6228],
			["Кофейная кружка", 74033, -6696],
			["Кофейная кружка", 74042, -6688],
			["Кофейная кружка", 89669, -6112],
			["Кофейная кружка", 89681, -6107],
			["Кофейная кружка", 89005, -5993],
			["Кофейная кружка", 91374, -4630],
			["Кофейная кружка", 95252, -8191],
			["Кофейная кружка", 85369, -2776],
			["Кофейная кружка", 87986, -4029],
			["Кофейная кружка", 48715, -22017],
			["Кофейная кружка", 48645, -22150],
			["Кофейная кружка", 48671, -22195],
			["Кофейная кружка", 47387, -20682],
			["Кофейная кружка", 28215, -31664],
			["Кофейная кружка", 28510, -31190],
			["Кофейная кружка", 32134, -21485],
			["Кофейная кружка", 31739, -21209],
			["Кофейная кружка", 29557, -21355],
			["Кофейная кружка", 29729, -21590],
			["Кофейная кружка", 29480, -21333],
			["Кофейная кружка", 29639, -21225],
			["Кофейная кружка", 29280, -18710],
			["Кофейная кружка", 29294, -18697],
			["Кофейная кружка", 29285, -18686],
			["Кофейная кружка", 107805, -54391],
			["Кофейная кружка", 113438, -55850],
			["Кофейная кружка", 111495, -55316],
			["Кофейная кружка", 61889, -58340],
			["Кофейная кружка", 51557, -42718],
			["Кофейная кружка", 51613, -42539],
			["Кофейная кружка", 51547, -42576],
			["Кофейная кружка", 32969, -40665],
			["Кофейная кружка", 34478, -36934],
			["Кофейная кружка", 52180, -40625],
			["Кофейная кружка", 52186, -40432],
			["Кофейная кружка", 52258, -40430],
			["Кофейная кружка", 52318, -40364],
			["Кофейная кружка", 35900, -35250],
			["Кофейная кружка", 35747, -34864],
			["Кофейная кружка", 35577, -34862],
			["Кофейная кружка", 35809, -35216],
			["Кофейная кружка", 35427, -35291],
			["Кофейная кружка", 25807, -60598],
			["Кофейная кружка", 25797, -58790],
			["Кофейная кружка", 29290, -58361],
			["Кофейная кружка", 29441, -58572],
			["Кофейная кружка", 32140, -40245],
			["Кофейная кружка", 31234, -33346],
			["Кофейная кружка", 79461, -81858],
			["Кофейная кружка", 60759, -96243],
			["Кофейная кружка", 46038, -66108],
			["Кофейная кружка", 55560, -67219],
			["Кофейная кружка", 55551, -65882],
			["Кофейная кружка", 55889, -65860],
			["Кофейная кружка", 56752, -66360],
			["Кофейная кружка", 55281, -67236],
			["Кофейная кружка", 55347, -67955],
			["Кофейная кружка", 55176, -67395],
			["Кофейная кружка", 56465, -67260],
			["Кофейная кружка", 29200, -83943],
			["Кофейная кружка", 15998, -80072],
			["Кофейная кружка", 69583, -104169],
			["Кофейная кружка", 38025, -119136],
			["Кофейная кружка", 37962, -119411],
			["Кофейная кружка", 37498, -119434],
			["Кофейная кружка", 49591, -98828],
			["Кофейная кружка", 49681, -99059],
			["Кофейная кружка", 21125, -109270],
			["Кофейная кружка", 21086, -109514],
			["Кофейная кружка", 22033, -105383],
			["Кофейная кружка", 21544, -105336],
			["Кофейная кружка", 21554, -105349],
			["Кофейная кружка", 21548, -105330],
			["Кофейная кружка", 29210, -100188],
			["Кофейная кружка", -4170, -155869],
			["Кофейная кружка", -30904, -152147],
			["Кофейная кружка", -61551, -145645],
			["Кофейная кружка", -61576, -145803],
			["Кофейная кружка", -61353, -145713],
			["Кофейная кружка", -61156, -145624],
			["Кофейная кружка", -61354, -145453],
			["Кофейная кружка", -45183, -132423],
			["Кофейная кружка", -93781, -163442],
			["Кофейная кружка", -93350, -163661],
			["Кофейная кружка", -81834, -160856],
			["Кофейная кружка", -93136, -131095],
			["Кофейная кружка", -126181, -144654],
			["Кофейная кружка", -126538, -144845],
			["Кофейная кружка", -126533, -144702],
			["Кофейная кружка", -126532, -144707],
			["Кофейная кружка", -126536, -144726],
			["Кофейная кружка", -126546, -144913],
			["Кофейная кружка", -126630, -144871],
			["Кофейная кружка", -116257, -137502],
			["Кофейная кружка", -116883, -136521],
			["Кофейная кружка", -123701, -132415],
			["Кофейная кружка", -123560, -132430],
			["Кофейная кружка", -108341, -133809],
			["Кофейная кружка", -24182, -179800],
			["Кофейная кружка", -24254, -179965],
			["Кофейная кружка", -24064, -179934],
			["Кофейная кружка", -7980, -165118],
			["Кофейная кружка", -42927, -173538],
			["Кофейная кружка", -62314, -171176],
			["Кофейная кружка", -95233, -176208],
			["Кофейная кружка", -95273, -176203],
			["Кофейная кружка", -95231, -176168],
			["Кофейная кружка", -82926, -177949],
			["Кофейная кружка", -87736, -165956],
			["Кофейная кружка", -130392, -190025],
			["Кофейная кружка", -130383, -189994],
			["Кофейная кружка", -130370, -190028],
			["Кофейная кружка", -130392, -190025],
			["Кофейная кружка", -130406, -190015],
			["Кофейная кружка", -108744, -187371],
			["Кофейная кружка", -113843, -169216],
			["Кофейная кружка", -113729, -170505],
			["Кофейная кружка", -152909, -161026],
			["Кофейная кружка", -152901, -161043],
			["Кофейная кружка", -152732, -161065],
			["Кофейная кружка", -152275, -160794],
			["Кофейная кружка", -134293, -154341],
			["Кофейная кружка", -133372, -153376],
			["Кофейная кружка", -134231, -153971],
			["Кофейная кружка", -133853, -153757],
			["Кофейная кружка", -132088, -148763],
			["Кофейная кружка", -139614, -144679],
			["Кофейная кружка", -136774, -176957],
			["Кофейная кружка", -137025, -175428],
			["Кофейная кружка", 135598, -156227],
			["Кофейная кружка", 135572, -156247],
			["Кофейная кружка", 135645, -156132],
			["Кофейная кружка", 189332, -169582],
			["Кофейная кружка", 189418, -169554],
			["Кофейная кружка", 189668, -169553],
			["Кофейная кружка", 189672, -169420],
			["Кофейная кружка", 189778, -169354],
			["Кофейная кружка", 194020, -169305],
			["Кофейная кружка", 193466, -169085],
			["Кофейная кружка", 189937, -165138],
			["Кофейная кружка", 108565, -161405],
			["Кофейная кружка", 102745, -151873],
			["Кофейная кружка", 102666, -151402],
			["Кофейная кружка", 51148, -151136],
			["Кофейная кружка", 27345, -137311],
			["Кофейная кружка", 27350, -137360],
			["Кофейная кружка", 27315, -137306],
			["Кофейная кружка", 25787, -137802],
			["Кофейная кружка", 25763, -137782],
			["Кофейная кружка", 73725, -178803],
			["Кофейная кружка", 73711, -178801],
			["Кофейная кружка", 73716, -178789],
			["Кофейная кружка", 73733, -178792],
			["Кофейная кружка", 74111, -176944],
			["Кофейная кружка", 74217, -177115],
			["Кофейная кружка", 74228, -177104],
			["Кофейная кружка", 74234, -176906],
			["Кофейная кружка", 74356, -172824],
			["Кофейная кружка", -64120, 202610],
			["Кофейная кружка", -63864, 202525],
			["Кофейная кружка", -63790, 202807],
			["Кофейная кружка", -63771, 202798],
			["Кофейная кружка", -97675, 200259],
			["Кофейная кружка", -82242, 201528],
			["Кофейная кружка", -23209, 189603],
			["Кофейная кружка", -13254, 189623],
			["Кофейная кружка", -31188, 196444],
			["Кофейная кружка", -10030, 193389],
			["Кофейная кружка", -10462, 193279],
			["Кофейная кружка", -10238, 193318],
			["Кофейная кружка", -60922, 182205],
			["Кофейная кружка", -83739, 165595],
			["Кофейная кружка", -68789, 171245],
			["Кофейная кружка", -97507, 179179],
			["Кофейная кружка", -91649, 176850],
			["Кофейная кружка", -91510, 176968],
			["Кофейная кружка", -91501, 176727],
			["Кофейная кружка", -94447, 183319],
			["Кофейная кружка", -94759, 183267],
			["Кофейная кружка", -96968, 180627],
			["Кофейная кружка", -94557, 182286],
			["Кофейная кружка", -95243, 183103],
			["Кофейная кружка", -95342, 183083],
			["Кофейная кружка", -92836, 183659],
			["Кофейная кружка", -92907, 183356],
			["Кофейная кружка", -92904, 183339],
			["Кофейная кружка", -92918, 183348],
			["Кофейная кружка", -93263, 183696],
			["Кофейная кружка", -93194, 183535],
			["Кофейная кружка", -92651, 183658],
			["Кофейная кружка", -92582, 183498],
			["Кофейная кружка", -93421, 183672],
			["Кофейная кружка", -93353, 183511],
			["Кофейная кружка", -93612, 183485],
			["Кофейная кружка", -93577, 183803],
			["Кофейная кружка", -93155, 184273],
			["Кофейная кружка", -93639, 184106],
			["Кофейная кружка", -92739, 180594],
			["Кофейная кружка", -92855, 180599],
			["Кофейная кружка", -95563, 184422],
			["Кофейная кружка", -88935, 185210],
			["Кофейная кружка", -95717, 190054],
			["Кофейная кружка", -95710, 190030],
			["Кофейная кружка", -1384, 158070],
			["Кофейная кружка", -26545, 162622],
			["Кофейная кружка", -27363, 162825],
			["Кофейная кружка", -17355, 162761],
			["Кофейная кружка", -17347, 162773],
			["Кофейная кружка", -17339, 162952],
			["Кофейная кружка", -17356, 162942],
			["Кофейная кружка", -16620, 163809],
			["Кофейная кружка", -5695, 161961],
			["Кофейная кружка", -5843, 161910],
			["Кофейная кружка", -5807, 162137],
			["Кофейная кружка", -5651, 162107],
			["Кофейная кружка", -6076, 162168],
			["Кофейная кружка", -6030, 162299],
			["Кофейная кружка", -3479, 162811],
			["Кофейная кружка", -3601, 162770],
			["Кофейная кружка", -3922, 161585],
			["Кофейная кружка", -64109, 132153],
			["Кофейная кружка", -39428, 159837],
			["Кофейная кружка", -39429, 160073],
			["Кофейная кружка", -89570, 148608],
			["Кофейная кружка", -109334, 159002],
			["Кофейная кружка", -163631, 200629],
			["Кофейная кружка", -145757, 172397],
			["Кофейная кружка", -146157, 173212],
			["Кофейная кружка", -146105, 174215],
			["Кофейная кружка", -138922, 173597],
			["Кофейная кружка", -145036, 178034],
			["Кофейная кружка", -143393, 178591],
			["Кофейная кружка", -145591, 177312],
			["Кофейная кружка", -144793, 137066],
			["Кофейная кружка", -144798, 137078],
			["Кофейная кружка", -144751, 137044],
			["Кофейная кружка", -139636, 138732],
			["Кофейная кружка", -139594, 138774],
			["Кофейная кружка", -139588, 139394],
			["Кофейная кружка", -160452, 151756],
			["Кофейная кружка", -137397, 153781],
			["Кофейная кружка", -137394, 154025],
			["Кофейная кружка", -137400, 154063],
			["Кофейная кружка", -137417, 153929],
			["Кофейная кружка", -140985, 156532],
			["Кофейная кружка", -140959, 156511],
			["Кофейная кружка", 162625, 206812],
			["Кофейная кружка", 193917, 167538],
			["Кофейная кружка", 179172, 133747],
			["Кофейная кружка", 179137, 134033],
			["Кофейная кружка", 151369, 136834],
			["Кофейная кружка", 151373, 136886],
			["Кофейная кружка", 151156, 136029],
			["Кофейная кружка", 151527, 136239],
			["Кофейная кружка", 151194, 135776],
			["Кофейная кружка", 151960, 137684],
			["Кофейная кружка", 151954, 138010],
			["Кофейная кружка", 151971, 138006],
			["Кофейная кружка", 152298, 137820],
			["Кофейная кружка", 152464, 137601],
			["Кофейная кружка", 152278, 161513],
			["Кофейная кружка", 152265, 161509],
			["Кофейная кружка", 152267, 161519],
			["Кофейная кружка", 152272, 161491],
			["Кофейная кружка", 152184, 161392],
			["Кофейная кружка", 152798, 161913],
			["Кофейная кружка", 152863, 161905],
			["Кофейная кружка", 152804, 161435],
			["Кофейная кружка", 70240, 202334],
			["Кофейная кружка", 69961, 202187],
			["Кофейная кружка", 70230, 202188],
			["Кофейная кружка", 15694, 198431],
			["Кофейная кружка", 101359, 192423],
			["Кофейная кружка", 102206, 191470],
			["Кофейная кружка", 101611, 193861],
			["Кофейная кружка", 80220, 182574],
			["Кофейная кружка", 80112, 182275],
			["Кофейная кружка", 95825, 187178],
			["Кофейная кружка", 91777, 188944],
			["Кофейная кружка", 91601, 188733],
			["Кофейная кружка", 91564, 188731],
			["Кофейная кружка", 91286, 188722],
			["Кофейная кружка", 91300, 188731],
			["Кофейная кружка", 93460, 189134],
			["Кофейная кружка", 95929, 192161],
			["Кофейная кружка", 61230, 172474],
			["Кофейная кружка", 59332, 172495],
			["Кофейная кружка", 63945, 173023],
			["Кофейная кружка", 58638, 176842],
			["Кофейная кружка", 1384, 164462],
			["Кофейная кружка", 3572, 167788],
			["Кофейная кружка", 2896, 164282],
			["Кофейная кружка", 16269, 190110],
			["Кофейная кружка", 72289, 133744],
			["Кофейная кружка", 71898, 133481],
			["Кофейная кружка", 72841, 136652],
			["Кофейная кружка", 71123, 137160],
			["Кофейная кружка", 71230, 137163],
			["Кофейная кружка", 77194, 151381],
			["Кофейная кружка", 84535, 151551],
			["Кофейная кружка", 85259, 151416],
			["Кофейная кружка", 78735, 152966],
			["Кофейная кружка", 85794, 151905],
			["Кофейная кружка", 85724, 152218],
			["Кофейная кружка", 85130, 152088],
			["Кофейная кружка", 86152, 152173],
			["Кофейная кружка", 73859, 156151],
			["Кофейная кружка", 87837, 157264],
			["Кофейная кружка", 87729, 157264],
			["Кофейная кружка", 87390, 158060],
			["Кофейная кружка", 45762, 161940],
			["Кофейная кружка", 20433, 134799],
			["Кофейная кружка", 27400, 131727],
			["Кофейная кружка", 27411, 131774],
			["Кофейная кружка", 26980, 131449],
			["Кофейная кружка", 27412, 131630],
			["Кофейная кружка", 27206, 132018],
			["Кофейная кружка", 27714, 133546],
			["Кофейная кружка", 27206, 132018],
			["Кофейная кружка", 28713, 131382],
			["Кофейная кружка", 28881, 131331],
			["Кофейная кружка", 29145, 131476],
			["Кофейная кружка", 28888, 131290],
			["Кофейная кружка", 2418, 137921],
			["Кофейная кружка", 2416, 137976],
			["Кофейная кружка", 2699, 163563],
			["Кофейная кружка", 2628, 163666],
			["Кофейная кружка", 3003, 163457],
			["Кофейная кружка", 2876, 163288],
			["Кофейная кружка", 2899, 163519],
			["Кофейная кружка", 2288, 163227],
			["Кофейная кружка", 3977, 160865],
			["Кофейная кружка", 3872, 160362],
			["Кофейная кружка", 3764, 160308],
			["Кофейная кружка", 2570, 162000],
			["Кофейная кружка", 4216, 160711],
			["Кофейная кружка", -16641, 117935],
			["Кофейная кружка", -14674, 120244],
			["Кофейная кружка", -14851, 120239],
			["Кофейная кружка", -14892, 120178],
			["Кофейная кружка", -14649, 120183],
			["Кофейная кружка", -13933, 119107],
			["Кофейная кружка", -13858, 119015],
			["Кофейная кружка", -13858, 119782],
			["Кофейная кружка", -14042, 119425],
			["Кофейная кружка", -58439, 99008],
			["Кофейная кружка", -58415, 98996],
			["Кофейная кружка", -80685, 102614],
			["Кофейная кружка", -80660, 102605],
			["Кофейная кружка", -86540, 115445],
			["Кофейная кружка", -86760, 115420],
			["Кофейная кружка", -129006, 120244],
			["Кофейная кружка", -128876, 119911],
			["Кофейная кружка", -129364, 119842],
			["Кофейная кружка", -129162, 119488],
			["Кофейная кружка", -129238, 119082],
			["Кофейная кружка", -129357, 119340],
			["Кофейная кружка", -104931, 123246],
			["Кофейная кружка", -24903, 83114],
			["Кофейная кружка", -32395, 91948],
			["Кофейная кружка", -32196, 92077],
			["Кофейная кружка", -38598, 84730],
			["Кофейная кружка", -56693, 88760],
			["Кофейная кружка", -41071, 87650],
			["Кофейная кружка", -40960, 88142],
			["Кофейная кружка", -40970, 88071],
			["Кофейная кружка", -41250, 88994],
			["Кофейная кружка", -41830, 87535],
			["Кофейная кружка", -42018, 87903],
			["Кофейная кружка", -40942, 87984],
			["Кофейная кружка", -40955, 87989],
			["Кофейная кружка", -43620, 90711],
			["Кофейная кружка", -43667, 90648],
			["Кофейная кружка", -43662, 90638],
			["Кофейная кружка", -40913, 90767],
			["Кофейная кружка", -33713, 92144],
			["Кофейная кружка", -87840, 67828],
			["Кофейная кружка", -127085, 83584],
			["Кофейная кружка", -39800, 47099],
			["Кофейная кружка", -39441, 46571],
			["Кофейная кружка", -91139, 63257],
			["Кофейная кружка", -91185, 63284],
			["Кофейная кружка", -94024, 63799],
			["Кофейная кружка", -93103, 62137],
			["Кофейная кружка", -89927, 64977],
			["Кофейная кружка", -87600, 63549],
			["Кофейная кружка", -88132, 63664],
			["Кофейная кружка", -121960, 40767],
			["Кофейная кружка", -104531, 38377],
			["Кофейная кружка", -104544, 38388],
			["Кофейная кружка", -104846, 41761],
			["Кофейная кружка", -104846, 41682],
			["Кофейная кружка", -104838, 41697],
			["Кофейная кружка", -123271, 51005],
			["Кофейная кружка", -19446, 16694],
			["Кофейная кружка", -19447, 16797],
			["Кофейная кружка", -46782, 2630],
			["Кофейная кружка", -47887, 1637],
			["Кофейная кружка", -41823, 3213],
			["Кофейная кружка", -42133, 2862],
			["Кофейная кружка", -42149, 2885],
			["Кофейная кружка", -38599, 3444],
			["Кофейная кружка", -38688, 3477],
			["Кофейная кружка", -38682, 3370],
			["Кофейная кружка", -38683, 3396],
			["Кофейная кружка", -59440, 4216],
			["Кофейная кружка", -53274, 4337],
			["Кофейная кружка", -46856, 13287],
			["Кофейная кружка", -46331, 20444],
			["Кофейная кружка", -47736, 20557],
			["Кофейная кружка", -46456, 26845],
			["Кофейная кружка", -46445, 28215],
			["Кофейная кружка", -44229, 28118],
			["Кофейная кружка", -46201, 28975],
			["Кофейная кружка", -91871, 27094],
			["Кофейная кружка", -91849, 27073],
			["Кофейная кружка", -91787, 26401],
			["Кофейная кружка", -77759, 30854],
			["Кофейная кружка", -119794, 1732],
			["Кофейная кружка", -118547, 3327],
			["Кофейная кружка", -118436, 985],
			["Кофейная кружка", -98496, 8173],
			["Кофейная кружка", -98508, 8187],
			["Кофейная кружка", -99583, 7853],
			["Кофейная кружка", -130660, 10580],
			["Кофейная кружка", -130834, 10708],
			["Кофейная кружка", -130473, 10429],
			["Кофейная кружка", -130623, 10374],
			["Кофейная кружка", -130670, 10296],
			["Кофейная кружка", -148738, 112415],
			["Кофейная кружка", -148733, 113395],
			["Кофейная кружка", -172648, 110103],
			["Кофейная кружка", -145952, 65987],
			["Кофейная кружка", -160576, 77977],
			["Кофейная кружка", -139445, 90836],
			["Кофейная кружка", -179878, 74849],
			["Кофейная кружка", -131989, 10535],
			["Кофейная кружка", -132062, 12356],
			["Кофейная кружка", -132019, 12381],
			["Кофейная кружка", -132032, 12360],
			["Кофейная кружка", -131964, 12496],
			["Кофейная кружка", -132078, 12562],
			["Кофейная кружка", -132007, 12509],
			["Кофейная кружка", -131999, 12509],
			["Кофейная кружка", -132005, 12493],
			["Кофейная кружка", 180810, 110504],
			["Кофейная кружка", 182387, 112647],
			["Кофейная кружка", 183213, 111450],
			["Кофейная кружка", 182432, 112585],
			["Кофейная кружка", 182364, 112651],
			["Кофейная кружка", 183480, 111759],
			["Кофейная кружка", 191071, 115686],
			["Кофейная кружка", 191247, 115667],
			["Кофейная кружка", 146114, 107441],
			["Кофейная кружка", 146294, 107255],
			["Кофейная кружка", 182331, 96978],
			["Кофейная кружка", 182380, 96832],
			["Кофейная кружка", 182485, 96805],
			["Кофейная кружка", 141130, 67403],
			["Кофейная кружка", 133766, 87704],
			["Кофейная кружка", 200276, 46408],
			["Кофейная кружка", 170510, 56475],
			["Кофейная кружка", 170317, 57113],
			["Кофейная кружка", 170388, 57131],
			["Кофейная кружка", 172520, 58002],
			["Кофейная кружка", 172535, 58009],
			["Кофейная кружка", 193791, 57867],
			["Кофейная кружка", 140370, 40987],
			["Кофейная кружка", 140361, 40988],
			["Кофейная кружка", 171267, 1602],
			["Кофейная кружка", 170923, 1719],
			["Кофейная кружка", 171124, 1745],
			["Кофейная кружка", 183817, 2324],
			["Кофейная кружка", 183587, 2376],
			["Кофейная кружка", 183096, 2968],
			["Кофейная кружка", 183031, 2972],
			["Кофейная кружка", 183638, 2663],
			["Кофейная кружка", 183121, 2798],
			["Кофейная кружка", 182931, 2808],
			["Кофейная кружка", 133902, 15300],
			["Кофейная кружка", 134363, 16197],
			["Кофейная кружка", 88076, 105460],
			["Кофейная кружка", 95331, 103877],
			["Кофейная кружка", 92787, 114442],
			["Кофейная кружка", 92788, 114408],
			["Кофейная кружка", 46259, 100690],
			["Кофейная кружка", 46038, 101068],
			["Кофейная кружка", 46177, 101232],
			["Кофейная кружка", 33993, 127794],
			["Кофейная кружка", 25155, 124227],
			["Кофейная кружка", 28999, 130978],
			["Кофейная кружка", 130667, 87738],
			["Кофейная кружка", 129318, 86485],
			["Кофейная кружка", 129288, 86504],
			["Кофейная кружка", 100418, 91353],
			["Кофейная кружка", 99366, 92033],
			["Кофейная кружка", 100117, 91278],
			["Кофейная кружка", 49860, 85763],
			["Кофейная кружка", 50110, 85697],
			["Кофейная кружка", 28568, 93414],
			["Кофейная кружка", 28558, 93421],
			["Кофейная кружка", 109209, 56461],
			["Кофейная кружка", 109827, 57624],
			["Кофейная кружка", 110016, 57416],
			["Кофейная кружка", 73957, 38296],
			["Кофейная кружка", 74568, 44159],
			["Кофейная кружка", 88808, 53150],
			["Кофейная кружка", 89038, 53253],
			["Кофейная кружка", 88892, 53270],
			["Кофейная кружка", 81497, 59841],
			["Кофейная кружка", 35154, 40405],
			["Кофейная кружка", 35714, 40441],
			["Кофейная кружка", 54874, 52418],
			["Кофейная кружка", 59070, 55309],
			["Кофейная кружка", 59090, 55276],
			["Кофейная кружка", 14888, 39620],
			["Кофейная кружка", 14862, 39611],
			["Кофейная кружка", 14862, 39598],
			["Кофейная кружка", 13947, 39162],
			["Кофейная кружка", 7569, 44341],
			["Кофейная кружка", 7591, 44122],
			["Кофейная кружка", 7547, 43908],
			["Кофейная кружка", 17130, 41848],
			["Кофейная кружка", 23437, 44128],
			["Кофейная кружка", 21816, 43044],
			["Кофейная кружка", 17024, 45605],
			["Кофейная кружка", 16968, 45540],
			["Кофейная кружка", 16937, 45561],
			["Кофейная кружка", 26809, 48584],
			["Кофейная кружка", 26677, 48603],
			["Кофейная кружка", 26645, 48455],
			["Кофейная кружка", 24937, 46311],
			["Кофейная кружка", 9664, 50337],
			["Кофейная кружка", 23964, 49270],
			["Кофейная кружка", 28671, 52764],
			["Кофейная кружка", 27562, 50254],
			["Кофейная кружка", 103399, 3776],
			["Кофейная кружка", 104260, 6951],
			["Кофейная кружка", 104234, 6911],
			["Кофейная кружка", 122109, 6459],
			["Кофейная кружка", 120550, 5477],
			["Кофейная кружка", 100506, 25761],
			["Кофейная кружка", 88775, 2853],
			["Кофейная кружка", 66710, 19502],
			["Кофейная кружка", 66838, 19496],
			["Кофейная кружка", 71355, 20929],
			["Кофейная кружка", 87409, 28820],
			["Кофейная кружка", 51887, 1372],
			["Кофейная кружка", 52299, 3644],
			["Кофейная кружка", 57472, 102],
			["Кофейная кружка", 51507, 12057],
			["Кофейная кружка", 55510, 10344],
			["Кофейная кружка", 57984, 10004],
			["Кофейная кружка", 55982, 12739],
			["Кофейная кружка", 942, 15890],
			["Кофейная кружка", 877, 15886],
			["Кофейная кружка", -59008, -91790]
			];
	for (var i = 0; i < hlam214.length; i++) {
				hlam_214 = new L.circleMarker([hlam214[i][1],hlam214[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam214[i][0])
					.bindTooltip(hlam214[i][0], {direction: 'top'})
					.addTo(hlam214icons);
			}
	}
	else {
		hlam214icons.clearLayers();
	}
}
var hlam215icons = L.layerGroup().addTo(map);
function Hlam215OnOff() {
	var chbox215;
	chbox215=document.getElementById('Hlam215Button');
	if (chbox215.checked) {
		var hlam215 = [
			["Кофейная кружка &quotМемор-Из&quot", -55081, -27627]
			];
	for (var i = 0; i < hlam215.length; i++) {
				hlam_215 = new L.circleMarker([hlam215[i][1],hlam215[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam215[i][0])
					.bindTooltip(hlam215[i][0], {direction: 'top'})
					.addTo(hlam215icons);
			}
	}
	else {
		hlam215icons.clearLayers();
	}
}
var hlam216icons = L.layerGroup().addTo(map);
function Hlam216OnOff() {
	var chbox216;
	chbox216=document.getElementById('Hlam216Button');
	if (chbox216.checked) {
		var hlam216 = [
			["Кофейная чашка УВТ", 50840, -45141],
			["Кофейная чашка УВТ", 29402, -58784],
			["Кофейная чашка УВТ", 74108, -176963],
			["Кофейная чашка УВТ", 70247, 202330]
			];
	for (var i = 0; i < hlam216.length; i++) {
				hlam_216 = new L.circleMarker([hlam216[i][1],hlam216[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam216[i][0])
					.bindTooltip(hlam216[i][0], {direction: 'top'})
					.addTo(hlam216icons);
			}
	}
	else {
		hlam216icons.clearLayers();
	}
}
var hlam217icons = L.layerGroup().addTo(map);
function Hlam217OnOff() {
	var chbox217;
	chbox217=document.getElementById('Hlam217Button');
	if (chbox217.checked) {
		var hlam217 = [
			["Кофейник", -9637, -27189],
			["Кофейник", -54548, -10288],
			["Кофейник", -67551, -1432],
			["Кофейник", -24811, -59705],
			["Кофейник", -13813, -44599],
			["Кофейник", -56449, -60314],
			["Кофейник", -47199, -50595],
			["Кофейник", -41164, -37686],
			["Кофейник", -112443, -58601],
			["Кофейник", -112382, -58908],
			["Кофейник", -111019, -58805],
			["Кофейник", -108433, -58964],
			["Кофейник", -31267, -87869],
			["Кофейник", -31650, -87762],
			["Кофейник", -13465, -66672],
			["Кофейник", -41525, -80473],
			["Кофейник", -119891, -73807],
			["Кофейник", -63182, -129206],
			["Кофейник", -61772, -127528],
			["Кофейник", -48895, -128301],
			["Кофейник", -48917, -128285],
			["Кофейник", -47673, -117754],
			["Кофейник", -50727, -111906],
			["Кофейник", -51683, -111887],
			["Кофейник", -37225, -112673],
			["Кофейник", -56452, -108296],
			["Кофейник", -46601, -108184],
			["Кофейник", -43977, -107532],
			["Кофейник", -43952, -107519],
			["Кофейник", -45924, -104734],
			["Кофейник", -46068, -104108],
			["Кофейник", -45494, -104660],
			["Кофейник", -46268, -104145],
			["Кофейник", -47446, -102087],
			["Кофейник", -95350, -113382],
			["Кофейник", -79757, -108095],
			["Кофейник", -68152, -106713],
			["Кофейник", -68550, -105434],
			["Кофейник", -72312, -98418],
			["Кофейник", -102326, -129709],
			["Кофейник", -122845, -123341],
			["Кофейник", -104950, -118917],
			["Кофейник", -126656, -114292],
			["Кофейник", -168398, -24237],
			["Кофейник", -147756, -57728],
			["Кофейник", -147552, -57272],
			["Кофейник", -147537, -56527],
			["Кофейник", -147787, -54987],
			["Кофейник", -159441, -40809],
			["Кофейник", -137841, -97600],
			["Кофейник", -137898, -96913],
			["Кофейник", -151058, -74899],
			["Кофейник", -151496, -71808],
			["Кофейник", -146910, -70839],
			["Кофейник", -167989, -115692],
			["Кофейник", -168274, -112828],
			["Кофейник", -168107, -112488],
			["Кофейник", 197257, -23088],
			["Кофейник", 167328, -26381],
			["Кофейник", 167292, -22148],
			["Кофейник", 167937, -17974],
			["Кофейник", 173424, -13603],
			["Кофейник", 173692, -13796],
			["Кофейник", 182034, -13416],
			["Кофейник", 172534, -11409],
			["Кофейник", 173423, -11495],
			["Кофейник", 179510, -9582],
			["Кофейник", 190679, -35117],
			["Кофейник", 148947, -52278],
			["Кофейник", 149361, -51966],
			["Кофейник", 147736, -48981],
			["Кофейник", 149947, -45905],
			["Кофейник", 183832, -92909],
			["Кофейник", 161432, -92033],
			["Кофейник", 147605, -78333],
			["Кофейник", 153088, -75462],
			["Кофейник", 149881, -66992],
			["Кофейник", 150237, -67647],
			["Кофейник", 181238, -122925],
			["Кофейник", 128687, -30973],
			["Кофейник", 129132, -30709],
			["Кофейник", 129355, -31352],
			["Кофейник", 103827, -21477],
			["Кофейник", 99798, -16490],
			["Кофейник", 101630, -13809],
			["Кофейник", 102618, -12634],
			["Кофейник", 119848, -2492],
			["Кофейник", 88791, -31316],
			["Кофейник", 90060, -32183],
			["Кофейник", 89789, -31335],
			["Кофейник", 90397, -32065],
			["Кофейник", 90165, -30004],
			["Кофейник", 90613, -29316],
			["Кофейник", 82181, -18723],
			["Кофейник", 77765, -15053],
			["Кофейник", 77808, -15254],
			["Кофейник", 84520, -15420],
			["Кофейник", 77929, -11612],
			["Кофейник", 90402, -9890],
			["Кофейник", 95295, -8205],
			["Кофейник", 73158, -7183],
			["Кофейник", 89680, -6080],
			["Кофейник", 28499, -31203],
			["Кофейник", 29798, -21616],
			["Кофейник", 29428, -21296],
			["Кофейник", 111515, -55321],
			["Кофейник", 51568, -42663],
			["Кофейник", 52314, -40335],
			["Кофейник", 33572, -33795],
			["Кофейник", 60793, -96358],
			["Кофейник", 55331, -67224],
			["Кофейник", 38106, -119282],
			["Кофейник", 21241, -109695],
			["Кофейник", 21089, -109497],
			["Кофейник", 21529, -105331],
			["Кофейник", 29206, -100170],
			["Кофейник", -61134, -145639],
			["Кофейник", -93322, -163636],
			["Кофейник", -126613, -144652],
			["Кофейник", -126551, -144709],
			["Кофейник", -126537, -135371],
			["Кофейник", -123634, -132277],
			["Кофейник", -100163, -132752],
			["Кофейник", -76773, -176180],
			["Кофейник", -121072, -189357],
			["Кофейник", -108768, -187354],
			["Кофейник", -111294, -177541],
			["Кофейник", -113893, -169213],
			["Кофейник", -152702, -161065],
			["Кофейник", -138151, -152399],
			["Кофейник", -139740, -144783],
			["Кофейник", -146981, -142936],
			["Кофейник", -137118, -182860],
			["Кофейник", 189624, -169473],
			["Кофейник", 189760, -169353],
			["Кофейник", 193752, -169086],
			["Кофейник", 102822, -151560],
			["Кофейник", 52086, -149191],
			["Кофейник", 27319, -137335],
			["Кофейник", 25789, -137775],
			["Кофейник", 74234, -177120],
			["Кофейник", 73959, -172840],
			["Кофейник", -82237, 201546],
			["Кофейник", -13259, 189602],
			["Кофейник", -60589, 181676],
			["Кофейник", -38971, 190072],
			["Кофейник", -69176, 171068],
			["Кофейник", -96869, 180543],
			["Кофейник", -92913, 183323],
			["Кофейник", -91801, 183566],
			["Кофейник", -92687, 180594],
			["Кофейник", -95731, 190034],
			["Кофейник", -3945, 161653],
			["Кофейник", -64070, 132122],
			["Кофейник", -90526, 149850],
			["Кофейник", -109335, 159032],
			["Кофейник", -163642, 200633],
			["Кофейник", -146166, 173190],
			["Кофейник", -145665, 172599],
			["Кофейник", -143506, 179076],
			["Кофейник", -178130, 165720],
			["Кофейник", -144785, 137046],
			["Кофейник", -137600, 153903],
			["Кофейник", -140971, 156526],
			["Кофейник", 179342, 134128],
			["Кофейник", 151953, 137708],
			["Кофейник", 152443, 137599],
			["Кофейник", 152005, 161321],
			["Кофейник", 152299, 161438],
			["Кофейник", 15632, 198403],
			["Кофейник", 107758, 173355],
			["Кофейник", 80270, 182592],
			["Кофейник", 91819, 188957],
			["Кофейник", 91338, 188797],
			["Кофейник", 60266, 173255],
			["Кофейник", 63929, 173010],
			["Кофейник", 58718, 176870],
			["Кофейник", 13270, 174366],
			["Кофейник", 26711, 172124],
			["Кофейник", 14870, 188153],
			["Кофейник", 71767, 133117],
			["Кофейник", 71791, 137163],
			["Кофейник", 77770, 151522],
			["Кофейник", 73869, 156182],
			["Кофейник", 45775, 161953],
			["Кофейник", 27414, 131666],
			["Кофейник", 27203, 132065],
			["Кофейник", -16796, 117843],
			["Кофейник", -14627, 120440],
			["Кофейник", -49060, 110131],
			["Кофейник", -80626, 102693],
			["Кофейник", -86734, 115412],
			["Кофейник", -129119, 119467],
			["Кофейник", -128378, 119948],
			["Кофейник", -128668, 119974],
			["Кофейник", -41036, 87972],
			["Кофейник", -41071, 90619],
			["Кофейник", -33593, 91973],
			["Кофейник", -8682, 42255],
			["Кофейник", -65409, 35866],
			["Кофейник", -39453, 46589],
			["Кофейник", -104555, 38369],
			["Кофейник", -122103, 41002],
			["Кофейник", -25112, 4253],
			["Кофейник", -42151, 2867],
			["Кофейник", -59422, 4211],
			["Кофейник", -53288, 4313],
			["Кофейник", -34351, 12914],
			["Кофейник", -92194, 26842],
			["Кофейник", -118161, 3400],
			["Кофейник", -118446, 944],
			["Кофейник", -130832, 10735],
			["Кофейник", -98505, 8255],
			["Кофейник", -139408, 90869],
			["Кофейник", -148940, 39995],
			["Кофейник", -132056, 12337],
			["Кофейник", 182374, 112696],
			["Кофейник", 146061, 107472],
			["Кофейник", 133492, 126642],
			["Кофейник", 170464, 57151],
			["Кофейник", 169603, 56602],
			["Кофейник", 170214, 56739],
			["Кофейник", 172522, 58023],
			["Кофейник", 170896, 1717],
			["Кофейник", 183078, 2994],
			["Кофейник", 172318, 8935],
			["Кофейник", 46222, 100654],
			["Кофейник", 99388, 92009],
			["Кофейник", 49864, 85783],
			["Кофейник", 28536, 93422],
			["Кофейник", 8437, 95498],
			["Кофейник", 88754, 53237],
			["Кофейник", 33830, 33341],
			["Кофейник", 35971, 39160],
			["Кофейник", 14873, 39626],
			["Кофейник", 17125, 41894],
			["Кофейник", 23487, 44124],
			["Кофейник", 16823, 45524],
			["Кофейник", 27028, 50119],
			["Кофейник", 100503, 25781],
			["Кофейник", 71352, 21121],
			["Кофейник", 55505, 10369],
			["Кофейник", 673, 16204]
			];
	for (var i = 0; i < hlam217.length; i++) {
				hlam_217 = new L.circleMarker([hlam217[i][1],hlam217[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam217[i][0])
					.bindTooltip(hlam217[i][0], {direction: 'top'})
					.addTo(hlam217icons);
			}
	}
	else {
		hlam217icons.clearLayers();
	}
}
var hlam218icons = L.layerGroup().addTo(map);
function Hlam218OnOff() {
	var chbox218;
	chbox218=document.getElementById('Hlam218Button');
	if (chbox218.checked) {
		var hlam218 = [
			["Кофейник &quotКофелюкс&quot", -59101, -91708],
			["Кофейник &quotКофелюкс&quot", -46806, -72924],
			["Кофейник &quotКофелюкс&quot", -93305, -83668],
			["Кофейник &quotКофелюкс&quot", -47546, -117878],
			["Кофейник &quotКофелюкс&quot", -48653, -99583],
			["Кофейник &quotКофелюкс&quot", -82363, -126168],
			["Кофейник &quotКофелюкс&quot", -82161, -126486],
			["Кофейник &quotКофелюкс&quot", -82534, -126337],
			["Кофейник &quotКофелюкс&quot", -111568, -121844],
			["Кофейник &quotКофелюкс&quot", -111436, -122122],
			["Кофейник &quotКофелюкс&quot", -112019, -122111],
			["Кофейник &quotКофелюкс&quot", 143572, -89166],
			["Кофейник &quotКофелюкс&quot", 148688, -69700],
			["Кофейник &quotКофелюкс&quot", 148540, -69506],
			["Кофейник &quotКофелюкс&quot", 102235, -12443],
			["Кофейник &quotКофелюкс&quot", -126492, -144817],
			["Кофейник &quotКофелюкс&quot", -126507, -135379],
			["Кофейник &quotКофелюкс&quot", -82922, -177934],
			["Кофейник &quotКофелюкс&quot", 135615, -156155],
			["Кофейник &quotКофелюкс&quot", 73757, -178806],
			["Кофейник &quotКофелюкс&quot", -34719, 172674],
			["Кофейник &quotКофелюкс&quot", -143587, 178402],
			["Кофейник &quotКофелюкс&quot", 70271, 202345],
			["Кофейник &quotКофелюкс&quot", 95863, 187173],
			["Кофейник &quotКофелюкс&quot", 93419, 189066],
			["Кофейник &quotКофелюкс&quot", 95464, 189580],
			["Кофейник &quotКофелюкс&quot", 2414, 137946],
			["Кофейник &quotКофелюкс&quot", -46663, 2610],
			["Кофейник &quotКофелюкс&quot", -56125, 10507],
			["Кофейник &quotКофелюкс&quot", -46236, 28392],
			["Кофейник &quotКофелюкс&quot", -44199, 28285],
			["Кофейник &quotКофелюкс&quot", -43849, 28994],
			["Кофейник &quotКофелюкс&quot", -77763, 30875]
			];
	for (var i = 0; i < hlam218.length; i++) {
				hlam_218 = new L.circleMarker([hlam218[i][1],hlam218[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam218[i][0])
					.bindTooltip(hlam218[i][0], {direction: 'top'})
					.addTo(hlam218icons);
			}
	}
	else {
		hlam218icons.clearLayers();
	}
}
var hlam219icons = L.layerGroup().addTo(map);
function Hlam219OnOff() {
	var chbox219;
	chbox219=document.getElementById('Hlam219Button');
	if (chbox219.checked) {
		var hlam219 = [
			["Кошачья миска", -42076, -5512],
			["Кошачья миска", -43007, -5494],
			["Кошачья миска", -39460, -59453],
			["Кошачья миска", -38596, -61355],
			["Кошачья миска", -36794, -58906],
			["Кошачья миска", -46887, -50940],
			["Кошачья миска", -56153, -83306],
			["Кошачья миска", -62977, -129162],
			["Кошачья миска", 80602, -1576],
			["Кошачья миска", 50202, -19710],
			["Кошачья миска", 29142, -58135],
			["Кошачья миска", 60278, -96695],
			["Кошачья миска", 25516, -104728],
			["Кошачья миска", 30075, -102010],
			["Кошачья миска", -2355, -159837],
			["Кошачья миска", -126282, -144677],
			["Кошачья миска", -38223, -173964],
			["Кошачья миска", -76785, -176235],
			["Кошачья миска", -139149, -144222],
			["Кошачья миска", 22761, -149494],
			["Кошачья миска", 71695, -175086],
			["Кошачья миска", -34671, 172638],
			["Кошачья миска", -97499, 179203],
			["Кошачья миска", -98850, 183512],
			["Кошачья миска", -19938, 145938],
			["Кошачья миска", -27027, 162673],
			["Кошачья миска", -89943, 148560],
			["Кошачья миска", -114529, 155750],
			["Кошачья миска", -109601, 157579],
			["Кошачья миска", -163834, 200425],
			["Кошачья миска", -145962, 153007],
			["Кошачья миска", 15484, 198043],
			["Кошачья миска", 48730, 190531],
			["Кошачья миска", 11776, 183113],
			["Кошачья миска", 14755, 188139],
			["Кошачья миска", 20839, 131496],
			["Кошачья миска", -104028, 123978],
			["Кошачья миска", -103643, 84570],
			["Кошачья миска", -128812, 88515],
			["Кошачья миска", -128681, 88441],
			["Кошачья миска", -128680, 88494],
			["Кошачья миска", -128665, 88434],
			["Кошачья миска", -21415, 11348],
			["Кошачья миска", -20903, 16576],
			["Кошачья миска", -92175, 26973],
			["Кошачья миска", -180035, 74199],
			["Кошачья миска", 9855, 48308],
			["Кошачья миска", 75580, 10110],
			["Кошачья миска", 75607, 10114],
			["Кошачья миска", 75607, 10114],
			["Кошачья миска", 75626, 10105],
			["Кошачья миска", 75626, 10105],
			["Кошачья миска", 75626, 10105],
			["Кошачья миска", 75626, 10105],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75654, 10044],
			["Кошачья миска", 75737, 10031],
			["Кошачья миска", 75737, 10031],
			["Кошачья миска", 75737, 10031],
			["Кошачья миска", 75361, 9933],
			["Кошачья миска", 75361, 9933],
			["Кошачья миска", 75361, 9933],
			["Кошачья миска", 75273, 9772],
			["Кошачья миска", 75273, 9666],
			["Кошачья миска", 75295, 9701],
			["Кошачья миска", 75295, 9648],
			["Кошачья миска", 75295, 9648],
			["Кошачья миска", 75295, 9648],
			["Кошачья миска", 75649, 9406],
			["Кошачья миска", 75636, 9646],
			["Кошачья миска", 75467, 9628],
			["Кошачья миска", -37645, 96261]
			];
	for (var i = 0; i < hlam219.length; i++) {
				hlam_219 = new L.circleMarker([hlam219[i][1],hlam219[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam219[i][0])
					.bindTooltip(hlam219[i][0], {direction: 'top'})
					.addTo(hlam219icons);
			}
	}
	else {
		hlam219icons.clearLayers();
	}
}
var hlam220icons = L.layerGroup().addTo(map);
function Hlam220OnOff() {
	var chbox220;
	chbox220=document.getElementById('Hlam220Button');
	if (chbox220.checked) {
		var hlam220 = [
			["Красивая белая ваза", -44832, -8612],
			["Красивая белая ваза", -42802, -5158],
			["Красивая белая ваза", -43075, -5334],
			["Красивая белая ваза", -42508, -5860],
			["Красивая белая ваза", -42889, -6090],
			["Красивая белая ваза", -42964, -6014],
			["Красивая белая ваза", -46801, 2242],
			["Красивая белая ваза", -45741, 19969],
			["Красивая белая ваза", -45825, 19747],
			["Красивая белая ваза", -46275, 19762],
			["Красивая белая ваза", 171924, 58056],
			["Красивая белая ваза", 171340, 58486],
			["Красивая белая ваза", 171281, 58732],
			["Красивая белая ваза", 171697, 59761],
			["Красивая белая ваза", 172007, 59683],
			["Красивая белая ваза", 172441, 58363],
			["Красивая белая ваза", 172665, 59314],
			["Красивая белая ваза", 172792, 58535]
			];
	for (var i = 0; i < hlam220.length; i++) {
				hlam_220 = new L.circleMarker([hlam220[i][1],hlam220[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam220[i][0])
					.bindTooltip(hlam220[i][0], {direction: 'top'})
					.addTo(hlam220icons);
			}
	}
	else {
		hlam220icons.clearLayers();
	}
}
var hlam221icons = L.layerGroup().addTo(map);
function Hlam221OnOff() {
	var chbox221;
	chbox221=document.getElementById('Hlam221Button');
	if (chbox221.checked) {
		var hlam221 = [
			["Красивая ваза", -45179, -8912],
			["Красивая ваза", 171476, 57773],
			["Красивая ваза", 171006, 59432],
			["Красивая ваза", 171671, 59584],
			["Красивая ваза", 172764, 58634]
			];
	for (var i = 0; i < hlam221.length; i++) {
				hlam_221 = new L.circleMarker([hlam221[i][1],hlam221[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam221[i][0])
					.bindTooltip(hlam221[i][0], {direction: 'top'})
					.addTo(hlam221icons);
			}
	}
	else {
		hlam221icons.clearLayers();
	}
}
var hlam222icons = L.layerGroup().addTo(map);
function Hlam222OnOff() {
	var chbox222;
	chbox222=document.getElementById('Hlam222Button');
	if (chbox222.checked) {
		var hlam222 = [
			["Красивая китайская ваза", -44816, -8630],
			["Красивая китайская ваза", -43131, -5853],
			["Красивая китайская ваза", -38221, 3401],
			["Красивая китайская ваза", 171147, 59604],
			["Красивая китайская ваза", 171264, 59490],
			["Красивая китайская ваза", 172193, 59345]
			];
	for (var i = 0; i < hlam222.length; i++) {
				hlam_222 = new L.circleMarker([hlam222[i][1],hlam222[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam222[i][0])
					.bindTooltip(hlam222[i][0], {direction: 'top'})
					.addTo(hlam222icons);
			}
	}
	else {
		hlam222icons.clearLayers();
	}
}
var hlam223icons = L.layerGroup().addTo(map);
function Hlam223OnOff() {
	var chbox223;
	chbox223=document.getElementById('Hlam223Button');
	if (chbox223.checked) {
		var hlam223 = [
			["Красная краска", -12160, -69111],
			["Красная краска", -158849, -57778],
			["Красная краска", 158092, -68823],
			["Красная краска", 158077, -68837],
			["Красная краска", -43445, -173251],
			["Красная краска", -43428, -173242],
			["Красная краска", -43415, -173224],
			["Красная краска", 135574, -156421],
			["Красная краска", -143664, 178793],
			["Красная краска", -61042, 89485],
			["Красная краска", -61699, 90453]
			];
	for (var i = 0; i < hlam223.length; i++) {
				hlam_223 = new L.circleMarker([hlam223[i][1],hlam223[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam223[i][0])
					.bindTooltip(hlam223[i][0], {direction: 'top'})
					.addTo(hlam223icons);
			}
	}
	else {
		hlam223icons.clearLayers();
	}
}
var hlam224icons = L.layerGroup().addTo(map);
function Hlam224OnOff() {
	var chbox224;
	chbox224=document.getElementById('Hlam224Button');
	if (chbox224.checked) {
		var hlam224 = [
			["Красная тарелка", -50968, -12598],
			["Красная тарелка", -50671, -13259],
			["Красная тарелка", -50426, -13648],
			["Красная тарелка", -50463, -13722],
			["Красная тарелка", -50234, -13690],
			["Красная тарелка", -50890, -14179],
			["Красная тарелка", -53591, -1915],
			["Красная тарелка", -19172, -46876],
			["Красная тарелка", -19371, -43543],
			["Красная тарелка", -55581, -61357],
			["Красная тарелка", -55503, -61249],
			["Красная тарелка", -61198, -100010],
			["Красная тарелка", -61169, -100049],
			["Красная тарелка", -70104, -104404],
			["Красная тарелка", -70214, -104388],
			["Красная тарелка", -147742, -56847],
			["Красная тарелка", 149188, -52225],
			["Красная тарелка", 142119, -123804],
			["Красная тарелка", 33316, -32764],
			["Красная тарелка", 48622, -22178],
			["Красная тарелка", 48723, -22264],
			["Красная тарелка", 50258, -23221],
			["Красная тарелка", 31716, -21204],
			["Красная тарелка", 29764, -21035],
			["Красная тарелка", 29800, -21021],
			["Красная тарелка", 34073, -33716],
			["Красная тарелка", 33379, -32928],
			["Красная тарелка", 33422, -33151],
			["Красная тарелка", 33468, -33127],
			["Красная тарелка", 30584, -33028],
			["Красная тарелка", 30578, -33084],
			["Красная тарелка", 75485, -76965],
			["Красная тарелка", 75640, -76683],
			["Красная тарелка", 75509, -76917],
			["Красная тарелка", 46191, -66148],
			["Красная тарелка", 13776, -107417],
			["Красная тарелка", -115888, -137030],
			["Красная тарелка", -115905, -137026],
			["Красная тарелка", -116073, -137162],
			["Красная тарелка", -93939, -175215],
			["Красная тарелка", -17306, 162542],
			["Красная тарелка", -17307, 162542],
			["Красная тарелка", -17307, 162540],
			["Красная тарелка", -41284, 161774],
			["Красная тарелка", -41282, 161780],
			["Красная тарелка", -137150, 153914],
			["Красная тарелка", -137407, 153964],
			["Красная тарелка", -137408, 154047],
			["Красная тарелка", 124791, 169070],
			["Красная тарелка", 124839, 169023],
			["Красная тарелка", 124697, 168926],
			["Красная тарелка", 111616, 139729],
			["Красная тарелка", -59845, 117421],
			["Красная тарелка", -16704, 60420],
			["Красная тарелка", -17266, 60072],
			["Красная тарелка", -17307, 60034],
			["Красная тарелка", -37554, 49149],
			["Красная тарелка", -37202, 48965],
			["Красная тарелка", -37539, 49157],
			["Красная тарелка", -123266, 51045],
			["Красная тарелка", -33970, 164],
			["Красная тарелка", -33970, 164],
			["Красная тарелка", -33970, 164],
			["Красная тарелка", -148436, 112057],
			["Красная тарелка", 193142, 113014],
			["Красная тарелка", 196778, 65622],
			["Красная тарелка", 196556, 65844],
			["Красная тарелка", 196534, 65867],
			["Красная тарелка", 133902, 85678],
			["Красная тарелка", 196794, 65402],
			["Красная тарелка", 193933, 56240],
			["Красная тарелка", 191230, 61310],
			["Красная тарелка", 95329, 104041],
			["Красная тарелка", 130679, 87714]
			];
	for (var i = 0; i < hlam224.length; i++) {
				hlam_224 = new L.circleMarker([hlam224[i][1],hlam224[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam224[i][0])
					.bindTooltip(hlam224[i][0], {direction: 'top'})
					.addTo(hlam224icons);
			}
	}
	else {
		hlam224icons.clearLayers();
	}
}
var hlam225icons = L.layerGroup().addTo(map);
function Hlam225OnOff() {
	var chbox225;
	chbox225=document.getElementById('Hlam225Button');
	if (chbox225.checked) {
		var hlam225 = [
			["Красный садовый гном", -119995, -14303],
			["Красный садовый гном", -9884, -50300],
			["Красный садовый гном", -93398, -83532],
			["Красный садовый гном", -15738, -124321],
			["Красный садовый гном", 70294, -5894],
			["Красный садовый гном", 62080, -97381],
			["Красный садовый гном", 7939, -69797],
			["Красный садовый гном", 23257, -123976],
			["Красный садовый гном", 18011, -119643],
			["Красный садовый гном", -153971, -168193],
			["Красный садовый гном", -154181, -168163],
			["Красный садовый гном", -152438, -166456],
			["Красный садовый гном", -152414, -166428],
			["Красный садовый гном", -154603, -167046],
			["Красный садовый гном", 50199, -166064],
			["Красный садовый гном", -58995, 177606],
			["Красный садовый гном", -58570, 177346],
			["Красный садовый гном", -59769, 177359],
			["Красный садовый гном", -27974, 162255],
			["Красный садовый гном", -107300, 150768],
			["Красный садовый гном", -139623, 172667],
			["Красный садовый гном", 10571, 160958],
			["Красный садовый гном", -95669, 124285],
			["Красный садовый гном", -6495, 93292],
			["Красный садовый гном", -49199, 86284],
			["Красный садовый гном", -92354, 65900],
			["Красный садовый гном", -92322, 65874],
			["Красный садовый гном", -92087, 10155],
			["Красный садовый гном", -118359, 5713],
			["Красный садовый гном", -138446, 113172],
			["Красный садовый гном", -138542, 113100],
			["Красный садовый гном", -179667, 73974],
			["Красный садовый гном", 136705, 123400],
			["Красный садовый гном", 139489, 86737],
			["Красный садовый гном", 52876, 100407],
			["Красный садовый гном", 64900, 76928],
			["Красный садовый гном", 20880, 90046],
			["Красный садовый гном", 117119, 52883],
			["Красный садовый гном", 85680, 59763],
			["Красный садовый гном", 61485, 178688],
			["Красный садовый гном", 131205, 85133],
			["Красный садовый гном", 51609, -69443],
			["Красный садовый гном", 47440, 13914],
			["Красный садовый гном", -11823, 196833]
			];
	for (var i = 0; i < hlam225.length; i++) {
				hlam_225 = new L.circleMarker([hlam225[i][1],hlam225[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam225[i][0])
					.bindTooltip(hlam225[i][0], {direction: 'top'})
					.addTo(hlam225icons);
			}
	}
	else {
		hlam225icons.clearLayers();
	}
}
var hlam226icons = L.layerGroup().addTo(map);
function Hlam226OnOff() {
	var chbox226;
	chbox226=document.getElementById('Hlam226Button');
	if (chbox226.checked) {
		var hlam226 = [
			["Кроличья шкура", -10454, -50340],
			["Кроличья шкура", -35118, -57865],
			["Кроличья шкура", -37477, -57169],
			["Кроличья шкура", -113564, -55736],
			["Кроличья шкура", -22057, -77353],
			["Кроличья шкура", -1608, -130742],
			["Кроличья шкура", -16914, -121845],
			["Кроличья шкура", -171518, -11391],
			["Кроличья шкура", -171519, -11389],
			["Кроличья шкура", -155842, -36043],
			["Кроличья шкура", 164818, -7596],
			["Кроличья шкура", 208283, -69148],
			["Кроличья шкура", 181576, -130217],
			["Кроличья шкура", 79520, -1639],
			["Кроличья шкура", 68226, -87872],
			["Кроличья шкура", 11786, -83348],
			["Кроличья шкура", 81830, -112328],
			["Кроличья шкура", 52896, -125817],
			["Кроличья шкура", 44812, -113347],
			["Кроличья шкура", -27240, -131380],
			["Кроличья шкура", -123115, -192654],
			["Кроличья шкура", -132375, -148701],
			["Кроличья шкура", 173097, -140037],
			["Кроличья шкура", 52122, -148725],
			["Кроличья шкура", -94782, 190564],
			["Кроличья шкура", -41505, 158772],
			["Кроличья шкура", -90415, 147996],
			["Кроличья шкура", 16343, 189672],
			["Кроличья шкура", 71783, 135842],
			["Кроличья шкура", 88426, 157284],
			["Кроличья шкура", -59492, 122660],
			["Кроличья шкура", -69732, 110984],
			["Кроличья шкура", -79575, 88521],
			["Кроличья шкура", -39411, 44790],
			["Кроличья шкура", -39278, 47349],
			["Кроличья шкура", -94138, 61335],
			["Кроличья шкура", -179374, 74927],
			["Кроличья шкура", -179992, 74385],
			["Кроличья шкура", -158857, 57029],
			["Кроличья шкура", -145942, 64743],
			["Кроличья шкура", 192644, 113426],
			["Кроличья шкура", 182328, 96895],
			["Кроличья шкура", 188920, 56652],
			["Кроличья шкура", 190765, 61393],
			["Кроличья шкура", 191433, 61149],
			["Кроличья шкура", 191458, 63289],
			["Кроличья шкура", 195376, 65181],
			["Кроличья шкура", 96890, 104513],
			["Кроличья шкура", 80379, 53250],
			["Кроличья шкура", 5740, 42615],
			["Кроличья шкура", 24321, 49880]
			];
	for (var i = 0; i < hlam226.length; i++) {
				hlam_226 = new L.circleMarker([hlam226[i][1],hlam226[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam226[i][0])
					.bindTooltip(hlam226[i][0], {direction: 'top'})
					.addTo(hlam226icons);
			}
	}
	else {
		hlam226icons.clearLayers();
	}
}
var hlam227icons = L.layerGroup().addTo(map);
function Hlam227OnOff() {
	var chbox227;
	chbox227=document.getElementById('Hlam227Button');
	if (chbox227.checked) {
		var hlam227 = [
			["Крысиный яд", -79360, -22394],
			["Крысиный яд", -79267, -22471],
			["Крысиный яд", -79267, -22454],
			["Крысиный яд", -79285, -22481],
			["Крысиный яд", -77670, -21771],
			["Крысиный яд", -77686, -21775],
			["Крысиный яд", -126701, -1319],
			["Крысиный яд", -29304, -49397],
			["Крысиный яд", -29310, -49381],
			["Крысиный яд", -61242, -56101],
			["Крысиный яд", -51978, -46622],
			["Крысиный яд", -51970, -46611],
			["Крысиный яд", -52012, -46668],
			["Крысиный яд", -51977, -46701],
			["Крысиный яд", -120122, -45873],
			["Крысиный яд", -120186, -45943],
			["Крысиный яд", -17080, -69518],
			["Крысиный яд", -10910, -123681],
			["Крысиный яд", -9858, -123440],
			["Крысиный яд", -9861, -123451],
			["Крысиный яд", -8295, -121384],
			["Крысиный яд", -101394, -107134],
			["Крысиный яд", -147814, -57444],
			["Крысиный яд", -168191, -42098],
			["Крысиный яд", -152044, -73051],
			["Крысиный яд", -151454, -73179],
			["Крысиный яд", -168145, -115196],
			["Крысиный яд", 167533, -23943],
			["Крысиный яд", 167930, -17936],
			["Крысиный яд", 167696, -17916],
			["Крысиный яд", 173255, -13478],
			["Крысиный яд", 180816, -11979],
			["Крысиный яд", 160940, -58140],
			["Крысиный яд", 149146, -52312],
			["Крысиный яд", 149008, -51912],
			["Крысиный яд", 161371, -91743],
			["Крысиный яд", 149948, -66965],
			["Крысиный яд", 153249, -103843],
			["Крысиный яд", 153114, -103843],
			["Крысиный яд", 129982, -2885],
			["Крысиный яд", 88583, -31279],
			["Крысиный яд", 81793, -20882],
			["Крысиный яд", 82415, -21023],
			["Крысиный яд", 84547, -19420],
			["Крысиный яд", 96350, -13974],
			["Крысиный яд", 72445, -3794],
			["Крысиный яд", 48583, -21881],
			["Крысиный яд", 28449, -31024],
			["Крысиный яд", 36048, -35292],
			["Крысиный яд", 29081, -58400],
			["Крысиный яд", 17155, -82491],
			["Крысиный яд", 98948, -124742],
			["Крысиный яд", 89354, -124811],
			["Крысиный яд", -2449, -159926],
			["Крысиный яд", -4378, -155702],
			["Крысиный яд", -125852, -135257],
			["Крысиный яд", -121685, -132653],
			["Крысиный яд", -29804, -172231],
			["Крысиный яд", -29808, -172237],
			["Крысиный яд", -29409, -172565],
			["Крысиный яд", -29587, -172730],
			["Крысиный яд", -29595, -172526],
			["Крысиный яд", -42263, -172791],
			["Крысиный яд", -75700, -176699],
			["Крысиный яд", -75691, -176719],
			["Крысиный яд", -133846, -153713],
			["Крысиный яд", -134680, -154155],
			["Крысиный яд", 189161, -165915],
			["Крысиный яд", 60543, -145225],
			["Крысиный яд", 22796, -149410],
			["Крысиный яд", 71767, -175666],
			["Крысиный яд", -23337, 188868],
			["Крысиный яд", -61169, 179924],
			["Крысиный яд", -98759, 183563],
			["Крысиный яд", -27268, 162754],
			["Крысиный яд", -144636, 173168],
			["Крысиный яд", -145370, 174306],
			["Крысиный яд", -143530, 178666],
			["Крысиный яд", -140923, 156522],
			["Крысиный яд", 142335, 139342],
			["Крысиный яд", 152604, 140027],
			["Крысиный яд", 100587, 195987],
			["Крысиный яд", 60320, 171590],
			["Крысиный яд", 60488, 173147],
			["Крысиный яд", 53956, 190931],
			["Крысиный яд", 26684, 172116],
			["Крысиный яд", 26678, 172120],
			["Крысиный яд", 2510, 182319],
			["Крысиный яд", 71599, 137244],
			["Крысиный яд", 88481, 156926],
			["Крысиный яд", 87283, 157945],
			["Крысиный яд", 1754, 162421],
			["Крысиный яд", -129541, 119226],
			["Крысиный яд", -129428, 119134],
			["Крысиный яд", -104681, 123050],
			["Крысиный яд", -31986, 91982],
			["Крысиный яд", -33302, 92149],
			["Крысиный яд", -35414, 2301],
			["Крысиный яд", -33946, 574],
			["Крысиный яд", -33957, 582],
			["Крысиный яд", -148441, 113700],
			["Крысиный яд", 153537, 105584],
			["Крысиный яд", 182107, 96851],
			["Крысиный яд", 154151, 77372],
			["Крысиный яд", 144526, 81479],
			["Крысиный яд", 168327, 55563],
			["Крысиный яд", 169092, 58381],
			["Крысиный яд", 153144, 57714],
			["Крысиный яд", 171016, 1890],
			["Крысиный яд", 183079, 2751],
			["Крысиный яд", 183482, 2480],
			["Крысиный яд", 139413, 3507],
			["Крысиный яд", 98940, 86212],
			["Крысиный яд", 110098, 55476],
			["Крысиный яд", 111777, 55792],
			["Крысиный яд", 110008, 57643],
			["Крысиный яд", 111578, 57894],
			["Крысиный яд", 16197, 44955],
			["Крысиный яд", 27585, 47612],
			["Крысиный яд", 20012, 50678]
			];
	for (var i = 0; i < hlam227.length; i++) {
				hlam_227 = new L.circleMarker([hlam227[i][1],hlam227[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam227[i][0])
					.bindTooltip(hlam227[i][0], {direction: 'top'})
					.addTo(hlam227icons);
			}
	}
	else {
		hlam227icons.clearLayers();
	}
}
var hlam228icons = L.layerGroup().addTo(map);
function Hlam228OnOff() {
	var chbox228;
	chbox228=document.getElementById('Hlam228Button');
	if (chbox228.checked) {
		var hlam228 = [
			["Крышка маслобойки", 64849, -58632],
			["Крышка маслобойки", 93884, -85012],
			["Крышка маслобойки", 46864, 161069],
			["Крышка маслобойки", 172388, 39870],
			["Крышка маслобойки", 190983, 62643]
			];
	for (var i = 0; i < hlam228.length; i++) {
				hlam_228 = new L.circleMarker([hlam228[i][1],hlam228[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam228[i][0])
					.bindTooltip(hlam228[i][0], {direction: 'top'})
					.addTo(hlam228icons);
			}
	}
	else {
		hlam228icons.clearLayers();
	}
}
var hlam229icons = L.layerGroup().addTo(map);
function Hlam229OnOff() {
	var chbox229;
	chbox229=document.getElementById('Hlam229Button');
	if (chbox229.checked) {
		var hlam229 = [
			["Крышка на контуре хладагента", -86726, -13308],
			["Крышка на контуре хладагента", -86753, -13261],
			["Крышка на контуре хладагента", -34136, -84708],
			["Крышка на контуре хладагента", -46755, -72894],
			["Крышка на контуре хладагента", -106144, -83939],
			["Крышка на контуре хладагента", -111726, -121845],
			["Крышка на контуре хладагента", -131953, -95992],
			["Крышка на контуре хладагента", 140537, -61168],
			["Крышка на контуре хладагента", 149318, -75831],
			["Крышка на контуре хладагента", 90310, -29964],
			["Крышка на контуре хладагента", 84676, -19361],
			["Крышка на контуре хладагента", 111478, -55289],
			["Крышка на контуре хладагента", 56791, -94489],
			["Крышка на контуре хладагента", 22740, -101836],
			["Крышка на контуре хладагента", -126465, -135337],
			["Крышка на контуре хладагента", -146053, -142905],
			["Крышка на контуре хладагента", 189098, -165941],
			["Крышка на контуре хладагента", 189941, -165156],
			["Крышка на контуре хладагента", -145355, 173560],
			["Крышка на контуре хладагента", -147096, 178633],
			["Крышка на контуре хладагента", 95886, 187236],
			["Крышка на контуре хладагента", -25481, 47007],
			["Крышка на контуре хладагента", -1001, 1399],
			["Крышка на контуре хладагента", 182966, 109915],
			["Крышка на контуре хладагента", 181950, 110398],
			["Крышка на контуре хладагента", 153970, 77436],
			["Крышка на контуре хладагента", 144272, 81093],
			["Крышка на контуре хладагента", 153141, 57557],
			["Крышка на контуре хладагента", 111655, 57895]
			];
	for (var i = 0; i < hlam229.length; i++) {
				hlam_229 = new L.circleMarker([hlam229[i][1],hlam229[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam229[i][0])
					.bindTooltip(hlam229[i][0], {direction: 'top'})
					.addTo(hlam229icons);
			}
	}
	else {
		hlam229icons.clearLayers();
	}
}
var hlam230icons = L.layerGroup().addTo(map);
function Hlam230OnOff() {
	var chbox230;
	chbox230=document.getElementById('Hlam230Button');
	if (chbox230.checked) {
		var hlam230 = [
			["Крышка от большой стеклянной банки", -107710, -30624],
			["Крышка от большой стеклянной банки", -120822, -13800],
			["Крышка от большой стеклянной банки", -115173, -47151],
			["Крышка от большой стеклянной банки", -166746, -14209],
			["Крышка от большой стеклянной банки", -169435, -116520],
			["Крышка от большой стеклянной банки", 93111, -8884],
			["Крышка от большой стеклянной банки", 72272, -75988],
			["Крышка от большой стеклянной банки", 15472, -107447],
			["Крышка от большой стеклянной банки", -31172, -151937],
			["Крышка от большой стеклянной банки", -29989, -132611],
			["Крышка от большой стеклянной банки", -95171, -176770],
			["Крышка от большой стеклянной банки", -95426, -176813],
			["Крышка от большой стеклянной банки", -139521, -144611],
			["Крышка от большой стеклянной банки", 202979, -138051],
			["Крышка от большой стеклянной банки", -76, 139107],
			["Крышка от большой стеклянной банки", -163132, 157131],
			["Крышка от большой стеклянной банки", -163125, 157135],
			["Крышка от большой стеклянной банки", 14493, 193277],
			["Крышка от большой стеклянной банки", 75242, 150912],
			["Крышка от большой стеклянной банки", -43108, 87345],
			["Крышка от большой стеклянной банки", 198484, 94132]
			];
	for (var i = 0; i < hlam230.length; i++) {
				hlam_230 = new L.circleMarker([hlam230[i][1],hlam230[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam230[i][0])
					.bindTooltip(hlam230[i][0], {direction: 'top'})
					.addTo(hlam230icons);
			}
	}
	else {
		hlam230icons.clearLayers();
	}
}
var hlam231icons = L.layerGroup().addTo(map);
function Hlam231OnOff() {
	var chbox231;
	chbox231=document.getElementById('Hlam231Button');
	if (chbox231.checked) {
		var hlam231 = [
			["Крышка от маленькой соусницы", -80940, -102492],
			["Крышка от маленькой соусницы", 105964, -8373],
			["Крышка от маленькой соусницы", -96763, 180886],
			["Крышка от маленькой соусницы", 28823, 131345]
			];
	for (var i = 0; i < hlam231.length; i++) {
				hlam_231 = new L.circleMarker([hlam231[i][1],hlam231[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam231[i][0])
					.bindTooltip(hlam231[i][0], {direction: 'top'})
					.addTo(hlam231icons);
			}
	}
	else {
		hlam231icons.clearLayers();
	}
}
var hlam232icons = L.layerGroup().addTo(map);
function Hlam232OnOff() {
	var chbox232;
	chbox232=document.getElementById('Hlam232Button');
	if (chbox232.checked) {
		var hlam232 = [
			["Крышка от маленькой стеклянной банки", -147563, -56802],
			["Крышка от маленькой стеклянной банки", 178092, -122381],
			["Крышка от маленькой стеклянной банки", 33975, -36309],
			["Крышка от маленькой стеклянной банки", 27621, -44929],
			["Крышка от маленькой стеклянной банки", -123, 139127],
			["Крышка от маленькой стеклянной банки", 126055, 160442],
			["Крышка от маленькой стеклянной банки", -106399, 42922],
			["Крышка от маленькой стеклянной банки", -43352, 12374]
			];
	for (var i = 0; i < hlam232.length; i++) {
				hlam_232 = new L.circleMarker([hlam232[i][1],hlam232[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam232[i][0])
					.bindTooltip(hlam232[i][0], {direction: 'top'})
					.addTo(hlam232icons);
			}
	}
	else {
		hlam232icons.clearLayers();
	}
}
var hlam233icons = L.layerGroup().addTo(map);
function Hlam233OnOff() {
	var chbox233;
	chbox233=document.getElementById('Hlam233Button');
	if (chbox233.checked) {
		var hlam233 = [
			["Крышка от металлического корыта", -80728, -110364],
			["Крышка от металлического корыта", -114405, -117046],
			["Крышка от металлического корыта", 149023, -51847],
			["Крышка от металлического корыта", 148368, -52469],
			["Крышка от металлического корыта", 33885, -36523],
			["Крышка от металлического корыта", 17865, -120645],
			["Крышка от металлического корыта", 164889, -150836],
			["Крышка от металлического корыта", -71447, 170085],
			["Крышка от металлического корыта", 9062, 166930],
			["Крышка от металлического корыта", 45194, 162896],
			["Крышка от металлического корыта", 45720, 162711],
			["Крышка от металлического корыта", -46382, 28837],
			["Крышка от металлического корыта", 183802, 3201],
			["Крышка от металлического корыта", 26240, 54781]
			];
	for (var i = 0; i < hlam233.length; i++) {
				hlam_233 = new L.circleMarker([hlam233[i][1],hlam233[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam233[i][0])
					.bindTooltip(hlam233[i][0], {direction: 'top'})
					.addTo(hlam233icons);
			}
	}
	else {
		hlam233icons.clearLayers();
	}
}
var hlam234icons = L.layerGroup().addTo(map);
function Hlam234OnOff() {
	var chbox234;
	chbox234=document.getElementById('Hlam234Button');
	if (chbox234.checked) {
		var hlam234 = [
			["Крышка от соусницы", -24823, -59767],
			["Крышка от соусницы", -47906, -106724],
			["Крышка от соусницы", -147813, -56899],
			["Крышка от соусницы", -136770, -177172],
			["Крышка от соусницы", 169014, 56077],
			["Крышка от соусницы", 88839, 2859]
			];
	for (var i = 0; i < hlam234.length; i++) {
				hlam_234 = new L.circleMarker([hlam234[i][1],hlam234[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam234[i][0])
					.bindTooltip(hlam234[i][0], {direction: 'top'})
					.addTo(hlam234icons);
			}
	}
	else {
		hlam234icons.clearLayers();
	}
}
var hlam235icons = L.layerGroup().addTo(map);
function Hlam235OnOff() {
	var chbox235;
	chbox235=document.getElementById('Hlam235Button');
	if (chbox235.checked) {
		var hlam235 = [
			["Кувшин самогона", -121579, -26980],
			["Кувшин самогона", -120485, -13768],
			["Кувшин самогона", -107678, -14126],
			["Кувшин самогона", -127092, -1870],
			["Кувшин самогона", -113949, -46824],
			["Кувшин самогона", -92938, -83292],
			["Кувшин самогона", -84621, -80396],
			["Кувшин самогона", -84314, -106391],
			["Кувшин самогона", -155874, -14464],
			["Кувшин самогона", -178691, -2629],
			["Кувшин самогона", -146236, -92849],
			["Кувшин самогона", -146249, -92889],
			["Кувшин самогона", -146224, -92891],
			["Кувшин самогона", -146246, -92859],
			["Кувшин самогона", 196788, -90761],
			["Кувшин самогона", 196054, -91101],
			["Кувшин самогона", 196177, -90984],
			["Кувшин самогона", 161287, -92104],
			["Кувшин самогона", 147181, -78332],
			["Кувшин самогона", 181722, -130106],
			["Кувшин самогона", 59678, -23322],
			["Кувшин самогона", 64145, -49974],
			["Кувшин самогона", 10277, -52426],
			["Кувшин самогона", 93797, -85203],
			["Кувшин самогона", 94436, -85036],
			["Кувшин самогона", 76109, -108594],
			["Кувшин самогона", 76061, -108730],
			["Кувшин самогона", 84810, -108717],
			["Кувшин самогона", 84765, -108768],
			["Кувшин самогона", 84823, -109071],
			["Кувшин самогона", -142858, -158069],
			["Кувшин самогона", -148683, -142927],
			["Кувшин самогона", 197278, -143078],
			["Кувшин самогона", 202992, -138117],
			["Кувшин самогона", -5112, 200497],
			["Кувшин самогона", -5111, 200593],
			["Кувшин самогона", -38394, 201262],
			["Кувшин самогона", -25625, 185813],
			["Кувшин самогона", -4123, 184411],
			["Кувшин самогона", -4094, 184402],
			["Кувшин самогона", -36113, 171161],
			["Кувшин самогона", -34875, 172360],
			["Кувшин самогона", -84964, 166465],
			["Кувшин самогона", -84969, 166594],
			["Кувшин самогона", -71188, 170312],
			["Кувшин самогона", -71337, 170018],
			["Кувшин самогона", -71390, 170027],
			["Кувшин самогона", -71148, 169908],
			["Кувшин самогона", -71066, 169895],
			["Кувшин самогона", -69198, 171379],
			["Кувшин самогона", -27509, 144354],
			["Кувшин самогона", -138389, 152667],
			["Кувшин самогона", 70054, 137290],
			["Кувшин самогона", 72510, 137019],
			["Кувшин самогона", -26006, 99411],
			["Кувшин самогона", -26003, 99390],
			["Кувшин самогона", -25625, 98889],
			["Кувшин самогона", -49680, 110494],
			["Кувшин самогона", -104380, 123818],
			["Кувшин самогона", -63389, 74266],
			["Кувшин самогона", -63534, 74646],
			["Кувшин самогона", -49361, 86209],
			["Кувшин самогона", -49383, 86249],
			["Кувшин самогона", -49384, 86298],
			["Кувшин самогона", -49362, 86302],
			["Кувшин самогона", -43717, 90891],
			["Кувшин самогона", -75360, 89413],
			["Кувшин самогона", -75409, 89255],
			["Кувшин самогона", -120359, 44856],
			["Кувшин самогона", -104623, 41847],
			["Кувшин самогона", -5363, 5179],
			["Кувшин самогона", -22466, 8571],
			["Кувшин самогона", -78863, 18265],
			["Кувшин самогона", -127501, 30724],
			["Кувшин самогона", -164329, 121983],
			["Кувшин самогона", 193118, 112988],
			["Кувшин самогона", 193070, 113002],
			["Кувшин самогона", 146142, 107227],
			["Кувшин самогона", 198899, 94186],
			["Кувшин самогона", 181188, 91828],
			["Кувшин самогона", 181173, 91572],
			["Кувшин самогона", 181211, 91582],
			["Кувшин самогона", 182111, 96980],
			["Кувшин самогона", 191353, 60597],
			["Кувшин самогона", 182735, 2938],
			["Кувшин самогона", 182811, 2840],
			["Кувшин самогона", 131760, 12009],
			["Кувшин самогона", 42651, 109552],
			["Кувшин самогона", 42666, 109514],
			["Кувшин самогона", 42658, 109523],
			["Кувшин самогона", 42649, 109562],
			["Кувшин самогона", 42666, 109489],
			["Кувшин самогона", 42667, 109537],
			["Кувшин самогона", 42779, 109553],
			["Кувшин самогона", 51369, 112407],
			["Кувшин самогона", 51287, 112366],
			["Кувшин самогона", 51308, 113528],
			["Кувшин самогона", 1946, 100157],
			["Кувшин самогона", 125061, 84576],
			["Кувшин самогона", 80911, 87876],
			["Кувшин самогона", 50214, 84560],
			["Кувшин самогона", 32962, 92721],
			["Кувшин самогона", 19837, 90128],
			["Кувшин самогона", 19883, 90113],
			["Кувшин самогона", 19861, 90120],
			["Кувшин самогона", 19816, 90115],
			["Кувшин самогона", 19447, 90751],
			["Кувшин самогона", 20088, 90455],
			["Кувшин самогона", 20140, 90435],
			["Кувшин самогона", 20185, 90564],
			["Кувшин самогона", 104682, 42285],
			["Кувшин самогона", 103894, 56794],
			["Кувшин самогона", 37102, 41418],
			["Кувшин самогона", 37108, 41126],
			["Кувшин самогона", 13334, 43376],
			["Кувшин самогона", 23866, 15236]
			];
	for (var i = 0; i < hlam235.length; i++) {
				hlam_235 = new L.circleMarker([hlam235[i][1],hlam235[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam235[i][0])
					.bindTooltip(hlam235[i][0], {direction: 'top'})
					.addTo(hlam235icons);
			}
	}
	else {
		hlam235icons.clearLayers();
	}
}
var hlam236icons = L.layerGroup().addTo(map);
function Hlam236OnOff() {
	var chbox236;
	chbox236=document.getElementById('Hlam236Button');
	if (chbox236.checked) {
		var hlam236 = [
			["Кузнечный молот", -153270, -120595],
			["Кузнечный молот", -164186, -128907],
			["Кузнечный молот", 90274, -9920],
			["Кузнечный молот", 15783, -107648],
			["Кузнечный молот", 17888, -108567],
			["Кузнечный молот", 543, 168105],
			["Кузнечный молот", 43293, 161550],
			["Кузнечный молот", 188807, 57476],
			["Кузнечный молот", 136941, 42950],
			["Кузнечный молот", -128545, 80248]
			];
	for (var i = 0; i < hlam236.length; i++) {
				hlam_236 = new L.circleMarker([hlam236[i][1],hlam236[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam236[i][0])
					.bindTooltip(hlam236[i][0], {direction: 'top'})
					.addTo(hlam236icons);
			}
	}
	else {
		hlam236icons.clearLayers();
	}
}
var hlam237icons = L.layerGroup().addTo(map);
function Hlam237OnOff() {
	var chbox237;
	chbox237=document.getElementById('Hlam237Button');
	if (chbox237.checked) {
		var hlam237 = [
			["Кукла", -152193, -74012],
			["Кукла", 149729, -76009],
			["Кукла", 149933, -67402],
			["Кукла", 99061, -9714],
			["Кукла", 97097, -13494],
			["Кукла", 91109, -8052],
			["Кукла", 36032, -35302],
			["Кукла", 21974, -105749],
			["Кукла", 21022, -102442],
			["Кукла", -71728, -176842],
			["Кукла", -135009, -185224],
			["Кукла", 146812, -148079],
			["Кукла", 15545, -155729],
			["Кукла", -94300, 176579],
			["Кукла", 170661, 240427],
			["Кукла", 150184, 135265],
			["Кукла", -128628, 120218],
			["Кукла", -6823, 43273],
			["Кукла", -158978, 57720],
			["Кукла", 57308, 54290],
			["Кукла", 92702, 9122],
			["Кукла", 58280, 10488]
			];
	for (var i = 0; i < hlam237.length; i++) {
				hlam_237 = new L.circleMarker([hlam237[i][1],hlam237[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam237[i][0])
					.bindTooltip(hlam237[i][0], {direction: 'top'})
					.addTo(hlam237icons);
			}
	}
	else {
		hlam237icons.clearLayers();
	}
}
var hlam238icons = L.layerGroup().addTo(map);
function Hlam238OnOff() {
	var chbox238;
	chbox238=document.getElementById('Hlam238Button');
	if (chbox238.checked) {
		var hlam238 = [
			["Куски пробки", 29136, -58528]
			];
	for (var i = 0; i < hlam238.length; i++) {
				hlam_238 = new L.circleMarker([hlam238[i][1],hlam238[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam238[i][0])
					.bindTooltip(hlam238[i][0], {direction: 'top'})
					.addTo(hlam238icons);
			}
	}
	else {
		hlam238icons.clearLayers();
	}
}
var hlam239icons = L.layerGroup().addTo(map);
function Hlam239OnOff() {
	var chbox239;
	chbox239=document.getElementById('Hlam239Button');
	if (chbox239.checked) {
		var hlam239 = [
			["Кухонные весы", -53149, -13796],
			["Кухонные весы", -43330, -6270],
			["Кухонные весы", -19496, -47025],
			["Кухонные весы", -38757, -57502],
			["Кухонные весы", -31041, -66304],
			["Кухонные весы", -59367, -84533],
			["Кухонные весы", -69998, -104954],
			["Кухонные весы", 167515, -24677],
			["Кухонные весы", 167512, -24420],
			["Кухонные весы", 173353, -13436],
			["Кухонные весы", 183500, -93122],
			["Кухонные весы", 148685, -69707],
			["Кухонные весы", 181116, -122915],
			["Кухонные весы", 79239, -1697],
			["Кухонные весы", 33920, -36320],
			["Кухонные весы", 16620, -107147],
			["Кухонные весы", 17862, -106393],
			["Кухонные весы", -4306, -155980],
			["Кухонные весы", -40696, -175260],
			["Кухонные весы", -121004, -189689],
			["Кухонные весы", -40670, 161403],
			["Кухонные весы", 69734, 202264],
			["Кухонные весы", 3299, 182782],
			["Кухонные весы", 16325, 189662],
			["Кухонные весы", -88049, 66374],
			["Кухонные весы", 182781, 2991],
			["Кухонные весы", 190338, 30902]
			];
	for (var i = 0; i < hlam239.length; i++) {
				hlam_239 = new L.circleMarker([hlam239[i][1],hlam239[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam239[i][0])
					.bindTooltip(hlam239[i][0], {direction: 'top'})
					.addTo(hlam239icons);
			}
	}
	else {
		hlam239icons.clearLayers();
	}
}
var hlam240icons = L.layerGroup().addTo(map);
function Hlam240OnOff() {
	var chbox240;
	chbox240=document.getElementById('Hlam240Button');
	if (chbox240.checked) {
		var hlam240 = [
			["Лабораторная емкость", 8780, -5985],
			["Лабораторная емкость", 8775, -5978],
			["Лабораторная емкость", 189099, -165981],
			["Лабораторная емкость", -84422, 166076],
			["Лабораторная емкость", -84190, 166217],
			["Лабораторная емкость", -83894, 166215],
			["Лабораторная емкость", -90890, 67030]
			];
	for (var i = 0; i < hlam240.length; i++) {
				hlam_240 = new L.circleMarker([hlam240[i][1],hlam240[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam240[i][0])
					.bindTooltip(hlam240[i][0], {direction: 'top'})
					.addTo(hlam240icons);
			}
	}
	else {
		hlam240icons.clearLayers();
	}
}
var hlam241icons = L.layerGroup().addTo(map);
function Hlam241OnOff() {
	var chbox241;
	chbox241=document.getElementById('Hlam241Button');
	if (chbox241.checked) {
		var hlam241 = [
			["Лабораторная пробирка", 101679, -12149],
			["Лабораторная пробирка", 87307, 2733],
			["Лабораторная пробирка", 87302, 2745],
			["Лабораторная пробирка", 87287, 2735]
			];
	for (var i = 0; i < hlam241.length; i++) {
				hlam_241 = new L.circleMarker([hlam241[i][1],hlam241[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam241[i][0])
					.bindTooltip(hlam241[i][0], {direction: 'top'})
					.addTo(hlam241icons);
			}
	}
	else {
		hlam241icons.clearLayers();
	}
}
var hlam242icons = L.layerGroup().addTo(map);
function Hlam242OnOff() {
	var chbox242;
	chbox242=document.getElementById('Hlam242Button');
	if (chbox242.checked) {
		var hlam242 = [

			];
	for (var i = 0; i < hlam242.length; i++) {
				hlam_242 = new L.circleMarker([hlam242[i][1],hlam242[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam242[i][0])
					.bindTooltip(hlam242[i][0], {direction: 'top'})
					.addTo(hlam242icons);
			}
	}
	else {
		hlam242icons.clearLayers();
	}
}
var hlam243icons = L.layerGroup().addTo(map);
function Hlam243OnOff() {
	var chbox243;
	chbox243=document.getElementById('Hlam243Button');
	if (chbox243.checked) {
		var hlam243 = [
			["Лампочка", -40320, -1653],
			["Лампочка", -40565, -3070],
			["Лампочка", -77780, -21590],
			["Лампочка", -77788, -21602],
			["Лампочка", -77780, -21610],
			["Лампочка", -9831, -50363],
			["Лампочка", -56443, -60283],
			["Лампочка", -47248, -49393],
			["Лампочка", -14393, -70004],
			["Лампочка", -47596, -117267],
			["Лампочка", -148283, -58431],
			["Лампочка", -162155, -53931],
			["Лампочка", -146184, -92824],
			["Лампочка", -131311, -113377],
			["Лампочка", 148924, -52477],
			["Лампочка", 184127, -92691],
			["Лампочка", 201906, -125298],
			["Лампочка", 201893, -125299],
			["Лампочка", 29510, -58487],
			["Лампочка", 9942, -79250],
			["Лампочка", -126550, -135246],
			["Лампочка", -119351, -135742],
			["Лампочка", -32722, -187209],
			["Лампочка", 74529, -177753],
			["Лампочка", -39728, 158890],
			["Лампочка", -38970, 158387],
			["Лампочка", -40679, 161529],
			["Лампочка", -40702, 161519],
			["Лампочка", -40691, 161515],
			["Лампочка", -146985, 178701],
			["Лампочка", -138353, 153356],
			["Лампочка", 16119, 198268],
			["Лампочка", 1681, 164244],
			["Лампочка", 45679, 161593],
			["Лампочка", -103873, 38207],
			["Лампочка", -103815, 38229],
			["Лампочка", -103857, 38208],
			["Лампочка", -103854, 38194],
			["Лампочка", -47587, 1859],
			["Лампочка", -46638, 2591],
			["Лампочка", -42598, 2511],
			["Лампочка", 183173, 111438],
			["Лампочка", 183188, 111438]
			];
	for (var i = 0; i < hlam243.length; i++) {
				hlam_243 = new L.circleMarker([hlam243[i][1],hlam243[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam243[i][0])
					.bindTooltip(hlam243[i][0], {direction: 'top'})
					.addTo(hlam243icons);
			}
	}
	else {
		hlam243icons.clearLayers();
	}
}
var hlam244icons = L.layerGroup().addTo(map);
function Hlam244OnOff() {
	var chbox244;
	chbox244=document.getElementById('Hlam244Button');
	if (chbox244.checked) {
		var hlam244 = [
			["Левая рука куклы", -10546, -50635],
			["Левая рука куклы", -10545, -50636],
			["Левая рука куклы", -73546, -179576],
			["Левая рука куклы", -38419, 3970],
			["Левая рука куклы", -19038, 137588]
			];
	for (var i = 0; i < hlam244.length; i++) {
				hlam_244 = new L.circleMarker([hlam244[i][1],hlam244[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam244[i][0])
					.bindTooltip(hlam244[i][0], {direction: 'top'})
					.addTo(hlam244icons);
			}
	}
	else {
		hlam244icons.clearLayers();
	}
}
var hlam245icons = L.layerGroup().addTo(map);
function Hlam245OnOff() {
	var chbox245;
	chbox245=document.getElementById('Hlam245Button');
	if (chbox245.checked) {
		var hlam245 = [
			["Ледяные щипцы", -54901, -47953],
			["Ледяные щипцы", -46799, -72914],
			["Ледяные щипцы", -60173, 180662],
			["Ледяные щипцы", 144176, 98647]
			];
	for (var i = 0; i < hlam245.length; i++) {
				hlam_245 = new L.circleMarker([hlam245[i][1],hlam245[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam245[i][0])
					.bindTooltip(hlam245[i][0], {direction: 'top'})
					.addTo(hlam245icons);
			}
	}
	else {
		hlam245icons.clearLayers();
	}
}
var hlam246icons = L.layerGroup().addTo(map);
function Hlam246OnOff() {
	var chbox246;
	chbox246=document.getElementById('Hlam246Button');
	if (chbox246.checked) {
		var hlam246 = [
			["Линейка", -44502, -8524],
			["Линейка", -51869, -46575],
			["Линейка", -29622, -93985],
			["Линейка", -31019, -66260],
			["Линейка", -34997, -84278],
			["Линейка", -71019, -69116],
			["Линейка", -11816, -123224],
			["Линейка", -39801, -128798],
			["Линейка", -128458, -118934],
			["Линейка", -155400, -36112],
			["Линейка", -131419, -92896],
			["Линейка", -164102, -129059],
			["Линейка", 167285, -25403],
			["Линейка", 131208, -31323],
			["Линейка", 130181, -27674],
			["Линейка", 90425, -9744],
			["Линейка", 79307, -1648],
			["Линейка", 51437, -43670],
			["Линейка", 25728, -60988],
			["Линейка", 23120, -107043],
			["Линейка", 25731, -99763],
			["Линейка", -4356, -156088],
			["Линейка", 131555, -132188],
			["Линейка", 115602, -157731],
			["Линейка", -94293, 176581],
			["Линейка", -95597, 184399],
			["Линейка", -19807, 145744],
			["Линейка", -40480, 161214],
			["Линейка", -141025, 143153],
			["Линейка", -144403, 149565],
			["Линейка", 69738, 202304],
			["Линейка", 48595, 190915],
			["Линейка", 14768, 191233],
			["Линейка", -38700, 83870],
			["Линейка", -102446, 84518],
			["Линейка", -29725, 17192],
			["Линейка", -44224, 28210],
			["Линейка", -155979, 51514],
			["Линейка", 181212, 110584],
			["Линейка", 183457, 111685],
			["Линейка", 55322, 8427]
			];
	for (var i = 0; i < hlam246.length; i++) {
				hlam_246 = new L.circleMarker([hlam246[i][1],hlam246[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam246[i][0])
					.bindTooltip(hlam246[i][0], {direction: 'top'})
					.addTo(hlam246icons);
			}
	}
	else {
		hlam246icons.clearLayers();
	}
}
var hlam247icons = L.layerGroup().addTo(map);
function Hlam247OnOff() {
	var chbox247;
	chbox247=document.getElementById('Hlam247Button');
	if (chbox247.checked) {
		var hlam247 = [

			];
	for (var i = 0; i < hlam247.length; i++) {
				hlam_247 = new L.circleMarker([hlam247[i][1],hlam247[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam247[i][0])
					.bindTooltip(hlam247[i][0], {direction: 'top'})
					.addTo(hlam247icons);
			}
	}
	else {
		hlam247icons.clearLayers();
	}
}
var hlam248icons = L.layerGroup().addTo(map);
function Hlam248OnOff() {
	var chbox248;
	chbox248=document.getElementById('Hlam248Button');
	if (chbox248.checked) {
		var hlam248 = [
			["Лисья шкура", -37938, -58084],
			["Лисья шкура", -63166, -102754],
			["Лисья шкура", -161259, -42369],
			["Лисья шкура", 180346, -11763],
			["Лисья шкура", 164801, -7583],
			["Лисья шкура", 173625, -1476],
			["Лисья шкура", 138968, -1085],
			["Лисья шкура", 141219, -455],
			["Лисья шкура", 141224, -470],
			["Лисья шкура", 142737, -56438],
			["Лисья шкура", 208260, -69180],
			["Лисья шкура", 160247, -92414],
			["Лисья шкура", 153092, -74994],
			["Лисья шкура", 67676, -87923],
			["Лисья шкура", 59674, -108742],
			["Лисья шкура", 23754, -106681],
			["Лисья шкура", -61087, -145039],
			["Лисья шкура", -116882, -187021],
			["Лисья шкура", -127745, -182876],
			["Лисья шкура", 52238, -148875],
			["Лисья шкура", -69171, 171574],
			["Лисья шкура", -92661, 185135],
			["Лисья шкура", -39438, 162288],
			["Лисья шкура", -163565, 141762],
			["Лисья шкура", 179293, 133452],
			["Лисья шкура", 1207, 140263],
			["Лисья шкура", -126014, 120499],
			["Лисья шкура", -79880, 89209],
			["Лисья шкура", -79459, 89355],
			["Лисья шкура", -39439, 44827],
			["Лисья шкура", -40803, 50600],
			["Лисья шкура", -68594, 56194],
			["Лисья шкура", -78463, 18471],
			["Лисья шкура", -70960, 25396],
			["Лисья шкура", -99032, 8363],
			["Лисья шкура", -127988, 30649],
			["Лисья шкура", -164394, 121860],
			["Лисья шкура", -180879, 73911],
			["Лисья шкура", 192607, 113607],
			["Лисья шкура", 182345, 96885],
			["Лисья шкура", 191433, 61094],
			["Лисья шкура", 190629, 62117],
			["Лисья шкура", 191560, 63147],
			["Лисья шкура", 22345, 128115],
			["Лисья шкура", 71734, 20502]
			];
	for (var i = 0; i < hlam248.length; i++) {
				hlam_248 = new L.circleMarker([hlam248[i][1],hlam248[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam248[i][0])
					.bindTooltip(hlam248[i][0], {direction: 'top'})
					.addTo(hlam248icons);
			}
	}
	else {
		hlam248icons.clearLayers();
	}
}
var hlam249icons = L.layerGroup().addTo(map);
function Hlam249OnOff() {
	var chbox249;
	chbox249=document.getElementById('Hlam249Button');
	if (chbox249.checked) {
		var hlam249 = [
			["Лицевой щиток из черепа", 127727, -27462],
			["Лицевой щиток из черепа", 36043, -35341],
			["Лицевой щиток из черепа", -162734, -157136],
			["Лицевой щиток из черепа", 68449, 202359],
			["Лицевой щиток из черепа", 183729, 3298]
			];
	for (var i = 0; i < hlam249.length; i++) {
				hlam_249 = new L.circleMarker([hlam249[i][1],hlam249[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam249[i][0])
					.bindTooltip(hlam249[i][0], {direction: 'top'})
					.addTo(hlam249icons);
			}
	}
	else {
		hlam249icons.clearLayers();
	}
}
var hlam250icons = L.layerGroup().addTo(map);
function Hlam250OnOff() {
	var chbox250;
	chbox250=document.getElementById('Hlam250Button');
	if (chbox250.checked) {
		var hlam250 = [
			["Лопатка", -56644, -11118],
			["Лопатка", -107244, -22212],
			["Лопатка", -24976, -57106],
			["Лопатка", -19191, -47076],
			["Лопатка", -55734, -60308],
			["Лопатка", -107838, -58985],
			["Лопатка", -56557, -108628],
			["Лопатка", -132637, -4645],
			["Лопатка", -147824, -56852],
			["Лопатка", -148244, -56996],
			["Лопатка", 167269, -21487],
			["Лопатка", 149090, -52476],
			["Лопатка", 148567, -79695],
			["Лопатка", 89117, -20967],
			["Лопатка", 94091, -6319],
			["Лопатка", 79282, -1677],
			["Лопатка", 88189, -3718],
			["Лопатка", 50327, -23317],
			["Лопатка", 38425, -48785],
			["Лопатка", 34189, -32818],
			["Лопатка", 34304, -36417],
			["Лопатка", 12148, -78182],
			["Лопатка", -120877, -189588],
			["Лопатка", -134152, -153831],
			["Лопатка", 22177, -150348],
			["Лопатка", -4319, 184928],
			["Лопатка", -91864, 183558],
			["Лопатка", -7028, 146418],
			["Лопатка", -92736, 149802],
			["Лопатка", -160428, 152520],
			["Лопатка", 151871, 138787],
			["Лопатка", 91101, 188888],
			["Лопатка", 91098, 188901],
			["Лопатка", 11607, 183012],
			["Лопатка", -49341, 110554],
			["Лопатка", -23485, 11855],
			["Лопатка", -40026, 5825],
			["Лопатка", 135235, 115376],
			["Лопатка", 183786, 2317],
			["Лопатка", 183705, 2349],
			["Лопатка", 138437, 442],
			["Лопатка", 94814, 99214],
			["Лопатка", -39023, -132702],
			["Лопатка", 153006, -104545],
			["Лопатка", 173858, -13665]
			];
	for (var i = 0; i < hlam250.length; i++) {
				hlam_250 = new L.circleMarker([hlam250[i][1],hlam250[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam250[i][0])
					.bindTooltip(hlam250[i][0], {direction: 'top'})
					.addTo(hlam250icons);
			}
	}
	else {
		hlam250icons.clearLayers();
	}
}
var hlam251icons = L.layerGroup().addTo(map);
function Hlam251OnOff() {
	var chbox251;
	chbox251=document.getElementById('Hlam251Button');
	if (chbox251.checked) {
		var hlam251 = [
			["Лунная мартышка Дженглс", -4817, -115608],
			["Лунная мартышка Дженглс", 191510, -34244],
			["Лунная мартышка Дженглс", 91774, -9902],
			["Лунная мартышка Дженглс", 25459, -63005],
			["Лунная мартышка Дженглс", -72915, -176498],
			["Лунная мартышка Дженглс", 164159, -150360],
			["Лунная мартышка Дженглс", -129439, 131211],
			["Лунная мартышка Дженглс", 146873, 139927],
			["Лунная мартышка Дженглс", 61155, 172401],
			["Лунная мартышка Дженглс", 88055, 157254],
			["Лунная мартышка Дженглс", -92660, 66554],
			["Лунная мартышка Дженглс", 190908, 31203],
			["Лунная мартышка Дженглс", 25951, 125587],
			["Лунная мартышка Дженглс", 47330, 62365],
			["Лунная мартышка Дженглс", 136609, 90725],
			["Лунная мартышка Дженглс", 41076, -15767],
			["Лунная мартышка Дженглс", -30674, -191586],
			["Лунная мартышка Дженглс", -110469, -95464],
			["Лунная мартышка Дженглс", -2271, -159654]
			];
	for (var i = 0; i < hlam251.length; i++) {
				hlam_251 = new L.circleMarker([hlam251[i][1],hlam251[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam251[i][0])
					.bindTooltip(hlam251[i][0], {direction: 'top'})
					.addTo(hlam251icons);
			}
	}
	else {
		hlam251icons.clearLayers();
	}
}
var hlam252icons = L.layerGroup().addTo(map);
function Hlam252OnOff() {
	var chbox252;
	chbox252=document.getElementById('Hlam252Button');
	if (chbox252.checked) {
		var hlam252 = [
			["Лунная мартышка Дженглс", 142969, -146585]
			];
	for (var i = 0; i < hlam252.length; i++) {
				hlam_252 = new L.circleMarker([hlam252[i][1],hlam252[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam252[i][0])
					.bindTooltip(hlam252[i][0], {direction: 'top'})
					.addTo(hlam252icons);
			}
	}
	else {
		hlam252icons.clearLayers();
	}
}
var hlam253icons = L.layerGroup().addTo(map);
function Hlam253OnOff() {
	var chbox253;
	chbox253=document.getElementById('Hlam253Button');
	if (chbox253.checked) {
		var hlam253 = [
			["Лыжная палка", -50142, -12689],
			["Лыжная палка", 57359, -57],
			["Лыжная палка", 6779, -20519],
			["Лыжная палка", 6597, -20666],
			["Лыжная палка", 6597, -20649],
			["Лыжная палка", 6699, -20617],
			["Лыжная палка", 6683, -20598],
			["Лыжная палка", 6778, -20498],
			["Лыжная палка", 6755, -20487],
			["Лыжная палка", 6718, -20580],
			["Лыжная палка", 6735, -20599],
			["Лыжная палка", 6695, -20476],
			["Лыжная палка", 18629, -361],
			["Лыжная палка", 29282, -58591],
			["Лыжная палка", 29357, -58579],
			["Лыжная палка", 29351, -58582],
			["Лыжная палка", -80935, -178284],
			["Лыжная палка", 1543, -137936],
			["Лыжная палка", 131219, 75299],
			["Лыжная палка", 132847, 76258],
			["Лыжная палка", 132847, 76250],
			["Лыжная палка", 132400, 79953],
			["Лыжная палка", 132439, 79940],
			["Лыжная палка", 134079, 85952],
			["Лыжная палка", 133188, 87878],
			["Лыжная палка", 133156, 87920],
			["Лыжная палка", 145013, 87551],
			["Лыжная палка", 136994, 97695],
			["Лыжная палка", 139358, 94616],
			["Лыжная палка", 139389, 94530],
			["Лыжная палка", 144507, 97738],
			["Лыжная палка", 143465, 98034],
			["Лыжная палка", 143603, 96975],
			["Лыжная палка", 143616, 96982],
			["Лыжная палка", 131022, 74686],
			["Лыжная палка", 131000, 74669],
			["Лыжная палка", 41136, 77041],
			["Лыжная палка", 41106, 77183],
			["Лыжная палка", 50187, 84809],
			["Лыжная палка", 50063, 84660],
			["Лыжная палка", 25816, 70603],
			["Лыжная палка", 25949, 70657],
			["Лыжная палка", 17857, 75591],
			["Лыжная палка", 17866, 75604],
			["Лыжная палка", 2867, 85970],
			["Лыжная палка", 2885, 85947],
			["Лыжная палка", 35538, 40004],
			["Лыжная палка", 35671, 40052],
			["Лыжная палка", 36023, 39238],
			["Лыжная палка", 35074, 40385],
			["Лыжная палка", 34427, 54946],
			["Лыжная палка", 34426, 54928],
			["Лыжная палка", 24492, 36157],
			["Лыжная палка", 12252, 37634],
			["Лыжная палка", 16196, 39995],
			["Лыжная палка", 14873, 36884],
			["Лыжная палка", 13259, 38183],
			["Лыжная палка", 12730, 38736],
			["Лыжная палка", 12780, 38750],
			["Лыжная палка", 14472, 37780],
			["Лыжная палка", 12974, 38761],
			["Лыжная палка", 13040, 38721],
			["Лыжная палка", 13700, 39954],
			["Лыжная палка", 13707, 39944],
			["Лыжная палка", 13756, 39942],
			["Лыжная палка", 15497, 39380],
			["Лыжная палка", 15547, 39381],
			["Лыжная палка", 15583, 39355],
			["Лыжная палка", 15554, 39371],
			["Лыжная палка", 7512, 44388],
			["Лыжная палка", 7520, 44108],
			["Лыжная палка", 7542, 44162],
			["Лыжная палка", 7523, 43970],
			["Лыжная палка", 7471, 43942],
			["Лыжная палка", 7330, 43513],
			["Лыжная палка", 7182, 41820],
			["Лыжная палка", 7065, 41739],
			["Лыжная палка", 8226, 42789],
			["Лыжная палка", 8244, 42650],
			["Лыжная палка", 15607, 43868],
			["Лыжная палка", 15669, 43909],
			["Лыжная палка", 13925, 44381],
			["Лыжная палка", 14103, 44247],
			["Лыжная палка", 14009, 44411],
			["Лыжная палка", 13976, 44407],
			["Лыжная палка", 16548, 44577],
			["Лыжная палка", 16041, 45428],
			["Лыжная палка", 16046, 45439],
			["Лыжная палка", 16025, 45483],
			["Лыжная палка", 14283, 47576],
			["Лыжная палка", 15011, 47877],
			["Лыжная палка", 14981, 47915],
			["Лыжная палка", 14951, 47927],
			["Лыжная палка", 14986, 47960],
			["Лыжная палка", 15584, 47779],
			["Лыжная палка", 15589, 47789],
			["Лыжная палка", 15569, 47834],
			["Лыжная палка", 16166, 48261],
			["Лыжная палка", 16214, 48205],
			["Лыжная палка", 14535, 46285],
			["Лыжная палка", 14529, 46335],
			["Лыжная палка", 14558, 45999],
			["Лыжная палка", 14545, 45968],
			["Лыжная палка", 16843, 45604],
			["Лыжная палка", 16833, 45609],
			["Лыжная палка", 20366, 47472],
			["Лыжная палка", 20878, 47064],
			["Лыжная палка", 21013, 47701],
			["Лыжная палка", 20601, 47693],
			["Лыжная палка", 24779, 45935],
			["Лыжная палка", 24785, 45940],
			["Лыжная палка", 28024, 48583],
			["Лыжная палка", 28875, 53709],
			["Лыжная палка", 28875, 53709],
			["Лыжная палка", 51821, 1361],
			["Лыжная палка", 51840, 1303],
			["Лыжная палка", 52295, 8533],
			["Лыжная палка", 51572, 12070],
			["Лыжная палка", 51552, 12127],
			["Лыжная палка", 55983, 12825],
			["Лыжная палка", 14870, 27004],
			["Лыжная палка", 13487, 26185],
			["Лыжная палка", 13469, 26194],
			["Лыжная палка", 14498, 28723],
			["Лыжная палка", 14475, 28718],
			["Лыжная палка", 15033, 28775],
			["Лыжная палка", 15021, 28783],
			["Лыжная палка", 14791, 30921],
			["Лыжная палка", 14565, 30882],
			["Лыжная палка", 14389, 29664],
			["Лыжная палка", 14344, 29730],
			["Лыжная палка", 14385, 29967],
			["Лыжная палка", 14429, 29774],
			["Лыжная палка", 14387, 30665],
			["Лыжная палка", 14453, 30696],
			["Лыжная палка", 14702, 31046],
			["Лыжная палка", 13737, 31961],
			["Лыжная палка", 26887, 32644],
			["Лыжная палка", 26958, 32539],
			["Лыжная палка", 13784, 31890]
			];
	for (var i = 0; i < hlam253.length; i++) {
				hlam_253 = new L.circleMarker([hlam253[i][1],hlam253[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam253[i][0])
					.bindTooltip(hlam253[i][0], {direction: 'top'})
					.addTo(hlam253icons);
			}
	}
	else {
		hlam253icons.clearLayers();
	}
}
var hlam254icons = L.layerGroup().addTo(map);
function Hlam254OnOff() {
	var chbox254;
	chbox254=document.getElementById('Hlam254Button');
	if (chbox254.checked) {
		var hlam254 = [
			["Маленькая бутылочка с соской", -54780, -11906],
			["Маленькая бутылочка с соской", -42763, -4236],
			["Маленькая бутылочка с соской", -49662, -55520],
			["Маленькая бутылочка с соской", -109432, -59634],
			["Маленькая бутылочка с соской", -62449, -129021],
			["Маленькая бутылочка с соской", -75404, -111082],
			["Маленькая бутылочка с соской", -144135, -13464],
			["Маленькая бутылочка с соской", 167399, -22182],
			["Маленькая бутылочка с соской", 5884, -59042],
			["Маленькая бутылочка с соской", 17273, -44511],
			["Маленькая бутылочка с соской", 17567, -44549],
			["Маленькая бутылочка с соской", 26904, -102217],
			["Маленькая бутылочка с соской", -62470, -171392],
			["Маленькая бутылочка с соской", 193206, -145289],
			["Маленькая бутылочка с соской", 15552, -155741],
			["Маленькая бутылочка с соской", -27340, 162824],
			["Маленькая бутылочка с соской", -143331, 157347],
			["Маленькая бутылочка с соской", 14497, 193404],
			["Маленькая бутылочка с соской", 14818, 193214],
			["Маленькая бутылочка с соской", -104550, 84138],
			["Маленькая бутылочка с соской", -104551, 84166],
			["Маленькая бутылочка с соской", -92517, 65092],
			["Маленькая бутылочка с соской", -47103, 20551],
			["Маленькая бутылочка с соской", 115419, 111350],
			["Маленькая бутылочка с соской", 70125, 82700],
			["Маленькая бутылочка с соской", 51612, -69449],
			["Маленькая бутылочка с соской", -54644, -131837]
			];
	for (var i = 0; i < hlam254.length; i++) {
				hlam_254 = new L.circleMarker([hlam254[i][1],hlam254[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam254[i][0])
					.bindTooltip(hlam254[i][0], {direction: 'top'})
					.addTo(hlam254icons);
			}
	}
	else {
		hlam254icons.clearLayers();
	}
}
var hlam255icons = L.layerGroup().addTo(map);
function Hlam255OnOff() {
	var chbox255;
	chbox255=document.getElementById('Hlam255Button');
	if (chbox255.checked) {
		var hlam255 = [
			["Маленькая запечатанная стеклянная банка", -7865, -13587],
			["Маленькая запечатанная стеклянная банка", -36066, -17888],
			["Маленькая запечатанная стеклянная банка", -41129, -37702],
			["Маленькая запечатанная стеклянная банка", -120390, -45887],
			["Маленькая запечатанная стеклянная банка", -59132, -91631],
			["Маленькая запечатанная стеклянная банка", -46693, -72897],
			["Маленькая запечатанная стеклянная банка", -71295, -69085],
			["Маленькая запечатанная стеклянная банка", -114154, -117364],
			["Маленькая запечатанная стеклянная банка", -151603, -71773],
			["Маленькая запечатанная стеклянная банка", -168209, -115636],
			["Маленькая запечатанная стеклянная банка", 182223, -29969],
			["Маленькая запечатанная стеклянная банка", 148711, -79545],
			["Маленькая запечатанная стеклянная банка", 149575, -75865],
			["Маленькая запечатанная стеклянная банка", 149784, -67205],
			["Маленькая запечатанная стеклянная банка", 179619, -122032],
			["Маленькая запечатанная стеклянная банка", 90104, -32174],
			["Маленькая запечатанная стеклянная банка", 89802, -31378],
			["Маленькая запечатанная стеклянная банка", 89675, -31397],
			["Маленькая запечатанная стеклянная банка", 81870, -21238],
			["Маленькая запечатанная стеклянная банка", 47580, -20414],
			["Маленькая запечатанная стеклянная банка", 16183, -118810],
			["Маленькая запечатанная стеклянная банка", -2478, -159942],
			["Маленькая запечатанная стеклянная банка", -2463, -159908],
			["Маленькая запечатанная стеклянная банка", -31336, -151715],
			["Маленькая запечатанная стеклянная банка", -61140, -145595],
			["Маленькая запечатанная стеклянная банка", -61113, -145673],
			["Маленькая запечатанная стеклянная банка", -61324, -145768],
			["Маленькая запечатанная стеклянная банка", -126530, -135236],
			["Маленькая запечатанная стеклянная банка", -126439, -135338],
			["Маленькая запечатанная стеклянная банка", -126522, -134116],
			["Маленькая запечатанная стеклянная банка", -42299, -173294],
			["Маленькая запечатанная стеклянная банка", -42286, -173302],
			["Маленькая запечатанная стеклянная банка", -42284, -173286],
			["Маленькая запечатанная стеклянная банка", 71926, -175220],
			["Маленькая запечатанная стеклянная банка", 71927, -175190],
			["Маленькая запечатанная стеклянная банка", 71305, -173933],
			["Маленькая запечатанная стеклянная банка", -23253, 189609],
			["Маленькая запечатанная стеклянная банка", -23249, 189619],
			["Маленькая запечатанная стеклянная банка", -23261, 189617],
			["Маленькая запечатанная стеклянная банка", -97364, 179474],
			["Маленькая запечатанная стеклянная банка", -99340, 183426],
			["Маленькая запечатанная стеклянная банка", -59, 139100],
			["Маленькая запечатанная стеклянная банка", -145260, 174810],
			["Маленькая запечатанная стеклянная банка", -145608, 177334],
			["Маленькая запечатанная стеклянная банка", -145628, 176981],
			["Маленькая запечатанная стеклянная банка", -145679, 177104],
			["Маленькая запечатанная стеклянная банка", -146928, 178636],
			["Маленькая запечатанная стеклянная банка", -147119, 178653],
			["Маленькая запечатанная стеклянная банка", 62372, 173493],
			["Маленькая запечатанная стеклянная банка", 15976, 189745],
			["Маленькая запечатанная стеклянная банка", -37154, 48769],
			["Маленькая запечатанная стеклянная банка", -106415, 42888],
			["Маленькая запечатанная стеклянная банка", -38687, 3391],
			["Маленькая запечатанная стеклянная банка", -98489, 7717],
			["Маленькая запечатанная стеклянная банка", -130868, 10708],
			["Маленькая запечатанная стеклянная банка", -130813, 10770],
			["Маленькая запечатанная стеклянная банка", -130627, 10632],
			["Маленькая запечатанная стеклянная банка", -148443, 113680],
			["Маленькая запечатанная стеклянная банка", -158177, 56104],
			["Маленькая запечатанная стеклянная банка", 143561, 98571],
			["Маленькая запечатанная стеклянная банка", 133110, 54876],
			["Маленькая запечатанная стеклянная банка", 182962, 2748],
			["Маленькая запечатанная стеклянная банка", 183773, 2497],
			["Маленькая запечатанная стеклянная банка", 141850, 4485],
			["Маленькая запечатанная стеклянная банка", 94852, 98800],
			["Маленькая запечатанная стеклянная банка", 130337, 86596],
			["Маленькая запечатанная стеклянная банка", 25782, 71535],
			["Маленькая запечатанная стеклянная банка", 27077, 50346]
			];
	for (var i = 0; i < hlam255.length; i++) {
				hlam_255 = new L.circleMarker([hlam255[i][1],hlam255[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam255[i][0])
					.bindTooltip(hlam255[i][0], {direction: 'top'})
					.addTo(hlam255icons);
			}
	}
	else {
		hlam255icons.clearLayers();
	}
}
var hlam256icons = L.layerGroup().addTo(map);
function Hlam256OnOff() {
	var chbox256;
	chbox256=document.getElementById('Hlam256Button');
	if (chbox256.checked) {
		var hlam256 = [
			["Маленькая стеклянная банка", -7824, -13539],
			["Маленькая стеклянная банка", -53788, -4147],
			["Маленькая стеклянная банка", -120812, -13805],
			["Маленькая стеклянная банка", -115163, -47157],
			["Маленькая стеклянная банка", -121779, -66416],
			["Маленькая стеклянная банка", -123068, -125486],
			["Маленькая стеклянная банка", -166710, -14209],
			["Маленькая стеклянная банка", -147566, -56814],
			["Маленькая стеклянная банка", -148338, -55779],
			["Маленькая стеклянная банка", -169454, -116519],
			["Маленькая стеклянная банка", -168019, -115347],
			["Маленькая стеклянная банка", 173619, -13411],
			["Маленькая стеклянная банка", 149790, -67191],
			["Маленькая стеклянная банка", 88620, -31171],
			["Маленькая стеклянная банка", 89490, -8777],
			["Маленькая стеклянная банка", 80843, -1783],
			["Маленькая стеклянная банка", 47575, -20411],
			["Маленькая стеклянная банка", 17969, -27488],
			["Маленькая стеклянная банка", 35991, -35204],
			["Маленькая стеклянная банка", 71903, -76351],
			["Маленькая стеклянная банка", 71933, -76257],
			["Маленькая стеклянная банка", 71966, -76285],
			["Маленькая стеклянная банка", 71886, -76181],
			["Маленькая стеклянная банка", 101186, -100158],
			["Маленькая стеклянная банка", 101205, -99948],
			["Маленькая стеклянная банка", 16174, -118829],
			["Маленькая стеклянная банка", 17459, -119733],
			["Маленькая стеклянная банка", 17050, -107008],
			["Маленькая стеклянная банка", -2451, -160067],
			["Маленькая стеклянная банка", -71258, -163289],
			["Маленькая стеклянная банка", -72619, -132603],
			["Маленькая стеклянная банка", -95081, -176653],
			["Маленькая стеклянная банка", -82949, -179054],
			["Маленькая стеклянная банка", -82656, -178470],
			["Маленькая стеклянная банка", -81906, -178005],
			["Маленькая стеклянная банка", 202961, -138037],
			["Маленькая стеклянная банка", 74362, -177789],
			["Маленькая стеклянная банка", 71923, -175230],
			["Маленькая стеклянная банка", 71926, -175200],
			["Маленькая стеклянная банка", -98946, 183495],
			["Маленькая стеклянная банка", -140, 139141],
			["Маленькая стеклянная банка", -146144, 172978],
			["Маленькая стеклянная банка", 72331, 137395],
			["Маленькая стеклянная банка", 72846, 137047],
			["Маленькая стеклянная банка", 75251, 150902],
			["Маленькая стеклянная банка", -5400, 33857],
			["Маленькая стеклянная банка", -37191, 48786],
			["Маленькая стеклянная банка", -106406, 42937],
			["Маленькая стеклянная банка", -123261, 51020],
			["Маленькая стеклянная банка", -42307, 10864],
			["Маленькая стеклянная банка", -137936, 88411],
			["Маленькая стеклянная банка", 198983, 109308],
			["Маленькая стеклянная банка", 193098, 113037],
			["Маленькая стеклянная банка", 193149, 112979],
			["Маленькая стеклянная банка", 198462, 94134],
			["Маленькая стеклянная банка", 171099, 1812],
			["Маленькая стеклянная банка", 183133, 2791],
			["Маленькая стеклянная банка", 183749, 2497],
			["Маленькая стеклянная банка", 183673, 2601],
			["Маленькая стеклянная банка", 131855, 11961],
			["Маленькая стеклянная банка", 94131, 103620],
			["Маленькая стеклянная банка", 94755, 103343],
			["Маленькая стеклянная банка", 94724, 103349],
			["Маленькая стеклянная банка", 94727, 103444],
			["Маленькая стеклянная банка", 94443, 103350],
			["Маленькая стеклянная банка", 94680, 104095],
			["Маленькая стеклянная банка", 94406, 103692],
			["Маленькая стеклянная банка", 94669, 103988],
			["Маленькая стеклянная банка", 94829, 103593],
			["Маленькая стеклянная банка", 94880, 103737],
			["Маленькая стеклянная банка", 94425, 103926],
			["Маленькая стеклянная банка", 94365, 104048],
			["Маленькая стеклянная банка", 94306, 103743],
			["Маленькая стеклянная банка", 95113, 104073],
			["Маленькая стеклянная банка", 95098, 104069],
			["Маленькая стеклянная банка", 95104, 103875],
			["Маленькая стеклянная банка", 95341, 103826],
			["Маленькая стеклянная банка", 95312, 104081],
			["Маленькая стеклянная банка", 95325, 104089],
			["Маленькая стеклянная банка", 95309, 104147],
			["Маленькая стеклянная банка", 95321, 103988],
			["Маленькая стеклянная банка", 94694, 104422],
			["Маленькая стеклянная банка", 94558, 103214],
			["Маленькая стеклянная банка", 94585, 103020],
			["Маленькая стеклянная банка", 95797, 106172],
			["Маленькая стеклянная банка", 95750, 106142],
			["Маленькая стеклянная банка", 95931, 106305],
			["Маленькая стеклянная банка", 94644, 103413],
			["Маленькая стеклянная банка", 130273, 86626],
			["Маленькая стеклянная банка", 130383, 86571],
			["Маленькая стеклянная банка", 16273, 48572],
			["Маленькая стеклянная банка", 15485, 50081],
			["Маленькая стеклянная банка", 15500, 50065],
			["Маленькая стеклянная банка", 121135, 6592],
			["Маленькая стеклянная банка", 55260, 9147],
			["Маленькая стеклянная банка", 55019, 8919]
			];
	for (var i = 0; i < hlam256.length; i++) {
				hlam_256 = new L.circleMarker([hlam256[i][1],hlam256[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam256[i][0])
					.bindTooltip(hlam256[i][0], {direction: 'top'})
					.addTo(hlam256icons);
			}
	}
	else {
		hlam256icons.clearLayers();
	}
}
var hlam257icons = L.layerGroup().addTo(map);
function Hlam257OnOff() {
	var chbox257;
	chbox257=document.getElementById('Hlam257Button');
	if (chbox257.checked) {
		var hlam257 = [
			["Маленькая фоторамка", -44924, -9103],
			["Маленькая фоторамка", -45009, -8807],
			["Маленькая фоторамка", -44272, -7654],
			["Маленькая фоторамка", -12857, -69360],
			["Маленькая фоторамка", -45519, -104641],
			["Маленькая фоторамка", -46503, -104297],
			["Маленькая фоторамка", -72283, -98489],
			["Маленькая фоторамка", -72270, -98515],
			["Маленькая фоторамка", -149038, -58935],
			["Маленькая фоторамка", 164900, -22166],
			["Маленькая фоторамка", 183276, -93304],
			["Маленькая фоторамка", 67734, -14382],
			["Маленькая фоторамка", 77652, -15044],
			["Маленькая фоторамка", 29055, -58378],
			["Маленькая фоторамка", 13421, -111348],
			["Маленькая фоторамка", 19471, -104243],
			["Маленькая фоторамка", 22191, -105468],
			["Маленькая фоторамка", -1808, -159707],
			["Маленькая фоторамка", 25910, -137505],
			["Маленькая фоторамка", 74765, -177506],
			["Маленькая фоторамка", -93337, 183698],
			["Маленькая фоторамка", 80053, 182287],
			["Маленькая фоторамка", 49044, 190981],
			["Маленькая фоторамка", 72209, 133693],
			["Маленькая фоторамка", -104415, 123617],
			["Маленькая фоторамка", -121864, 40981],
			["Маленькая фоторамка", -46654, 2579],
			["Маленькая фоторамка", -38437, 4063],
			["Маленькая фоторамка", -38425, 3950],
			["Маленькая фоторамка", -37931, 3398],
			["Маленькая фоторамка", -37942, 3475],
			["Маленькая фоторамка", -38845, 3626],
			["Маленькая фоторамка", -38364, 4178],
			["Маленькая фоторамка", -38037, 4405],
			["Маленькая фоторамка", 181436, 110011],
			["Маленькая фоторамка", 183637, 3164],
			["Маленькая фоторамка", 183427, 2679],
			["Маленькая фоторамка", 45809, 101229],
			["Маленькая фоторамка", 16956, 45481],
			["Маленькая фоторамка", 75280, 9746]
			];
	for (var i = 0; i < hlam257.length; i++) {
				hlam_257 = new L.circleMarker([hlam257[i][1],hlam257[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam257[i][0])
					.bindTooltip(hlam257[i][0], {direction: 'top'})
					.addTo(hlam257icons);
			}
	}
	else {
		hlam257icons.clearLayers();
	}
}
var hlam258icons = L.layerGroup().addTo(map);
function Hlam258OnOff() {
	var chbox258;
	chbox258=document.getElementById('Hlam258Button');
	if (chbox258.checked) {
		var hlam258 = [
			["Маленькая фоторамка", -51343, -13868],
			["Маленькая фоторамка", -51340, -13886],
			["Маленькая фоторамка", -52193, -14036],
			["Маленькая фоторамка", -52059, -14031]
			];
	for (var i = 0; i < hlam258.length; i++) {
				hlam_258 = new L.circleMarker([hlam258[i][1],hlam258[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam258[i][0])
					.bindTooltip(hlam258[i][0], {direction: 'top'})
					.addTo(hlam258icons);
			}
	}
	else {
		hlam258icons.clearLayers();
	}
}
var hlam259icons = L.layerGroup().addTo(map);
function Hlam259OnOff() {
	var chbox259;
	chbox259=document.getElementById('Hlam259Button');
	if (chbox259.checked) {
		var hlam259 = [
			["Маленький ковшик", -19226, -46896],
			["Маленький ковшик", -69633, -96289],
			["Маленький ковшик", -80970, -102529],
			["Маленький ковшик", -147792, -56953],
			["Маленький ковшик", 105978, -8388],
			["Маленький ковшик", 30952, -33090],
			["Маленький ковшик", 28706, 131259],
			["Маленький ковшик", -158503, 57623],
			["Маленький ковшик", 172730, 58317]
			];
	for (var i = 0; i < hlam259.length; i++) {
				hlam_259 = new L.circleMarker([hlam259[i][1],hlam259[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam259[i][0])
					.bindTooltip(hlam259[i][0], {direction: 'top'})
					.addTo(hlam259icons);
			}
	}
	else {
		hlam259icons.clearLayers();
	}
}
var hlam260icons = L.layerGroup().addTo(map);
function Hlam260OnOff() {
	var chbox260;
	chbox260=document.getElementById('Hlam260Button');
	if (chbox260.checked) {
		var hlam260 = [
			["Маленький ковшик с крышкой", 105250, 156872],
			["Маленький ковшик с крышкой", 182156, 96866]
			];
	for (var i = 0; i < hlam260.length; i++) {
				hlam_260 = new L.circleMarker([hlam260[i][1],hlam260[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam260[i][0])
					.bindTooltip(hlam260[i][0], {direction: 'top'})
					.addTo(hlam260icons);
			}
	}
	else {
		hlam260icons.clearLayers();
	}
}
var hlam261icons = L.layerGroup().addTo(map);
function Hlam261OnOff() {
	var chbox261;
	chbox261=document.getElementById('Hlam261Button');
	if (chbox261.checked) {
		var hlam261 = [
			["Маленький левый рог", -44209, -8289],
			["Маленький левый рог", -23270, -42317],
			["Маленький левый рог", -8686, -66643],
			["Маленький левый рог", -10060, -66588],
			["Маленький левый рог", -153620, -75815],
			["Маленький левый рог", 178686, -12345],
			["Маленький левый рог", 180434, -13945],
			["Маленький левый рог", 182408, -14618],
			["Маленький левый рог", 178597, -9546],
			["Маленький левый рог", 179446, -11194],
			["Маленький левый рог", 181509, -11256],
			["Маленький левый рог", 182265, -92211],
			["Маленький левый рог", 173549, -130706],
			["Маленький левый рог", 175817, -124601],
			["Маленький левый рог", 180125, -123442],
			["Маленький левый рог", 171060, -121705],
			["Маленький левый рог", 22674, -47278],
			["Маленький левый рог", 21629, -45341],
			["Маленький левый рог", 26153, -45140],
			["Маленький левый рог", 19574, -44764],
			["Маленький левый рог", 18724, -43140],
			["Маленький левый рог", 22348, -44336],
			["Маленький левый рог", 76188, -74929],
			["Маленький левый рог", 74709, -72941],
			["Маленький левый рог", 74661, -73080],
			["Маленький левый рог", 74485, -72994],
			["Маленький левый рог", 75430, -73280],
			["Маленький левый рог", 45457, -74291],
			["Маленький левый рог", 101183, -100459],
			["Маленький левый рог", 125756, -99326],
			["Маленький левый рог", 55092, -129089],
			["Маленький левый рог", 54960, -125803],
			["Маленький левый рог", -39662, -150881],
			["Маленький левый рог", -39911, -149000],
			["Маленький левый рог", -35686, -148792],
			["Маленький левый рог", -25428, -175480],
			["Маленький левый рог", -34405, -186125],
			["Маленький левый рог", -76439, -184261],
			["Маленький левый рог", -81233, -179164],
			["Маленький левый рог", -81606, -178219],
			["Маленький левый рог", -174072, -141345],
			["Маленький левый рог", -334382, -252978],
			["Маленький левый рог", 165095, -150502],
			["Маленький левый рог", 165246, -148449],
			["Маленький левый рог", 165278, -150204],
			["Маленький левый рог", 164571, -149006],
			["Маленький левый рог", 134859, -158617],
			["Маленький левый рог", 51442, -150987],
			["Маленький левый рог", 51668, -149950],
			["Маленький левый рог", 52074, -149406],
			["Маленький левый рог", 26952, -139999],
			["Маленький левый рог", 25576, -138130],
			["Маленький левый рог", -92898, 182128],
			["Маленький левый рог", -27458, 162941],
			["Маленький левый рог", -65875, 132089],
			["Маленький левый рог", -87128, 153242],
			["Маленький левый рог", -157145, 192183],
			["Маленький левый рог", 3277, 185225],
			["Маленький левый рог", 16329, 189660],
			["Маленький левый рог", 30184, 132767],
			["Маленький левый рог", -65262, 130587],
			["Маленький левый рог", -104583, 123113],
			["Маленький левый рог", -103302, 84696],
			["Маленький левый рог", -23322, 9538],
			["Маленький левый рог", -106233, 21288],
			["Маленький левый рог", -104404, 21969],
			["Маленький левый рог", -103865, 21040],
			["Маленький левый рог", -165662, 122047],
			["Маленький левый рог", -177601, 72387],
			["Маленький левый рог", -329975, 125554],
			["Маленький левый рог", 95246, 99196],
			["Маленький левый рог", 94993, 103131],
			["Маленький левый рог", 13886, 31945]
			];
	for (var i = 0; i < hlam261.length; i++) {
				hlam_261 = new L.circleMarker([hlam261[i][1],hlam261[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam261[i][0])
					.bindTooltip(hlam261[i][0], {direction: 'top'})
					.addTo(hlam261icons);
			}
	}
	else {
		hlam261icons.clearLayers();
	}
}
var hlam262icons = L.layerGroup().addTo(map);
function Hlam262OnOff() {
	var chbox262;
	chbox262=document.getElementById('Hlam262Button');
	if (chbox262.checked) {
		var hlam262 = [
			["Маленький правый рог", -44430, -8228],
			["Маленький правый рог", -43386, -6701],
			["Маленький правый рог", -8527, -66199],
			["Маленький правый рог", -9890, -67598],
			["Маленький правый рог", -101052, -80205],
			["Маленький правый рог", -100901, -75835],
			["Маленький правый рог", 166166, -22213],
			["Маленький правый рог", 181451, -11974],
			["Маленький правый рог", 180036, -93671],
			["Маленький правый рог", 182054, -92793],
			["Маленький правый рог", 182961, -89580],
			["Маленький правый рог", 173587, -130462],
			["Маленький правый рог", 175644, -124533],
			["Маленький правый рог", 180791, -123857],
			["Маленький правый рог", 178039, -122148],
			["Маленький правый рог", 178910, -120845],
			["Маленький правый рог", 180167, -120569],
			["Маленький правый рог", 22001, -45638],
			["Маленький правый рог", 76578, -74745],
			["Маленький правый рог", 74600, -73255],
			["Маленький правый рог", 53568, -79912],
			["Маленький правый рог", -29635, -159928],
			["Маленький правый рог", -28832, -157648],
			["Маленький правый рог", -30279, -157330],
			["Маленький правый рог", -27520, -181840],
			["Маленький правый рог", -26924, -178920],
			["Маленький правый рог", -26303, -179082],
			["Маленький правый рог", -25296, -177849],
			["Маленький правый рог", -26759, -173982],
			["Маленький правый рог", -34765, -186465],
			["Маленький правый рог", -83333, -178557],
			["Маленький правый рог", -173566, -141682],
			["Маленький правый рог", 165754, -148724],
			["Маленький правый рог", 165289, -148350],
			["Маленький правый рог", 164328, -150148],
			["Маленький правый рог", 165277, -150162],
			["Маленький правый рог", 165351, -149956],
			["Маленький правый рог", 104848, -152204],
			["Маленький правый рог", 104146, -149765],
			["Маленький правый рог", 51454, -150963],
			["Маленький правый рог", 51671, -148863],
			["Маленький правый рог", 50959, -149675],
			["Маленький правый рог", 51262, -150155],
			["Маленький правый рог", 51082, -150468],
			["Маленький правый рог", 22554, -149474],
			["Маленький правый рог", 27130, -139718],
			["Маленький правый рог", -94462, 181679],
			["Маленький правый рог", -93856, 181941],
			["Маленький правый рог", -26600, 162562],
			["Маленький правый рог", -157244, 192124],
			["Маленький правый рог", 133708, 174957],
			["Маленький правый рог", 76480, 179804],
			["Маленький правый рог", 79256, 179598],
			["Маленький правый рог", 30130, 132738],
			["Маленький правый рог", -66053, 130084],
			["Маленький правый рог", -67414, 129091],
			["Маленький правый рог", -104195, 123125],
			["Маленький правый рог", -25098, 9745],
			["Маленький правый рог", -22733, 9890],
			["Маленький правый рог", -104474, 20897],
			["Маленький правый рог", -165698, 122191],
			["Маленький правый рог", -178115, 72373],
			["Маленький правый рог", -178838, 78637],
			["Маленький правый рог", -178995, 83923],
			["Маленький правый рог", 192434, 40952],
			["Маленький правый рог", 191165, 42230],
			["Маленький правый рог", 193111, 47012],
			["Маленький правый рог", 194133, 48645],
			["Маленький правый рог", 119602, 116009],
			["Маленький правый рог", 97004, 106013],
			["Маленький правый рог", 13690, 31815]
			];
	for (var i = 0; i < hlam262.length; i++) {
				hlam_262 = new L.circleMarker([hlam262[i][1],hlam262[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam262[i][0])
					.bindTooltip(hlam262[i][0], {direction: 'top'})
					.addTo(hlam262icons);
			}
	}
	else {
		hlam262icons.clearLayers();
	}
}
var hlam263icons = L.layerGroup().addTo(map);
function Hlam263OnOff() {
	var chbox263;
	chbox263=document.getElementById('Hlam263Button');
	if (chbox263.checked) {
		var hlam263 = [
			["Маленький стакан", -49915, -12816],
			["Маленький стакан", -50930, -13605],
			["Маленький стакан", -50834, -13975],
			["Маленький стакан", -50472, -12971],
			["Маленький стакан", -50697, -12793],
			["Маленький стакан", -43174, -5648],
			["Маленький стакан", -53574, -1905],
			["Маленький стакан", -41775, -4013],
			["Маленький стакан", 160643, -58507],
			["Маленький стакан", 160797, -58197],
			["Маленький стакан", 160609, -57875],
			["Маленький стакан", 160613, -57844],
			["Маленький стакан", 16940, -107252],
			["Маленький стакан", -56570, 3760],
			["Маленький стакан", -59941, 4929],
			["Маленький стакан", -40042, 6502],
			["Маленький стакан", -38082, 4713],
			["Маленький стакан", -46335, 20444],
			["Маленький стакан", -46317, 20445],
			["Маленький стакан", 94246, 103087],
			["Маленький стакан", 94451, 103317],
			["Маленький стакан", 94397, 103932],
			["Маленький стакан", 94645, 104112],
			["Маленький стакан", 94769, 103394],
			["Маленький стакан", 94702, 103468],
			["Маленький стакан", 13733, 45872]
			];
	for (var i = 0; i < hlam263.length; i++) {
				hlam_263 = new L.circleMarker([hlam263[i][1],hlam263[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam263[i][0])
					.bindTooltip(hlam263[i][0], {direction: 'top'})
					.addTo(hlam263icons);
			}
	}
	else {
		hlam263icons.clearLayers();
	}
}
var hlam264icons = L.layerGroup().addTo(map);
function Hlam264OnOff() {
	var chbox264;
	chbox264=document.getElementById('Hlam264Button');
	if (chbox264.checked) {
		var hlam264 = [
			["Малый барабан", -147561, -56192]
			];
	for (var i = 0; i < hlam264.length; i++) {
				hlam_264 = new L.circleMarker([hlam264[i][1],hlam264[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam264[i][0])
					.bindTooltip(hlam264[i][0], {direction: 'top'})
					.addTo(hlam264icons);
			}
	}
	else {
		hlam264icons.clearLayers();
	}
}
var hlam265icons = L.layerGroup().addTo(map);
function Hlam265OnOff() {
	var chbox265;
	chbox265=document.getElementById('Hlam265Button');
	if (chbox265.checked) {
		var hlam265 = [
			["Масленка", -54354, -12218],
			["Масленка", -48023, -10339],
			["Масленка", -52022, -46618],
			["Масленка", -117749, -63150],
			["Масленка", -24182, -73152],
			["Масленка", -9105, -71858],
			["Масленка", -84132, -79341],
			["Масленка", -72158, -69971],
			["Масленка", -111484, -91363],
			["Масленка", -109560, -88932],
			["Масленка", -105190, -86793],
			["Масленка", -101730, -84978],
			["Масленка", -31631, -129703],
			["Масленка", -50497, -100895],
			["Масленка", -169336, -23454],
			["Масленка", -166704, -14214],
			["Масленка", 190996, -31949],
			["Масленка", 174432, -41562],
			["Масленка", 100780, -29754],
			["Масленка", 101421, -28885],
			["Масленка", 102702, -29492],
			["Масленка", 129580, -28100],
			["Масленка", 98720, -12710],
			["Масленка", 102986, -11320],
			["Масленка", 90028, -30499],
			["Масленка", 91004, -29870],
			["Масленка", 84984, -19534],
			["Масленка", 47880, -20533],
			["Масленка", 8128, -31881],
			["Масленка", 51901, -44799],
			["Масленка", 50511, -43304],
			["Масленка", 51416, -39888],
			["Масленка", 24934, -63577],
			["Масленка", 5090, -33522],
			["Масленка", 39496, -96830],
			["Масленка", 70115, -105118],
			["Масленка", -117135, -140244],
			["Масленка", -121956, -135872],
			["Масленка", -124032, -134184],
			["Масленка", -123902, -134338],
			["Масленка", -125833, -134162],
			["Масленка", -126132, -135060],
			["Масленка", -30596, -188489],
			["Масленка", -42158, -172891],
			["Масленка", -44397, -173579],
			["Масленка", -108897, -187775],
			["Масленка", -114872, -171428],
			["Масленка", 131596, -132168],
			["Масленка", 115630, -157690],
			["Масленка", 102442, -151842],
			["Масленка", 96246, -135767],
			["Масленка", 79673, -182618],
			["Масленка", 75514, -179294],
			["Масленка", 50210, -167093],
			["Масленка", -64549, 199476],
			["Масленка", -66549, 203158],
			["Масленка", -22942, 189447],
			["Масленка", -84420, 165999],
			["Масленка", -84162, 166214],
			["Масленка", -84471, 164824],
			["Масленка", -95316, 182454],
			["Масленка", -96866, 184325],
			["Масленка", -19803, 145695],
			["Масленка", -41524, 161223],
			["Масленка", -38003, 159847],
			["Масленка", -71352, 145540],
			["Масленка", -161005, 202677],
			["Масленка", -161832, 201765],
			["Масленка", -155498, 165376],
			["Масленка", -141178, 170863],
			["Масленка", -141159, 170896],
			["Масленка", -141095, 171506],
			["Масленка", -144337, 173911],
			["Масленка", -144519, 172905],
			["Масленка", -144901, 175415],
			["Масленка", -147507, 179062],
			["Масленка", -146610, 178317],
			["Масленка", -140330, 179126],
			["Масленка", -141744, 179149],
			["Масленка", -140973, 178901],
			["Масленка", -145913, 153394],
			["Масленка", 147434, 137967],
			["Масленка", 152656, 161630],
			["Масленка", 101684, 196898],
			["Масленка", 70301, 202264],
			["Масленка", 102833, 191571],
			["Масленка", 93438, 192104],
			["Масленка", 94907, 189367],
			["Масленка", 93785, 194078],
			["Масленка", 3368, 182788],
			["Масленка", 1815, 162345],
			["Масленка", 1827, 162597],
			["Масленка", 3962, 160885],
			["Масленка", 3952, 160891],
			["Масленка", 6904, 161176],
			["Масленка", -37678, 84221],
			["Масленка", -58973, 89726],
			["Масленка", -56016, 88229],
			["Масленка", -58512, 90774],
			["Масленка", -78691, 88940],
			["Масленка", -52670, 55865],
			["Масленка", -52234, 59155],
			["Масленка", -69127, 55541],
			["Масленка", -22471, 11854],
			["Масленка", -47831, 1167],
			["Масленка", -58659, 12234],
			["Масленка", -54906, 10598],
			["Масленка", -55320, 9762],
			["Масленка", -56157, 10530],
			["Масленка", -58775, 12567],
			["Масленка", -47342, 20295],
			["Масленка", -53664, 21315],
			["Масленка", -45780, 20703],
			["Масленка", -46915, 28054],
			["Масленка", -43814, 27864],
			["Масленка", -43961, 27876],
			["Масленка", -46753, 29101],
			["Масленка", -153924, 129724],
			["Масленка", -132506, 10625],
			["Масленка", -134185, 26650],
			["Масленка", 181587, 110450],
			["Масленка", 181634, 110504],
			["Масленка", 181744, 110644],
			["Масленка", 168681, 56174],
			["Масленка", 171212, 57227],
			["Масленка", 190589, 31549],
			["Масленка", 136905, 16978],
			["Масленка", 133560, 21569],
			["Масленка", 93893, 104241],
			["Масленка", 74354, 36630],
			["Масленка", 75000, 36952],
			["Масленка", 74097, 37343],
			["Масленка", 74059, 37639],
			["Масленка", 75080, 46471],
			["Масленка", 80029, 55733],
			["Масленка", 79704, 55874]
			];
	for (var i = 0; i < hlam265.length; i++) {
				hlam_265 = new L.circleMarker([hlam265[i][1],hlam265[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam265[i][0])
					.bindTooltip(hlam265[i][0], {direction: 'top'})
					.addTo(hlam265icons);
			}
	}
	else {
		hlam265icons.clearLayers();
	}
}
var hlam266icons = L.layerGroup().addTo(map);
function Hlam266OnOff() {
	var chbox266;
	chbox266=document.getElementById('Hlam266Button');
	if (chbox266.checked) {
		var hlam266 = [
			["Масленка", -42702, -6386],
			["Масленка", -120115, -45952],
			["Масленка", -125990, -104261],
			["Масленка", -131353, -113772],
			["Масленка", 197258, -31300],
			["Масленка", 191598, -34176],
			["Масленка", 182752, -93515],
			["Масленка", 17938, -2538],
			["Масленка", -94813, -176281],
			["Масленка", -114372, -171312],
			["Масленка", 79373, -154011],
			["Масленка", 42541, -153763],
			["Масленка", -70973, 197965],
			["Масленка", -150, 139139],
			["Масленка", -42733, 137637],
			["Масленка", -37862, 159748],
			["Масленка", -89100, 150691],
			["Масленка", -161567, 200936],
			["Масленка", 143470, 194336],
			["Масленка", 35939, 176786],
			["Масленка", -40718, 50787],
			["Масленка", -148445, 113803],
			["Масленка", 134549, 127440],
			["Масленка", 169539, 57268],
			["Масленка", 133286, 17898],
			["Масленка", 95464, 99027],
			["Масленка", 74434, 44203]
			];
	for (var i = 0; i < hlam266.length; i++) {
				hlam_266 = new L.circleMarker([hlam266[i][1],hlam266[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam266[i][0])
					.bindTooltip(hlam266[i][0], {direction: 'top'})
					.addTo(hlam266icons);
			}
	}
	else {
		hlam266icons.clearLayers();
	}
}
var hlam267icons = L.layerGroup().addTo(map);
function Hlam267OnOff() {
	var chbox267;
	chbox267=document.getElementById('Hlam267Button');
	if (chbox267.checked) {
		var hlam267 = [
			["Маточное молочко", 127210, -81141]
			];
	for (var i = 0; i < hlam267.length; i++) {
				hlam_267 = new L.circleMarker([hlam267[i][1],hlam267[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam267[i][0])
					.bindTooltip(hlam267[i][0], {direction: 'top'})
					.addTo(hlam267icons);
			}
	}
	else {
		hlam267icons.clearLayers();
	}
}
var hlam268icons = L.layerGroup().addTo(map);
function Hlam268OnOff() {
	var chbox268;
	chbox268=document.getElementById('Hlam268Button');
	if (chbox268.checked) {
		var hlam268 = [
			["Медицинские ножницы", -8556, -3127],
			["Медицинские ножницы", -35808, -80705],
			["Медицинские ножницы", -93882, -129824],
			["Медицинские ножницы", -152234, -73313],
			["Медицинские ножницы", 104201, -12800],
			["Медицинские ножницы", 21587, -109619],
			["Медицинские ножницы", 144489, -145529],
			["Медицинские ножницы", 102500, -151813],
			["Медицинские ножницы", 74158, -172451],
			["Медицинские ножницы", 74325, -172454],
			["Медицинские ножницы", 74990, -172404],
			["Медицинские ножницы", -90448, 149264],
			["Медицинские ножницы", 16196, 197973],
			["Медицинские ножницы", 2586, 164267],
			["Медицинские ножницы", 2553, 164638],
			["Медицинские ножницы", 190320, 30925]
			];
	for (var i = 0; i < hlam268.length; i++) {
				hlam_268 = new L.circleMarker([hlam268[i][1],hlam268[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam268[i][0])
					.bindTooltip(hlam268[i][0], {direction: 'top'})
					.addTo(hlam268icons);
			}
	}
	else {
		hlam268icons.clearLayers();
	}
}
var hlam269icons = L.layerGroup().addTo(map);
function Hlam269OnOff() {
	var chbox269;
	chbox269=document.getElementById('Hlam269Button');
	if (chbox269.checked) {
		var hlam269 = [

			];
	for (var i = 0; i < hlam269.length; i++) {
				hlam_269 = new L.circleMarker([hlam269[i][1],hlam269[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam269[i][0])
					.bindTooltip(hlam269[i][0], {direction: 'top'})
					.addTo(hlam269icons);
			}
	}
	else {
		hlam269icons.clearLayers();
	}
}
var hlam270icons = L.layerGroup().addTo(map);
function Hlam270OnOff() {
	var chbox270;
	chbox270=document.getElementById('Hlam270Button');
	if (chbox270.checked) {
		var hlam270 = [
			["Медный фонарь шахтера", -89507, -42181],
			["Медный фонарь шахтера", -111949, -56029],
			["Медный фонарь шахтера", -121747, -66359],
			["Медный фонарь шахтера", 1132, 189962],
			["Медный фонарь шахтера", 72507, 137268],
			["Медный фонарь шахтера", 15230, 137103],
			["Медный фонарь шахтера", -46360, 28888]
			];
	for (var i = 0; i < hlam270.length; i++) {
				hlam_270 = new L.circleMarker([hlam270[i][1],hlam270[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam270[i][0])
					.bindTooltip(hlam270[i][0], {direction: 'top'})
					.addTo(hlam270icons);
			}
	}
	else {
		hlam270icons.clearLayers();
	}
}
var hlam271icons = L.layerGroup().addTo(map);
function Hlam271OnOff() {
	var chbox271;
	chbox271=document.getElementById('Hlam271Button');
	if (chbox271.checked) {
		var hlam271 = [
			["Мел", -109397, -23703],
			["Мел", -27000, -48381],
			["Мел", -47257, -51045],
			["Мел", -47278, -51042],
			["Мел", -47272, -51034],
			["Мел", -124949, -124104],
			["Мел", -148541, -54323],
			["Мел", 173234, -18081],
			["Мел", 174174, -17333],
			["Мел", 174223, -17367],
			["Мел", 174216, -17304],
			["Мел", 174210, -17287],
			["Мел", 174628, -17563],
			["Мел", 174671, -17613],
			["Мел", 174696, -17597],
			["Мел", 174626, -17567],
			["Мел", 197841, -127839],
			["Мел", 198132, -127802],
			["Мел", 87154, -32134],
			["Мел", 91787, -9984],
			["Мел", 87934, -33300],
			["Мел", 29256, -58596],
			["Мел", 68597, -88407],
			["Мел", 74828, -83270],
			["Мел", 44395, -80570],
			["Мел", 12623, -91669],
			["Мел", 21226, -109377],
			["Мел", -4370, -156023],
			["Мел", -122926, -137604],
			["Мел", -69228, -189531],
			["Мел", -77070, -187446],
			["Мел", 165690, -135633],
			["Мел", 152345, -162215],
			["Мел", -82529, 201997],
			["Мел", -91972, 178074],
			["Мел", 80108, 182156],
			["Мел", 58846, 176780],
			["Мел", 14479, 191313],
			["Мел", 14755, 191166],
			["Мел", 6780, 163690],
			["Мел", 6782, 163695],
			["Мел", -104725, 123051],
			["Мел", -15160, 16586],
			["Мел", -47541, 32585],
			["Мел", 171283, 56999],
			["Мел", 171482, 56701],
			["Мел", 171465, 56664],
			["Мел", 171492, 56748],
			["Мел", 162636, 55632],
			["Мел", 160390, 58741],
			["Мел", 160393, 58745],
			["Мел", 94148, 103674],
			["Мел", 130802, 74752],
			["Мел", 130820, 74744],
			["Мел", 130808, 74744],
			["Мел", 122048, 5379],
			["Мел", -132027, -145227]
			];
	for (var i = 0; i < hlam271.length; i++) {
				hlam_271 = new L.circleMarker([hlam271[i][1],hlam271[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam271[i][0])
					.bindTooltip(hlam271[i][0], {direction: 'top'})
					.addTo(hlam271icons);
			}
	}
	else {
		hlam271icons.clearLayers();
	}
}
var hlam272icons = L.layerGroup().addTo(map);
function Hlam272OnOff() {
	var chbox272;
	chbox272=document.getElementById('Hlam272Button');
	if (chbox272.checked) {
		var hlam272 = [
			["Мензурка", -97173, 189804],
			["Мензурка", -97351, 189548],
			["Мензурка", -97441, 189723],
			["Мензурка", -92829, 190820],
			["Мензурка", 87264, 2746]
			];
	for (var i = 0; i < hlam272.length; i++) {
				hlam_272 = new L.circleMarker([hlam272[i][1],hlam272[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam272[i][0])
					.bindTooltip(hlam272[i][0], {direction: 'top'})
					.addTo(hlam272icons);
			}
	}
	else {
		hlam272icons.clearLayers();
	}
}
var hlam273icons = L.layerGroup().addTo(map);
function Hlam273OnOff() {
	var chbox273;
	chbox273=document.getElementById('Hlam273Button');
	if (chbox273.checked) {
		var hlam273 = [
			["Мерный цилиндр", 115586, -157766],
			["Мерный цилиндр", -19818, 145783],
			["Мерный цилиндр", 69077, 202221],
			["Мерный цилиндр", -90910, 67029]
			];
	for (var i = 0; i < hlam273.length; i++) {
				hlam_273 = new L.circleMarker([hlam273[i][1],hlam273[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam273[i][0])
					.bindTooltip(hlam273[i][0], {direction: 'top'})
					.addTo(hlam273icons);
			}
	}
	else {
		hlam273icons.clearLayers();
	}
}
var hlam274icons = L.layerGroup().addTo(map);
function Hlam274OnOff() {
	var chbox274;
	chbox274=document.getElementById('Hlam274Button');
	if (chbox274.checked) {
		var hlam274 = [
			["Металлическая пивная кружка с крышкой", -44379, -7818],
			["Металлическая пивная кружка с крышкой", 32884, -40955],
			["Металлическая пивная кружка с крышкой", 35831, -34861],
			["Металлическая пивная кружка с крышкой", 35551, -34862],
			["Металлическая пивная кружка с крышкой", 33357, -32950],
			["Металлическая пивная кружка с крышкой", 33547, -33787],
			["Металлическая пивная кружка с крышкой", -27323, -131366],
			["Металлическая пивная кружка с крышкой", -59627, 88974],
			["Металлическая пивная кружка с крышкой", -19884, 15551],
			["Металлическая пивная кружка с крышкой", 132844, 85191]
			];
	for (var i = 0; i < hlam274.length; i++) {
				hlam_274 = new L.circleMarker([hlam274[i][1],hlam274[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam274[i][0])
					.bindTooltip(hlam274[i][0], {direction: 'top'})
					.addTo(hlam274icons);
			}
	}
	else {
		hlam274icons.clearLayers();
	}
}
var hlam275icons = L.layerGroup().addTo(map);
function Hlam275OnOff() {
	var chbox275;
	chbox275=document.getElementById('Hlam275Button');
	if (chbox275.checked) {
		var hlam275 = [
			["Металлическое ведро", -8453, -3080],
			["Металлическое ведро", -49764, -14647],
			["Металлическое ведро", -49749, -14647],
			["Металлическое ведро", -48045, -10241],
			["Металлическое ведро", -77564, -21577],
			["Металлическое ведро", -5821, -63957],
			["Металлическое ведро", -29472, -49397],
			["Металлическое ведро", -20394, -50740],
			["Металлическое ведро", -21748, -44110],
			["Металлическое ведро", -39462, -55148],
			["Металлическое ведро", -34981, -56000],
			["Металлическое ведро", -45962, -50493],
			["Металлическое ведро", -47486, -49979],
			["Металлическое ведро", -41202, -37570],
			["Металлическое ведро", -41395, -37780],
			["Металлическое ведро", -121919, -64674],
			["Металлическое ведро", -111243, -62383],
			["Металлическое ведро", -111282, -62382],
			["Металлическое ведро", -111554, -62372],
			["Металлическое ведро", -110130, -61723],
			["Металлическое ведро", -110091, -61711],
			["Металлическое ведро", -112440, -58502],
			["Металлическое ведро", -110711, -60729],
			["Металлическое ведро", -110709, -60699],
			["Металлическое ведро", -111336, -60951],
			["Металлическое ведро", -111332, -60912],
			["Металлическое ведро", -112115, -59725],
			["Металлическое ведро", -110646, -59140],
			["Металлическое ведро", -111114, -58979],
			["Металлическое ведро", -111691, -57840],
			["Металлическое ведро", -111613, -58255],
			["Металлическое ведро", -111038, -58310],
			["Металлическое ведро", -112626, -59183],
			["Металлическое ведро", -110475, -58879],
			["Металлическое ведро", -110523, -58894],
			["Металлическое ведро", -120155, -46269],
			["Металлическое ведро", -119311, -46749],
			["Металлическое ведро", -29790, -93254],
			["Металлическое ведро", -22457, -76777],
			["Металлическое ведро", -22345, -77345],
			["Металлическое ведро", -31493, -66043],
			["Металлическое ведро", -17555, -68983],
			["Металлическое ведро", -51532, -96624],
			["Металлическое ведро", -58397, -85664],
			["Металлическое ведро", -36047, -80648],
			["Металлическое ведро", -35460, -80331],
			["Металлическое ведро", -36001, -80633],
			["Металлическое ведро", -35608, -80502],
			["Металлическое ведро", -59760, -71962],
			["Металлическое ведро", -47089, -72772],
			["Металлическое ведро", -45480, -72175],
			["Металлическое ведро", -47099, -72096],
			["Металлическое ведро", -48199, -70880],
			["Металлическое ведро", -47279, -70156],
			["Металлическое ведро", -47073, -71235],
			["Металлическое ведро", -45073, -70433],
			["Металлическое ведро", -45349, -70718],
			["Металлическое ведро", -101738, -67703],
			["Металлическое ведро", -13921, -125285],
			["Металлическое ведро", -14132, -124761],
			["Металлическое ведро", -14143, -124747],
			["Металлическое ведро", -14131, -124759],
			["Металлическое ведро", -14118, -125203],
			["Металлическое ведро", -5245, -115406],
			["Металлическое ведро", -49544, -129359],
			["Металлическое ведро", -48972, -129401],
			["Металлическое ведро", -48000, -127615],
			["Металлическое ведро", -37714, -129159],
			["Металлическое ведро", -42175, -126055],
			["Металлическое ведро", -38613, -124906],
			["Металлическое ведро", -51160, -111469],
			["Металлическое ведро", -78726, -107853],
			["Металлическое ведро", -79786, -108095],
			["Металлическое ведро", -102711, -130431],
			["Металлическое ведро", -122917, -122990],
			["Металлическое ведро", -122975, -122741],
			["Металлическое ведро", -126962, -114190],
			["Металлическое ведро", -117317, -102184],
			["Металлическое ведро", -114937, -99486],
			["Металлическое ведро", -144027, -13284],
			["Металлическое ведро", -169060, -23778],
			["Металлическое ведро", -147671, -58462],
			["Металлическое ведро", -148094, -56834],
			["Металлическое ведро", -160234, -41944],
			["Металлическое ведро", -156140, -36347],
			["Металлическое ведро", -152263, -74901],
			["Металлическое ведро", -151189, -75201],
			["Металлическое ведро", -133349, -121475],
			["Металлическое ведро", -149952, -99359],
			["Металлическое ведро", 188404, -29335],
			["Металлическое ведро", 189671, -30137],
			["Металлическое ведро", 195026, -31769],
			["Металлическое ведро", 195132, -31510],
			["Металлическое ведро", 194332, -26393],
			["Металлическое ведро", 193982, -26114],
			["Металлическое ведро", 194038, -26178],
			["Металлическое ведро", 194132, -26829],
			["Металлическое ведро", 171270, -24000],
			["Металлическое ведро", 196198, -23743],
			["Металлическое ведро", 173649, -13567],
			["Металлическое ведро", 169504, -4195],
			["Металлическое ведро", 131489, -31428],
			["Металлическое ведро", 135949, -1103],
			["Металлическое ведро", 140263, -3064],
			["Металлическое ведро", 198107, -33700],
			["Металлическое ведро", 141823, -57684],
			["Металлическое ведро", 141561, -57632],
			["Металлическое ведро", 142883, -59367],
			["Металлическое ведро", 143072, -56003],
			["Металлическое ведро", 146976, -56606],
			["Металлическое ведро", 141674, -51495],
			["Металлическое ведро", 147139, -51636],
			["Металлическое ведро", 148790, -51809],
			["Металлическое ведро", 155925, -50570],
			["Металлическое ведро", 158725, -51451],
			["Металлическое ведро", 158954, -49406],
			["Металлическое ведро", 160041, -50373],
			["Металлическое ведро", 148907, -46584],
			["Металлическое ведро", 152703, -48558],
			["Металлическое ведро", 151753, -48339],
			["Металлическое ведро", 157147, -46980],
			["Металлическое ведро", 183629, -91489],
			["Металлическое ведро", 184268, -92722],
			["Металлическое ведро", 183209, -93574],
			["Металлическое ведро", 173608, -75588],
			["Металлическое ведро", 182932, -66776],
			["Металлическое ведро", 147112, -78374],
			["Металлическое ведро", 153105, -75440],
			["Металлическое ведро", 148249, -70080],
			["Металлическое ведро", 180110, -121787],
			["Металлическое ведро", 100757, -29492],
			["Металлическое ведро", 101730, -28979],
			["Металлическое ведро", 129433, -31457],
			["Металлическое ведро", 130176, -27909],
			["Металлическое ведро", 101181, -12486],
			["Металлическое ведро", 105748, -7081],
			["Металлическое ведро", 105577, -7076],
			["Металлическое ведро", 90809, -30191],
			["Металлическое ведро", 82386, -20993],
			["Металлическое ведро", 82035, -18813],
			["Металлическое ведро", 84943, -19146],
			["Металлическое ведро", 82071, -18711],
			["Металлическое ведро", 84432, -15752],
			["Металлическое ведро", 89296, -8716],
			["Металлическое ведро", 93319, -4102],
			["Металлическое ведро", 95886, -6671],
			["Металлическое ведро", 80830, -1588],
			["Металлическое ведро", 94449, -4080],
			["Металлическое ведро", 47653, -20873],
			["Металлическое ведро", 27681, -31219],
			["Металлическое ведро", 18217, -27583],
			["Металлическое ведро", 17885, -27429],
			["Металлическое ведро", 17854, -27534],
			["Металлическое ведро", 29523, -21393],
			["Металлическое ведро", 30512, -20076],
			["Металлическое ведро", 30701, -20203],
			["Металлическое ведро", 31341, -20165],
			["Металлическое ведро", 30900, -20282],
			["Металлическое ведро", 108084, -54983],
			["Металлическое ведро", 113850, -56083],
			["Металлическое ведро", 111773, -55929],
			["Металлическое ведро", 37628, -41939],
			["Металлическое ведро", 34063, -38842],
			["Металлическое ведро", 33641, -35532],
			["Металлическое ведро", 37952, -35108],
			["Металлическое ведро", 25120, -63811],
			["Металлическое ведро", 12208, -60909],
			["Металлическое ведро", 22362, -58231],
			["Металлическое ведро", 22283, -58206],
			["Металлическое ведро", 22388, -58138],
			["Металлическое ведро", 30253, -57962],
			["Металлическое ведро", 29442, -58541],
			["Металлическое ведро", 29047, -58285],
			["Металлическое ведро", 32333, -39203],
			["Металлическое ведро", 82535, -95963],
			["Металлическое ведро", 67310, -88501],
			["Металлическое ведро", 56767, -95009],
			["Металлическое ведро", 60359, -96775],
			["Металлическое ведро", 55584, -73782],
			["Металлическое ведро", 45956, -66213],
			["Металлическое ведро", 101927, -98429],
			["Металлическое ведро", 101338, -98566],
			["Металлическое ведро", 101211, -100091],
			["Металлическое ведро", 74363, -121241],
			["Металлическое ведро", 82014, -119382],
			["Металлическое ведро", 84456, -109212],
			["Металлическое ведро", 52740, -130336],
			["Металлическое ведро", 49748, -99078],
			["Металлическое ведро", 61172, -99162],
			["Металлическое ведро", 18050, -119669],
			["Металлическое ведро", 20973, -113699],
			["Металлическое ведро", 9362, -109251],
			["Металлическое ведро", 9336, -109165],
			["Металлическое ведро", 22620, -108232],
			["Металлическое ведро", 20857, -108583],
			["Металлическое ведро", 22924, -106757],
			["Металлическое ведро", 16963, -104408],
			["Металлическое ведро", 19950, -104260],
			["Металлическое ведро", 807, -99945],
			["Металлическое ведро", 20539, -101875],
			["Металлическое ведро", -4422, -155772],
			["Металлическое ведро", -4415, -156115],
			["Металлическое ведро", -30943, -152037],
			["Металлическое ведро", -82257, -160877],
			["Металлическое ведро", -31434, -188006],
			["Металлическое ведро", -31215, -187885],
			["Металлическое ведро", -23147, -175818],
			["Металлическое ведро", -32976, -187600],
			["Металлическое ведро", -33055, -187362],
			["Металлическое ведро", -33060, -187463],
			["Металлическое ведро", -33076, -187484],
			["Металлическое ведро", -78235, -181162],
			["Металлическое ведро", -78281, -176946],
			["Металлическое ведро", -81557, -178826],
			["Металлическое ведро", -76632, -176589],
			["Металлическое ведро", -74885, -180109],
			["Металлическое ведро", -75024, -180179],
			["Металлическое ведро", -75085, -180105],
			["Металлическое ведро", -87559, -165994],
			["Металлическое ведро", -86877, -166593],
			["Металлическое ведро", -120181, -189129],
			["Металлическое ведро", -120284, -189833],
			["Металлическое ведро", -120246, -189848],
			["Металлическое ведро", -119079, -191543],
			["Металлическое ведро", -118759, -188959],
			["Металлическое ведро", -121992, -188137],
			["Металлическое ведро", -126780, -184111],
			["Металлическое ведро", -114936, -171397],
			["Металлическое ведро", -113909, -169190],
			["Металлическое ведро", -113402, -170199],
			["Металлическое ведро", -114376, -170605],
			["Металлическое ведро", -152515, -160333],
			["Металлическое ведро", -132090, -157204],
			["Металлическое ведро", -132902, -157669],
			["Металлическое ведро", -138042, -152743],
			["Металлическое ведро", -134645, -154210],
			["Металлическое ведро", -132328, -148782],
			["Металлическое ведро", -132087, -148583],
			["Металлическое ведро", -146962, -142915],
			["Металлическое ведро", -137148, -179798],
			["Металлическое ведро", -136470, -176848],
			["Металлическое ведро", -135925, -175509],
			["Металлическое ведро", 165062, -150537],
			["Металлическое ведро", 146076, -143194],
			["Металлическое ведро", 196081, -168747],
			["Металлическое ведро", 189215, -165977],
			["Металлическое ведро", 188499, -165341],
			["Металлическое ведро", 115379, -157417],
			["Металлическое ведро", 117021, -135627],
			["Металлическое ведро", 95105, -163743],
			["Металлическое ведро", 48585, -152116],
			["Металлическое ведро", 50470, -149447],
			["Металлическое ведро", 52340, -149325],
			["Металлическое ведро", 51147, -150059],
			["Металлическое ведро", 49948, -150847],
			["Металлическое ведро", 51532, -150930],
			["Металлическое ведро", 61824, -133227],
			["Металлическое ведро", 23234, -148685],
			["Металлическое ведро", 28121, -139724],
			["Металлическое ведро", 27670, -140936],
			["Металлическое ведро", 30441, -139549],
			["Металлическое ведро", 28741, -139275],
			["Металлическое ведро", 28950, -140646],
			["Металлическое ведро", 29754, -139647],
			["Металлическое ведро", 29549, -140292],
			["Металлическое ведро", 31006, -139455],
			["Металлическое ведро", 26341, -136542],
			["Металлическое ведро", 26276, -136627],
			["Металлическое ведро", 30320, -139093],
			["Металлическое ведро", 111831, -164583],
			["Металлическое ведро", 74556, -176772],
			["Металлическое ведро", 75490, -174753],
			["Металлическое ведро", 74392, -172615],
			["Металлическое ведро", 75445, -173401],
			["Металлическое ведро", 714, -171515],
			["Металлическое ведро", 730, -166631],
			["Металлическое ведро", -23314, 188880],
			["Металлическое ведро", -23084, 189547],
			["Металлическое ведро", -23046, 189529],
			["Металлическое ведро", -31143, 196264],
			["Металлическое ведро", -9751, 193721],
			["Металлическое ведро", -10113, 193329],
			["Металлическое ведро", -59494, 180006],
			["Металлическое ведро", -59529, 181264],
			["Металлическое ведро", -60852, 181649],
			["Металлическое ведро", -56374, 182997],
			["Металлическое ведро", -84025, 166053],
			["Металлическое ведро", -97563, 179377],
			["Металлическое ведро", -79742, 180198],
			["Металлическое ведро", -97280, 183801],
			["Металлическое ведро", -93932, 181957],
			["Металлическое ведро", -94142, 182134],
			["Металлическое ведро", -93831, 182915],
			["Металлическое ведро", -89648, 184298],
			["Металлическое ведро", -87784, 184434],
			["Металлическое ведро", -95240, 190469],
			["Металлическое ведро", -97379, 189538],
			["Металлическое ведро", -99528, 183629],
			["Металлическое ведро", -99322, 183409],
			["Металлическое ведро", -98842, 183365],
			["Металлическое ведро", -98570, 189156],
			["Металлическое ведро", -25832, 144258],
			["Металлическое ведро", -1722, 158461],
			["Металлическое ведро", -2676, 158297],
			["Металлическое ведро", -27015, 162692],
			["Металлическое ведро", -5888, 162976],
			["Металлическое ведро", -64069, 132094],
			["Металлическое ведро", -41334, 161154],
			["Металлическое ведро", -87365, 144377],
			["Металлическое ведро", -163443, 200862],
			["Металлическое ведро", -140635, 171716],
			["Металлическое ведро", -141037, 170492],
			["Металлическое ведро", -145516, 173195],
			["Металлическое ведро", -144615, 173414],
			["Металлическое ведро", -146107, 175429],
			["Металлическое ведро", -144711, 172783],
			["Металлическое ведро", -146065, 174368],
			["Металлическое ведро", -139461, 173431],
			["Металлическое ведро", -139216, 173447],
			["Металлическое ведро", -147486, 179156],
			["Металлическое ведро", -144859, 177987],
			["Металлическое ведро", -144305, 176917],
			["Металлическое ведро", -140953, 178880],
			["Металлическое ведро", -141263, 180684],
			["Металлическое ведро", -141330, 142904],
			["Металлическое ведро", -149492, 150902],
			["Металлическое ведро", -163155, 156812],
			["Металлическое ведро", 156613, 184597],
			["Металлическое ведро", 200431, 144077],
			["Металлическое ведро", 178820, 134123],
			["Металлическое ведро", 136590, 145551],
			["Металлическое ведро", 137090, 145375],
			["Металлическое ведро", 152054, 161188],
			["Металлическое ведро", 99220, 202259],
			["Металлическое ведро", 68440, 201824],
			["Металлическое ведро", 69250, 202633],
			["Металлическое ведро", 68711, 202718],
			["Металлическое ведро", 69989, 202086],
			["Металлическое ведро", 80052, 183005],
			["Металлическое ведро", 82482, 184076],
			["Металлическое ведро", 82341, 184165],
			["Металлическое ведро", 96187, 188972],
			["Металлическое ведро", 59908, 171698],
			["Металлическое ведро", 64593, 174101],
			["Металлическое ведро", 62836, 172877],
			["Металлическое ведро", 63556, 177285],
			["Металлическое ведро", 13301, 174858],
			["Металлическое ведро", 2753, 182270],
			["Металлическое ведро", 16036, 189662],
			["Металлическое ведро", 15165, 188717],
			["Металлическое ведро", 13487, 193064],
			["Металлическое ведро", 14806, 192813],
			["Металлическое ведро", 111576, 139161],
			["Металлическое ведро", 112269, 139571],
			["Металлическое ведро", 66860, 149514],
			["Металлическое ведро", 79895, 149267],
			["Металлическое ведро", 46924, 162715],
			["Металлическое ведро", 19152, 133987],
			["Металлическое ведро", 23996, 131564],
			["Металлическое ведро", 22756, 134699],
			["Металлическое ведро", 3480, 162723],
			["Металлическое ведро", 2680, 163103],
			["Металлическое ведро", 3833, 160249],
			["Металлическое ведро", 7070, 162397],
			["Металлическое ведро", -16504, 117840],
			["Металлическое ведро", -64373, 128062],
			["Металлическое ведро", -13613, 79655],
			["Металлическое ведро", -38807, 84746],
			["Металлическое ведро", -37660, 84499],
			["Металлическое ведро", -61064, 89492],
			["Металлическое ведро", -41168, 88628],
			["Металлическое ведро", -41776, 88194],
			["Металлическое ведро", -57716, 90463],
			["Металлическое ведро", -57695, 90431],
			["Металлическое ведро", -93279, 66894],
			["Металлическое ведро", -89796, 82808],
			["Металлическое ведро", -128128, 81875],
			["Металлическое ведро", -101773, 85224],
			["Металлическое ведро", -129123, 88380],
			["Металлическое ведро", -5474, 33984],
			["Металлическое ведро", -7599, 40531],
			["Металлическое ведро", -47724, 32972],
			["Металлическое ведро", -39728, 46364],
			["Металлическое ведро", -37341, 49181],
			["Металлическое ведро", -52905, 55660],
			["Металлическое ведро", -55254, 58026],
			["Металлическое ведро", -54878, 57662],
			["Металлическое ведро", -97838, 35253],
			["Металлическое ведро", -86189, 44935],
			["Металлическое ведро", -87310, 46862],
			["Металлическое ведро", -103264, 35528],
			["Металлическое ведро", -122154, 40950],
			["Металлическое ведро", -123161, 50964],
			["Металлическое ведро", -123449, 50993],
			["Металлическое ведро", -123167, 51385],
			["Металлическое ведро", -7916, 20775],
			["Металлическое ведро", -46864, 820],
			["Металлическое ведро", -42416, 833],
			["Металлическое ведро", -39788, 2425],
			["Металлическое ведро", -33933, 562],
			["Металлическое ведро", -33825, 14333],
			["Металлическое ведро", -47396, 20413],
			["Металлическое ведро", -46967, 18880],
			["Металлическое ведро", -46965, 18643],
			["Металлическое ведро", -53673, 21245],
			["Металлическое ведро", -45564, 20638],
			["Металлическое ведро", -46146, 20592],
			["Металлическое ведро", -46794, 28261],
			["Металлическое ведро", -46979, 28085],
			["Металлическое ведро", -46485, 27263],
			["Металлическое ведро", -46393, 26615],
			["Металлическое ведро", -43718, 28500],
			["Металлическое ведро", -50124, 29273],
			["Металлическое ведро", -45080, 28966],
			["Металлическое ведро", -71334, 25064],
			["Металлическое ведро", -119272, 5087],
			["Металлическое ведро", -98523, 7601],
			["Металлическое ведро", -98700, 7265],
			["Металлическое ведро", -98518, 7677],
			["Металлическое ведро", -127445, 30755],
			["Металлическое ведро", -148466, 113181],
			["Металлическое ведро", -149030, 114617],
			["Металлическое ведро", -148490, 113776],
			["Металлическое ведро", -150203, 114978],
			["Металлическое ведро", -131105, 120179],
			["Металлическое ведро", -154037, 129819],
			["Металлическое ведро", -172309, 110101],
			["Металлическое ведро", -138210, 88122],
			["Металлическое ведро", -138769, 90748],
			["Металлическое ведро", -179926, 74668],
			["Металлическое ведро", -155973, 51515],
			["Металлическое ведро", -132553, 10763],
			["Металлическое ведро", -132643, 10266],
			["Металлическое ведро", -160391, 13720],
			["Металлическое ведро", 180348, 109625],
			["Металлическое ведро", 181640, 109542],
			["Металлическое ведро", 183547, 111827],
			["Металлическое ведро", 182900, 110810],
			["Металлическое ведро", 183385, 111941],
			["Металлическое ведро", 182438, 112499],
			["Металлическое ведро", 135592, 116330],
			["Металлическое ведро", 201725, 94053],
			["Металлическое ведро", 154054, 77566],
			["Металлическое ведро", 143643, 81709],
			["Металлическое ведро", 198409, 44944],
			["Металлическое ведро", 198076, 46717],
			["Металлическое ведро", 200466, 45615],
			["Металлическое ведро", 169071, 56093],
			["Металлическое ведро", 171118, 57176],
			["Металлическое ведро", 167901, 59651],
			["Металлическое ведро", 188775, 57470],
			["Металлическое ведро", 152891, 57534],
			["Металлическое ведро", 182543, 3027],
			["Металлическое ведро", 182703, 2848],
			["Металлическое ведро", 183290, 3261],
			["Металлическое ведро", 183071, 3473],
			["Металлическое ведро", 186487, 3045],
			["Металлическое ведро", 174312, 7147],
			["Металлическое ведро", 164989, 10594],
			["Металлическое ведро", 172313, 8963],
			["Металлическое ведро", 141939, 4076],
			["Металлическое ведро", 139642, 3794],
			["Металлическое ведро", 141614, 2224],
			["Металлическое ведро", 136826, 5658],
			["Металлическое ведро", 137424, 4807],
			["Металлическое ведро", 131750, 11808],
			["Металлическое ведро", 140863, 9105],
			["Металлическое ведро", 149442, 11326],
			["Металлическое ведро", 94990, 103025],
			["Металлическое ведро", 39670, 115721],
			["Металлическое ведро", 20791, 125422],
			["Металлическое ведро", 26857, 127631],
			["Металлическое ведро", 130106, 74142],
			["Металлическое ведро", 73367, 80080],
			["Металлическое ведро", 41764, 77476],
			["Металлическое ведро", 41821, 77586],
			["Металлическое ведро", 41633, 77605],
			["Металлическое ведро", 42773, 76878],
			["Металлическое ведро", 24841, 69631],
			["Металлическое ведро", 26098, 69531],
			["Металлическое ведро", 25323, 70997],
			["Металлическое ведро", 25382, 77030],
			["Металлическое ведро", 28615, 92884],
			["Металлическое ведро", 104543, 43420],
			["Металлическое ведро", 109404, 56652],
			["Металлическое ведро", 111570, 57766],
			["Металлическое ведро", 73574, 33443],
			["Металлическое ведро", 78914, 52997],
			["Металлическое ведро", 78220, 52417],
			["Металлическое ведро", 80075, 55713],
			["Металлическое ведро", 82643, 54526],
			["Металлическое ведро", 84134, 56506],
			["Металлическое ведро", 87510, 55756],
			["Металлическое ведро", 52828, 52145],
			["Металлическое ведро", 59120, 54949],
			["Металлическое ведро", 5671, 43513],
			["Металлическое ведро", 7522, 43672],
			["Металлическое ведро", 7209, 42736],
			["Металлическое ведро", 10071, 48328],
			["Металлическое ведро", 28628, 48328],
			["Металлическое ведро", 24632, 45672],
			["Металлическое ведро", 24816, 45736],
			["Металлическое ведро", 9786, 50342],
			["Металлическое ведро", 8895, 49492],
			["Металлическое ведро", 15510, 50131],
			["Металлическое ведро", 15343, 49795],
			["Металлическое ведро", 20125, 50633],
			["Металлическое ведро", 115638, 12985],
			["Металлическое ведро", 128755, 21435],
			["Металлическое ведро", 128774, 21411],
			["Металлическое ведро", 128781, 21437],
			["Металлическое ведро", 100694, 26009],
			["Металлическое ведро", 91711, 3643],
			["Металлическое ведро", 95670, 3529],
			["Металлическое ведро", 71530, 21891],
			["Металлическое ведро", 71512, 20917],
			["Металлическое ведро", 72152, 20630],
			["Металлическое ведро", 71259, 20861],
			["Металлическое ведро", 77316, 21437],
			["Металлическое ведро", 77975, 20856],
			["Металлическое ведро", 77886, 20610],
			["Металлическое ведро", 92642, 32298],
			["Металлическое ведро", 54956, 1685],
			["Металлическое ведро", 55291, 8401],
			["Металлическое ведро", 47915, 14063],
			["Металлическое ведро", 148721, 140771]
			];
	for (var i = 0; i < hlam275.length; i++) {
				hlam_275 = new L.circleMarker([hlam275[i][1],hlam275[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam275[i][0])
					.bindTooltip(hlam275[i][0], {direction: 'top'})
					.addTo(hlam275icons);
			}
	}
	else {
		hlam275icons.clearLayers();
	}
}
var hlam276icons = L.layerGroup().addTo(map);
function Hlam276OnOff() {
	var chbox276;
	chbox276=document.getElementById('Hlam276Button');
	if (chbox276.checked) {
		var hlam276 = [
			["Металлическое корыто", -37240, -58917],
			["Металлическое корыто", -36903, -58265],
			["Металлическое корыто", -34956, -57413],
			["Металлическое корыто", -47116, -50640],
			["Металлическое корыто", -109659, -58369],
			["Металлическое корыто", -24378, -73241],
			["Металлическое корыто", -46736, -72907],
			["Металлическое корыто", -129612, -91344],
			["Металлическое корыто", -129313, -91908],
			["Металлическое корыто", -13957, -124777],
			["Металлическое корыто", -80847, -110473],
			["Металлическое корыто", -148606, -57362],
			["Металлическое корыто", -162369, -53887],
			["Металлическое корыто", -147570, -56764],
			["Металлическое корыто", -148373, -56675],
			["Металлическое корыто", -151375, -71807],
			["Металлическое корыто", -132242, -111972],
			["Металлическое корыто", 149025, -51845],
			["Металлическое корыто", 148444, -52496],
			["Металлическое корыто", 184218, -92530],
			["Металлическое корыто", 33885, -36523],
			["Металлическое корыто", 29513, -58395],
			["Металлическое корыто", 17854, -120614],
			["Металлическое корыто", 18316, -120695],
			["Металлическое корыто", 30481, -100318],
			["Металлическое корыто", -116962, -163280],
			["Металлическое корыто", -126446, -135346],
			["Металлическое корыто", -116472, -136709],
			["Металлическое корыто", -126374, -134377],
			["Металлическое корыто", -126518, -134111],
			["Металлическое корыто", 164791, -150726],
			["Металлическое корыто", 51296, -150410],
			["Металлическое корыто", -49353, 175978],
			["Металлическое корыто", -71123, 169889],
			["Металлическое корыто", -71236, 170231],
			["Металлическое корыто", -71440, 170080],
			["Металлическое корыто", -27114, 162116],
			["Металлическое корыто", -144966, 174834],
			["Металлическое корыто", 93705, 189243],
			["Металлическое корыто", 111961, 140082],
			["Металлическое корыто", 45211, 162834],
			["Металлическое корыто", 45755, 162743],
			["Металлическое корыто", -81049, 89333],
			["Металлическое корыто", 183748, 3229],
			["Металлическое корыто", 100264, 91657],
			["Металлическое корыто", 26167, 54718],
			["Металлическое корыто", 82408, 15626],
			["Металлическое корыто", -138209, -139777]
			];
	for (var i = 0; i < hlam276.length; i++) {
				hlam_276 = new L.circleMarker([hlam276[i][1],hlam276[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam276[i][0])
					.bindTooltip(hlam276[i][0], {direction: 'top'})
					.addTo(hlam276icons);
			}
	}
	else {
		hlam276icons.clearLayers();
	}
}
var hlam277icons = L.layerGroup().addTo(map);
function Hlam277OnOff() {
	var chbox277;
	chbox277=document.getElementById('Hlam277Button');
	if (chbox277.checked) {
		var hlam277 = [
			["Металлическое корыто с крышкой", -43653, -6380],
			["Металлическое корыто с крышкой", -43624, -6560],
			["Металлическое корыто с крышкой", -27861, -59989],
			["Металлическое корыто с крышкой", 178321, -124318],
			["Металлическое корыто с крышкой", 179833, -121776],
			["Металлическое корыто с крышкой", 48746, -22435],
			["Металлическое корыто с крышкой", 17818, -120653],
			["Металлическое корыто с крышкой", -2300, -160155],
			["Металлическое корыто с крышкой", -8105, -164976],
			["Металлическое корыто с крышкой", 194606, -169042],
			["Металлическое корыто с крышкой", 71027, -173847],
			["Металлическое корыто с крышкой", -154868, 165211],
			["Металлическое корыто с крышкой", -153940, 129975]
			];
	for (var i = 0; i < hlam277.length; i++) {
				hlam_277 = new L.circleMarker([hlam277[i][1],hlam277[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam277[i][0])
					.bindTooltip(hlam277[i][0], {direction: 'top'})
					.addTo(hlam277icons);
			}
	}
	else {
		hlam277icons.clearLayers();
	}
}
var hlam278icons = L.layerGroup().addTo(map);
function Hlam278OnOff() {
	var chbox278;
	chbox278=document.getElementById('Hlam278Button');
	if (chbox278.checked) {
		var hlam278 = [
			["Метелка для пыли", -19492, -47048],
			["Метелка для пыли", -151401, -74145],
			["Метелка для пыли", -1598, -164316],
			["Метелка для пыли", -60436, 181496],
			["Метелка для пыли", 150019, 135227],
			["Метелка для пыли", 69726, 202351],
			["Метелка для пыли", -42999, 88162],
			["Метелка для пыли", -40881, 9127],
			["Метелка для пыли", 181284, 109898],
			["Метелка для пыли", 93642, 9030],
			["Метелка для пыли", 82375, 15446]
			];
	for (var i = 0; i < hlam278.length; i++) {
				hlam_278 = new L.circleMarker([hlam278[i][1],hlam278[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam278[i][0])
					.bindTooltip(hlam278[i][0], {direction: 'top'})
					.addTo(hlam278icons);
			}
	}
	else {
		hlam278icons.clearLayers();
	}
}
var hlam279icons = L.layerGroup().addTo(map);
function Hlam279OnOff() {
	var chbox279;
	chbox279=document.getElementById('Hlam279Button');
	if (chbox279.checked) {
		var hlam279 = [
			["Мешок с удобрением", -49946, -14012],
			["Мешок с удобрением", -50056, -14138],
			["Мешок с удобрением", -50083, -14147],
			["Мешок с удобрением", -54187, -9630],
			["Мешок с удобрением", -54288, -11943],
			["Мешок с удобрением", -54297, -11909],
			["Мешок с удобрением", -52197, -5698],
			["Мешок с удобрением", -52161, -5783],
			["Мешок с удобрением", -52122, -5780],
			["Мешок с удобрением", -43086, -6224],
			["Мешок с удобрением", -43064, -6218],
			["Мешок с удобрением", -41897, -5057],
			["Мешок с удобрением", -41924, -5112],
			["Мешок с удобрением", -41942, -5111],
			["Мешок с удобрением", -41934, -5112],
			["Мешок с удобрением", -42086, -4496],
			["Мешок с удобрением", -79494, -22532],
			["Мешок с удобрением", -79262, -22527],
			["Мешок с удобрением", -79311, -22497],
			["Мешок с удобрением", -77606, -21771],
			["Мешок с удобрением", -77664, -21759],
			["Мешок с удобрением", -77676, -21750],
			["Мешок с удобрением", -10078, -64827],
			["Мешок с удобрением", -10064, -64810],
			["Мешок с удобрением", -57841, -47726],
			["Мешок с удобрением", -57886, -47834],
			["Мешок с удобрением", -111265, -62280],
			["Мешок с удобрением", -111293, -62242],
			["Мешок с удобрением", -110041, -61688],
			["Мешок с удобрением", -109970, -61687],
			["Мешок с удобрением", -109701, -61664],
			["Мешок с удобрением", -109957, -64591],
			["Мешок с удобрением", -110066, -64514],
			["Мешок с удобрением", -112495, -58506],
			["Мешок с удобрением", -111402, -60931],
			["Мешок с удобрением", -111477, -60952],
			["Мешок с удобрением", -111625, -57860],
			["Мешок с удобрением", -111317, -58229],
			["Мешок с удобрением", -110048, -60604],
			["Мешок с удобрением", -110052, -60589],
			["Мешок с удобрением", -110086, -60457],
			["Мешок с удобрением", -29837, -94268],
			["Мешок с удобрением", -35049, -82599],
			["Мешок с удобрением", -72666, -68641],
			["Мешок с удобрением", -72676, -68653],
			["Мешок с удобрением", -126167, -104637],
			["Мешок с удобрением", -161283, -13105],
			["Мешок с удобрением", -157169, -44319],
			["Мешок с удобрением", -157191, -44315],
			["Мешок с удобрением", -156059, -36118],
			["Мешок с удобрением", -150964, -102106],
			["Мешок с удобрением", 131425, -31733],
			["Мешок с удобрением", 174914, -41743],
			["Мешок с удобрением", 174501, -41436],
			["Мешок с удобрением", 182965, -93339],
			["Мешок с удобрением", 161280, -92230],
			["Мешок с удобрением", 179315, -120544],
			["Мешок с удобрением", 179294, -120512],
			["Мешок с удобрением", 130089, -27517],
			["Мешок с удобрением", 105798, -23377],
			["Мешок с удобрением", 120015, -2073],
			["Мешок с удобрением", 82155, -18518],
			["Мешок с удобрением", 89990, -9679],
			["Мешок с удобрением", 90475, -10007],
			["Мешок с удобрением", 71034, -1614],
			["Мешок с удобрением", 30351, -21214],
			["Мешок с удобрением", 30313, -21197],
			["Мешок с удобрением", 30335, -21207],
			["Мешок с удобрением", 30348, -21191],
			["Мешок с удобрением", 71381, -47772],
			["Мешок с удобрением", 62447, -58285],
			["Мешок с удобрением", 51018, -42320],
			["Мешок с удобрением", 49366, -44655],
			["Мешок с удобрением", 49348, -44402],
			["Мешок с удобрением", 49622, -44303],
			["Мешок с удобрением", 5970, -58925],
			["Мешок с удобрением", 29485, -58436],
			["Мешок с удобрением", 78410, -93283],
			["Мешок с удобрением", 87975, -115413],
			["Мешок с удобрением", 60629, -98797],
			["Мешок с удобрением", 60672, -98792],
			["Мешок с удобрением", 60815, -98779],
			["Мешок с удобрением", 60818, -98805],
			["Мешок с удобрением", 60854, -98909],
			["Мешок с удобрением", 61052, -98904],
			["Мешок с удобрением", 61185, -99014],
			["Мешок с удобрением", 60724, -99219],
			["Мешок с удобрением", 60736, -99201],
			["Мешок с удобрением", 61185, -99131],
			["Мешок с удобрением", 61173, -99046],
			["Мешок с удобрением", 61178, -99129],
			["Мешок с удобрением", 61200, -98903],
			["Мешок с удобрением", 18610, -120807],
			["Мешок с удобрением", 18562, -120824],
			["Мешок с удобрением", 16552, -119251],
			["Мешок с удобрением", 16559, -119232],
			["Мешок с удобрением", 16501, -119283],
			["Мешок с удобрением", 9229, -109020],
			["Мешок с удобрением", 9407, -109375],
			["Мешок с удобрением", 9574, -109780],
			["Мешок с удобрением", 9598, -109759],
			["Мешок с удобрением", 25877, -104619],
			["Мешок с удобрением", -2304, -158900],
			["Мешок с удобрением", -54980, -160633],
			["Мешок с удобрением", -61200, -145435],
			["Мешок с удобрением", -61234, -145399],
			["Мешок с удобрением", -61175, -145399],
			["Мешок с удобрением", -24677, -172226],
			["Мешок с удобрением", -24614, -172290],
			["Мешок с удобрением", -24611, -172276],
			["Мешок с удобрением", -14789, -173871],
			["Мешок с удобрением", -41002, -175602],
			["Мешок с удобрением", -40985, -175638],
			["Мешок с удобрением", -41598, -175769],
			["Мешок с удобрением", -41499, -175266],
			["Мешок с удобрением", -95187, -176393],
			["Мешок с удобрением", -95176, -176377],
			["Мешок с удобрением", 194698, -146456],
			["Мешок с удобрением", 194720, -146456],
			["Мешок с удобрением", 194742, -146467],
			["Мешок с удобрением", 194696, -146498],
			["Мешок с удобрением", 27939, -139925],
			["Мешок с удобрением", 26180, -136608],
			["Мешок с удобрением", 26221, -136581],
			["Мешок с удобрением", -18525, 163872],
			["Мешок с удобрением", -23224, 189675],
			["Мешок с удобрением", -59924, 178027],
			["Мешок с удобрением", -59932, 177999],
			["Мешок с удобрением", -38774, 190373],
			["Мешок с удобрением", -38798, 190377],
			["Мешок с удобрением", -84422, 165914],
			["Мешок с удобрением", -84400, 166126],
			["Мешок с удобрением", -84271, 166202],
			["Мешок с удобрением", -91899, 183486],
			["Мешок с удобрением", -91735, 183597],
			["Мешок с удобрением", -91719, 183564],
			["Мешок с удобрением", -91728, 183621],
			["Мешок с удобрением", -91739, 183570],
			["Мешок с удобрением", -91681, 183600],
			["Мешок с удобрением", -91658, 183560],
			["Мешок с удобрением", -91676, 183492],
			["Мешок с удобрением", -537, 137140],
			["Мешок с удобрением", -23, 137042],
			["Мешок с удобрением", -367, 137164],
			["Мешок с удобрением", -109632, 132599],
			["Мешок с удобрением", -109626, 132574],
			["Мешок с удобрением", -138766, 152470],
			["Мешок с удобрением", 170811, 241820],
			["Мешок с удобрением", 6326, 164085],
			["Мешок с удобрением", 6296, 164065],
			["Мешок с удобрением", 11488, 182937],
			["Мешок с удобрением", 11464, 182942],
			["Мешок с удобрением", 12174, 183493],
			["Мешок с удобрением", 12184, 183480],
			["Мешок с удобрением", 15939, 189914],
			["Мешок с удобрением", 14057, 196472],
			["Мешок с удобрением", 14063, 196505],
			["Мешок с удобрением", 14094, 196479],
			["Мешок с удобрением", 14094, 196507],
			["Мешок с удобрением", 14091, 196533],
			["Мешок с удобрением", 13957, 193832],
			["Мешок с удобрением", 14120, 193808],
			["Мешок с удобрением", 14098, 193847],
			["Мешок с удобрением", 111472, 139751],
			["Мешок с удобрением", 105202, 157042],
			["Мешок с удобрением", 105128, 156737],
			["Мешок с удобрением", 20312, 132897],
			["Мешок с удобрением", 21970, 132770],
			["Мешок с удобрением", 21991, 132760],
			["Мешок с удобрением", 21976, 132803],
			["Мешок с удобрением", 2, 137075],
			["Мешок с удобрением", 1653, 139211],
			["Мешок с удобрением", 1642, 139201],
			["Мешок с удобрением", -13864, 107578],
			["Мешок с удобрением", -128393, 119803],
			["Мешок с удобрением", -43172, 87319],
			["Мешок с удобрением", -43148, 87316],
			["Мешок с удобрением", -87810, 67538],
			["Мешок с удобрением", -9064, 42240],
			["Мешок с удобрением", -9085, 42231],
			["Мешок с удобрением", -19450, 58835],
			["Мешок с удобрением", -19452, 58811],
			["Мешок с удобрением", -19089, 60180],
			["Мешок с удобрением", -19075, 60183],
			["Мешок с удобрением", -65249, 36747],
			["Мешок с удобрением", -65641, 36168],
			["Мешок с удобрением", -65655, 36182],
			["Мешок с удобрением", -65636, 36186],
			["Мешок с удобрением", -123236, 50912],
			["Мешок с удобрением", -51466, 6297],
			["Мешок с удобрением", -51475, 6319],
			["Мешок с удобрением", -42097, 12140],
			["Мешок с удобрением", -58425, 13192],
			["Мешок с удобрением", -58376, 13255],
			["Мешок с удобрением", -34747, 12859],
			["Мешок с удобрением", -34766, 12844],
			["Мешок с удобрением", -99702, 7424],
			["Мешок с удобрением", -99715, 7438],
			["Мешок с удобрением", -130992, 10563],
			["Мешок с удобрением", -131006, 10519],
			["Мешок с удобрением", -131013, 10572],
			["Мешок с удобрением", -137184, 106366],
			["Мешок с удобрением", -137784, 105998],
			["Мешок с удобрением", -138000, 106102],
			["Мешок с удобрением", -137988, 106092],
			["Мешок с удобрением", -138445, 106613],
			["Мешок с удобрением", 134815, 126976],
			["Мешок с удобрением", 191551, 60709],
			["Мешок с удобрением", 36400, 125283],
			["Мешок с удобрением", 114658, 68944],
			["Мешок с удобрением", 114592, 69027],
			["Мешок с удобрением", 114567, 69022],
			["Мешок с удобрением", 114588, 69055],
			["Мешок с удобрением", 100258, 91648],
			["Мешок с удобрением", 100251, 91699],
			["Мешок с удобрением", 62612, 53691],
			["Мешок с удобрением", 100130, 2143],
			["Мешок с удобрением", 103278, 3883]
			];
	for (var i = 0; i < hlam279.length; i++) {
				hlam_279 = new L.circleMarker([hlam279[i][1],hlam279[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam279[i][0])
					.bindTooltip(hlam279[i][0], {direction: 'top'})
					.addTo(hlam279icons);
			}
	}
	else {
		hlam279icons.clearLayers();
	}
}
var hlam280icons = L.layerGroup().addTo(map);
function Hlam280OnOff() {
	var chbox280;
	chbox280=document.getElementById('Hlam280Button');
	if (chbox280.checked) {
		var hlam280 = [
			["Мешок с хлором", -29216, -49078],
			["Мешок с хлором", -29187, -49048],
			["Мешок с хлором", -49291, -50695],
			["Мешок с хлором", -49279, -50706],
			["Мешок с хлором", -49336, -50770],
			["Мешок с хлором", -148597, -54841],
			["Мешок с хлором", 169059, -122076],
			["Мешок с хлором", 169100, -122077],
			["Мешок с хлором", 169113, -122074],
			["Мешок с хлором", 118653, -4802],
			["Мешок с хлором", 118669, -4803],
			["Мешок с хлором", 17375, -120818],
			["Мешок с хлором", 23010, -107101],
			["Мешок с хлором", -4415, -155758],
			["Мешок с хлором", -4352, -155708],
			["Мешок с хлором", -4406, -155737],
			["Мешок с хлором", -4372, -155727],
			["Мешок с хлором", -4387, -155707],
			["Мешок с хлором", -4459, -156141],
			["Мешок с хлором", -94809, -176389],
			["Мешок с хлором", 3438, 182824],
			["Мешок с хлором", 3135, 182084],
			["Мешок с хлором", 185949, 3771],
			["Мешок с хлором", 130535, 20826]
			];
	for (var i = 0; i < hlam280.length; i++) {
				hlam_280 = new L.circleMarker([hlam280[i][1],hlam280[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam280[i][0])
					.bindTooltip(hlam280[i][0], {direction: 'top'})
					.addTo(hlam280icons);
			}
	}
	else {
		hlam280icons.clearLayers();
	}
}
var hlam281icons = L.layerGroup().addTo(map);
function Hlam281OnOff() {
	var chbox281;
	chbox281=document.getElementById('Hlam281Button');
	if (chbox281.checked) {
		var hlam281 = [
			["Мешок цемента", -39658, -11817],
			["Мешок цемента", -39801, -12007],
			["Мешок цемента", -38741, -58227],
			["Мешок цемента", -73560, -61718],
			["Мешок цемента", -120534, -46400],
			["Мешок цемента", -119701, -46716],
			["Мешок цемента", -119693, -46691],
			["Мешок цемента", -119575, -46919],
			["Мешок цемента", -127391, -44064],
			["Мешок цемента", -127408, -44147],
			["Мешок цемента", -127148, -43990],
			["Мешок цемента", -127291, -44021],
			["Мешок цемента", -127293, -43940],
			["Мешок цемента", -127325, -43952],
			["Мешок цемента", -29765, -86777],
			["Мешок цемента", -45404, -72794],
			["Мешок цемента", -45405, -72779],
			["Мешок цемента", -45374, -72793],
			["Мешок цемента", -45378, -72800],
			["Мешок цемента", -46921, -72922],
			["Мешок цемента", -49508, -128720],
			["Мешок цемента", -44641, -131010],
			["Мешок цемента", -39810, -128856],
			["Мешок цемента", -39894, -128831],
			["Мешок цемента", -37349, -125019],
			["Мешок цемента", -37254, -125119],
			["Мешок цемента", -38223, -125133],
			["Мешок цемента", -36208, -125437],
			["Мешок цемента", -101028, -113158],
			["Мешок цемента", -101072, -113141],
			["Мешок цемента", -101045, -113139],
			["Мешок цемента", -162206, -53889],
			["Мешок цемента", -162187, -53849],
			["Мешок цемента", -162192, -53852],
			["Мешок цемента", -146616, -93527],
			["Мешок цемента", -146659, -93458],
			["Мешок цемента", 187968, -29143],
			["Мешок цемента", 187998, -29154],
			["Мешок цемента", 131502, -31581],
			["Мешок цемента", 131476, -31403],
			["Мешок цемента", 150248, -28980],
			["Мешок цемента", 150185, -28938],
			["Мешок цемента", 184003, -91258],
			["Мешок цемента", 184216, -92100],
			["Мешок цемента", 184229, -92102],
			["Мешок цемента", 184217, -92130],
			["Мешок цемента", 184209, -92128],
			["Мешок цемента", 184234, -92113],
			["Мешок цемента", 184138, -92184],
			["Мешок цемента", 184023, -93569],
			["Мешок цемента", 184010, -93571],
			["Мешок цемента", 184027, -93537],
			["Мешок цемента", 184034, -93539],
			["Мешок цемента", 184004, -93553],
			["Мешок цемента", 184070, -93831],
			["Мешок цемента", 183169, -77400],
			["Мешок цемента", 183142, -77408],
			["Мешок цемента", 183148, -77412],
			["Мешок цемента", 183167, -77387],
			["Мешок цемента", 183155, -77383],
			["Мешок цемента", 148819, -69877],
			["Мешок цемента", 148962, -69033],
			["Мешок цемента", 148903, -68971],
			["Мешок цемента", 153199, -103911],
			["Мешок цемента", 153166, -103989],
			["Мешок цемента", 98355, -22062],
			["Мешок цемента", 90492, -30911],
			["Мешок цемента", 91927, -31274],
			["Мешок цемента", 92373, -31703],
			["Мешок цемента", 81894, -18992],
			["Мешок цемента", 81920, -18992],
			["Мешок цемента", 89823, -57220],
			["Мешок цемента", 51413, -43835],
			["Мешок цемента", 51436, -43822],
			["Мешок цемента", 38468, -35401],
			["Мешок цемента", 87960, -115408],
			["Мешок цемента", 75969, -108821],
			["Мешок цемента", 18398, -122829],
			["Мешок цемента", 1468, -107398],
			["Мешок цемента", 1101, -107382],
			["Мешок цемента", 1127, -107382],
			["Мешок цемента", 1033, -107455],
			["Мешок цемента", -4020, -155628],
			["Мешок цемента", -44161, -136847],
			["Мешок цемента", -44134, -136754],
			["Мешок цемента", -47673, -132851],
			["Мешок цемента", -47533, -132810],
			["Мешок цемента", -46901, -133467],
			["Мешок цемента", -48075, -133887],
			["Мешок цемента", -47643, -133544],
			["Мешок цемента", -44445, -131102],
			["Мешок цемента", -39922, -133911],
			["Мешок цемента", -40005, -133900],
			["Мешок цемента", -40340, -133885],
			["Мешок цемента", -40328, -133892],
			["Мешок цемента", -37221, -131364],
			["Мешок цемента", -126443, -144810],
			["Мешок цемента", -124260, -136694],
			["Мешок цемента", -124246, -136613],
			["Мешок цемента", -24710, -172310],
			["Мешок цемента", -24699, -172305],
			["Мешок цемента", -24684, -172278],
			["Мешок цемента", -24703, -172351],
			["Мешок цемента", -24693, -172356],
			["Мешок цемента", -43296, -174499],
			["Мешок цемента", -43433, -173273],
			["Мешок цемента", -43444, -173252],
			["Мешок цемента", 165787, -148777],
			["Мешок цемента", 195561, -168939],
			["Мешок цемента", 188689, -165400],
			["Мешок цемента", 188659, -165400],
			["Мешок цемента", 21157, -142468],
			["Мешок цемента", -25162, 185761],
			["Мешок цемента", -60941, 181470],
			["Мешок цемента", -60963, 181458],
			["Мешок цемента", -60975, 181345],
			["Мешок цемента", -94851, 174640],
			["Мешок цемента", -96343, 179741],
			["Мешок цемента", -95488, 183872],
			["Мешок цемента", -92901, 183862],
			["Мешок цемента", -93054, 183857],
			["Мешок цемента", -93143, 183779],
			["Мешок цемента", -93095, 184294],
			["Мешок цемента", -93083, 184292],
			["Мешок цемента", -93072, 184296],
			["Мешок цемента", -93061, 184303],
			["Мешок цемента", -93736, 183445],
			["Мешок цемента", -93738, 183499],
			["Мешок цемента", -93729, 183569],
			["Мешок цемента", -93687, 183507],
			["Мешок цемента", -93730, 183576],
			["Мешок цемента", -93772, 183556],
			["Мешок цемента", -91639, 183849],
			["Мешок цемента", -91599, 183780],
			["Мешок цемента", -95514, 190115],
			["Мешок цемента", -173, 138862],
			["Мешок цемента", -90, 138881],
			["Мешок цемента", -5772, 160624],
			["Мешок цемента", -5754, 160618],
			["Мешок цемента", -138346, 152983],
			["Мешок цемента", -138346, 152957],
			["Мешок цемента", -138366, 152934],
			["Мешок цемента", 103515, 195241],
			["Мешок цемента", 103623, 195328],
			["Мешок цемента", 94548, 190809],
			["Мешок цемента", 94531, 190726],
			["Мешок цемента", 61263, 172972],
			["Мешок цемента", 61279, 172951],
			["Мешок цемента", 62137, 176407],
			["Мешок цемента", 16299, 189634],
			["Мешок цемента", 72124, 133034],
			["Мешок цемента", 72074, 133039],
			["Мешок цемента", 72104, 133031],
			["Мешок цемента", 72021, 138292],
			["Мешок цемента", 71997, 138285],
			["Мешок цемента", 88581, 158089],
			["Мешок цемента", 2834, 159154],
			["Мешок цемента", 2836, 159154],
			["Мешок цемента", 2884, 159226],
			["Мешок цемента", 2834, 159285],
			["Мешок цемента", 322, 160091],
			["Мешок цемента", 7233, 162494],
			["Мешок цемента", 7425, 162759],
			["Мешок цемента", 5988, 162628],
			["Мешок цемента", 5994, 162626],
			["Мешок цемента", 7705, 162540],
			["Мешок цемента", 7710, 162624],
			["Мешок цемента", 7429, 162788],
			["Мешок цемента", 7433, 162770],
			["Мешок цемента", -37541, 83823],
			["Мешок цемента", -128546, 87966],
			["Мешок цемента", -128523, 87956],
			["Мешок цемента", -128088, 87507],
			["Мешок цемента", -128025, 87514],
			["Мешок цемента", -128045, 87543],
			["Мешок цемента", -127845, 87501],
			["Мешок цемента", -127877, 87522],
			["Мешок цемента", -128336, 87908],
			["Мешок цемента", -128541, 87882],
			["Мешок цемента", -128528, 87961],
			["Мешок цемента", -8111, 45030],
			["Мешок цемента", -8119, 45020],
			["Мешок цемента", -8125, 45043],
			["Мешок цемента", -52647, 56667],
			["Мешок цемента", -104256, 38129],
			["Мешок цемента", -104134, 38280],
			["Мешок цемента", -99687, 39362],
			["Мешок цемента", -99663, 39353],
			["Мешок цемента", -123381, 51383],
			["Мешок цемента", -123383, 51379],
			["Мешок цемента", -24772, 12276],
			["Мешок цемента", -47076, 1051],
			["Мешок цемента", -46906, 1142],
			["Мешок цемента", -63890, 4276],
			["Мешок цемента", -57571, 7388],
			["Мешок цемента", -43101, 8555],
			["Мешок цемента", -43076, 8559],
			["Мешок цемента", -53493, 20418],
			["Мешок цемента", -53449, 20490],
			["Мешок цемента", -48925, 27318],
			["Мешок цемента", -43841, 29079],
			["Мешок цемента", -43827, 29078],
			["Мешок цемента", -119443, 3447],
			["Мешок цемента", -119976, 2072],
			["Мешок цемента", -119998, 1991],
			["Мешок цемента", -120111, 1725],
			["Мешок цемента", -120092, 1746],
			["Мешок цемента", -120099, 1748],
			["Мешок цемента", -120103, 1715],
			["Мешок цемента", -120089, 1720],
			["Мешок цемента", -119929, 1568],
			["Мешок цемента", -118672, 587],
			["Мешок цемента", -99525, 7490],
			["Мешок цемента", -148423, 112759],
			["Мешок цемента", -148826, 113831],
			["Мешок цемента", -148819, 113857],
			["Мешок цемента", -137412, 88037],
			["Мешок цемента", -138439, 89194],
			["Мешок цемента", -138362, 89161],
			["Мешок цемента", -140104, 91380],
			["Мешок цемента", 182179, 112321],
			["Мешок цемента", 140147, 71545],
			["Мешок цемента", 140203, 71609],
			["Мешок цемента", 190310, 31420],
			["Мешок цемента", 190300, 31384],
			["Мешок цемента", 190295, 31363],
			["Мешок цемента", 131521, 16796],
			["Мешок цемента", 131432, 16982],
			["Мешок цемента", 133475, 17127],
			["Мешок цемента", 133532, 17097],
			["Мешок цемента", 131916, 16459],
			["Мешок цемента", 132722, 21367],
			["Мешок цемента", 132703, 21302],
			["Мешок цемента", 132705, 21324],
			["Мешок цемента", 138939, 32013],
			["Мешок цемента", 138889, 31945],
			["Мешок цемента", 93961, 104175],
			["Мешок цемента", 93927, 104170],
			["Мешок цемента", 21015, 125060],
			["Мешок цемента", 103347, 56383],
			["Мешок цемента", 103286, 56447],
			["Мешок цемента", 103354, 56428],
			["Мешок цемента", 103548, 56950],
			["Мешок цемента", 103500, 56985],
			["Мешок цемента", 103497, 56990],
			["Мешок цемента", 103463, 57037],
			["Мешок цемента", 109770, 57166],
			["Мешок цемента", 25618, 47594]
			];
	for (var i = 0; i < hlam281.length; i++) {
				hlam_281 = new L.circleMarker([hlam281[i][1],hlam281[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam281[i][0])
					.bindTooltip(hlam281[i][0], {direction: 'top'})
					.addTo(hlam281icons);
			}
	}
	else {
		hlam281icons.clearLayers();
	}
}
var hlam282icons = L.layerGroup().addTo(map);
function Hlam282OnOff() {
	var chbox282;
	chbox282=document.getElementById('Hlam282Button');
	if (chbox282.checked) {
		var hlam282 = [
			["Микроскоп", -36201, -80816],
			["Микроскоп", -49359, -99831],
			["Микроскоп", -82359, -126376],
			["Микроскоп", -123320, -131046],
			["Микроскоп", -148177, -59491],
			["Микроскоп", 101951, -12401],
			["Микроскоп", 101176, -12312],
			["Микроскоп", 101473, -12243],
			["Микроскоп", 21313, -109646],
			["Микроскоп", -4409, -156072],
			["Микроскоп", 102307, -151800],
			["Микроскоп", 74374, -177777],
			["Микроскоп", -97394, 189557],
			["Микроскоп", -138388, 152464],
			["Микроскоп", 69746, 202334],
			["Микроскоп", 16392, 197803],
			["Микроскоп", 95425, 189698],
			["Микроскоп", 1737, 164432],
			["Микроскоп", 3357, 182787],
			["Микроскоп", 126058, 160390],
			["Микроскоп", 169112, 58279],
			["Микроскоп", 190380, 30905],
			["Микроскоп", 95451, 98802],
			["Микроскоп", 78845, 52823]
			];
	for (var i = 0; i < hlam282.length; i++) {
				hlam_282 = new L.circleMarker([hlam282[i][1],hlam282[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam282[i][0])
					.bindTooltip(hlam282[i][0], {direction: 'top'})
					.addTo(hlam282icons);
			}
	}
	else {
		hlam282icons.clearLayers();
	}
}
var hlam283icons = L.layerGroup().addTo(map);
function Hlam283OnOff() {
	var chbox283;
	chbox283=document.getElementById('Hlam283Button');
	if (chbox283.checked) {
		var hlam283 = [
			["Милый маленький медвежонок", -50523, -13997],
			["Милый маленький медвежонок", -52626, -1155],
			["Милый маленький медвежонок", -29119, -49190],
			["Милый маленький медвежонок", -122984, -123478],
			["Милый маленький медвежонок", 173845, -13668],
			["Милый маленький медвежонок", -121426, -132629],
			["Милый маленький медвежонок", -74908, -178943],
			["Милый маленький медвежонок", 146840, -147868],
			["Милый маленький медвежонок", 23204, -148949],
			["Милый маленький медвежонок", -145850, 172538],
			["Милый маленький медвежонок", 181615, 149461],
			["Милый маленький медвежонок", 103211, 190812],
			["Милый маленький медвежонок", 14106, 193145],
			["Милый маленький медвежонок", -69555, 110886],
			["Милый маленький медвежонок", -127846, 86120],
			["Милый маленький медвежонок", 129144, 85592],
			["Милый маленький медвежонок", -44725, -54628],
			["Милый маленький медвежонок", 153148, -103492],
			["Милый маленький медвежонок", 18760, -123090],
			["Милый маленький медвежонок", 153109, -103477]
			];
	for (var i = 0; i < hlam283.length; i++) {
				hlam_283 = new L.circleMarker([hlam283[i][1],hlam283[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam283[i][0])
					.bindTooltip(hlam283[i][0], {direction: 'top'})
					.addTo(hlam283icons);
			}
	}
	else {
		hlam283icons.clearLayers();
	}
}
var hlam284icons = L.layerGroup().addTo(map);
function Hlam284OnOff() {
	var chbox284;
	chbox284=document.getElementById('Hlam284Button');
	if (chbox284.checked) {
		var hlam284 = [
			["Миска", -7719, -13500],
			["Миска", -7707, -13506],
			["Миска", -56612, -11140],
			["Миска", -56295, -10995],
			["Миска", -56306, -10995],
			["Миска", -52816, -12185],
			["Миска", -52868, -12144],
			["Миска", -52883, -12154],
			["Миска", -55722, -60318],
			["Миска", -40008, -58779],
			["Миска", -38487, -58658],
			["Миска", -35141, -55916],
			["Миска", -46718, -72887],
			["Миска", -76173, -69447],
			["Миска", -14287, -125500],
			["Миска", -13327, -125180],
			["Миска", -13339, -125202],
			["Миска", -101977, -129676],
			["Миска", -132119, -96498],
			["Миска", 191209, -34340],
			["Миска", 183617, -91613],
			["Миска", 149251, -76041],
			["Миска", 152913, -103900],
			["Миска", 67255, -14396],
			["Миска", 97075, -13583],
			["Миска", 51069, -19506],
			["Миска", 28390, -31042],
			["Миска", 28487, -31018],
			["Миска", 35428, -35504],
			["Миска", 35430, -35337],
			["Миска", 12082, -77938],
			["Миска", 12161, -78220],
			["Миска", 18116, -107033],
			["Миска", 20400, -108326],
			["Миска", -126434, -135322],
			["Миска", -79994, -180780],
			["Миска", -79813, -180772],
			["Миска", -79641, -180766],
			["Миска", -79760, -180797],
			["Миска", -120705, -189393],
			["Миска", -120688, -189537],
			["Миска", 193811, -169300],
			["Миска", 188847, -165980],
			["Миска", 74080, -177153],
			["Миска", -59669, 180533],
			["Миска", -60846, 181774],
			["Миска", -61329, 182175],
			["Миска", 179116, 133715],
			["Миска", 145287, 141464],
			["Миска", 93511, 189202],
			["Миска", 58781, 176681],
			["Миска", 54091, 188716],
			["Миска", 6325, 164432],
			["Миска", 88156, 157331],
			["Миска", -18108, 60345],
			["Миска", -17627, 60086],
			["Миска", -52891, 57160],
			["Миска", -55674, 4844],
			["Миска", -46813, 18447],
			["Миска", -46967, 18815],
			["Миска", -46966, 18834],
			["Миска", -98739, 8086],
			["Миска", -148387, 112043],
			["Миска", -158082, 56146],
			["Миска", 183106, 111968],
			["Миска", 133104, 126873],
			["Миска", 40028, 115563],
			["Миска", 40121, 115625],
			["Миска", 8773, 49342],
			["Миска", 8799, 49534],
			["Миска", 8853, 49510]
			];
	for (var i = 0; i < hlam284.length; i++) {
				hlam_284 = new L.circleMarker([hlam284[i][1],hlam284[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam284[i][0])
					.bindTooltip(hlam284[i][0], {direction: 'top'})
					.addTo(hlam284icons);
			}
	}
	else {
		hlam284icons.clearLayers();
	}
}
var hlam285icons = L.layerGroup().addTo(map);
function Hlam285OnOff() {
	var chbox285;
	chbox285=document.getElementById('Hlam285Button');
	if (chbox285.checked) {
		var hlam285 = [
			["Мистер Пушистик — галстук-бабочка в клеточку", -79671, -179580],
			["Мистер Пушистик — галстук-бабочка в клеточку", 145284, -153102]
			];
	for (var i = 0; i < hlam285.length; i++) {
				hlam_285 = new L.circleMarker([hlam285[i][1],hlam285[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam285[i][0])
					.bindTooltip(hlam285[i][0], {direction: 'top'})
					.addTo(hlam285icons);
			}
	}
	else {
		hlam285icons.clearLayers();
	}
}
var hlam286icons = L.layerGroup().addTo(map);
function Hlam286OnOff() {
	var chbox286;
	chbox286=document.getElementById('Hlam286Button');
	if (chbox286.checked) {
		var hlam286 = [
			["Мистер Пушистик — галстук-бабочка из карамелек", -155448, -36472],
			["Мистер Пушистик — галстук-бабочка из карамелек", 160566, -30282],
			["Мистер Пушистик — галстук-бабочка из карамелек", 148811, -13078],
			["Мистер Пушистик — галстук-бабочка из карамелек", -2373, -159830],
			["Мистер Пушистик — галстук-бабочка из карамелек", -126557, -144906],
			["Мистер Пушистик — галстук-бабочка из карамелек", -77904, -182266],
			["Мистер Пушистик — галстук-бабочка из карамелек", -76664, -175457],
			["Мистер Пушистик — галстук-бабочка из карамелек", -76446, -175660],
			["Мистер Пушистик — галстук-бабочка из карамелек", 132751, 126313],
			["Мистер Пушистик — галстук-бабочка из карамелек", 130572, 112232]
			];
	for (var i = 0; i < hlam286.length; i++) {
				hlam_286 = new L.circleMarker([hlam286[i][1],hlam286[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam286[i][0])
					.bindTooltip(hlam286[i][0], {direction: 'top'})
					.addTo(hlam286icons);
			}
	}
	else {
		hlam286icons.clearLayers();
	}
}
var hlam287icons = L.layerGroup().addTo(map);
function Hlam287OnOff() {
	var chbox287;
	chbox287=document.getElementById('Hlam287Button');
	if (chbox287.checked) {
		var hlam287 = [
			["Мистер Пушистик — золотой галстук-бабочка", -75737, -180365],
			["Мистер Пушистик — золотой галстук-бабочка", -73217, -179734]
			];
	for (var i = 0; i < hlam287.length; i++) {
				hlam_287 = new L.circleMarker([hlam287[i][1],hlam287[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam287[i][0])
					.bindTooltip(hlam287[i][0], {direction: 'top'})
					.addTo(hlam287icons);
			}
	}
	else {
		hlam287icons.clearLayers();
	}
}
var hlam288icons = L.layerGroup().addTo(map);
function Hlam288OnOff() {
	var chbox288;
	chbox288=document.getElementById('Hlam288Button');
	if (chbox288.checked) {
		var hlam288 = [
			["Мистер Пушистик — изумрудный галстук-бабочка", -79637, -182174],
			["Мистер Пушистик — изумрудный галстук-бабочка", -81496, -181791],
			["Мистер Пушистик — изумрудный галстук-бабочка", -75720, -180361],
			["Мистер Пушистик — изумрудный галстук-бабочка", -76704, -175446],
			["Мистер Пушистик — изумрудный галстук-бабочка", -76446, -175678],
			["Мистер Пушистик — изумрудный галстук-бабочка", -76788, -175075],
			["Мистер Пушистик — изумрудный галстук-бабочка", -76605, -175615]
			];
	for (var i = 0; i < hlam288.length; i++) {
				hlam_288 = new L.circleMarker([hlam288[i][1],hlam288[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam288[i][0])
					.bindTooltip(hlam288[i][0], {direction: 'top'})
					.addTo(hlam288icons);
			}
	}
	else {
		hlam288icons.clearLayers();
	}
}
var hlam289icons = L.layerGroup().addTo(map);
function Hlam289OnOff() {
	var chbox289;
	chbox289=document.getElementById('Hlam289Button');
	if (chbox289.checked) {
		var hlam289 = [
			["Мистер Пушистик — красный галстук-бабочка", -76780, -176205],
			["Мистер Пушистик — красный галстук-бабочка", -76469, -175679]
			];
	for (var i = 0; i < hlam289.length; i++) {
				hlam_289 = new L.circleMarker([hlam289[i][1],hlam289[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam289[i][0])
					.bindTooltip(hlam289[i][0], {direction: 'top'})
					.addTo(hlam289icons);
			}
	}
	else {
		hlam289icons.clearLayers();
	}
}
var hlam290icons = L.layerGroup().addTo(map);
function Hlam290OnOff() {
	var chbox290;
	chbox290=document.getElementById('Hlam290Button');
	if (chbox290.checked) {
		var hlam290 = [
			["Мистер Пушистик — лиловый галстук-бабочка", -75711, -180337],
			["Мистер Пушистик — лиловый галстук-бабочка", -75728, -180336],
			["Мистер Пушистик — лиловый галстук-бабочка", -76686, -175450],
			["Мистер Пушистик — лиловый галстук-бабочка", -76433, -175642],
			["Мистер Пушистик — лиловый галстук-бабочка", 145276, -153111]
			];
	for (var i = 0; i < hlam290.length; i++) {
				hlam_290 = new L.circleMarker([hlam290[i][1],hlam290[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam290[i][0])
					.bindTooltip(hlam290[i][0], {direction: 'top'})
					.addTo(hlam290icons);
			}
	}
	else {
		hlam290icons.clearLayers();
	}
}
var hlam291icons = L.layerGroup().addTo(map);
function Hlam291OnOff() {
	var chbox291;
	chbox291=document.getElementById('Hlam291Button');
	if (chbox291.checked) {
		var hlam291 = [
			["Мистер Пушистик — оранжевый галстук-бабочка", -80094, -182576],
			["Мистер Пушистик — оранжевый галстук-бабочка", -76766, -175277],
			["Мистер Пушистик — оранжевый галстук-бабочка", -74752, -176567]
			];
	for (var i = 0; i < hlam291.length; i++) {
				hlam_291 = new L.circleMarker([hlam291[i][1],hlam291[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam291[i][0])
					.bindTooltip(hlam291[i][0], {direction: 'top'})
					.addTo(hlam291icons);
			}
	}
	else {
		hlam291icons.clearLayers();
	}
}
var hlam292icons = L.layerGroup().addTo(map);
function Hlam292OnOff() {
	var chbox292;
	chbox292=document.getElementById('Hlam292Button');
	if (chbox292.checked) {
		var hlam292 = [
			["Мистер Пушистик — рубиновый галстук-бабочка", -74274, -182587],
			["Мистер Пушистик — рубиновый галстук-бабочка", -75130, -179511],
			["Мистер Пушистик — рубиновый галстук-бабочка", 44191, 164295],
			["Мистер Пушистик — рубиновый галстук-бабочка", -29896, 17114],
			["Мистер Пушистик — рубиновый галстук-бабочка", 87896, 1802]
			];
	for (var i = 0; i < hlam292.length; i++) {
				hlam_292 = new L.circleMarker([hlam292[i][1],hlam292[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam292[i][0])
					.bindTooltip(hlam292[i][0], {direction: 'top'})
					.addTo(hlam292icons);
			}
	}
	else {
		hlam292icons.clearLayers();
	}
}
var hlam293icons = L.layerGroup().addTo(map);
function Hlam293OnOff() {
	var chbox293;
	chbox293=document.getElementById('Hlam293Button');
	if (chbox293.checked) {
		var hlam293 = [
			["Мистер Пушистик — серебристый галстук-бабочка", -152100, -73888],
			["Мистер Пушистик — серебристый галстук-бабочка", 115476, -63342],
			["Мистер Пушистик — серебристый галстук-бабочка", -82729, -181805],
			["Мистер Пушистик — серебристый галстук-бабочка", -75730, -180352],
			["Мистер Пушистик — серебристый галстук-бабочка", -76640, -175480],
			["Мистер Пушистик — серебристый галстук-бабочка", -76481, -175662],
			["Мистер Пушистик — серебристый галстук-бабочка", -76638, -175597],
			["Мистер Пушистик — серебристый галстук-бабочка", 15473, 49934],
			["Мистер Пушистик — серебристый галстук-бабочка", 94513, -3955]
			];
	for (var i = 0; i < hlam293.length; i++) {
				hlam_293 = new L.circleMarker([hlam293[i][1],hlam293[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam293[i][0])
					.bindTooltip(hlam293[i][0], {direction: 'top'})
					.addTo(hlam293icons);
			}
	}
	else {
		hlam293icons.clearLayers();
	}
}
var hlam294icons = L.layerGroup().addTo(map);
function Hlam294OnOff() {
	var chbox294;
	chbox294=document.getElementById('Hlam294Button');
	if (chbox294.checked) {
		var hlam294 = [
			["Мишка цвета жвачки", -54974, -9904],
			["Мишка цвета жвачки", -44244, -7653],
			["Мишка цвета жвачки", -120053, -14244],
			["Мишка цвета жвачки", -17355, -46448],
			["Мишка цвета жвачки", -55416, -59655],
			["Мишка цвета жвачки", -47297, -50625],
			["Мишка цвета жвачки", -91277, -42847],
			["Мишка цвета жвачки", -148124, -58302],
			["Мишка цвета жвачки", 195241, -31532],
			["Мишка цвета жвачки", 173871, -13701],
			["Мишка цвета жвачки", 142695, -59829],
			["Мишка цвета жвачки", 183550, -92878],
			["Мишка цвета жвачки", 142182, -123872],
			["Мишка цвета жвачки", 101949, -29390],
			["Мишка цвета жвачки", 93543, -14180],
			["Мишка цвета жвачки", 96399, -13897],
			["Мишка цвета жвачки", 92604, -9977],
			["Мишка цвета жвачки", 97934, -5312],
			["Мишка цвета жвачки", 5870, -59043],
			["Мишка цвета жвачки", 79227, -75030],
			["Мишка цвета жвачки", 60886, -96554],
			["Мишка цвета жвачки", 93339, -111762],
			["Мишка цвета жвачки", 145981, -146180],
			["Мишка цвета жвачки", -93862, 180633],
			["Мишка цвета жвачки", -144747, 154437],
			["Мишка цвета жвачки", -143342, 157358],
			["Мишка цвета жвачки", 150663, 134395],
			["Мишка цвета жвачки", 87762, 157091],
			["Мишка цвета жвачки", -59703, 88958],
			["Мишка цвета жвачки", -47068, 20607],
			["Мишка цвета жвачки", -130650, 9661],
			["Мишка цвета жвачки", -154904, 51502],
			["Мишка цвета жвачки", -132245, 11107],
			["Мишка цвета жвачки", 133734, 85889],
			["Мишка цвета жвачки", 202580, 54484],
			["Мишка цвета жвачки", 202581, 54658],
			["Мишка цвета жвачки", 20061, 91060],
			["Мишка цвета жвачки", 7298, 43486],
			["Мишка цвета жвачки", 17056, 41776],
			["Мишка цвета жвачки", 16953, 45516],
			["Мишка цвета жвачки", 16414, 45880],
			["Мишка цвета жвачки", 93464, 9940],
			["Мишка цвета жвачки", -21281, 16429],
			["Мишка цвета жвачки", 138308, 19349],
			["Мишка цвета жвачки", 20872, 131476],
			["Мишка цвета жвачки", -132017, -145234],
			["Мишка цвета жвачки", -29078, -49186]
			];
	for (var i = 0; i < hlam294.length; i++) {
				hlam_294 = new L.circleMarker([hlam294[i][1],hlam294[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam294[i][0])
					.bindTooltip(hlam294[i][0], {direction: 'top'})
					.addTo(hlam294icons);
			}
	}
	else {
		hlam294icons.clearLayers();
	}
}
var hlam295icons = L.layerGroup().addTo(map);
function Hlam295OnOff() {
	var chbox295;
	chbox295=document.getElementById('Hlam295Button');
	if (chbox295.checked) {
		var hlam295 = [
			["Мишка-неуклюжка", -55846, -11113],
			["Мишка-неуклюжка", -42329, -5565],
			["Мишка-неуклюжка", -21567, -57837],
			["Мишка-неуклюжка", -56678, -45534],
			["Мишка-неуклюжка", -116275, -74462],
			["Мишка-неуклюжка", -155527, -36591],
			["Мишка-неуклюжка", 193425, -34533],
			["Мишка-неуклюжка", 138796, -53795],
			["Мишка-неуклюжка", 35433, -35375],
			["Мишка-неуклюжка", 35421, -35363],
			["Мишка-неуклюжка", 35904, -35160],
			["Мишка-неуклюжка", -27505, -131501],
			["Мишка-неуклюжка", 141527, -144780],
			["Мишка-неуклюжка", -36166, 120089],
			["Мишка-неуклюжка", -69555, 110898],
			["Мишка-неуклюжка", 202577, 54612],
			["Мишка-неуклюжка", 162587, 206779]
			];
	for (var i = 0; i < hlam295.length; i++) {
				hlam_295 = new L.circleMarker([hlam295[i][1],hlam295[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam295[i][0])
					.bindTooltip(hlam295[i][0], {direction: 'top'})
					.addTo(hlam295icons);
			}
	}
	else {
		hlam295icons.clearLayers();
	}
}
var hlam296icons = L.layerGroup().addTo(map);
function Hlam296OnOff() {
	var chbox296;
	chbox296=document.getElementById('Hlam296Button');
	if (chbox296.checked) {
		var hlam296 = [
			["Модель &quotМистер Помощник&quot", 135945, -156503],
			["Модель &quotМистер Помощник&quot", 152872, 161739]
			];
	for (var i = 0; i < hlam296.length; i++) {
				hlam_296 = new L.circleMarker([hlam296[i][1],hlam296[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam296[i][0])
					.bindTooltip(hlam296[i][0], {direction: 'top'})
					.addTo(hlam296icons);
			}
	}
	else {
		hlam296icons.clearLayers();
	}
}
var hlam297icons = L.layerGroup().addTo(map);
function Hlam297OnOff() {
	var chbox297;
	chbox297=document.getElementById('Hlam297Button');
	if (chbox297.checked) {
		var hlam297 = [

			];
	for (var i = 0; i < hlam297.length; i++) {
				hlam_297 = new L.circleMarker([hlam297[i][1],hlam297[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam297[i][0])
					.bindTooltip(hlam297[i][0], {direction: 'top'})
					.addTo(hlam297icons);
			}
	}
	else {
		hlam297icons.clearLayers();
	}
}
var hlam298icons = L.layerGroup().addTo(map);
function Hlam298OnOff() {
	var chbox298;
	chbox298=document.getElementById('Hlam298Button');
	if (chbox298.checked) {
		var hlam298 = [
			["Модель &quotПротектрон&quot", -56313, -78580],
			["Модель &quotПротектрон&quot", -91556, 176687]
			];
	for (var i = 0; i < hlam298.length; i++) {
				hlam_298 = new L.circleMarker([hlam298[i][1],hlam298[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam298[i][0])
					.bindTooltip(hlam298[i][0], {direction: 'top'})
					.addTo(hlam298icons);
			}
	}
	else {
		hlam298icons.clearLayers();
	}
}
var hlam299icons = L.layerGroup().addTo(map);
function Hlam299OnOff() {
	var chbox299;
	chbox299=document.getElementById('Hlam299Button');
	if (chbox299.checked) {
		var hlam299 = [
			["Модель из деталей робота", 43498, 161178]
			];
	for (var i = 0; i < hlam299.length; i++) {
				hlam_299 = new L.circleMarker([hlam299[i][1],hlam299[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam299[i][0])
					.bindTooltip(hlam299[i][0], {direction: 'top'})
					.addTo(hlam299icons);
			}
	}
	else {
		hlam299icons.clearLayers();
	}
}
var hlam300icons = L.layerGroup().addTo(map);
function Hlam300OnOff() {
	var chbox300;
	chbox300=document.getElementById('Hlam300Button');
	if (chbox300.checked) {
		var hlam300 = [

			];
	for (var i = 0; i < hlam300.length; i++) {
				hlam_300 = new L.circleMarker([hlam300[i][1],hlam300[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam300[i][0])
					.bindTooltip(hlam300[i][0], {direction: 'top'})
					.addTo(hlam300icons);
			}
	}
	else {
		hlam300icons.clearLayers();
	}
}