var hlam301icons = L.layerGroup().addTo(map);
function Hlam301OnOff() {
	var chbox301;
	chbox301=document.getElementById('Hlam301Button');
	if (chbox301.checked) {
		var hlam301 = [

			];
	for (var i = 0; i < hlam301.length; i++) {
				hlam_301 = new L.circleMarker([hlam301[i][1],hlam301[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam301[i][0])
					.bindTooltip(hlam301[i][0], {direction: 'top'})
					.addTo(hlam301icons);
			}
	}
	else {
		hlam301icons.clearLayers();
	}
}
var hlam302icons = L.layerGroup().addTo(map);
function Hlam302OnOff() {
	var chbox302;
	chbox302=document.getElementById('Hlam302Button');
	if (chbox302.checked) {
		var hlam302 = [

			];
	for (var i = 0; i < hlam302.length; i++) {
				hlam_302 = new L.circleMarker([hlam302[i][1],hlam302[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam302[i][0])
					.bindTooltip(hlam302[i][0], {direction: 'top'})
					.addTo(hlam302icons);
			}
	}
	else {
		hlam302icons.clearLayers();
	}
}
var hlam303icons = L.layerGroup().addTo(map);
function Hlam303OnOff() {
	var chbox303;
	chbox303=document.getElementById('Hlam303Button');
	if (chbox303.checked) {
		var hlam303 = [

			];
	for (var i = 0; i < hlam303.length; i++) {
				hlam_303 = new L.circleMarker([hlam303[i][1],hlam303[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam303[i][0])
					.bindTooltip(hlam303[i][0], {direction: 'top'})
					.addTo(hlam303icons);
			}
	}
	else {
		hlam303icons.clearLayers();
	}
}
var hlam304icons = L.layerGroup().addTo(map);
function Hlam304OnOff() {
	var chbox304;
	chbox304=document.getElementById('Hlam304Button');
	if (chbox304.checked) {
		var hlam304 = [
			["Модная щетка для волос", -51282, -13341],
			["Модная щетка для волос", -42370, -5244],
			["Модная щетка для волос", -51367, -3550],
			["Модная щетка для волос", -53024, -1186],
			["Модная щетка для волос", -56208, -61282],
			["Модная щетка для волос", -46281, -50090],
			["Модная щетка для волос", -13245, -66128],
			["Модная щетка для волос", -63754, -103038],
			["Модная щетка для волос", -61138, -100411],
			["Модная щетка для волос", -47592, -101655],
			["Модная щетка для волос", -147844, -56915],
			["Модная щетка для волос", -151214, -71607],
			["Модная щетка для волос", 181092, -123629],
			["Модная щетка для волос", 179868, -122212],
			["Модная щетка для волос", 101454, -11551],
			["Модная щетка для волос", 77240, -15409],
			["Модная щетка для волос", 91612, -59169],
			["Модная щетка для волос", 16714, -82050],
			["Модная щетка для волос", 159623, -162216],
			["Модная щетка для волос", -71522, 198436],
			["Модная щетка для волос", -95615, 184419],
			["Модная щетка для волос", -142946, 137848],
			["Модная щетка для волос", 170674, 240399],
			["Модная щетка для волос", 150340, 134816],
			["Модная щетка для волос", 150516, 134997],
			["Модная щетка для волос", 105134, 156947],
			["Модная щетка для волос", 2245, 137452],
			["Модная щетка для волос", -104695, 123051],
			["Модная щетка для волос", -47749, 2562],
			["Модная щетка для волос", -47675, 2196],
			["Модная щетка для волос", -41405, 2864],
			["Модная щетка для волос", -38725, 3585],
			["Модная щетка для волос", -50910, 6785],
			["Модная щетка для волос", 162789, 62552],
			["Модная щетка для волос", 138350, 19348],
			["Модная щетка для волос", 33306, 129144],
			["Модная щетка для волос", -148118, -58311]
			];
	for (var i = 0; i < hlam304.length; i++) {
				hlam_304 = new L.circleMarker([hlam304[i][1],hlam304[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam304[i][0])
					.bindTooltip(hlam304[i][0], {direction: 'top'})
					.addTo(hlam304icons);
			}
	}
	else {
		hlam304icons.clearLayers();
	}
}
var hlam305icons = L.layerGroup().addTo(map);
function Hlam305OnOff() {
	var chbox305;
	chbox305=document.getElementById('Hlam305Button');
	if (chbox305.checked) {
		var hlam305 = [
			["Молоток", 139250, -1210],
			["Молоток", 131433, -132060]
			];
	for (var i = 0; i < hlam305.length; i++) {
				hlam_305 = new L.circleMarker([hlam305[i][1],hlam305[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam305[i][0])
					.bindTooltip(hlam305[i][0], {direction: 'top'})
					.addTo(hlam305icons);
			}
	}
	else {
		hlam305icons.clearLayers();
	}
}
var hlam306icons = L.layerGroup().addTo(map);
function Hlam306OnOff() {
	var chbox306;
	chbox306=document.getElementById('Hlam306Button');
	if (chbox306.checked) {
		var hlam306 = [
			["Молоток с шаровым бойком", -1553, -5434],
			["Молоток с шаровым бойком", -47025, -20880],
			["Молоток с шаровым бойком", -77663, -21751],
			["Молоток с шаровым бойком", -123484, -17182],
			["Молоток с шаровым бойком", -3594, -44921],
			["Молоток с шаровым бойком", -802, -34790],
			["Молоток с шаровым бойком", -38544, -59019],
			["Молоток с шаровым бойком", -55346, -48067],
			["Молоток с шаровым бойком", -59045, -39717],
			["Молоток с шаровым бойком", -119326, -46888],
			["Молоток с шаровым бойком", -29625, -94427],
			["Молоток с шаровым бойком", -29347, -86983],
			["Молоток с шаровым бойком", -35199, -82763],
			["Молоток с шаровым бойком", -34711, -84323],
			["Молоток с шаровым бойком", -34657, -83092],
			["Молоток с шаровым бойком", -40809, -74470],
			["Молоток с шаровым бойком", -40822, -74523],
			["Молоток с шаровым бойком", -40880, -74523],
			["Молоток с шаровым бойком", -40921, -74515],
			["Молоток с шаровым бойком", -40876, -74538],
			["Молоток с шаровым бойком", -47195, -72243],
			["Молоток с шаровым бойком", -71489, -69390],
			["Молоток с шаровым бойком", -97931, -126168],
			["Молоток с шаровым бойком", -79129, -105301],
			["Молоток с шаровым бойком", -104604, -120332],
			["Молоток с шаровым бойком", -101857, -115081],
			["Молоток с шаровым бойком", -149049, -57915],
			["Молоток с шаровым бойком", -148163, -57703],
			["Молоток с шаровым бойком", -155675, -36250],
			["Молоток с шаровым бойком", -168211, -42097],
			["Молоток с шаровым бойком", -151302, -74848],
			["Молоток с шаровым бойком", -151811, -73696],
			["Молоток с шаровым бойком", -147551, -125304],
			["Молоток с шаровым бойком", -150909, -102078],
			["Молоток с шаровым бойком", -164105, -128877],
			["Молоток с шаровым бойком", -168087, -112462],
			["Молоток с шаровым бойком", 194406, -31275],
			["Молоток с шаровым бойком", 167199, -25191],
			["Молоток с шаровым бойком", 180337, -11732],
			["Молоток с шаровым бойком", 139022, -1004],
			["Молоток с шаровым бойком", 184266, -92713],
			["Молоток с шаровым бойком", 202847, -126273],
			["Молоток с шаровым бойком", 172027, -121945],
			["Молоток с шаровым бойком", 130760, -31776],
			["Молоток с шаровым бойком", 127974, -24857],
			["Молоток с шаровым бойком", 104929, -20599],
			["Молоток с шаровым бойком", 88944, -31282],
			["Молоток с шаровым бойком", 92233, -31689],
			["Молоток с шаровым бойком", 91899, -28244],
			["Молоток с шаровым бойком", 84674, -19203],
			["Молоток с шаровым бойком", 92975, -13380],
			["Молоток с шаровым бойком", 79888, -11030],
			["Молоток с шаровым бойком", 90049, -9376],
			["Молоток с шаровым бойком", 75264, -7819],
			["Молоток с шаровым бойком", 89017, -5926],
			["Молоток с шаровым бойком", 95209, -8169],
			["Молоток с шаровым бойком", 80430, -3913],
			["Молоток с шаровым бойком", 108093, -54981],
			["Молоток с шаровым бойком", 62045, -58543],
			["Молоток с шаровым бойком", 24977, -63609],
			["Молоток с шаровым бойком", 22583, -60528],
			["Молоток с шаровым бойком", 29228, -58634],
			["Молоток с шаровым бойком", 101595, -98485],
			["Молоток с шаровым бойком", 63100, -116043],
			["Молоток с шаровым бойком", 15773, -107651],
			["Молоток с шаровым бойком", 20275, -103923],
			["Молоток с шаровым бойком", 25738, -104423],
			["Молоток с шаровым бойком", -6841, -161126],
			["Молоток с шаровым бойком", -41722, -135671],
			["Молоток с шаровым бойком", -93730, -163430],
			["Молоток с шаровым бойком", -93507, -131157],
			["Молоток с шаровым бойком", -117451, -136432],
			["Молоток с шаровым бойком", -24976, -172433],
			["Молоток с шаровым бойком", -43298, -174060],
			["Молоток с шаровым бойком", -62623, -170692],
			["Молоток с шаровым бойком", -83265, -179197],
			["Молоток с шаровым бойком", -120401, -189783],
			["Молоток с шаровым бойком", 165011, -150499],
			["Молоток с шаровым бойком", 131123, -131822],
			["Молоток с шаровым бойком", 189966, -169498],
			["Молоток с шаровым бойком", 189659, -169412],
			["Молоток с шаровым бойком", 195579, -168566],
			["Молоток с шаровым бойком", 196041, -168547],
			["Молоток с шаровым бойком", 189010, -165232],
			["Молоток с шаровым бойком", 115349, -157754],
			["Молоток с шаровым бойком", 52088, -149153],
			["Молоток с шаровым бойком", 19480, -142145],
			["Молоток с шаровым бойком", 76645, -179725],
			["Молоток с шаровым бойком", 75481, -174752],
			["Молоток с шаровым бойком", 75454, -173402],
			["Молоток с шаровым бойком", -4725, 185412],
			["Молоток с шаровым бойком", -13410, 189403],
			["Молоток с шаровым бойком", -60272, 181104],
			["Молоток с шаровым бойком", -89252, 179731],
			["Молоток с шаровым бойком", -93211, 183883],
			["Молоток с шаровым бойком", -92899, 183884],
			["Молоток с шаровым бойком", -91570, 183450],
			["Молоток с шаровым бойком", -88927, 185179],
			["Молоток с шаровым бойком", -1721, 158470],
			["Молоток с шаровым бойком", -16694, 163704],
			["Молоток с шаровым бойком", -3942, 161416],
			["Молоток с шаровым бойком", -41344, 161434],
			["Молоток с шаровым бойком", -40919, 161291],
			["Молоток с шаровым бойком", -109648, 132907],
			["Молоток с шаровым бойком", -109667, 157750],
			["Молоток с шаровым бойком", -163385, 142001],
			["Молоток с шаровым бойком", -140952, 142242],
			["Молоток с шаровым бойком", -163012, 156963],
			["Молоток с шаровым бойком", 188939, 229997],
			["Молоток с шаровым бойком", 169480, 239720],
			["Молоток с шаровым бойком", 151006, 178134],
			["Молоток с шаровым бойком", 156656, 184604],
			["Молоток с шаровым бойком", 153349, 140089],
			["Молоток с шаровым бойком", 136929, 145392],
			["Молоток с шаровым бойком", 151082, 161166],
			["Молоток с шаровым бойком", 79584, 180303],
			["Молоток с шаровым бойком", 62336, 172984],
			["Молоток с шаровым бойком", 6205, 164155],
			["Молоток с шаровым бойком", 10872, 184048],
			["Молоток с шаровым бойком", 72012, 138151],
			["Молоток с шаровым бойком", 88558, 156962],
			["Молоток с шаровым бойком", 20535, 134723],
			["Молоток с шаровым бойком", 2672, 163107],
			["Молоток с шаровым бойком", 2093, 163429],
			["Молоток с шаровым бойком", 3828, 160241],
			["Молоток с шаровым бойком", 7075, 162405],
			["Молоток с шаровым бойком", -59698, 122544],
			["Молоток с шаровым бойком", -129149, 119526],
			["Молоток с шаровым бойком", -129232, 119027],
			["Молоток с шаровым бойком", -129060, 119929],
			["Молоток с шаровым бойком", -129547, 119508],
			["Молоток с шаровым бойком", -49666, 86312],
			["Молоток с шаровым бойком", -33431, 92400],
			["Молоток с шаровым бойком", -87796, 67757],
			["Молоток с шаровым бойком", -102611, 84498],
			["Молоток с шаровым бойком", -54738, 57817],
			["Молоток с шаровым бойком", -85968, 65138],
			["Молоток с шаровым бойком", -104029, 38682],
			["Молоток с шаровым бойком", -46973, 2330],
			["Молоток с шаровым бойком", -48338, 3954],
			["Молоток с шаровым бойком", -58760, 12567],
			["Молоток с шаровым бойком", -47803, 15322],
			["Молоток с шаровым бойком", -70997, 25444],
			["Молоток с шаровым бойком", -119288, 3386],
			["Молоток с шаровым бойком", -118529, 744],
			["Молоток с шаровым бойком", -98515, 7603],
			["Молоток с шаровым бойком", -148852, 113205],
			["Молоток с шаровым бойком", -153857, 129587],
			["Молоток с шаровым бойком", -143936, 73564],
			["Молоток с шаровым бойком", -138777, 90748],
			["Молоток с шаровым бойком", -160311, 13642],
			["Молоток с шаровым бойком", 182457, 110602],
			["Молоток с шаровым бойком", 182802, 110692],
			["Молоток с шаровым бойком", 161660, 112835],
			["Молоток с шаровым бойком", 136098, 124135],
			["Молоток с шаровым бойком", 134840, 127160],
			["Молоток с шаровым бойком", 139970, 73322],
			["Молоток с шаровым бойком", 198074, 46725],
			["Молоток с шаровым бойком", 170864, 1564],
			["Молоток с шаровым бойком", 183607, 3024],
			["Молоток с шаровым бойком", 183757, 2934],
			["Молоток с шаровым бойком", 185925, 15313],
			["Молоток с шаровым бойком", 131801, 11813],
			["Молоток с шаровым бойком", 57954, 108283],
			["Молоток с шаровым бойком", 35806, 124592],
			["Молоток с шаровым бойком", 1352, 100207],
			["Молоток с шаровым бойком", 197, 128507],
			["Молоток с шаровым бойком", 54957, 95509],
			["Молоток с шаровым бойком", 109734, 57182],
			["Молоток с шаровым бойком", 111535, 58495],
			["Молоток с шаровым бойком", 80051, 55698],
			["Молоток с шаровым бойком", 16984, 45558],
			["Молоток с шаровым бойком", 16703, 45066],
			["Молоток с шаровым бойком", 20060, 50652],
			["Молоток с шаровым бойком", 103310, 3902],
			["Молоток с шаровым бойком", 84464, 679],
			["Молоток с шаровым бойком", 95159, 6798],
			["Молоток с шаровым бойком", 83112, 15410],
			["Молоток с шаровым бойком", 55278, 8403],
			["Молоток с шаровым бойком", -93392, -83541]
			];
	for (var i = 0; i < hlam306.length; i++) {
				hlam_306 = new L.circleMarker([hlam306[i][1],hlam306[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam306[i][0])
					.bindTooltip(hlam306[i][0], {direction: 'top'})
					.addTo(hlam306icons);
			}
	}
	else {
		hlam306icons.clearLayers();
	}
}
var hlam307icons = L.layerGroup().addTo(map);
function Hlam307OnOff() {
	var chbox307;
	chbox307=document.getElementById('Hlam307Button');
	if (chbox307.checked) {
		var hlam307 = [
			["Мотыга", -54179, -9598],
			["Мотыга", -60151, -3092],
			["Мотыга", -77584, -21769],
			["Мотыга", -35061, -55861],
			["Мотыга", -128935, -119461],
			["Мотыга", -149844, -99351],
			["Мотыга", 181527, -130154],
			["Мотыга", 107454, -23155],
			["Мотыга", 90375, -9908],
			["Мотыга", 29851, -21452],
			["Мотыга", 29115, -58376],
			["Мотыга", 25864, -104559],
			["Мотыга", 176290, -133383],
			["Мотыга", 136586, -162882],
			["Мотыга", 143778, -145642],
			["Мотыга", -59947, 177621],
			["Мотыга", 125446, 169880],
			["Мотыга", 105120, 156918],
			["Мотыга", -51407, 6205],
			["Мотыга", -44001, 6696],
			["Мотыга", -42046, 12108],
			["Мотыга", -137629, 106446],
			["Мотыга", -137649, 105813]
			];
	for (var i = 0; i < hlam307.length; i++) {
				hlam_307 = new L.circleMarker([hlam307[i][1],hlam307[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam307[i][0])
					.bindTooltip(hlam307[i][0], {direction: 'top'})
					.addTo(hlam307icons);
			}
	}
	else {
		hlam307icons.clearLayers();
	}
}
var hlam308icons = L.layerGroup().addTo(map);
function Hlam308OnOff() {
	var chbox308;
	chbox308=document.getElementById('Hlam308Button');
	if (chbox308.checked) {
		var hlam308 = [
			["Мощный магнит", -150639, -101427],
			["Мощный магнит", 100775, -15123],
			["Мощный магнит", 89899, -10611],
			["Мощный магнит", -82126, -161114],
			["Мощный магнит", -108597, -187351],
			["Мощный магнит", -97887, 200136],
			["Мощный магнит", -157003, 190930],
			["Мощный магнит", 15746, 197733],
			["Мощный магнит", 93569, 190619],
			["Мощный магнит", -56151, 10553],
			["Мощный магнит", -48956, 27374],
			["Мощный магнит", -46715, 27121]
			];
	for (var i = 0; i < hlam308.length; i++) {
				hlam_308 = new L.circleMarker([hlam308[i][1],hlam308[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam308[i][0])
					.bindTooltip(hlam308[i][0], {direction: 'top'})
					.addTo(hlam308icons);
			}
	}
	else {
		hlam308icons.clearLayers();
	}
}
var hlam309icons = L.layerGroup().addTo(map);
function Hlam309OnOff() {
	var chbox309;
	chbox309=document.getElementById('Hlam309Button');
	if (chbox309.checked) {
		var hlam309 = [
			["Мыло", -55362, -9570],
			["Мыло", -42361, -5259],
			["Мыло", -53468, -1282],
			["Мыло", -40197, -3285],
			["Мыло", -72286, -7289],
			["Мыло", -20443, -44224],
			["Мыло", -56401, -60207],
			["Мыло", -46316, -50052],
			["Мыло", -5092, -90649],
			["Мыло", -5150, -90663],
			["Мыло", -5138, -90634],
			["Мыло", -5120, -90650],
			["Мыло", -5159, -90618],
			["Мыло", -5166, -90633],
			["Мыло", -5128, -90638],
			["Мыло", -5164, -90663],
			["Мыло", -5105, -90672],
			["Мыло", -5114, -90652],
			["Мыло", -5101, -90638],
			["Мыло", -5115, -90638],
			["Мыло", -5145, -90634],
			["Мыло", -5135, -90634],
			["Мыло", -5110, -90664],
			["Мыло", -5135, -90641],
			["Мыло", -5135, -90658],
			["Мыло", -5099, -90656],
			["Мыло", -5095, -90673],
			["Мыло", -5105, -90652],
			["Мыло", -5088, -90664],
			["Мыло", -5088, -90650],
			["Мыло", -5094, -90658],
			["Мыло", -5085, -90656],
			["Мыло", -12547, -69909],
			["Мыло", -62051, -129255],
			["Мыло", -63715, -103000],
			["Мыло", -61136, -100066],
			["Мыло", -69931, -104519],
			["Мыло", -70075, -104475],
			["Мыло", -112235, -122530],
			["Мыло", -111459, -121933],
			["Мыло", -147889, -57441],
			["Мыло", -148161, -58730],
			["Мыло", -148253, -57069],
			["Мыло", -152244, -75254],
			["Мыло", -152068, -75190],
			["Мыло", -151838, -74780],
			["Мыло", -151122, -75240],
			["Мыло", -151122, -74490],
			["Мыло", -131322, -113393],
			["Мыло", 167410, -26323],
			["Мыло", 167512, -617],
			["Мыло", 167266, -211],
			["Мыло", 167594, -166],
			["Мыло", 149125, -52410],
			["Мыло", 183772, -93456],
			["Мыло", 101386, -12278],
			["Мыло", 105676, -7052],
			["Мыло", 105489, -7098],
			["Мыло", 89521, -8754],
			["Мыло", 84536, -1962],
			["Мыло", 28196, -31083],
			["Мыло", 91771, -59351],
			["Мыло", 24581, -63758],
			["Мыло", 24653, -63759],
			["Мыло", 29134, -58113],
			["Мыло", 8913, -82199],
			["Мыло", 13706, -107142],
			["Мыло", 19823, -104349],
			["Мыло", 20152, -104072],
			["Мыло", 29620, -101334],
			["Мыло", -119334, -135752],
			["Мыло", -133864, -153855],
			["Мыло", -134184, -153864],
			["Мыло", 164505, -149076],
			["Мыло", 164495, -149071],
			["Мыло", 164480, -149070],
			["Мыло", 164487, -149074],
			["Мыло", 164501, -149066],
			["Мыло", 164496, -149080],
			["Мыло", 164501, -149089],
			["Мыло", 73566, -179340],
			["Мыло", 73563, -179323],
			["Мыло", 74407, -176992],
			["Мыло", 74405, -176731],
			["Мыло", -61100, 179908],
			["Мыло", -60113, 182165],
			["Мыло", -92972, 183323],
			["Мыло", -7063, 146409],
			["Мыло", -2113, 157406],
			["Мыло", -41299, 161165],
			["Мыло", -160797, 151890],
			["Мыло", -138621, 153515],
			["Мыло", -138620, 153539],
			["Мыло", 150025, 135115],
			["Мыло", 150508, 134961],
			["Мыло", 148789, 135760],
			["Мыло", 152357, 138509],
			["Мыло", 70254, 201776],
			["Мыло", 26619, 171963],
			["Мыло", 26613, 171989],
			["Мыло", 111123, 157819],
			["Мыло", 85846, 151491],
			["Мыло", 86159, 151907],
			["Мыло", 1957, 138521],
			["Мыло", 287, 160080],
			["Мыло", 6646, 161159],
			["Мыло", -128067, 84563],
			["Мыло", -37505, 49667],
			["Мыло", -47506, 2347],
			["Мыло", -47507, 2335],
			["Мыло", -47855, 2273],
			["Мыло", -47717, 2155],
			["Мыло", -41411, 2856],
			["Мыло", -38087, 4772],
			["Мыло", -44104, 28280],
			["Мыло", -98770, 7726],
			["Мыло", -98676, 7331],
			["Мыло", 133948, 85308],
			["Мыло", 168868, 56039],
			["Мыло", 169001, 59530],
			["Мыло", 96926, 104762],
			["Мыло", 93734, 106666],
			["Мыло", 34643, 128689],
			["Мыло", 29191, 53922],
			["Мыло", 77250, 21037],
			["Мыло", 59014, 12191],
			["Мыло", 58674, 10332],
			["Мыло", -68431, 195648],
			["Мыло", -104375, 123351],
			["Мыло", -148135, -58309]
			];
	for (var i = 0; i < hlam309.length; i++) {
				hlam_309 = new L.circleMarker([hlam309[i][1],hlam309[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam309[i][0])
					.bindTooltip(hlam309[i][0], {direction: 'top'})
					.addTo(hlam309icons);
			}
	}
	else {
		hlam309icons.clearLayers();
	}
}
var hlam310icons = L.layerGroup().addTo(map);
function Hlam310OnOff() {
	var chbox310;
	chbox310=document.getElementById('Hlam310Button');
	if (chbox310.checked) {
		var hlam310 = [
			["Мягкая подушка", -52051, -13575],
			["Мягкая подушка", -13597, -66477],
			["Мягкая подушка", -13599, -66475],
			["Мягкая подушка", -70337, -104189],
			["Мягкая подушка", 182921, -93485],
			["Мягкая подушка", 29383, -58713],
			["Мягкая подушка", 29398, -58753],
			["Мягкая подушка", 125506, -99477],
			["Мягкая подушка", 20809, -109752],
			["Мягкая подушка", -47455, 1551]
			];
	for (var i = 0; i < hlam310.length; i++) {
				hlam_310 = new L.circleMarker([hlam310[i][1],hlam310[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam310[i][0])
					.bindTooltip(hlam310[i][0], {direction: 'top'})
					.addTo(hlam310icons);
			}
	}
	else {
		hlam310icons.clearLayers();
	}
}
var hlam311icons = L.layerGroup().addTo(map);
function Hlam311OnOff() {
	var chbox311;
	chbox311=document.getElementById('Hlam311Button');
	if (chbox311.checked) {
		var hlam311 = [
			["Мяч", -55191, -10967],
			["Мяч", -47476, -50778],
			["Мяч", -150831, -73351],
			["Мяч", 189534, -27163],
			["Мяч", 148935, -46466],
			["Мяч", 148878, -46479],
			["Мяч", 148851, -46462],
			["Мяч", 148910, -46422],
			["Мяч", 148890, -46437],
			["Мяч", 148864, -46438],
			["Мяч", 148878, -46414],
			["Мяч", 148889, -46458],
			["Мяч", 148865, -46471],
			["Мяч", 148862, -46442],
			["Мяч", 148883, -46407],
			["Мяч", 148908, -46426],
			["Мяч", 198047, -128612],
			["Мяч", 198027, -128577],
			["Мяч", 197784, -127975],
			["Мяч", 202556, -127262],
			["Мяч", 202546, -127248],
			["Мяч", 127452, -26567],
			["Мяч", 115393, -62841],
			["Мяч", 50492, -43837],
			["Мяч", 30874, -62496],
			["Мяч", 13876, -75395],
			["Мяч", 15454, -76828],
			["Мяч", 28020, -102669],
			["Мяч", -75435, -182298],
			["Мяч", -44407, 8247],
			["Мяч", 130992, 74333],
			["Мяч", 27796, 47417],
			["Мяч", 57716, 13836]
			];
	for (var i = 0; i < hlam311.length; i++) {
				hlam_311 = new L.circleMarker([hlam311[i][1],hlam311[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam311[i][0])
					.bindTooltip(hlam311[i][0], {direction: 'top'})
					.addTo(hlam311icons);
			}
	}
	else {
		hlam311icons.clearLayers();
	}
}
var hlam312icons = L.layerGroup().addTo(map);
function Hlam312OnOff() {
	var chbox312;
	chbox312=document.getElementById('Hlam312Button');
	if (chbox312.checked) {
		var hlam312 = [
			["Мяч &quotАтомных гонок&quot", -108741, -23262],
			["Мяч &quotАтомных гонок&quot", -73883, -180158],
			["Мяч &quotАтомных гонок&quot", -74210, -179856],
			["Мяч &quotАтомных гонок&quot", -74060, -179723],
			["Мяч &quotАтомных гонок&quot", -73969, -179902],
			["Мяч &quotАтомных гонок&quot", -74147, -179895],
			["Мяч &quotАтомных гонок&quot", -74170, -179907],
			["Мяч &quotАтомных гонок&quot", -73993, -179905],
			["Мяч &quotАтомных гонок&quot", -73833, -179919],
			["Мяч &quotАтомных гонок&quot", -73832, -179912],
			["Мяч &quotАтомных гонок&quot", -74241, -179905],
			["Мяч &quotАтомных гонок&quot", -74240, -179897],
			["Мяч &quotАтомных гонок&quot", 140335, -145973],
			["Мяч &quotАтомных гонок&quot", 139829, -146381],
			["Мяч &quotАтомных гонок&quot", 140107, -145678],
			["Мяч &quotАтомных гонок&quot", 140123, -145583],
			["Мяч &quotАтомных гонок&quot", 140116, -145581],
			["Мяч &quotАтомных гонок&quot", 140059, -145799],
			["Мяч &quotАтомных гонок&quot", 139836, -145813],
			["Мяч &quotАтомных гонок&quot", 140091, -145931],
			["Мяч &quotАтомных гонок&quot", 139986, -146028],
			["Мяч &quotАтомных гонок&quot", 140000, -146030],
			["Мяч &quotАтомных гонок&quot", 139978, -146086],
			["Мяч &quotАтомных гонок&quot", 139967, -146145],
			["Мяч &quotАтомных гонок&quot", 139974, -146149],
			["Мяч &quotАтомных гонок&quot", -97106, 184052],
			["Мяч &quotАтомных гонок&quot", -97104, 184062],
			["Мяч &quotАтомных гонок&quot", -97094, 184062],
			["Мяч &quotАтомных гонок&quot", -97089, 184071],
			["Мяч &quotАтомных гонок&quot", -97044, 184024],
			["Мяч &quotАтомных гонок&quot", -144779, 149440],
			["Мяч &quotАтомных гонок&quot", -129064, 88255],
			["Мяч &quotАтомных гонок&quot", -129072, 88230]
			];
	for (var i = 0; i < hlam312.length; i++) {
				hlam_312 = new L.circleMarker([hlam312[i][1],hlam312[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam312[i][0])
					.bindTooltip(hlam312[i][0], {direction: 'top'})
					.addTo(hlam312icons);
			}
	}
	else {
		hlam312icons.clearLayers();
	}
}
var hlam313icons = L.layerGroup().addTo(map);
function Hlam313OnOff() {
	var chbox313;
	chbox313=document.getElementById('Hlam313Button');
	if (chbox313.checked) {
		var hlam313 = [
			["Мяч для гольфа", -65284, -20632],
			["Мяч для гольфа", -65274, -20664],
			["Мяч для гольфа", -65285, -20659],
			["Мяч для гольфа", -57901, -23877],
			["Мяч для гольфа", -57999, -23974],
			["Мяч для гольфа", -57994, -23975],
			["Мяч для гольфа", -57975, -23908],
			["Мяч для гольфа", -57961, -23942],
			["Мяч для гольфа", -57947, -23912],
			["Мяч для гольфа", -46190, -17376],
			["Мяч для гольфа", -46176, -17312],
			["Мяч для гольфа", -45798, -17308],
			["Мяч для гольфа", -45773, -17338],
			["Мяч для гольфа", -62158, -12791],
			["Мяч для гольфа", -62068, -12776],
			["Мяч для гольфа", -51475, -13076],
			["Мяч для гольфа", -51480, -13074],
			["Мяч для гольфа", -51490, -13021],
			["Мяч для гольфа", -51781, -12710],
			["Мяч для гольфа", -51777, -12705],
			["Мяч для гольфа", -51773, -12610],
			["Мяч для гольфа", -51753, -13177],
			["Мяч для гольфа", -51126, -12908],
			["Мяч для гольфа", -51122, -12911],
			["Мяч для гольфа", -51153, -12907],
			["Мяч для гольфа", -51152, -12904],
			["Мяч для гольфа", -51029, -13094],
			["Мяч для гольфа", -51100, -13072],
			["Мяч для гольфа", -51027, -13091],
			["Мяч для гольфа", -51808, -14043],
			["Мяч для гольфа", -51821, -14033],
			["Мяч для гольфа", -51817, -14033],
			["Мяч для гольфа", -51580, -14042],
			["Мяч для гольфа", -51566, -14050],
			["Мяч для гольфа", -51001, -16166],
			["Мяч для гольфа", -51018, -16192],
			["Мяч для гольфа", -50166, -14641],
			["Мяч для гольфа", -50168, -14646],
			["Мяч для гольфа", -50167, -14639],
			["Мяч для гольфа", -50162, -14642],
			["Мяч для гольфа", -50164, -14638],
			["Мяч для гольфа", -50160, -14635],
			["Мяч для гольфа", -50164, -14634],
			["Мяч для гольфа", -50161, -14639],
			["Мяч для гольфа", -50161, -14630],
			["Мяч для гольфа", -50166, -14631],
			["Мяч для гольфа", -46635, -13757],
			["Мяч для гольфа", -46741, -13691],
			["Мяч для гольфа", -46728, -13682],
			["Мяч для гольфа", -46760, -13596],
			["Мяч для гольфа", -46788, -13657],
			["Мяч для гольфа", -44544, -12502],
			["Мяч для гольфа", -44532, -12405],
			["Мяч для гольфа", -44718, -12489],
			["Мяч для гольфа", -44750, -12397],
			["Мяч для гольфа", -44742, -12545],
			["Мяч для гольфа", -44793, -12403],
			["Мяч для гольфа", -44786, -12445],
			["Мяч для гольфа", -44710, -12416],
			["Мяч для гольфа", -44681, -12444],
			["Мяч для гольфа", -44687, -12440],
			["Мяч для гольфа", -56284, -8801],
			["Мяч для гольфа", -56264, -8850],
			["Мяч для гольфа", -56276, -8847],
			["Мяч для гольфа", -56280, -8853],
			["Мяч для гольфа", -52627, -12174],
			["Мяч для гольфа", -52769, -12051],
			["Мяч для гольфа", -52750, -12024],
			["Мяч для гольфа", -52408, -9978],
			["Мяч для гольфа", -52407, -9979],
			["Мяч для гольфа", -52402, -9991],
			["Мяч для гольфа", -52387, -9963],
			["Мяч для гольфа", -52394, -9969],
			["Мяч для гольфа", -52390, -9966],
			["Мяч для гольфа", -52218, -10104],
			["Мяч для гольфа", -52217, -10098],
			["Мяч для гольфа", -52214, -10102],
			["Мяч для гольфа", -52297, -10102],
			["Мяч для гольфа", -52294, -10121],
			["Мяч для гольфа", -52243, -10081],
			["Мяч для гольфа", -52232, -10086],
			["Мяч для гольфа", -52302, -10015],
			["Мяч для гольфа", -52335, -10107],
			["Мяч для гольфа", -52320, -10130],
			["Мяч для гольфа", -52149, -11230],
			["Мяч для гольфа", -52153, -11233],
			["Мяч для гольфа", -52159, -11228],
			["Мяч для гольфа", -52157, -11232],
			["Мяч для гольфа", -52114, -11260],
			["Мяч для гольфа", -52142, -11231],
			["Мяч для гольфа", -52139, -11227],
			["Мяч для гольфа", -52147, -11255],
			["Мяч для гольфа", -59540, -4863],
			["Мяч для гольфа", -58787, -6000],
			["Мяч для гольфа", -58761, -5947],
			["Мяч для гольфа", -58768, -5948],
			["Мяч для гольфа", -58379, -5903],
			["Мяч для гольфа", -58376, -5899],
			["Мяч для гольфа", -58102, -5593],
			["Мяч для гольфа", -58108, -5594],
			["Мяч для гольфа", -58115, -5596],
			["Мяч для гольфа", -58093, -5694],
			["Мяч для гольфа", -57240, -6322],
			["Мяч для гольфа", -57272, -6267],
			["Мяч для гольфа", -57268, -6265],
			["Мяч для гольфа", -57267, -6267],
			["Мяч для гольфа", -57269, -6273],
			["Мяч для гольфа", -57265, -6272],
			["Мяч для гольфа", -57263, -6269],
			["Мяч для гольфа", -42026, -5964],
			["Мяч для гольфа", -40101, -7461],
			["Мяч для гольфа", -60181, -3016],
			["Мяч для гольфа", -59603, -3104],
			["Мяч для гольфа", -59910, -2506],
			["Мяч для гольфа", -61069, -2711],
			["Мяч для гольфа", -61219, -2628],
			["Мяч для гольфа", -61324, -2990],
			["Мяч для гольфа", -61184, -3254],
			["Мяч для гольфа", -61280, -3201],
			["Мяч для гольфа", -61154, -3122],
			["Мяч для гольфа", -61081, -3298],
			["Мяч для гольфа", -59860, -3130],
			["Мяч для гольфа", -59603, -2886],
			["Мяч для гольфа", -59741, -2761],
			["Мяч для гольфа", -59783, -2861],
			["Мяч для гольфа", -59905, -2760],
			["Мяч для гольфа", -53424, -4091],
			["Мяч для гольфа", -53464, -4049],
			["Мяч для гольфа", -53460, -4051],
			["Мяч для гольфа", -53440, -4035],
			["Мяч для гольфа", -53195, -1100],
			["Мяч для гольфа", -53092, -1196],
			["Мяч для гольфа", -53103, -1193],
			["Мяч для гольфа", -53072, -1180],
			["Мяч для гольфа", -40753, -1507],
			["Мяч для гольфа", -40743, -1501],
			["Мяч для гольфа", -40727, -1524],
			["Мяч для гольфа", -78471, -20640],
			["Мяч для гольфа", -78472, -20634],
			["Мяч для гольфа", -69956, -19981],
			["Мяч для гольфа", -77185, -15425],
			["Мяч для гольфа", -77184, -15427],
			["Мяч для гольфа", -77181, -15430],
			["Мяч для гольфа", -77182, -15434],
			["Мяч для гольфа", -77185, -15432],
			["Мяч для гольфа", -77187, -15433],
			["Мяч для гольфа", -77188, -15428],
			["Мяч для гольфа", -77182, -15432],
			["Мяч для гольфа", -76904, -14556],
			["Мяч для гольфа", -77260, -14247],
			["Мяч для гольфа", -76737, -13968],
			["Мяч для гольфа", -66845, -15774],
			["Мяч для гольфа", -66891, -15664],
			["Мяч для гольфа", -66963, -15664],
			["Мяч для гольфа", -66926, -15670],
			["Мяч для гольфа", -66697, -15689],
			["Мяч для гольфа", -66783, -15690],
			["Мяч для гольфа", -66784, -15709],
			["Мяч для гольфа", -78166, -8984],
			["Мяч для гольфа", -81407, -9009],
			["Мяч для гольфа", -81410, -9008],
			["Мяч для гольфа", -81467, -9027],
			["Мяч для гольфа", -76928, -11519],
			["Мяч для гольфа", -69804, -96615],
			["Мяч для гольфа", 192368, -29113],
			["Мяч для гольфа", 192434, -29295],
			["Мяч для гольфа", 192405, -29190],
			["Мяч для гольфа", 192407, -29213],
			["Мяч для гольфа", 192619, -29124],
			["Мяч для гольфа", 192620, -29129],
			["Мяч для гольфа", 192616, -29126],
			["Мяч для гольфа", 192529, -29098],
			["Мяч для гольфа", 192748, -28996],
			["Мяч для гольфа", 192573, -29001],
			["Мяч для гольфа", 177661, -63851],
			["Мяч для гольфа", 177651, -63832],
			["Мяч для гольфа", 148930, -46591],
			["Мяч для гольфа", 180429, -72165],
			["Мяч для гольфа", 183758, -66008],
			["Мяч для гольфа", 183981, -66616],
			["Мяч для гольфа", 183956, -66615],
			["Мяч для гольфа", 183973, -66619],
			["Мяч для гольфа", 183775, -66350],
			["Мяч для гольфа", 183163, -66063],
			["Мяч для гольфа", 183367, -65803],
			["Мяч для гольфа", 183359, -65831],
			["Мяч для гольфа", 183368, -65829],
			["Мяч для гольфа", 183166, -65950],
			["Мяч для гольфа", 183161, -65944],
			["Мяч для гольфа", 183761, -66074],
			["Мяч для гольфа", 183776, -66074],
			["Мяч для гольфа", 183783, -66078],
			["Мяч для гольфа", 183294, -66377],
			["Мяч для гольфа", 183306, -66373],
			["Мяч для гольфа", 183242, -66380],
			["Мяч для гольфа", 183236, -66376],
			["Мяч для гольфа", 183246, -66376],
			["Мяч для гольфа", -31521, -192303],
			["Мяч для гольфа", -31571, -192324],
			["Мяч для гольфа", -31313, -192048],
			["Мяч для гольфа", -31381, -191899],
			["Мяч для гольфа", -31309, -192092],
			["Мяч для гольфа", -30634, -191564],
			["Мяч для гольфа", -30639, -191563],
			["Мяч для гольфа", -30636, -191559],
			["Мяч для гольфа", -30637, -191566],
			["Мяч для гольфа", -30638, -191559],
			["Мяч для гольфа", -30634, -191562],
			["Мяч для гольфа", -30634, -191567],
			["Мяч для гольфа", -30639, -191565],
			["Мяч для гольфа", -30637, -191561],
			["Мяч для гольфа", -30637, -191568],
			["Мяч для гольфа", -30641, -191562],
			["Мяч для гольфа", -30632, -191563],
			["Мяч для гольфа", -30719, -191637],
			["Мяч для гольфа", 188059, -148035],
			["Мяч для гольфа", 185917, -148685],
			["Мяч для гольфа", 186218, -148364],
			["Мяч для гольфа", 185874, -148667],
			["Мяч для гольфа", 185681, -148758],
			["Мяч для гольфа", 186050, -148598],
			["Мяч для гольфа", 185947, -148657],
			["Мяч для гольфа", 186037, -148675],
			["Мяч для гольфа", 196593, -143416],
			["Мяч для гольфа", 196575, -143388],
			["Мяч для гольфа", 196598, -143411],
			["Мяч для гольфа", 196597, -143416],
			["Мяч для гольфа", 196588, -143480],
			["Мяч для гольфа", 195626, -143886],
			["Мяч для гольфа", 195592, -143880],
			["Мяч для гольфа", 193135, -146480],
			["Мяч для гольфа", 196593, -143493],
			["Мяч для гольфа", 143293, -148849],
			["Мяч для гольфа", 143298, -148840],
			["Мяч для гольфа", 143263, -148620],
			["Мяч для гольфа", 141037, -149758],
			["Мяч для гольфа", 141114, -149912],
			["Мяч для гольфа", 140975, -149901],
			["Мяч для гольфа", 140951, -149756],
			["Мяч для гольфа", 140744, -149631],
			["Мяч для гольфа", 140913, -149688],
			["Мяч для гольфа", 140989, -149679],
			["Мяч для гольфа", 141108, -149710],
			["Мяч для гольфа", 141180, -149746],
			["Мяч для гольфа", 143765, -148773],
			["Мяч для гольфа", 143630, -148980],
			["Мяч для гольфа", 143526, -149024],
			["Мяч для гольфа", -97332, 200163],
			["Мяч для гольфа", -97337, 200164],
			["Мяч для гольфа", -97317, 200182],
			["Мяч для гольфа", -36165, 171190],
			["Мяч для гольфа", -36146, 171177],
			["Мяч для гольфа", -36142, 171174],
			["Мяч для гольфа", 11576, 182909],
			["Мяч для гольфа", 11568, 182937],
			["Мяч для гольфа", 11570, 182932],
			["Мяч для гольфа", -128084, 83987],
			["Мяч для гольфа", -128076, 83991],
			["Мяч для гольфа", -128106, 83959],
			["Мяч для гольфа", -128091, 83964],
			["Мяч для гольфа", -56857, 3577],
			["Мяч для гольфа", -56862, 3578],
			["Мяч для гольфа", -56864, 3570],
			["Мяч для гольфа", -56858, 3569],
			["Мяч для гольфа", -56858, 3574],
			["Мяч для гольфа", -56862, 3572],
			["Мяч для гольфа", -56863, 3573],
			["Мяч для гольфа", -55925, 3882],
			["Мяч для гольфа", -55220, 4046],
			["Мяч для гольфа", -55894, 3632],
			["Мяч для гольфа", -56149, 3408],
			["Мяч для гольфа", -56149, 3412],
			["Мяч для гольфа", -56117, 3390],
			["Мяч для гольфа", -56120, 3381],
			["Мяч для гольфа", -56104, 3390],
			["Мяч для гольфа", -56101, 3393],
			["Мяч для гольфа", -56099, 3386],
			["Мяч для гольфа", -56098, 3393],
			["Мяч для гольфа", -56096, 3390],
			["Мяч для гольфа", -56100, 3389],
			["Мяч для гольфа", -56037, 3137],
			["Мяч для гольфа", -55488, 3531],
			["Мяч для гольфа", -54481, 4036],
			["Мяч для гольфа", -54296, 3886],
			["Мяч для гольфа", -54155, 3878],
			["Мяч для гольфа", -54148, 3959],
			["Мяч для гольфа", -55437, 3223],
			["Мяч для гольфа", -56103, 2713],
			["Мяч для гольфа", -56115, 2761],
			["Мяч для гольфа", -56318, 2905],
			["Мяч для гольфа", -56678, 3643],
			["Мяч для гольфа", -56671, 3629],
			["Мяч для гольфа", -56678, 3637],
			["Мяч для гольфа", -56695, 3561],
			["Мяч для гольфа", -46881, 1535],
			["Мяч для гольфа", -46865, 1518],
			["Мяч для гольфа", -46855, 1531],
			["Мяч для гольфа", -55888, 4223],
			["Мяч для гольфа", -55576, 4626],
			["Мяч для гольфа", -55481, 4628],
			["Мяч для гольфа", -55477, 4619],
			["Мяч для гольфа", -55475, 4612],
			["Мяч для гольфа", -55485, 4596],
			["Мяч для гольфа", -55453, 4895],
			["Мяч для гольфа", -55347, 4843],
			["Мяч для гольфа", -54977, 4879],
			["Мяч для гольфа", -54776, 5095],
			["Мяч для гольфа", -54212, 4150],
			["Мяч для гольфа", -54193, 4145],
			["Мяч для гольфа", -54199, 4150],
			["Мяч для гольфа", -51308, 7228],
			["Мяч для гольфа", -51314, 7226],
			["Мяч для гольфа", -51280, 7205],
			["Мяч для гольфа", -48016, 20636],
			["Мяч для гольфа", -48013, 20636],
			["Мяч для гольфа", -48014, 20640],
			["Мяч для гольфа", -47989, 20668],
			["Мяч для гольфа", -98657, 7848],
			["Мяч для гольфа", -98663, 7842],
			["Мяч для гольфа", -98637, 7834],
			["Мяч для гольфа", 56681, 11670],
			["Мяч для гольфа", 56702, 11663],
			["Мяч для гольфа", 56701, 11658],
			["Мяч для гольфа", 56703, 11666],
			["Мяч для гольфа", 56706, 11660],
			["Мяч для гольфа", 56699, 11663],
			["Мяч для гольфа", 56686, 11639],
			["Мяч для гольфа", 56685, 11633],
			["Мяч для гольфа", 56685, 11640],
			["Мяч для гольфа", 56687, 11635],
			["Мяч для гольфа", 56682, 11637],
			["Мяч для гольфа", 56663, 11654],
			["Мяч для гольфа", 56663, 11658],
			["Мяч для гольфа", 56660, 11656],
			["Мяч для гольфа", 56667, 11654],
			["Мяч для гольфа", 56664, 11651],
			["Мяч для гольфа", 53343, 9085],
			["Мяч для гольфа", 57397, 12635],
			["Мяч для гольфа", 33279, 129069],
			["Мяч для гольфа", 33276, 129059],
			["Мяч для гольфа", -44402, -15937]
			];
	for (var i = 0; i < hlam313.length; i++) {
				hlam_313 = new L.circleMarker([hlam313[i][1],hlam313[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam313[i][0])
					.bindTooltip(hlam313[i][0], {direction: 'top'})
					.addTo(hlam313icons);
			}
	}
	else {
		hlam313icons.clearLayers();
	}
}
var hlam314icons = L.layerGroup().addTo(map);
function Hlam314OnOff() {
	var chbox314;
	chbox314=document.getElementById('Hlam314Button');
	if (chbox314.checked) {
		var hlam314 = [
			["Набор стаканчиков для Ядер-колы", -51933, -13019],
			["Набор стаканчиков для Ядер-колы", -56772, -11008],
			["Набор стаканчиков для Ядер-колы", -56658, -11141],
			["Набор стаканчиков для Ядер-колы", -56843, -11210],
			["Набор стаканчиков для Ядер-колы", -56834, -11218],
			["Набор стаканчиков для Ядер-колы", -56770, -11047],
			["Набор стаканчиков для Ядер-колы", -50415, -9499],
			["Набор стаканчиков для Ядер-колы", -50412, -10512],
			["Набор стаканчиков для Ядер-колы", 199553, -29902],
			["Набор стаканчиков для Ядер-колы", 199586, -29913],
			["Набор стаканчиков для Ядер-колы", 199179, -29716],
			["Набор стаканчиков для Ядер-колы", 198100, -26864],
			["Набор стаканчиков для Ядер-колы", 192360, -29248],
			["Набор стаканчиков для Ядер-колы", 196304, -31872],
			["Набор стаканчиков для Ядер-колы", 195646, -31041],
			["Набор стаканчиков для Ядер-колы", 192589, -29479],
			["Набор стаканчиков для Ядер-колы", 191864, -28579],
			["Набор стаканчиков для Ядер-колы", 191518, -33896],
			["Набор стаканчиков для Ядер-колы", 191461, -34335],
			["Набор стаканчиков для Ядер-колы", 193630, -34437],
			["Набор стаканчиков для Ядер-колы", 193496, -34317],
			["Набор стаканчиков для Ядер-колы", 18217, -1002],
			["Набор стаканчиков для Ядер-колы", 18207, -1012],
			["Набор стаканчиков для Ядер-колы", -80097, -181324],
			["Набор стаканчиков для Ядер-колы", -80120, -181327],
			["Набор стаканчиков для Ядер-колы", -80108, -181337],
			["Набор стаканчиков для Ядер-колы", -77790, -180633],
			["Набор стаканчиков для Ядер-колы", -77250, -181126],
			["Набор стаканчиков для Ядер-колы", -74152, -179442],
			["Набор стаканчиков для Ядер-колы", -76676, -177439],
			["Набор стаканчиков для Ядер-колы", 140113, -157910],
			["Набор стаканчиков для Ядер-колы", -18092, 60275],
			["Набор стаканчиков для Ядер-колы", -18092, 60215],
			["Набор стаканчиков для Ядер-колы", -18063, 60093],
			["Набор стаканчиков для Ядер-колы", -46662, 1722],
			["Набор стаканчиков для Ядер-колы", -43988, 8091]
			];
	for (var i = 0; i < hlam314.length; i++) {
				hlam_314 = new L.circleMarker([hlam314[i][1],hlam314[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam314[i][0])
					.bindTooltip(hlam314[i][0], {direction: 'top'})
					.addTo(hlam314icons);
			}
	}
	else {
		hlam314icons.clearLayers();
	}
}
var hlam315icons = L.layerGroup().addTo(map);
function Hlam315OnOff() {
	var chbox315;
	chbox315=document.getElementById('Hlam315Button');
	if (chbox315.checked) {
		var hlam315 = [
			["Наручники", -129584, -65462],
			["Наручники", -112858, -55588],
			["Наручники", -82069, -126707],
			["Наручники", -151373, -74136],
			["Наручники", 173042, -17475],
			["Наручники", 172541, -11789],
			["Наручники", 147598, -48515],
			["Наручники", 147649, -48763],
			["Наручники", 80401, -1461],
			["Наручники", 89978, -53257],
			["Наручники", 113881, -74194],
			["Наручники", 113921, -74101],
			["Наручники", 114000, -74151],
			["Наручники", -94564, 175874],
			["Наручники", -93753, 180271],
			["Наручники", -92781, 180581],
			["Наручники", -93221, 180697],
			["Наручники", -93506, 180554],
			["Наручники", -93069, 180262],
			["Наручники", -93061, 180249],
			["Наручники", -93065, 180251],
			["Наручники", -93071, 180270],
			["Наручники", -93064, 180272],
			["Наручники", 61215, 172686],
			["Наручники", 13840, 193852],
			["Наручники", -98493, 78312],
			["Наручники", -74358, 49054],
			["Наручники", 160583, 115991],
			["Наручники", 160564, 116003],
			["Наручники", 131305, 85901],
			["Наручники", 143856, 97470],
			["Наручники", 144396, 97983],
			["Наручники", 182870, 3122],
			["Наручники", 183675, 3336],
			["Наручники", 105736, 52507],
			["Наручники", 106826, 61361],
			["Наручники", 129138, 59759],
			["Наручники", 129394, 59826],
			["Наручники", 89185, 53221],
			["Наручники", 88840, 53175],
			["Наручники", 88916, 53271],
			["Наручники", 16774, 49916],
			["Наручники", 54871, 8801],
			["Наручники", 55059, 8723],
			["Наручники", 135017, 21336],
			["Наручники", 134909, 21469],
			["Наручники", 128510, 85063],
			["Наручники", -31535, -129798],
			["Наручники", 169567, -1730]
			];
	for (var i = 0; i < hlam315.length; i++) {
				hlam_315 = new L.circleMarker([hlam315[i][1],hlam315[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam315[i][0])
					.bindTooltip(hlam315[i][0], {direction: 'top'})
					.addTo(hlam315icons);
			}
	}
	else {
		hlam315icons.clearLayers();
	}
}
var hlam316icons = L.layerGroup().addTo(map);
function Hlam316OnOff() {
	var chbox316;
	chbox316=document.getElementById('Hlam316Button');
	if (chbox316.checked) {
		var hlam316 = [
			["Настольная игра &quotВскрытие&quot", -50724, -13014],
			["Настольная игра &quotВскрытие&quot", 160580, -30375],
			["Настольная игра &quotВскрытие&quot", 93518, -1451],
			["Настольная игра &quotВскрытие&quot", 38782, -48278],
			["Настольная игра &quotВскрытие&quot", 30881, -33722],
			["Настольная игра &quotВскрытие&quot", 9118, -79343],
			["Настольная игра &quotВскрытие&quot", -2073, -159992],
			["Настольная игра &quotВскрытие&quot", 152878, 161712],
			["Настольная игра &quotВскрытие&quot", -21146, 11464],
			["Настольная игра &quotВскрытие&quot", -30254, 16931],
			["Настольная игра &quotВскрытие&quot", -59917, 4959],
			["Настольная игра &quotВскрытие&quot", -119213, 2142],
			["Настольная игра &quotВскрытие&quot", -146121, 66084],
			["Настольная игра &quotВскрытие&quot", -179821, 74872],
			["Настольная игра &quotВскрытие&quot", 23848, 43611],
			["Настольная игра &quotВскрытие&quot", 23714, 48812],
			["Настольная игра &quotВскрытие&quot", 70934, 21765],
			["Настольная игра &quotВскрытие&quot", 78046, 20917],
			["Настольная игра &quotВскрытие&quot", 57915, 10592]
			];
	for (var i = 0; i < hlam316.length; i++) {
				hlam_316 = new L.circleMarker([hlam316[i][1],hlam316[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam316[i][0])
					.bindTooltip(hlam316[i][0], {direction: 'top'})
					.addTo(hlam316icons);
			}
	}
	else {
		hlam316icons.clearLayers();
	}
}
var hlam317icons = L.layerGroup().addTo(map);
function Hlam317OnOff() {
	var chbox317;
	chbox317=document.getElementById('Hlam317Button');
	if (chbox317.checked) {
		var hlam317 = [
			["Настольная игра &quotНесокрушимые!&quot", -44038, -8096],
			["Настольная игра &quotНесокрушимые!&quot", -152100, -73816],
			["Настольная игра &quotНесокрушимые!&quot", 160698, -30352],
			["Настольная игра &quotНесокрушимые!&quot", 142141, -124019],
			["Настольная игра &quotНесокрушимые!&quot", 81905, -1191],
			["Настольная игра &quotНесокрушимые!&quot", 30837, -33718],
			["Настольная игра &quotНесокрушимые!&quot", -8074, -165494],
			["Настольная игра &quotНесокрушимые!&quot", 152874, 161711],
			["Настольная игра &quotНесокрушимые!&quot", 14791, 193410],
			["Настольная игра &quotНесокрушимые!&quot", -41500, 87939],
			["Настольная игра &quotНесокрушимые!&quot", -59919, 4963],
			["Настольная игра &quotНесокрушимые!&quot", -99543, 8062],
			["Настольная игра &quotНесокрушимые!&quot", -146229, 65972],
			["Настольная игра &quotНесокрушимые!&quot", 101529, 69454],
			["Настольная игра &quotНесокрушимые!&quot", 21528, 42279],
			["Настольная игра &quotНесокрушимые!&quot", 57921, 10591]
			];
	for (var i = 0; i < hlam317.length; i++) {
				hlam_317 = new L.circleMarker([hlam317[i][1],hlam317[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam317[i][0])
					.bindTooltip(hlam317[i][0], {direction: 'top'})
					.addTo(hlam317icons);
			}
	}
	else {
		hlam317icons.clearLayers();
	}
}
var hlam318icons = L.layerGroup().addTo(map);
function Hlam318OnOff() {
	var chbox318;
	chbox318=document.getElementById('Hlam318Button');
	if (chbox318.checked) {
		var hlam318 = [
			["Настольная игра &quotПоймай комми&quot", -42018, -5266],
			["Настольная игра &quotПоймай комми&quot", -67343, -1316],
			["Настольная игра &quotПоймай комми&quot", -126161, -74249],
			["Настольная игра &quotПоймай комми&quot", -152103, -73771],
			["Настольная игра &quotПоймай комми&quot", 160564, -30361],
			["Настольная игра &quotПоймай комми&quot", 146129, -101743],
			["Настольная игра &quotПоймай комми&quot", 146128, -101741],
			["Настольная игра &quotПоймай комми&quot", 146128, -101742],
			["Настольная игра &quotПоймай комми&quot", 146129, -101741],
			["Настольная игра &quotПоймай комми&quot", 87606, -21958],
			["Настольная игра &quotПоймай комми&quot", 29385, -58670],
			["Настольная игра &quotПоймай комми&quot", 152860, 161771],
			["Настольная игра &quotПоймай комми&quot", -99586, 7852],
			["Настольная игра &quotПоймай комми&quot", -146120, 66076],
			["Настольная игра &quotПоймай комми&quot", 23353, 43993],
			["Настольная игра &quotПоймай комми&quot", 28873, 53039],
			["Настольная игра &quotПоймай комми&quot", 57949, 10617]
			];
	for (var i = 0; i < hlam318.length; i++) {
				hlam_318 = new L.circleMarker([hlam318[i][1],hlam318[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam318[i][0])
					.bindTooltip(hlam318[i][0], {direction: 'top'})
					.addTo(hlam318icons);
			}
	}
	else {
		hlam318icons.clearLayers();
	}
}
var hlam319icons = L.layerGroup().addTo(map);
function Hlam319OnOff() {
	var chbox319;
	chbox319=document.getElementById('Hlam319Button');
	if (chbox319.checked) {
		var hlam319 = [
			["Настольная игра &quotРад-покер&quot", -51760, -12249],
			["Настольная игра &quotРад-покер&quot", -67344, -1313],
			["Настольная игра &quotРад-покер&quot", -135744, -6034],
			["Настольная игра &quotРад-покер&quot", -152099, -73813],
			["Настольная игра &quotРад-покер&quot", -150905, -73573],
			["Настольная игра &quotРад-покер&quot", -146678, -122756],
			["Настольная игра &quotРад-покер&quot", 142138, -124017],
			["Настольная игра &quotРад-покер&quot", 105655, -8598],
			["Настольная игра &quotРад-покер&quot", 87605, -21956],
			["Настольная игра &quotРад-покер&quot", 29388, -58670],
			["Настольная игра &quotРад-покер&quot", -1597, -164394],
			["Настольная игра &quotРад-покер&quot", -142431, 134790],
			["Настольная игра &quotРад-покер&quot", -144374, 150238],
			["Настольная игра &quotРад-покер&quot", -146522, 155836],
			["Настольная игра &quotРад-покер&quot", 152853, 161773],
			["Настольная игра &quotРад-покер&quot", -59943, 117109],
			["Настольная игра &quotРад-покер&quot", -146245, 66160],
			["Настольная игра &quotРад-покер&quot", 30631, 65843],
			["Настольная игра &quotРад-покер&quot", 103966, 44467],
			["Настольная игра &quotРад-покер&quot", 21353, 46462],
			["Настольная игра &quotРад-покер&quot", 27632, 50351],
			["Настольная игра &quotРад-покер&quot", 28856, 53049],
			["Настольная игра &quotРад-покер&quot", 71130, 20533]
			];
	for (var i = 0; i < hlam319.length; i++) {
				hlam_319 = new L.circleMarker([hlam319[i][1],hlam319[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam319[i][0])
					.bindTooltip(hlam319[i][0], {direction: 'top'})
					.addTo(hlam319icons);
			}
	}
	else {
		hlam319icons.clearLayers();
	}
}
var hlam320icons = L.layerGroup().addTo(map);
function Hlam320OnOff() {
	var chbox320;
	chbox320=document.getElementById('Hlam320Button');
	if (chbox320.checked) {
		var hlam320 = [
			["Настольная игра &quotРадиус взрыва&quot", -44265, -7718],
			["Настольная игра &quotРадиус взрыва&quot", -121970, -26736],
			["Настольная игра &quotРадиус взрыва&quot", -47352, -50978],
			["Настольная игра &quotРадиус взрыва&quot", -89291, -41518],
			["Настольная игра &quotРадиус взрыва&quot", -114463, -47217],
			["Настольная игра &quotРадиус взрыва&quot", -59154, -89299],
			["Настольная игра &quotРадиус взрыва&quot", -152100, -73813],
			["Настольная игра &quotРадиус взрыва&quot", 160622, -30264],
			["Настольная игра &quotРадиус взрыва&quot", 142134, -124017],
			["Настольная игра &quotРадиус взрыва&quot", 105696, -22204],
			["Настольная игра &quotРадиус взрыва&quot", 82060, -1165],
			["Настольная игра &quotРадиус взрыва&quot", 21008, -59943],
			["Настольная игра &quotРадиус взрыва&quot", 29381, -58324],
			["Настольная игра &quotРадиус взрыва&quot", 30854, -33395],
			["Настольная игра &quotРадиус взрыва&quot", 11844, -83785],
			["Настольная игра &quotРадиус взрыва&quot", -1961, -160049],
			["Настольная игра &quotРадиус взрыва&quot", -40497, -157845],
			["Настольная игра &quotРадиус взрыва&quot", 143410, -151397],
			["Настольная игра &quotРадиус взрыва&quot", -34876, 172233],
			["Настольная игра &quotРадиус взрыва&quot", -26955, 162459],
			["Настольная игра &quotРадиус взрыва&quot", -41701, 158588],
			["Настольная игра &quotРадиус взрыва&quot", 146939, 139936],
			["Настольная игра &quotРадиус взрыва&quot", 152851, 161721],
			["Настольная игра &quotРадиус взрыва&quot", 27877, 167623],
			["Настольная игра &quotРадиус взрыва&quot", 14798, 193413],
			["Настольная игра &quotРадиус взрыва&quot", 74920, 151181],
			["Настольная игра &quotРадиус взрыва&quot", 2117, 161614],
			["Настольная игра &quotРадиус взрыва&quot", -39435, 46611],
			["Настольная игра &quotРадиус взрыва&quot", -23183, 13939],
			["Настольная игра &quotРадиус взрыва&quot", -98981, 7844],
			["Настольная игра &quotРадиус взрыва&quot", -146098, 65923],
			["Настольная игра &quotРадиус взрыва&quot", 181752, 110719],
			["Настольная игра &quotРадиус взрыва&quot", 189279, 83915],
			["Настольная игра &quotРадиус взрыва&quot", 131686, 54732],
			["Настольная игра &quotРадиус взрыва&quot", 139613, 3547],
			["Настольная игра &quotРадиус взрыва&quot", 109614, 57232],
			["Настольная игра &quotРадиус взрыва&quot", 27598, 49995],
			["Настольная игра &quotРадиус взрыва&quot", 58764, 9252]
			];
	for (var i = 0; i < hlam320.length; i++) {
				hlam_320 = new L.circleMarker([hlam320[i][1],hlam320[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam320[i][0])
					.bindTooltip(hlam320[i][0], {direction: 'top'})
					.addTo(hlam320icons);
			}
	}
	else {
		hlam320icons.clearLayers();
	}
}
var hlam321icons = L.layerGroup().addTo(map);
function Hlam321OnOff() {
	var chbox321;
	chbox321=document.getElementById('Hlam321Button');
	if (chbox321.checked) {
		var hlam321 = [
			["Настольная фоторамка", -44907, -9086],
			["Настольная фоторамка", -51078, -98278],
			["Настольная фоторамка", -148040, -59172],
			["Настольная фоторамка", -147581, -58527],
			["Настольная фоторамка", -147817, -58534],
			["Настольная фоторамка", -147788, -58850],
			["Настольная фоторамка", -148054, -59295],
			["Настольная фоторамка", -148232, -54654],
			["Настольная фоторамка", 124107, -28954],
			["Настольная фоторамка", 90193, -9762],
			["Настольная фоторамка", 73404, -7309],
			["Настольная фоторамка", 31326, -33711],
			["Настольная фоторамка", 22191, -105369],
			["Настольная фоторамка", -27460, -131637],
			["Настольная фоторамка", 148859, -149044],
			["Настольная фоторамка", 49040, 190964],
			["Настольная фоторамка", 27196, 132069],
			["Настольная фоторамка", 1631, 162306],
			["Настольная фоторамка", -43802, 90845],
			["Настольная фоторамка", -41138, 90643],
			["Настольная фоторамка", -104861, 41763],
			["Настольная фоторамка", -123626, 51350],
			["Настольная фоторамка", 157463, 13503],
			["Настольная фоторамка", 45868, 101244],
			["Настольная фоторамка", 34388, 127911],
			["Настольная фоторамка", 34106, 127765],
			["Настольная фоторамка", 129193, 85550]
			];
	for (var i = 0; i < hlam321.length; i++) {
				hlam_321 = new L.circleMarker([hlam321[i][1],hlam321[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam321[i][0])
					.bindTooltip(hlam321[i][0], {direction: 'top'})
					.addTo(hlam321icons);
			}
	}
	else {
		hlam321icons.clearLayers();
	}
}
var hlam322icons = L.layerGroup().addTo(map);
function Hlam322OnOff() {
	var chbox322;
	chbox322=document.getElementById('Hlam322Button');
	if (chbox322.checked) {
		var hlam322 = [
			["Настольный вентилятор", -56834, -11201],
			["Настольный вентилятор", -43416, -7027],
			["Настольный вентилятор", -112652, -58914],
			["Настольный вентилятор", -13273, -66094],
			["Настольный вентилятор", -13885, -66965],
			["Настольный вентилятор", -70169, -96338],
			["Настольный вентилятор", -120220, -73781],
			["Настольный вентилятор", -46030, -104070],
			["Настольный вентилятор", -46419, -104747],
			["Настольный вентилятор", -61629, -100937],
			["Настольный вентилятор", -49442, -99906],
			["Настольный вентилятор", -47760, -101081],
			["Настольный вентилятор", -82042, -126522],
			["Настольный вентилятор", -68185, -106203],
			["Настольный вентилятор", -148887, -58200],
			["Настольный вентилятор", -147799, -57435],
			["Настольный вентилятор", -148076, -58796],
			["Настольный вентилятор", -149243, -58001],
			["Настольный вентилятор", -152296, -75034],
			["Настольный вентилятор", -151505, -75517],
			["Настольный вентилятор", -151650, -71535],
			["Настольный вентилятор", -146894, -70743],
			["Настольный вентилятор", -146631, -122737],
			["Настольный вентилятор", 190690, -35241],
			["Настольный вентилятор", 152004, -49293],
			["Настольный вентилятор", 147791, -48857],
			["Настольный вентилятор", 149052, -75810],
			["Настольный вентилятор", 177663, -122343],
			["Настольный вентилятор", 90086, -31914],
			["Настольный вентилятор", 82142, -18703],
			["Настольный вентилятор", 77332, -15315],
			["Настольный вентилятор", 76872, -14934],
			["Настольный вентилятор", 77875, -12139],
			["Настольный вентилятор", 95047, -8555],
			["Настольный вентилятор", 73193, -7303],
			["Настольный вентилятор", 93394, -4215],
			["Настольный вентилятор", 28124, -31768],
			["Настольный вентилятор", 28720, -31312],
			["Настольный вентилятор", 29656, -21198],
			["Настольный вентилятор", 29453, -18824],
			["Настольный вентилятор", 29426, -18825],
			["Настольный вентилятор", 108211, -54415],
			["Настольный вентилятор", 91745, -59397],
			["Настольный вентилятор", 34467, -36875],
			["Настольный вентилятор", 32144, -40214],
			["Настольный вентилятор", 31203, -33335],
			["Настольный вентилятор", 75577, -76570],
			["Настольный вентилятор", 60565, -96691],
			["Настольный вентилятор", 12260, -83119],
			["Настольный вентилятор", 12046, -77943],
			["Настольный вентилятор", 21578, -113282],
			["Настольный вентилятор", 21136, -109286],
			["Настольный вентилятор", 21371, -109630],
			["Настольный вентилятор", 20931, -109581],
			["Настольный вентилятор", 21880, -105118],
			["Настольный вентилятор", -24069, -179965],
			["Настольный вентилятор", -29749, -172275],
			["Настольный вентилятор", -80011, -182372],
			["Настольный вентилятор", -87763, -165940],
			["Настольный вентилятор", -134240, -154315],
			["Настольный вентилятор", -133330, -153413],
			["Настольный вентилятор", -145895, -143123],
			["Настольный вентилятор", 131572, -131947],
			["Настольный вентилятор", 102691, -151383],
			["Настольный вентилятор", 27781, -137174],
			["Настольный вентилятор", 75983, -180501],
			["Настольный вентилятор", 75611, -173135],
			["Настольный вентилятор", -93412, 183700],
			["Настольный вентилятор", -6919, 145882],
			["Настольный вентилятор", -5616, 162091],
			["Настольный вентилятор", -6119, 162127],
			["Настольный вентилятор", -3429, 162798],
			["Настольный вентилятор", -121319, 143220],
			["Настольный вентилятор", -109598, 158764],
			["Настольный вентилятор", -145062, 178051],
			["Настольный вентилятор", -144688, 137605],
			["Настольный вентилятор", -140992, 143038],
			["Настольный вентилятор", -141735, 143555],
			["Настольный вентилятор", -138498, 152458],
			["Настольный вентилятор", 69799, 202620],
			["Настольный вентилятор", 16293, 197542],
			["Настольный вентилятор", 124687, 168990],
			["Настольный вентилятор", 80189, 182387],
			["Настольный вентилятор", 79903, 182316],
			["Настольный вентилятор", 95552, 189490],
			["Настольный вентилятор", 62282, 172878],
			["Настольный вентилятор", 63556, 177201],
			["Настольный вентилятор", 1518, 165112],
			["Настольный вентилятор", 27209, 131960],
			["Настольный вентилятор", 3050, 162437],
			["Настольный вентилятор", 2346, 162132],
			["Настольный вентилятор", 6533, 161510],
			["Настольный вентилятор", -129134, 119266],
			["Настольный вентилятор", -129138, 119210],
			["Настольный вентилятор", -24829, 83141],
			["Настольный вентилятор", -41224, 87448],
			["Настольный вентилятор", -42197, 87269],
			["Настольный вентилятор", -40979, 87914],
			["Настольный вентилятор", -41995, 88099],
			["Настольный вентилятор", -40718, 87713],
			["Настольный вентилятор", -87989, 67394],
			["Настольный вентилятор", -46970, 2708],
			["Настольный вентилятор", -41567, 3330],
			["Настольный вентилятор", -33573, 34],
			["Настольный вентилятор", -46816, 13072],
			["Настольный вентилятор", 181605, 109666],
			["Настольный вентилятор", 168378, 59799],
			["Настольный вентилятор", 171005, 58926],
			["Настольный вентилятор", 172152, 58122],
			["Настольный вентилятор", 196392, 62494],
			["Настольный вентилятор", 140336, 41006],
			["Настольный вентилятор", 182662, 3138],
			["Настольный вентилятор", 182786, 3079],
			["Настольный вентилятор", 139460, 8704],
			["Настольный вентилятор", 23978, 122107],
			["Настольный вентилятор", 88766, 53132],
			["Настольный вентилятор", 88791, 53153],
			["Настольный вентилятор", 59112, 55308],
			["Настольный вентилятор", 13849, 39226],
			["Настольный вентилятор", 22822, 44298],
			["Настольный вентилятор", 23988, 49325],
			["Настольный вентилятор", 59035, 12210],
			["Настольный вентилятор", 59206, 12337]
			];
	for (var i = 0; i < hlam322.length; i++) {
				hlam_322 = new L.circleMarker([hlam322[i][1],hlam322[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam322[i][0])
					.bindTooltip(hlam322[i][0], {direction: 'top'})
					.addTo(hlam322icons);
			}
	}
	else {
		hlam322icons.clearLayers();
	}
}
var hlam323icons = L.layerGroup().addTo(map);
function Hlam323OnOff() {
	var chbox323;
	chbox323=document.getElementById('Hlam323Button');
	if (chbox323.checked) {
		var hlam323 = [
			["Неиспользованная зажигалка", -39258, 3479]
			];
	for (var i = 0; i < hlam323.length; i++) {
				hlam_323 = new L.circleMarker([hlam323[i][1],hlam323[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam323[i][0])
					.bindTooltip(hlam323[i][0], {direction: 'top'})
					.addTo(hlam323icons);
			}
	}
	else {
		hlam323icons.clearLayers();
	}
}
var hlam324icons = L.layerGroup().addTo(map);
function Hlam324OnOff() {
	var chbox324;
	chbox324=document.getElementById('Hlam324Button');
	if (chbox324.checked) {
		var hlam324 = [
			["Необожженная прихватка", 12101, -78143]
			];
	for (var i = 0; i < hlam324.length; i++) {
				hlam_324 = new L.circleMarker([hlam324[i][1],hlam324[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam324[i][0])
					.bindTooltip(hlam324[i][0], {direction: 'top'})
					.addTo(hlam324icons);
			}
	}
	else {
		hlam324icons.clearLayers();
	}
}
var hlam325icons = L.layerGroup().addTo(map);
function Hlam325OnOff() {
	var chbox325;
	chbox325=document.getElementById('Hlam325Button');
	if (chbox325.checked) {
		var hlam325 = [
			["Необработанная кожа", 90022, -9401],
			["Необработанная кожа", 29164, -58571]
			];
	for (var i = 0; i < hlam325.length; i++) {
				hlam_325 = new L.circleMarker([hlam325[i][1],hlam325[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam325[i][0])
					.bindTooltip(hlam325[i][0], {direction: 'top'})
					.addTo(hlam325icons);
			}
	}
	else {
		hlam325icons.clearLayers();
	}
}
var hlam326icons = L.layerGroup().addTo(map);
function Hlam326OnOff() {
	var chbox326;
	chbox326=document.getElementById('Hlam326Button');
	if (chbox326.checked) {
		var hlam326 = [

			];
	for (var i = 0; i < hlam326.length; i++) {
				hlam_326 = new L.circleMarker([hlam326[i][1],hlam326[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam326[i][0])
					.bindTooltip(hlam326[i][0], {direction: 'top'})
					.addTo(hlam326icons);
			}
	}
	else {
		hlam326icons.clearLayers();
	}
}
var hlam327icons = L.layerGroup().addTo(map);
function Hlam327OnOff() {
	var chbox327;
	chbox327=document.getElementById('Hlam327Button');
	if (chbox327.checked) {
		var hlam327 = [
			["Необработанное удобрение", 89976, -53229],
			["Необработанное удобрение", -163159, 156874],
			["Необработанное удобрение", 35958, 125150]
			];
	for (var i = 0; i < hlam327.length; i++) {
				hlam_327 = new L.circleMarker([hlam327[i][1],hlam327[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam327[i][0])
					.bindTooltip(hlam327[i][0], {direction: 'top'})
					.addTo(hlam327icons);
			}
	}
	else {
		hlam327icons.clearLayers();
	}
}
var hlam328icons = L.layerGroup().addTo(map);
function Hlam328OnOff() {
	var chbox328;
	chbox328=document.getElementById('Hlam328Button');
	if (chbox328.checked) {
		var hlam328 = [

			];
	for (var i = 0; i < hlam328.length; i++) {
				hlam_328 = new L.circleMarker([hlam328[i][1],hlam328[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam328[i][0])
					.bindTooltip(hlam328[i][0], {direction: 'top'})
					.addTo(hlam328icons);
			}
	}
	else {
		hlam328icons.clearLayers();
	}
}
var hlam329icons = L.layerGroup().addTo(map);
function Hlam329OnOff() {
	var chbox329;
	chbox329=document.getElementById('Hlam329Button');
	if (chbox329.checked) {
		var hlam329 = [

			];
	for (var i = 0; i < hlam329.length; i++) {
				hlam_329 = new L.circleMarker([hlam329[i][1],hlam329[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam329[i][0])
					.bindTooltip(hlam329[i][0], {direction: 'top'})
					.addTo(hlam329icons);
			}
	}
	else {
		hlam329icons.clearLayers();
	}
}
var hlam330icons = L.layerGroup().addTo(map);
function Hlam330OnOff() {
	var chbox330;
	chbox330=document.getElementById('Hlam330Button');
	if (chbox330.checked) {
		var hlam330 = [
			["Необработанный текстиль", -60992, -83493],
			["Необработанный текстиль", -60967, -83488],
			["Необработанный текстиль", 118259, -5027],
			["Необработанный текстиль", -164658, 122511]
			];
	for (var i = 0; i < hlam330.length; i++) {
				hlam_330 = new L.circleMarker([hlam330[i][1],hlam330[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam330[i][0])
					.bindTooltip(hlam330[i][0], {direction: 'top'})
					.addTo(hlam330icons);
			}
	}
	else {
		hlam330icons.clearLayers();
	}
}
var hlam331icons = L.layerGroup().addTo(map);
function Hlam331OnOff() {
	var chbox331;
	chbox331=document.getElementById('Hlam331Button');
	if (chbox331.checked) {
		var hlam331 = [
			["Неповрежденный плюшевый мишка", -47210, -51193],
			["Неповрежденный плюшевый мишка", -34934, -114708],
			["Неповрежденный плюшевый мишка", -111650, -122274],
			["Неповрежденный плюшевый мишка", 140017, -50303],
			["Неповрежденный плюшевый мишка", 147608, -78454],
			["Неповрежденный плюшевый мишка", 149737, -75963],
			["Неповрежденный плюшевый мишка", 153078, -75291],
			["Неповрежденный плюшевый мишка", -136023, -152940],
			["Неповрежденный плюшевый мишка", -63928, 132063],
			["Неповрежденный плюшевый мишка", -91181, 66417],
			["Неповрежденный плюшевый мишка", 173758, 7788]
			];
	for (var i = 0; i < hlam331.length; i++) {
				hlam_331 = new L.circleMarker([hlam331[i][1],hlam331[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam331[i][0])
					.bindTooltip(hlam331[i][0], {direction: 'top'})
					.addTo(hlam331icons);
			}
	}
	else {
		hlam331icons.clearLayers();
	}
}
var hlam332icons = L.layerGroup().addTo(map);
function Hlam332OnOff() {
	var chbox332;
	chbox332=document.getElementById('Hlam332Button');
	if (chbox332.checked) {
		var hlam332 = [

			];
	for (var i = 0; i < hlam332.length; i++) {
				hlam_332 = new L.circleMarker([hlam332[i][1],hlam332[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam332[i][0])
					.bindTooltip(hlam332[i][0], {direction: 'top'})
					.addTo(hlam332icons);
			}
	}
	else {
		hlam332icons.clearLayers();
	}
}
var hlam333icons = L.layerGroup().addTo(map);
function Hlam333OnOff() {
	var chbox333;
	chbox333=document.getElementById('Hlam333Button');
	if (chbox333.checked) {
		var hlam333 = [

			];
	for (var i = 0; i < hlam333.length; i++) {
				hlam_333 = new L.circleMarker([hlam333[i][1],hlam333[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam333[i][0])
					.bindTooltip(hlam333[i][0], {direction: 'top'})
					.addTo(hlam333icons);
			}
	}
	else {
		hlam333icons.clearLayers();
	}
}
var hlam334icons = L.layerGroup().addTo(map);
function Hlam334OnOff() {
	var chbox334;
	chbox334=document.getElementById('Hlam334Button');
	if (chbox334.checked) {
		var hlam334 = [

			];
	for (var i = 0; i < hlam334.length; i++) {
				hlam_334 = new L.circleMarker([hlam334[i][1],hlam334[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam334[i][0])
					.bindTooltip(hlam334[i][0], {direction: 'top'})
					.addTo(hlam334icons);
			}
	}
	else {
		hlam334icons.clearLayers();
	}
}
var hlam335icons = L.layerGroup().addTo(map);
function Hlam335OnOff() {
	var chbox335;
	chbox335=document.getElementById('Hlam335Button');
	if (chbox335.checked) {
		var hlam335 = [

			];
	for (var i = 0; i < hlam335.length; i++) {
				hlam_335 = new L.circleMarker([hlam335[i][1],hlam335[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam335[i][0])
					.bindTooltip(hlam335[i][0], {direction: 'top'})
					.addTo(hlam335icons);
			}
	}
	else {
		hlam335icons.clearLayers();
	}
}
var hlam336icons = L.layerGroup().addTo(map);
function Hlam336OnOff() {
	var chbox336;
	chbox336=document.getElementById('Hlam336Button');
	if (chbox336.checked) {
		var hlam336 = [
			["Новая ваза-купол &quotИва&quot", -46546, 20239]
			];
	for (var i = 0; i < hlam336.length; i++) {
				hlam_336 = new L.circleMarker([hlam336[i][1],hlam336[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam336[i][0])
					.bindTooltip(hlam336[i][0], {direction: 'top'})
					.addTo(hlam336icons);
			}
	}
	else {
		hlam336icons.clearLayers();
	}
}
var hlam337icons = L.layerGroup().addTo(map);
function Hlam337OnOff() {
	var chbox337;
	chbox337=document.getElementById('Hlam337Button');
	if (chbox337.checked) {
		var hlam337 = [

			];
	for (var i = 0; i < hlam337.length; i++) {
				hlam_337 = new L.circleMarker([hlam337[i][1],hlam337[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam337[i][0])
					.bindTooltip(hlam337[i][0], {direction: 'top'})
					.addTo(hlam337icons);
			}
	}
	else {
		hlam337icons.clearLayers();
	}
}
var hlam338icons = L.layerGroup().addTo(map);
function Hlam338OnOff() {
	var chbox338;
	chbox338=document.getElementById('Hlam338Button');
	if (chbox338.checked) {
		var hlam338 = [
			["Новая ваза-купол &quotЦветы&quot", -8122, -165549]
			];
	for (var i = 0; i < hlam338.length; i++) {
				hlam_338 = new L.circleMarker([hlam338[i][1],hlam338[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam338[i][0])
					.bindTooltip(hlam338[i][0], {direction: 'top'})
					.addTo(hlam338icons);
			}
	}
	else {
		hlam338icons.clearLayers();
	}
}
var hlam339icons = L.layerGroup().addTo(map);
function Hlam339OnOff() {
	var chbox339;
	chbox339=document.getElementById('Hlam339Button');
	if (chbox339.checked) {
		var hlam339 = [

			];
	for (var i = 0; i < hlam339.length; i++) {
				hlam_339 = new L.circleMarker([hlam339[i][1],hlam339[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam339[i][0])
					.bindTooltip(hlam339[i][0], {direction: 'top'})
					.addTo(hlam339icons);
			}
	}
	else {
		hlam339icons.clearLayers();
	}
}
var hlam340icons = L.layerGroup().addTo(map);
function Hlam340OnOff() {
	var chbox340;
	chbox340=document.getElementById('Hlam340Button');
	if (chbox340.checked) {
		var hlam340 = [
			["Новая игрушечная машинка", -43987, -8033],
			["Новая игрушечная машинка", -44014, -8071],
			["Новая игрушечная машинка", -40523, -1393],
			["Новая игрушечная машинка", -76632, -175284],
			["Новая игрушечная машинка", 79294, -153865],
			["Новая игрушечная машинка", -165813, 122473]
			];
	for (var i = 0; i < hlam340.length; i++) {
				hlam_340 = new L.circleMarker([hlam340[i][1],hlam340[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam340[i][0])
					.bindTooltip(hlam340[i][0], {direction: 'top'})
					.addTo(hlam340icons);
			}
	}
	else {
		hlam340icons.clearLayers();
	}
}
var hlam341icons = L.layerGroup().addTo(map);
function Hlam341OnOff() {
	var chbox341;
	chbox341=document.getElementById('Hlam341Button');
	if (chbox341.checked) {
		var hlam341 = [

			];
	for (var i = 0; i < hlam341.length; i++) {
				hlam_341 = new L.circleMarker([hlam341[i][1],hlam341[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam341[i][0])
					.bindTooltip(hlam341[i][0], {direction: 'top'})
					.addTo(hlam341icons);
			}
	}
	else {
		hlam341icons.clearLayers();
	}
}
var hlam342icons = L.layerGroup().addTo(map);
function Hlam342OnOff() {
	var chbox342;
	chbox342=document.getElementById('Hlam342Button');
	if (chbox342.checked) {
		var hlam342 = [

			];
	for (var i = 0; i < hlam342.length; i++) {
				hlam_342 = new L.circleMarker([hlam342[i][1],hlam342[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam342[i][0])
					.bindTooltip(hlam342[i][0], {direction: 'top'})
					.addTo(hlam342icons);
			}
	}
	else {
		hlam342icons.clearLayers();
	}
}
var hlam343icons = L.layerGroup().addTo(map);
function Hlam343OnOff() {
	var chbox343;
	chbox343=document.getElementById('Hlam343Button');
	if (chbox343.checked) {
		var hlam343 = [

			];
	for (var i = 0; i < hlam343.length; i++) {
				hlam_343 = new L.circleMarker([hlam343[i][1],hlam343[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam343[i][0])
					.bindTooltip(hlam343[i][0], {direction: 'top'})
					.addTo(hlam343icons);
			}
	}
	else {
		hlam343icons.clearLayers();
	}
}
var hlam344icons = L.layerGroup().addTo(map);
function Hlam344OnOff() {
	var chbox344;
	chbox344=document.getElementById('Hlam344Button');
	if (chbox344.checked) {
		var hlam344 = [

			];
	for (var i = 0; i < hlam344.length; i++) {
				hlam_344 = new L.circleMarker([hlam344[i][1],hlam344[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam344[i][0])
					.bindTooltip(hlam344[i][0], {direction: 'top'})
					.addTo(hlam344icons);
			}
	}
	else {
		hlam344icons.clearLayers();
	}
}
var hlam345icons = L.layerGroup().addTo(map);
function Hlam345OnOff() {
	var chbox345;
	chbox345=document.getElementById('Hlam345Button');
	if (chbox345.checked) {
		var hlam345 = [

			];
	for (var i = 0; i < hlam345.length; i++) {
				hlam_345 = new L.circleMarker([hlam345[i][1],hlam345[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam345[i][0])
					.bindTooltip(hlam345[i][0], {direction: 'top'})
					.addTo(hlam345icons);
			}
	}
	else {
		hlam345icons.clearLayers();
	}
}
var hlam346icons = L.layerGroup().addTo(map);
function Hlam346OnOff() {
	var chbox346;
	chbox346=document.getElementById('Hlam346Button');
	if (chbox346.checked) {
		var hlam346 = [

			];
	for (var i = 0; i < hlam346.length; i++) {
				hlam_346 = new L.circleMarker([hlam346[i][1],hlam346[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam346[i][0])
					.bindTooltip(hlam346[i][0], {direction: 'top'})
					.addTo(hlam346icons);
			}
	}
	else {
		hlam346icons.clearLayers();
	}
}
var hlam347icons = L.layerGroup().addTo(map);
function Hlam347OnOff() {
	var chbox347;
	chbox347=document.getElementById('Hlam347Button');
	if (chbox347.checked) {
		var hlam347 = [

			];
	for (var i = 0; i < hlam347.length; i++) {
				hlam_347 = new L.circleMarker([hlam347[i][1],hlam347[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam347[i][0])
					.bindTooltip(hlam347[i][0], {direction: 'top'})
					.addTo(hlam347icons);
			}
	}
	else {
		hlam347icons.clearLayers();
	}
}
var hlam348icons = L.layerGroup().addTo(map);
function Hlam348OnOff() {
	var chbox348;
	chbox348=document.getElementById('Hlam348Button');
	if (chbox348.checked) {
		var hlam348 = [
			["Новая расширяющаяся ваза &quotЦветы&quot", -55341, -27628]
			];
	for (var i = 0; i < hlam348.length; i++) {
				hlam_348 = new L.circleMarker([hlam348[i][1],hlam348[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam348[i][0])
					.bindTooltip(hlam348[i][0], {direction: 'top'})
					.addTo(hlam348icons);
			}
	}
	else {
		hlam348icons.clearLayers();
	}
}
var hlam349icons = L.layerGroup().addTo(map);
function Hlam349OnOff() {
	var chbox349;
	chbox349=document.getElementById('Hlam349Button');
	if (chbox349.checked) {
		var hlam349 = [

			];
	for (var i = 0; i < hlam349.length; i++) {
				hlam_349 = new L.circleMarker([hlam349[i][1],hlam349[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam349[i][0])
					.bindTooltip(hlam349[i][0], {direction: 'top'})
					.addTo(hlam349icons);
			}
	}
	else {
		hlam349icons.clearLayers();
	}
}
var hlam350icons = L.layerGroup().addTo(map);
function Hlam350OnOff() {
	var chbox350;
	chbox350=document.getElementById('Hlam350Button');
	if (chbox350.checked) {
		var hlam350 = [

			];
	for (var i = 0; i < hlam350.length; i++) {
				hlam_350 = new L.circleMarker([hlam350[i][1],hlam350[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam350[i][0])
					.bindTooltip(hlam350[i][0], {direction: 'top'})
					.addTo(hlam350icons);
			}
	}
	else {
		hlam350icons.clearLayers();
	}
}
var hlam351icons = L.layerGroup().addTo(map);
function Hlam351OnOff() {
	var chbox351;
	chbox351=document.getElementById('Hlam351Button');
	if (chbox351.checked) {
		var hlam351 = [

			];
	for (var i = 0; i < hlam351.length; i++) {
				hlam_351 = new L.circleMarker([hlam351[i][1],hlam351[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam351[i][0])
					.bindTooltip(hlam351[i][0], {direction: 'top'})
					.addTo(hlam351icons);
			}
	}
	else {
		hlam351icons.clearLayers();
	}
}
var hlam352icons = L.layerGroup().addTo(map);
function Hlam352OnOff() {
	var chbox352;
	chbox352=document.getElementById('Hlam352Button');
	if (chbox352.checked) {
		var hlam352 = [

			];
	for (var i = 0; i < hlam352.length; i++) {
				hlam_352 = new L.circleMarker([hlam352[i][1],hlam352[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam352[i][0])
					.bindTooltip(hlam352[i][0], {direction: 'top'})
					.addTo(hlam352icons);
			}
	}
	else {
		hlam352icons.clearLayers();
	}
}
var hlam353icons = L.layerGroup().addTo(map);
function Hlam353OnOff() {
	var chbox353;
	chbox353=document.getElementById('Hlam353Button');
	if (chbox353.checked) {
		var hlam353 = [

			];
	for (var i = 0; i < hlam353.length; i++) {
				hlam_353 = new L.circleMarker([hlam353[i][1],hlam353[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam353[i][0])
					.bindTooltip(hlam353[i][0], {direction: 'top'})
					.addTo(hlam353icons);
			}
	}
	else {
		hlam353icons.clearLayers();
	}
}
var hlam354icons = L.layerGroup().addTo(map);
function Hlam354OnOff() {
	var chbox354;
	chbox354=document.getElementById('Hlam354Button');
	if (chbox354.checked) {
		var hlam354 = [

			];
	for (var i = 0; i < hlam354.length; i++) {
				hlam_354 = new L.circleMarker([hlam354[i][1],hlam354[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam354[i][0])
					.bindTooltip(hlam354[i][0], {direction: 'top'})
					.addTo(hlam354icons);
			}
	}
	else {
		hlam354icons.clearLayers();
	}
}
var hlam355icons = L.layerGroup().addTo(map);
function Hlam355OnOff() {
	var chbox355;
	chbox355=document.getElementById('Hlam355Button');
	if (chbox355.checked) {
		var hlam355 = [

			];
	for (var i = 0; i < hlam355.length; i++) {
				hlam_355 = new L.circleMarker([hlam355[i][1],hlam355[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam355[i][0])
					.bindTooltip(hlam355[i][0], {direction: 'top'})
					.addTo(hlam355icons);
			}
	}
	else {
		hlam355icons.clearLayers();
	}
}
var hlam356icons = L.layerGroup().addTo(map);
function Hlam356OnOff() {
	var chbox356;
	chbox356=document.getElementById('Hlam356Button');
	if (chbox356.checked) {
		var hlam356 = [

			];
	for (var i = 0; i < hlam356.length; i++) {
				hlam_356 = new L.circleMarker([hlam356[i][1],hlam356[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam356[i][0])
					.bindTooltip(hlam356[i][0], {direction: 'top'})
					.addTo(hlam356icons);
			}
	}
	else {
		hlam356icons.clearLayers();
	}
}
var hlam357icons = L.layerGroup().addTo(map);
function Hlam357OnOff() {
	var chbox357;
	chbox357=document.getElementById('Hlam357Button');
	if (chbox357.checked) {
		var hlam357 = [

			];
	for (var i = 0; i < hlam357.length; i++) {
				hlam_357 = new L.circleMarker([hlam357[i][1],hlam357[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam357[i][0])
					.bindTooltip(hlam357[i][0], {direction: 'top'})
					.addTo(hlam357icons);
			}
	}
	else {
		hlam357icons.clearLayers();
	}
}
var hlam358icons = L.layerGroup().addTo(map);
function Hlam358OnOff() {
	var chbox358;
	chbox358=document.getElementById('Hlam358Button');
	if (chbox358.checked) {
		var hlam358 = [

			];
	for (var i = 0; i < hlam358.length; i++) {
				hlam_358 = new L.circleMarker([hlam358[i][1],hlam358[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam358[i][0])
					.bindTooltip(hlam358[i][0], {direction: 'top'})
					.addTo(hlam358icons);
			}
	}
	else {
		hlam358icons.clearLayers();
	}
}
var hlam359icons = L.layerGroup().addTo(map);
function Hlam359OnOff() {
	var chbox359;
	chbox359=document.getElementById('Hlam359Button');
	if (chbox359.checked) {
		var hlam359 = [

			];
	for (var i = 0; i < hlam359.length; i++) {
				hlam_359 = new L.circleMarker([hlam359[i][1],hlam359[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam359[i][0])
					.bindTooltip(hlam359[i][0], {direction: 'top'})
					.addTo(hlam359icons);
			}
	}
	else {
		hlam359icons.clearLayers();
	}
}
var hlam360icons = L.layerGroup().addTo(map);
function Hlam360OnOff() {
	var chbox360;
	chbox360=document.getElementById('Hlam360Button');
	if (chbox360.checked) {
		var hlam360 = [

			];
	for (var i = 0; i < hlam360.length; i++) {
				hlam_360 = new L.circleMarker([hlam360[i][1],hlam360[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam360[i][0])
					.bindTooltip(hlam360[i][0], {direction: 'top'})
					.addTo(hlam360icons);
			}
	}
	else {
		hlam360icons.clearLayers();
	}
}
var hlam361icons = L.layerGroup().addTo(map);
function Hlam361OnOff() {
	var chbox361;
	chbox361=document.getElementById('Hlam361Button');
	if (chbox361.checked) {
		var hlam361 = [

			];
	for (var i = 0; i < hlam361.length; i++) {
				hlam_361 = new L.circleMarker([hlam361[i][1],hlam361[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam361[i][0])
					.bindTooltip(hlam361[i][0], {direction: 'top'})
					.addTo(hlam361icons);
			}
	}
	else {
		hlam361icons.clearLayers();
	}
}
var hlam362icons = L.layerGroup().addTo(map);
function Hlam362OnOff() {
	var chbox362;
	chbox362=document.getElementById('Hlam362Button');
	if (chbox362.checked) {
		var hlam362 = [
			["Новая цилиндрическая ваза &quotЦветы&quot", -46549, 20380]
			];
	for (var i = 0; i < hlam362.length; i++) {
				hlam_362 = new L.circleMarker([hlam362[i][1],hlam362[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam362[i][0])
					.bindTooltip(hlam362[i][0], {direction: 'top'})
					.addTo(hlam362icons);
			}
	}
	else {
		hlam362icons.clearLayers();
	}
}
var hlam363icons = L.layerGroup().addTo(map);
function Hlam363OnOff() {
	var chbox363;
	chbox363=document.getElementById('Hlam363Button');
	if (chbox363.checked) {
		var hlam363 = [
			["Новое эмалированное ведро", -52434, -12973],
			["Новое эмалированное ведро", -52699, -13880],
			["Новое эмалированное ведро", -41326, -1778],
			["Новое эмалированное ведро", -40370, -1607],
			["Новое эмалированное ведро", 191717, -28429],
			["Новое эмалированное ведро", -65820, 129497],
			["Новое эмалированное ведро", -65337, 5661]
			];
	for (var i = 0; i < hlam363.length; i++) {
				hlam_363 = new L.circleMarker([hlam363[i][1],hlam363[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam363[i][0])
					.bindTooltip(hlam363[i][0], {direction: 'top'})
					.addTo(hlam363icons);
			}
	}
	else {
		hlam363icons.clearLayers();
	}
}
var hlam364icons = L.layerGroup().addTo(map);
function Hlam364OnOff() {
	var chbox364;
	chbox364=document.getElementById('Hlam364Button');
	if (chbox364.checked) {
		var hlam364 = [
			["Новый игрушечный грузовик", -44012, -8068],
			["Новый игрушечный грузовик", 75121, -179184]
			];
	for (var i = 0; i < hlam364.length; i++) {
				hlam_364 = new L.circleMarker([hlam364[i][1],hlam364[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam364[i][0])
					.bindTooltip(hlam364[i][0], {direction: 'top'})
					.addTo(hlam364icons);
			}
	}
	else {
		hlam364icons.clearLayers();
	}
}
var hlam365icons = L.layerGroup().addTo(map);
function Hlam365OnOff() {
	var chbox365;
	chbox365=document.getElementById('Hlam365Button');
	if (chbox365.checked) {
		var hlam365 = [
			["Нога горелого в банке", 101870, -12366],
			["Нога горелого в банке", 101892, -12269]
			];
	for (var i = 0; i < hlam365.length; i++) {
				hlam_365 = new L.circleMarker([hlam365[i][1],hlam365[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam365[i][0])
					.bindTooltip(hlam365[i][0], {direction: 'top'})
					.addTo(hlam365icons);
			}
	}
	else {
		hlam365icons.clearLayers();
	}
}
var hlam366icons = L.layerGroup().addTo(map);
function Hlam366OnOff() {
	var chbox366;
	chbox366=document.getElementById('Hlam366Button');
	if (chbox366.checked) {
		var hlam366 = [
			["Ножницы", -127718, -707],
			["Ножницы", -36217, -80762],
			["Ножницы", -35647, -80389],
			["Ножницы", -34277, -114404],
			["Ножницы", -49270, -100063],
			["Ножницы", -105575, -115379],
			["Ножницы", -147670, -57446],
			["Ножницы", -155928, -36046],
			["Ножницы", -168220, -42090],
			["Ножницы", 167390, -25190],
			["Ножницы", 182379, -13615],
			["Ножницы", 140527, -2832],
			["Ножницы", 138508, -53813],
			["Ножницы", 148808, -51880],
			["Ножницы", 182763, -93514],
			["Ножницы", 119543, -2204],
			["Ножницы", 76830, -15021],
			["Ножницы", 76931, -15041],
			["Ножницы", 77141, -15054],
			["Ножницы", 77155, -15065],
			["Ножницы", 77241, -15371],
			["Ножницы", 48378, -22282],
			["Ножницы", 22652, -60595],
			["Ножницы", 29368, -58605],
			["Ножницы", 16908, -44456],
			["Ножницы", 94063, -84485],
			["Ножницы", 60751, -99195],
			["Ножницы", -93731, -163359],
			["Ножницы", -132384, -148721],
			["Ножницы", 131662, -132439],
			["Ножницы", 102351, -151570],
			["Ножницы", 74356, -177777],
			["Ножницы", -92124, 183429],
			["Ножницы", -95507, 184418],
			["Ножницы", -19784, 145390],
			["Ножницы", -163466, 142034],
			["Ножницы", 79368, 182035],
			["Ножницы", 10842, 184066],
			["Ножницы", 72278, 133738],
			["Ножницы", 88136, 156766],
			["Ножницы", -43150, 88971],
			["Ножницы", -56726, 13399],
			["Ножницы", -47953, 15352],
			["Ножницы", -46671, 19731],
			["Ножницы", 192959, 113289],
			["Ножницы", 114342, 72971],
			["Ножницы", 78844, 52735],
			["Ножницы", 87364, 7319],
			["Ножницы", 87319, 7143],
			["Ножницы", -59645, 117293]
			];
	for (var i = 0; i < hlam366.length; i++) {
				hlam_366 = new L.circleMarker([hlam366[i][1],hlam366[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam366[i][0])
					.bindTooltip(hlam366[i][0], {direction: 'top'})
					.addTo(hlam366icons);
			}
	}
	else {
		hlam366icons.clearLayers();
	}
}
var hlam367icons = L.layerGroup().addTo(map);
function Hlam367OnOff() {
	var chbox367;
	chbox367=document.getElementById('Hlam367Button');
	if (chbox367.checked) {
		var hlam367 = [
			["Обгорелая книга", -9722, -27224],
			["Обгорелая книга", -35182, -21232],
			["Обгорелая книга", -51899, -13435],
			["Обгорелая книга", -51948, -13353],
			["Обгорелая книга", -52339, -13101],
			["Обгорелая книга", -47883, -8031],
			["Обгорелая книга", -47874, -8033],
			["Обгорелая книга", -41866, -5413],
			["Обгорелая книга", -41927, -5354],
			["Обгорелая книга", -43111, -5875],
			["Обгорелая книга", -52510, -1044],
			["Обгорелая книга", -67319, -1394],
			["Обгорелая книга", -39201, -61540],
			["Обгорелая книга", -39179, -61410],
			["Обгорелая книга", -60571, -56817],
			["Обгорелая книга", -60570, -56816],
			["Обгорелая книга", -60569, -56664],
			["Обгорелая книга", -61265, -56101],
			["Обгорелая книга", -61326, -56099],
			["Обгорелая книга", -47201, -50044],
			["Обгорелая книга", -47857, -49557],
			["Обгорелая книга", -47835, -49579],
			["Обгорелая книга", -48355, -49372],
			["Обгорелая книга", -55138, -48114],
			["Обгорелая книга", -55161, -48216],
			["Обгорелая книга", -41800, -37872],
			["Обгорелая книга", -73374, -51044],
			["Обгорелая книга", -72922, -50428],
			["Обгорелая книга", -90930, -42255],
			["Обгорелая книга", -89057, -41844],
			["Обгорелая книга", -110422, -58682],
			["Обгорелая книга", -110399, -58702],
			["Обгорелая книга", -110402, -58675],
			["Обгорелая книга", -110401, -58670],
			["Обгорелая книга", -110428, -58563],
			["Обгорелая книга", -110434, -58545],
			["Обгорелая книга", -110416, -58611],
			["Обгорелая книга", -13681, -66558],
			["Обгорелая книга", -53040, -96794],
			["Обгорелая книга", -121774, -66362],
			["Обгорелая книга", -48083, -118056],
			["Обгорелая книга", -48048, -117982],
			["Обгорелая книга", -63701, -103080],
			["Обгорелая книга", -97953, -126169],
			["Обгорелая книга", -67965, -107151],
			["Обгорелая книга", -67479, -106981],
			["Обгорелая книга", -67953, -107460],
			["Обгорелая книга", -67620, -107252],
			["Обгорелая книга", -102015, -114735],
			["Обгорелая книга", -101214, -106808],
			["Обгорелая книга", -147569, -58705],
			["Обгорелая книга", -147570, -58678],
			["Обгорелая книга", -149493, -59036],
			["Обгорелая книга", -149538, -58863],
			["Обгорелая книга", -149537, -58894],
			["Обгорелая книга", -149539, -58835],
			["Обгорелая книга", -147810, -55387],
			["Обгорелая книга", -148107, -54951],
			["Обгорелая книга", -148683, -54454],
			["Обгорелая книга", -148737, -54418],
			["Обгорелая книга", -151989, -74467],
			["Обгорелая книга", -151713, -71546],
			["Обгорелая книга", -151721, -71549],
			["Обгорелая книга", -152013, -72988],
			["Обгорелая книга", -152018, -72958],
			["Обгорелая книга", -168029, -115331],
			["Обгорелая книга", 173101, -17760],
			["Обгорелая книга", 172749, -11354],
			["Обгорелая книга", 183832, -93677],
			["Обгорелая книга", 183791, -93710],
			["Обгорелая книга", 183704, -93826],
			["Обгорелая книга", 183669, -93332],
			["Обгорелая книга", 148562, -79590],
			["Обгорелая книга", 148556, -79590],
			["Обгорелая книга", 179755, -121788],
			["Обгорелая книга", 129385, -31411],
			["Обгорелая книга", 129394, -31454],
			["Обгорелая книга", 129397, -31460],
			["Обгорелая книга", 129394, -31465],
			["Обгорелая книга", 129400, -31466],
			["Обгорелая книга", 129395, -31472],
			["Обгорелая книга", 129537, -31158],
			["Обгорелая книга", 129877, -30678],
			["Обгорелая книга", 129879, -30667],
			["Обгорелая книга", 129880, -30670],
			["Обгорелая книга", 129867, -30635],
			["Обгорелая книга", 129887, -30612],
			["Обгорелая книга", 129838, -30560],
			["Обгорелая книга", 129838, -30595],
			["Обгорелая книга", 129878, -30609],
			["Обгорелая книга", 129874, -30617],
			["Обгорелая книга", 129848, -30612],
			["Обгорелая книга", 129855, -30592],
			["Обгорелая книга", 129837, -30594],
			["Обгорелая книга", 129840, -30593],
			["Обгорелая книга", 103674, -20920],
			["Обгорелая книга", 88723, -31289],
			["Обгорелая книга", 88634, -31193],
			["Обгорелая книга", 90013, -32171],
			["Обгорелая книга", 89831, -31319],
			["Обгорелая книга", 89708, -31380],
			["Обгорелая книга", 77562, -15408],
			["Обгорелая книга", 77744, -15251],
			["Обгорелая книга", 77732, -15226],
			["Обгорелая книга", 77746, -15225],
			["Обгорелая книга", 83790, -15645],
			["Обгорелая книга", 83758, -15694],
			["Обгорелая книга", 92577, -12537],
			["Обгорелая книга", 90139, -9584],
			["Обгорелая книга", 92268, -9770],
			["Обгорелая книга", 92267, -9770],
			["Обгорелая книга", 94768, -4098],
			["Обгорелая книга", 84817, -2133],
			["Обгорелая книга", 84424, -2019],
			["Обгорелая книга", 94786, -4075],
			["Обгорелая книга", 94931, -4027],
			["Обгорелая книга", 48428, -22289],
			["Обгорелая книга", 29701, -21212],
			["Обгорелая книга", 29746, -21595],
			["Обгорелая книга", 29911, -21246],
			["Обгорелая книга", 30482, -21455],
			["Обгорелая книга", 115687, -63411],
			["Обгорелая книга", 58159, -65111],
			["Обгорелая книга", 38010, -48937],
			["Обгорелая книга", 39693, -36967],
			["Обгорелая книга", 51499, -40242],
			["Обгорелая книга", 52377, -40428],
			["Обгорелая книга", 52391, -40891],
			["Обгорелая книга", 52434, -40898],
			["Обгорелая книга", 11879, -60863],
			["Обгорелая книга", 29556, -58369],
			["Обгорелая книга", 29402, -58690],
			["Обгорелая книга", 29577, -58633],
			["Обгорелая книга", 30882, -33719],
			["Обгорелая книга", 30891, -33717],
			["Обгорелая книга", 30889, -33718],
			["Обгорелая книга", 30898, -33713],
			["Обгорелая книга", 75238, -76780],
			["Обгорелая книга", 45442, -74341],
			["Обгорелая книга", 7624, -96926],
			["Обгорелая книга", 12262, -83645],
			["Обгорелая книга", 65872, -125314],
			["Обгорелая книга", 20732, -108820],
			["Обгорелая книга", 21039, -108686],
			["Обгорелая книга", 21118, -109767],
			["Обгорелая книга", 21111, -109784],
			["Обгорелая книга", 20554, -101931],
			["Обгорелая книга", 20556, -101943],
			["Обгорелая книга", 20555, -101922],
			["Обгорелая книга", 29224, -100594],
			["Обгорелая книга", -2074, -160195],
			["Обгорелая книга", -1998, -160015],
			["Обгорелая книга", -4381, -156043],
			["Обгорелая книга", -27456, -131669],
			["Обгорелая книга", -61149, -145685],
			["Обгорелая книга", -61146, -145560],
			["Обгорелая книга", -126584, -144619],
			["Обгорелая книга", -8420, -165242],
			["Обгорелая книга", -119733, -188681],
			["Обгорелая книга", -120456, -189990],
			["Обгорелая книга", 164893, -150632],
			["Обгорелая книга", 164902, -150764],
			["Обгорелая книга", 189319, -169360],
			["Обгорелая книга", 79751, -154330],
			["Обгорелая книга", 61980, -134092],
			["Обгорелая книга", 26067, -138089],
			["Обгорелая книга", 26013, -138063],
			["Обгорелая книга", 74753, -177562],
			["Обгорелая книга", 74762, -177371],
			["Обгорелая книга", 74758, -177419],
			["Обгорелая книга", 74692, -177384],
			["Обгорелая книга", 74519, -177495],
			["Обгорелая книга", 74492, -177254],
			["Обгорелая книга", 71855, -175162],
			["Обгорелая книга", -25265, 186104],
			["Обгорелая книга", -25349, 185646],
			["Обгорелая книга", -23318, 189565],
			["Обгорелая книга", -83482, 165957],
			["Обгорелая книга", -97304, 179322],
			["Обгорелая книга", -97384, 184122],
			["Обгорелая книга", -95227, 190151],
			["Обгорелая книга", -95061, 190193],
			["Обгорелая книга", -98663, 183478],
			["Обгорелая книга", -26537, 162641],
			["Обгорелая книга", -17605, 162188],
			["Обгорелая книга", -90483, 150360],
			["Обгорелая книга", -143523, 178661],
			["Обгорелая книга", -145606, 177000],
			["Обгорелая книга", -144396, 150217],
			["Обгорелая книга", 162763, 206593],
			["Обгорелая книга", 162807, 206574],
			["Обгорелая книга", 152729, 161633],
			["Обгорелая книга", 79857, 181766],
			["Обгорелая книга", 42399, 177019],
			["Обгорелая книга", 42744, 176682],
			["Обгорелая книга", 42418, 176940],
			["Обгорелая книга", 42649, 176369],
			["Обгорелая книга", 42138, 176279],
			["Обгорелая книга", 42571, 176336],
			["Обгорелая книга", 44734, 176520],
			["Обгорелая книга", 44546, 176534],
			["Обгорелая книга", 44521, 176957],
			["Обгорелая книга", 44715, 176752],
			["Обгорелая книга", 44556, 176938],
			["Обгорелая книга", 44518, 176732],
			["Обгорелая книга", 43430, 177271],
			["Обгорелая книга", 43461, 177271],
			["Обгорелая книга", 48537, 190922],
			["Обгорелая книга", 49285, 190510],
			["Обгорелая книга", 49286, 190484],
			["Обгорелая книга", 13065, 174495],
			["Обгорелая книга", 13065, 174495],
			["Обгорелая книга", 13114, 174459],
			["Обгорелая книга", 13334, 174404],
			["Обгорелая книга", 13291, 174347],
			["Обгорелая книга", 14696, 191196],
			["Обгорелая книга", 15113, 191410],
			["Обгорелая книга", 14617, 193268],
			["Обгорелая книга", 112015, 141368],
			["Обгорелая книга", 87518, 158068],
			["Обгорелая книга", 33369, 131675],
			["Обгорелая книга", 2059, 137790],
			["Обгорелая книга", 1810, 138320],
			["Обгорелая книга", 2703, 161746],
			["Обгорелая книга", -29268, 125237],
			["Обгорелая книга", -59901, 117105],
			["Обгорелая книга", -69885, 110725],
			["Обгорелая книга", -69882, 110725],
			["Обгорелая книга", -42154, 86978],
			["Обгорелая книга", -42259, 87011],
			["Обгорелая книга", -42526, 87362],
			["Обгорелая книга", -41071, 87693],
			["Обгорелая книга", -41086, 87691],
			["Обгорелая книга", -42103, 88681],
			["Обгорелая книга", -42440, 87087],
			["Обгорелая книга", -42440, 87085],
			["Обгорелая книга", -68654, 56113],
			["Обгорелая книга", -87662, 63471],
			["Обгорелая книга", -87661, 63469],
			["Обгорелая книга", -123583, 51146],
			["Обгорелая книга", -123583, 51145],
			["Обгорелая книга", -38280, 3601],
			["Обгорелая книга", -38478, 3680],
			["Обгорелая книга", -38754, 3943],
			["Обгорелая книга", -54959, 5669],
			["Обгорелая книга", -54849, 5625],
			["Обгорелая книга", -54848, 5623],
			["Обгорелая книга", -49861, 5671],
			["Обгорелая книга", -38534, 4616],
			["Обгорелая книга", -38541, 4272],
			["Обгорелая книга", -40682, 8330],
			["Обгорелая книга", -40722, 8335],
			["Обгорелая книга", -46666, 18892],
			["Обгорелая книга", -46666, 18892],
			["Обгорелая книга", -46666, 18892],
			["Обгорелая книга", -46717, 18775],
			["Обгорелая книга", -46717, 18775],
			["Обгорелая книга", -46717, 18775],
			["Обгорелая книга", -98681, 8129],
			["Обгорелая книга", -130785, 10745],
			["Обгорелая книга", -130895, 10686],
			["Обгорелая книга", -146112, 66025],
			["Обгорелая книга", -145985, 65957],
			["Обгорелая книга", -133928, 59234],
			["Обгорелая книга", 181391, 109528],
			["Обгорелая книга", 181446, 109959],
			["Обгорелая книга", 181437, 110011],
			["Обгорелая книга", 181428, 110015],
			["Обгорелая книга", 180860, 110675],
			["Обгорелая книга", 180860, 110675],
			["Обгорелая книга", 192372, 113734],
			["Обгорелая книга", 153539, 105388],
			["Обгорелая книга", 153537, 105598],
			["Обгорелая книга", 191433, 61236],
			["Обгорелая книга", 196235, 65507],
			["Обгорелая книга", 166505, 14884],
			["Обгорелая книга", 166520, 14883],
			["Обгорелая книга", 139780, 8443],
			["Обгорелая книга", 139810, 8448],
			["Обгорелая книга", 139810, 8448],
			["Обгорелая книга", 157409, 13556],
			["Обгорелая книга", 88394, 105786],
			["Обгорелая книга", 45873, 101245],
			["Обгорелая книга", 45860, 101250],
			["Обгорелая книга", 45846, 101237],
			["Обгорелая книга", 24293, 121692],
			["Обгорелая книга", 24186, 121842],
			["Обгорелая книга", 24874, 124880],
			["Обгорелая книга", 101468, 69408],
			["Обгорелая книга", 100360, 91150],
			["Обгорелая книга", 100203, 91180],
			["Обгорелая книга", 100213, 91277],
			["Обгорелая книга", 71353, 96513],
			["Обгорелая книга", 71366, 96524],
			["Обгорелая книга", 109710, 57313],
			["Обгорелая книга", 16834, 45540],
			["Обгорелая книга", 17004, 45623],
			["Обгорелая книга", 8650, 49308],
			["Обгорелая книга", 8650, 49308],
			["Обгорелая книга", 8651, 49308],
			["Обгорелая книга", 8651, 49308],
			["Обгорелая книга", 8651, 49308],
			["Обгорелая книга", 8737, 49215],
			["Обгорелая книга", 8737, 49215],
			["Обгорелая книга", 8737, 49215],
			["Обгорелая книга", 120812, 6460],
			["Обгорелая книга", 121191, 5485],
			["Обгорелая книга", 58508, 11029],
			["Обгорелая книга", 58515, 11030],
			["Обгорелая книга", 58496, 11001],
			["Обгорелая книга", 57815, 10026],
			["Обгорелая книга", 57770, 10074]
			];
	for (var i = 0; i < hlam367.length; i++) {
				hlam_367 = new L.circleMarker([hlam367[i][1],hlam367[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam367[i][0])
					.bindTooltip(hlam367[i][0], {direction: 'top'})
					.addTo(hlam367icons);
			}
	}
	else {
		hlam367icons.clearLayers();
	}
}
var hlam368icons = L.layerGroup().addTo(map);
function Hlam368OnOff() {
	var chbox368;
	chbox368=document.getElementById('Hlam368Button');
	if (chbox368.checked) {
		var hlam368 = [
			["Обгорелый журнал мод", -148993, -58960],
			["Обгорелый журнал мод", -147984, -55387],
			["Обгорелый журнал мод", -147960, -55388],
			["Обгорелый журнал мод", 173265, -13688],
			["Обгорелый журнал мод", 152899, -103849],
			["Обгорелый журнал мод", 70137, -7237],
			["Обгорелый журнал мод", 70241, -7347],
			["Обгорелый журнал мод", 47639, -20352],
			["Обгорелый журнал мод", 32642, -39735],
			["Обгорелый журнал мод", 32692, -40177],
			["Обгорелый журнал мод", 32498, -40256],
			["Обгорелый журнал мод", 32609, -40227],
			["Обгорелый журнал мод", 32629, -40233],
			["Обгорелый журнал мод", 32542, -40255],
			["Обгорелый журнал мод", 32515, -40252],
			["Обгорелый журнал мод", 31013, -33691],
			["Обгорелый журнал мод", -121975, -183984],
			["Обгорелый журнал мод", 74756, -177436],
			["Обгорелый журнал мод", 74757, -177390],
			["Обгорелый журнал мод", 74531, -177291],
			["Обгорелый журнал мод", -16549, 164092],
			["Обгорелый журнал мод", -93155, 180696],
			["Обгорелый журнал мод", -93080, 180694],
			["Обгорелый журнал мод", -93158, 180684],
			["Обгорелый журнал мод", -72864, 184531],
			["Обгорелый журнал мод", 149886, 139096],
			["Обгорелый журнал мод", 149617, 139044],
			["Обгорелый журнал мод", 80142, 182168],
			["Обгорелый журнал мод", 20152, 134879],
			["Обгорелый журнал мод", -78405, 89870],
			["Обгорелый журнал мод", -68172, 64017],
			["Обгорелый журнал мод", -53966, 5448],
			["Обгорелый журнал мод", 131874, 11892],
			["Обгорелый журнал мод", 94899, 98825],
			["Обгорелый журнал мод", 23453, 44120],
			["Обгорелый журнал мод", 27767, 47469],
			["Обгорелый журнал мод", 93781, 9117],
			["Обгорелый журнал мод", 57867, 10859],
			["Обгорелый журнал мод", 57896, 10886]
			];
	for (var i = 0; i < hlam368.length; i++) {
				hlam_368 = new L.circleMarker([hlam368[i][1],hlam368[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam368[i][0])
					.bindTooltip(hlam368[i][0], {direction: 'top'})
					.addTo(hlam368icons);
			}
	}
	else {
		hlam368icons.clearLayers();
	}
}
var hlam369icons = L.layerGroup().addTo(map);
function Hlam369OnOff() {
	var chbox369;
	chbox369=document.getElementById('Hlam369Button');
	if (chbox369.checked) {
		var hlam369 = [
			["Обгорелый комикс &quotГрогнак&quot", -17303, -46543],
			["Обгорелый комикс &quotГрогнак&quot", -17333, -46545],
			["Обгорелый комикс &quotГрогнак&quot", -17331, -46577],
			["Обгорелый комикс &quotГрогнак&quot", -17318, -46609],
			["Обгорелый комикс &quotГрогнак&quot", -17309, -46558],
			["Обгорелый комикс &quotГрогнак&quot", -110273, -58502],
			["Обгорелый комикс &quotГрогнак&quot", -110307, -58511],
			["Обгорелый комикс &quotГрогнак&quot", -68749, -105594],
			["Обгорелый комикс &quotГрогнак&quot", 142928, -59458],
			["Обгорелый комикс &quotГрогнак&quot", 151320, -52581],
			["Обгорелый комикс &quotГрогнак&quot", 79316, -65],
			["Обгорелый комикс &quotГрогнак&quot", 29361, -58682],
			["Обгорелый комикс &quotГрогнак&quot", -1644, -164327],
			["Обгорелый комикс &quotГрогнак&quot", -76106, -176213],
			["Обгорелый комикс &quotГрогнак&quot", -97035, 184409],
			["Обгорелый комикс &quotГрогнак&quot", -144312, 148475],
			["Обгорелый комикс &quotГрогнак&quot", -144764, 149413],
			["Обгорелый комикс &quotГрогнак&quot", -137115, 152957],
			["Обгорелый комикс &quotГрогнак&quot", -137151, 152630],
			["Обгорелый комикс &quotГрогнак&quot", -137189, 152798],
			["Обгорелый комикс &quotГрогнак&quot", -137333, 152992],
			["Обгорелый комикс &quotГрогнак&quot", -137241, 152982],
			["Обгорелый комикс &quotГрогнак&quot", -137373, 153165],
			["Обгорелый комикс &quotГрогнак&quot", -137279, 153157],
			["Обгорелый комикс &quotГрогнак&quot", 26381, 131346],
			["Обгорелый комикс &quotГрогнак&quot", 26304, 131367],
			["Обгорелый комикс &quotГрогнак&quot", -53946, 93094],
			["Обгорелый комикс &quotГрогнак&quot", -30188, 16872],
			["Обгорелый комикс &quotГрогнак&quot", -64886, 5568],
			["Обгорелый комикс &quotГрогнак&quot", -64795, 5581],
			["Обгорелый комикс &quotГрогнак&quot", 136351, 124122],
			["Обгорелый комикс &quotГрогнак&quot", 120432, 5360],
			["Обгорелый комикс &quotГрогнак&quot", 58876, 9197]
			];
	for (var i = 0; i < hlam369.length; i++) {
				hlam_369 = new L.circleMarker([hlam369[i][1],hlam369[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam369[i][0])
					.bindTooltip(hlam369[i][0], {direction: 'top'})
					.addTo(hlam369icons);
			}
	}
	else {
		hlam369icons.clearLayers();
	}
}
var hlam370icons = L.layerGroup().addTo(map);
function Hlam370OnOff() {
	var chbox370;
	chbox370=document.getElementById('Hlam370Button');
	if (chbox370.checked) {
		var hlam370 = [
			["Обгорелый комикс &quotМорской дьявол&quot", -17275, -46578],
			["Обгорелый комикс &quotМорской дьявол&quot", -41326, -37539],
			["Обгорелый комикс &quotМорской дьявол&quot", -29374, -94401],
			["Обгорелый комикс &quotМорской дьявол&quot", -68780, -105585],
			["Обгорелый комикс &quotМорской дьявол&quot", -68776, -105595],
			["Обгорелый комикс &quotМорской дьявол&quot", -112049, -122171],
			["Обгорелый комикс &quotМорской дьявол&quot", 173348, -18216],
			["Обгорелый комикс &quotМорской дьявол&quot", 151313, -52613],
			["Обгорелый комикс &quotМорской дьявол&quot", 151323, -52609],
			["Обгорелый комикс &quotМорской дьявол&quot", 88116, -22087],
			["Обгорелый комикс &quotМорской дьявол&quot", 79215, -107],
			["Обгорелый комикс &quotМорской дьявол&quot", 93549, -1385],
			["Обгорелый комикс &quotМорской дьявол&quot", 11888, -60843],
			["Обгорелый комикс &quotМорской дьявол&quot", 30832, -33717],
			["Обгорелый комикс &quotМорской дьявол&quot", 20549, -101894],
			["Обгорелый комикс &quotМорской дьявол&quot", -76314, -184364],
			["Обгорелый комикс &quotМорской дьявол&quot", -76100, -176136],
			["Обгорелый комикс &quotМорской дьявол&quot", -76108, -176246],
			["Обгорелый комикс &quotМорской дьявол&quot", -76098, -176240],
			["Обгорелый комикс &quotМорской дьявол&quot", -120256, -189640],
			["Обгорелый комикс &quotМорской дьявол&quot", -17614, 162158],
			["Обгорелый комикс &quotМорской дьявол&quot", -139364, 171806],
			["Обгорелый комикс &quotМорской дьявол&quot", -144314, 148496],
			["Обгорелый комикс &quotМорской дьявол&quot", -144832, 149384],
			["Обгорелый комикс &quotМорской дьявол&quot", -137219, 152798],
			["Обгорелый комикс &quotМорской дьявол&quot", -137246, 153157],
			["Обгорелый комикс &quotМорской дьявол&quot", -137252, 153166],
			["Обгорелый комикс &quotМорской дьявол&quot", -137372, 152947],
			["Обгорелый комикс &quotМорской дьявол&quot", -137330, 152957],
			["Обгорелый комикс &quotМорской дьявол&quot", -137293, 152771],
			["Обгорелый комикс &quotМорской дьявол&quot", -137317, 152761],
			["Обгорелый комикс &quotМорской дьявол&quot", -137319, 152729],
			["Обгорелый комикс &quotМорской дьявол&quot", -137291, 152762],
			["Обгорелый комикс &quotМорской дьявол&quot", -137186, 152763],
			["Обгорелый комикс &quotМорской дьявол&quot", 152416, 161958],
			["Обгорелый комикс &quotМорской дьявол&quot", -5455, 33838],
			["Обгорелый комикс &quotМорской дьявол&quot", -30159, 16897],
			["Обгорелый комикс &quotМорской дьявол&quot", -64822, 5584],
			["Обгорелый комикс &quotМорской дьявол&quot", -138809, 88763],
			["Обгорелый комикс &quotМорской дьявол&quot", 122003, 118228],
			["Обгорелый комикс &quotМорской дьявол&quot", 109707, 57511],
			["Обгорелый комикс &quotМорской дьявол&quot", 23116, 44046],
			["Обгорелый комикс &quotМорской дьявол&quot", 92564, 32125],
			["Обгорелый комикс &quotМорской дьявол&quot", 58307, 10111]
			];
	for (var i = 0; i < hlam370.length; i++) {
				hlam_370 = new L.circleMarker([hlam370[i][1],hlam370[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam370[i][0])
					.bindTooltip(hlam370[i][0], {direction: 'top'})
					.addTo(hlam370icons);
			}
	}
	else {
		hlam370icons.clearLayers();
	}
}
var hlam371icons = L.layerGroup().addTo(map);
function Hlam371OnOff() {
	var chbox371;
	chbox371=document.getElementById('Hlam371Button');
	if (chbox371.checked) {
		var hlam371 = [
			["Обгорелый комикс &quotНесокрушимые&quot", -17322, -46572],
			["Обгорелый комикс &quotНесокрушимые&quot", -17310, -46618],
			["Обгорелый комикс &quotНесокрушимые&quot", -17280, -46544],
			["Обгорелый комикс &quotНесокрушимые&quot", -41328, -37537],
			["Обгорелый комикс &quotНесокрушимые&quot", -110425, -58581],
			["Обгорелый комикс &quotНесокрушимые&quot", -110337, -58519],
			["Обгорелый комикс &quotНесокрушимые&quot", -110287, -58513],
			["Обгорелый комикс &quotНесокрушимые&quot", -110333, -58517],
			["Обгорелый комикс &quotНесокрушимые&quot", -120556, -45926],
			["Обгорелый комикс &quotНесокрушимые&quot", -24202, -73165],
			["Обгорелый комикс &quotНесокрушимые&quot", 169051, -1386],
			["Обгорелый комикс &quotНесокрушимые&quot", 88128, -22064],
			["Обгорелый комикс &quotНесокрушимые&quot", 84743, -19218],
			["Обгорелый комикс &quotНесокрушимые&quot", 84815, -2138],
			["Обгорелый комикс &quotНесокрушимые&quot", -81452, -178416],
			["Обгорелый комикс &quotНесокрушимые&quot", -76102, -176108],
			["Обгорелый комикс &quotНесокрушимые&quot", -96934, 184382],
			["Обгорелый комикс &quotНесокрушимые&quot", 152704, 161643],
			["Обгорелый комикс &quotНесокрушимые&quot", 14763, 193477],
			["Обгорелый комикс &quotНесокрушимые&quot", 72837, 137074],
			["Обгорелый комикс &quotНесокрушимые&quot", 2507, 162011],
			["Обгорелый комикс &quotНесокрушимые&quot", -54020, 93121],
			["Обгорелый комикс &quotНесокрушимые&quot", -148748, 113404],
			["Обгорелый комикс &quotНесокрушимые&quot", 109949, 57692],
			["Обгорелый комикс &quotНесокрушимые&quot", 23495, 44097],
			["Обгорелый комикс &quotНесокрушимые&quot", 23051, 43961],
			["Обгорелый комикс &quotНесокрушимые&quot", 120465, 5311],
			["Обгорелый комикс &quotНесокрушимые&quot", 79393, 55],
			["Обгорелый комикс &quotНесокрушимые&quot", 57988, 9898]
			];
	for (var i = 0; i < hlam371.length; i++) {
				hlam_371 = new L.circleMarker([hlam371[i][1],hlam371[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam371[i][0])
					.bindTooltip(hlam371[i][0], {direction: 'top'})
					.addTo(hlam371icons);
			}
	}
	else {
		hlam371icons.clearLayers();
	}
}
var hlam372icons = L.layerGroup().addTo(map);
function Hlam372OnOff() {
	var chbox372;
	chbox372=document.getElementById('Hlam372Button');
	if (chbox372.checked) {
		var hlam372 = [
			["Обгорелый популярный журнал", -52137, -13663],
			["Обгорелый популярный журнал", -41360, -37601],
			["Обгорелый популярный журнал", -110406, -58662],
			["Обгорелый популярный журнал", -23956, -73023],
			["Обгорелый популярный журнал", -149006, -58933],
			["Обгорелый популярный журнал", -147960, -55388],
			["Обгорелый популярный журнал", -150922, -72941],
			["Обгорелый популярный журнал", 173369, -18192],
			["Обгорелый популярный журнал", 173611, -14479],
			["Обгорелый популярный журнал", 183838, -91722],
			["Обгорелый популярный журнал", 173628, -75480],
			["Обгорелый популярный журнал", 152880, -103834],
			["Обгорелый популярный журнал", 128250, -32204],
			["Обгорелый популярный журнал", 84673, -19198],
			["Обгорелый популярный журнал", 70104, -7335],
			["Обгорелый популярный журнал", 47577, -20393],
			["Обгорелый популярный журнал", 51735, -40705],
			["Обгорелый популярный журнал", 36045, -35214],
			["Обгорелый популярный журнал", 32451, -40405],
			["Обгорелый популярный журнал", 32432, -39993],
			["Обгорелый популярный журнал", 32507, -40213],
			["Обгорелый популярный журнал", 32668, -40213],
			["Обгорелый популярный журнал", 32523, -40260],
			["Обгорелый популярный журнал", 32498, -40257],
			["Обгорелый популярный журнал", 32555, -40241],
			["Обгорелый популярный журнал", 32650, -40228],
			["Обгорелый популярный журнал", 32610, -40239],
			["Обгорелый популярный журнал", 32604, -40230],
			["Обгорелый популярный журнал", 9262, -107272],
			["Обгорелый популярный журнал", -81868, -178042],
			["Обгорелый популярный журнал", -139207, -144348],
			["Обгорелый популярный журнал", -16561, 164056],
			["Обгорелый популярный журнал", -93161, 180647],
			["Обгорелый популярный журнал", -93169, 180645],
			["Обгорелый популярный журнал", -93167, 180698],
			["Обгорелый популярный журнал", 149600, 138980],
			["Обгорелый популярный журнал", 20187, 134866],
			["Обгорелый популярный журнал", 24157, 131369],
			["Обгорелый популярный журнал", 27190, 131837],
			["Обгорелый популярный журнал", -78404, 89787],
			["Обгорелый популярный журнал", -68177, 63972],
			["Обгорелый популярный журнал", -68188, 63986],
			["Обгорелый популярный журнал", -68176, 64030],
			["Обгорелый популярный журнал", -68161, 63987],
			["Обгорелый популярный журнал", -68227, 63935],
			["Обгорелый популярный журнал", -38224, 3603],
			["Обгорелый популярный журнал", -53128, 5417],
			["Обгорелый популярный журнал", -133965, 59184],
			["Обгорелый популярный журнал", -133904, 59193],
			["Обгорелый популярный журнал", 134071, 85937],
			["Обгорелый популярный журнал", 194052, 57883],
			["Обгорелый популярный журнал", 109991, 57507],
			["Обгорелый популярный журнал", 109676, 57467],
			["Обгорелый популярный журнал", 23073, 43986]
			];
	for (var i = 0; i < hlam372.length; i++) {
				hlam_372 = new L.circleMarker([hlam372[i][1],hlam372[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam372[i][0])
					.bindTooltip(hlam372[i][0], {direction: 'top'})
					.addTo(hlam372icons);
			}
	}
	else {
		hlam372icons.clearLayers();
	}
}
var hlam373icons = L.layerGroup().addTo(map);
function Hlam373OnOff() {
	var chbox373;
	chbox373=document.getElementById('Hlam373Button');
	if (chbox373.checked) {
		var hlam373 = [
			["Обгорелый рекламный журнал", -52080, -13768],
			["Обгорелый рекламный журнал", -40541, -2898],
			["Обгорелый рекламный журнал", -41773, -37806],
			["Обгорелый рекламный журнал", -41350, -37598],
			["Обгорелый рекламный журнал", -117975, -85412],
			["Обгорелый рекламный журнал", -117892, -85286],
			["Обгорелый рекламный журнал", -8250, -121405],
			["Обгорелый рекламный журнал", -8240, -121404],
			["Обгорелый рекламный журнал", -149309, -56387],
			["Обгорелый рекламный журнал", -149270, -56372],
			["Обгорелый рекламный журнал", -155693, -36642],
			["Обгорелый рекламный журнал", -132523, -96606],
			["Обгорелый рекламный журнал", -150902, -72955],
			["Обгорелый рекламный журнал", 173835, -13961],
			["Обгорелый рекламный журнал", 180641, -11823],
			["Обгорелый рекламный журнал", 183797, -91675],
			["Обгорелый рекламный журнал", 173647, -75486],
			["Обгорелый рекламный журнал", 160686, -92151],
			["Обгорелый рекламный журнал", 160856, -91615],
			["Обгорелый рекламный журнал", 152913, -103887],
			["Обгорелый рекламный журнал", 130449, -30873],
			["Обгорелый рекламный журнал", 128698, -31294],
			["Обгорелый рекламный журнал", 84666, -19203],
			["Обгорелый рекламный журнал", 51697, -40703],
			["Обгорелый рекламный журнал", 51738, -40725],
			["Обгорелый рекламный журнал", 52441, -40382],
			["Обгорелый рекламный журнал", 52322, -40378],
			["Обгорелый рекламный журнал", 52418, -40892],
			["Обгорелый рекламный журнал", 32640, -40231],
			["Обгорелый рекламный журнал", 32620, -40236],
			["Обгорелый рекламный журнал", 32533, -40258],
			["Обгорелый рекламный журнал", 32495, -40268],
			["Обгорелый рекламный журнал", 32644, -40219],
			["Обгорелый рекламный журнал", 9263, -107241],
			["Обгорелый рекламный журнал", -2465, -159833],
			["Обгорелый рекламный журнал", -121983, -184032],
			["Обгорелый рекламный журнал", 74543, -177302],
			["Обгорелый рекламный журнал", 74532, -177393],
			["Обгорелый рекламный журнал", -92947, 180874],
			["Обгорелый рекламный журнал", -93126, 180616],
			["Обгорелый рекламный журнал", -92896, 180587],
			["Обгорелый рекламный журнал", -93159, 180639],
			["Обгорелый рекламный журнал", -93157, 180707],
			["Обгорелый рекламный журнал", -146098, 174156],
			["Обгорелый рекламный журнал", 149591, 138956],
			["Обгорелый рекламный журнал", 80879, 184565],
			["Обгорелый рекламный журнал", 49286, 190485],
			["Обгорелый рекламный журнал", 72310, 137333],
			["Обгорелый рекламный журнал", 24205, 131277],
			["Обгорелый рекламный журнал", -78426, 89857],
			["Обгорелый рекламный журнал", -68189, 64002],
			["Обгорелый рекламный журнал", -68243, 63905],
			["Обгорелый рекламный журнал", -68241, 63887],
			["Обгорелый рекламный журнал", -37975, 3826],
			["Обгорелый рекламный журнал", -38255, 3605],
			["Обгорелый рекламный журнал", 133408, 121583],
			["Обгорелый рекламный журнал", 134078, 85925],
			["Обгорелый рекламный журнал", 194092, 58153],
			["Обгорелый рекламный журнал", 94853, 98907],
			["Обгорелый рекламный журнал", 130137, 74126],
			["Обгорелый рекламный журнал", 109854, 57364],
			["Обгорелый рекламный журнал", 57840, 10864],
			["Обгорелый рекламный журнал", 57776, 10037],
			["Обгорелый рекламный журнал", 58013, 10021],
			["Обгорелый рекламный журнал", 57968, 9980],
			["Обгорелый рекламный журнал", 58431, 10490]
			];
	for (var i = 0; i < hlam373.length; i++) {
				hlam_373 = new L.circleMarker([hlam373[i][1],hlam373[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam373[i][0])
					.bindTooltip(hlam373[i][0], {direction: 'top'})
					.addTo(hlam373icons);
			}
	}
	else {
		hlam373icons.clearLayers();
	}
}
var hlam374icons = L.layerGroup().addTo(map);
function Hlam374OnOff() {
	var chbox374;
	chbox374=document.getElementById('Hlam374Button');
	if (chbox374.checked) {
		var hlam374 = [
			["Обгорелый учебник", -9458, -26988],
			["Обгорелый учебник", -52152, -13600],
			["Обгорелый учебник", -51924, -13458],
			["Обгорелый учебник", -52315, -13101],
			["Обгорелый учебник", -41871, -5412],
			["Обгорелый учебник", -42588, -5438],
			["Обгорелый учебник", -67327, -1364],
			["Обгорелый учебник", -67322, -1386],
			["Обгорелый учебник", -67320, -1389],
			["Обгорелый учебник", -62172, -56748],
			["Обгорелый учебник", -61796, -56783],
			["Обгорелый учебник", -48442, -49544],
			["Обгорелый учебник", -46476, -50910],
			["Обгорелый учебник", -47857, -49556],
			["Обгорелый учебник", -48355, -49372],
			["Обгорелый учебник", -48332, -49369],
			["Обгорелый учебник", -41352, -37554],
			["Обгорелый учебник", -72923, -50435],
			["Обгорелый учебник", -89066, -41858],
			["Обгорелый учебник", -89008, -41798],
			["Обгорелый учебник", -110427, -58578],
			["Обгорелый учебник", -110433, -58577],
			["Обгорелый учебник", -119315, -46823],
			["Обгорелый учебник", -119813, -46886],
			["Обгорелый учебник", -24012, -72981],
			["Обгорелый учебник", -48803, -129437],
			["Обгорелый учебник", -98004, -126543],
			["Обгорелый учебник", -101866, -114903],
			["Обгорелый учебник", -101230, -107017],
			["Обгорелый учебник", -147595, -58661],
			["Обгорелый учебник", -147609, -58622],
			["Обгорелый учебник", -147574, -58634],
			["Обгорелый учебник", -147810, -55387],
			["Обгорелый учебник", -148263, -54917],
			["Обгорелый учебник", -148708, -54464],
			["Обгорелый учебник", -148685, -54417],
			["Обгорелый учебник", -151730, -71557],
			["Обгорелый учебник", -151688, -71598],
			["Обгорелый учебник", -151780, -71568],
			["Обгорелый учебник", -152016, -72958],
			["Обгорелый учебник", -168016, -115325],
			["Обгорелый учебник", -168017, -115308],
			["Обгорелый учебник", -168084, -112475],
			["Обгорелый учебник", -168048, -112418],
			["Обгорелый учебник", 172548, -11924],
			["Обгорелый учебник", 180761, -11927],
			["Обгорелый учебник", 180779, -11977],
			["Обгорелый учебник", 180727, -12007],
			["Обгорелый учебник", 180397, -11949],
			["Обгорелый учебник", 165120, -7364],
			["Обгорелый учебник", 165219, -7694],
			["Обгорелый учебник", 165134, -7513],
			["Обгорелый учебник", 174228, -53303],
			["Обгорелый учебник", 183835, -93655],
			["Обгорелый учебник", 183834, -93652],
			["Обгорелый учебник", 148546, -79604],
			["Обгорелый учебник", 148512, -79657],
			["Обгорелый учебник", 148528, -79955],
			["Обгорелый учебник", 103719, -20780],
			["Обгорелый учебник", 101293, -11956],
			["Обгорелый учебник", 101506, -12081],
			["Обгорелый учебник", 88629, -31193],
			["Обгорелый учебник", 88662, -31240],
			["Обгорелый учебник", 88632, -31201],
			["Обгорелый учебник", 88817, -31297],
			["Обгорелый учебник", 90090, -32195],
			["Обгорелый учебник", 89827, -31311],
			["Обгорелый учебник", 89774, -31395],
			["Обгорелый учебник", 89779, -31365],
			["Обгорелый учебник", 90639, -29297],
			["Обгорелый учебник", 81486, -21350],
			["Обгорелый учебник", 77510, -15340],
			["Обгорелый учебник", 77747, -15215],
			["Обгорелый учебник", 92583, -12545],
			["Обгорелый учебник", 92597, -12535],
			["Обгорелый учебник", 89428, -8721],
			["Обгорелый учебник", 70295, -5368],
			["Обгорелый учебник", 94529, -4164],
			["Обгорелый учебник", 94773, -4099],
			["Обгорелый учебник", 84817, -2129],
			["Обгорелый учебник", 84424, -2019],
			["Обгорелый учебник", 93765, -1291],
			["Обгорелый учебник", 48356, -22247],
			["Обгорелый учебник", 29584, -21365],
			["Обгорелый учебник", 29702, -21214],
			["Обгорелый учебник", 115660, -63442],
			["Обгорелый учебник", 38056, -48888],
			["Обгорелый учебник", 39808, -37122],
			["Обгорелый учебник", 51529, -40253],
			["Обгорелый учебник", 29558, -58368],
			["Обгорелый учебник", 29402, -58690],
			["Обгорелый учебник", 29581, -58633],
			["Обгорелый учебник", 29402, -58690],
			["Обгорелый учебник", 29402, -58690],
			["Обгорелый учебник", 30888, -33719],
			["Обгорелый учебник", 30895, -33718],
			["Обгорелый учебник", 7636, -96852],
			["Обгорелый учебник", 12212, -83644],
			["Обгорелый учебник", 8915, -85835],
			["Обгорелый учебник", 12316, -83623],
			["Обгорелый учебник", 13257, -106917],
			["Обгорелый учебник", 13720, -107444],
			["Обгорелый учебник", 22193, -105416],
			["Обгорелый учебник", -4380, -156043],
			["Обгорелый учебник", -27458, -131670],
			["Обгорелый учебник", -61120, -145611],
			["Обгорелый учебник", -61122, -145506],
			["Обгорелый учебник", -61147, -145638],
			["Обгорелый учебник", -61138, -145554],
			["Обгорелый учебник", -29875, -172521],
			["Обгорелый учебник", -29798, -172839],
			["Обгорелый учебник", -29879, -172975],
			["Обгорелый учебник", -29711, -173006],
			["Обгорелый учебник", -29820, -173189],
			["Обгорелый учебник", -29733, -173108],
			["Обгорелый учебник", -29522, -173361],
			["Обгорелый учебник", -29362, -173360],
			["Обгорелый учебник", -29336, -173290],
			["Обгорелый учебник", -29516, -173139],
			["Обгорелый учебник", -29309, -173079],
			["Обгорелый учебник", -29386, -172623],
			["Обгорелый учебник", -29436, -172565],
			["Обгорелый учебник", -8322, -165502],
			["Обгорелый учебник", -7899, -165229],
			["Обгорелый учебник", -38206, -174160],
			["Обгорелый учебник", 79731, -154320],
			["Обгорелый учебник", 79333, -154027],
			["Обгорелый учебник", 26008, -137330],
			["Обгорелый учебник", 26155, -137615],
			["Обгорелый учебник", 26141, -137661],
			["Обгорелый учебник", 74761, -177369],
			["Обгорелый учебник", 74755, -177420],
			["Обгорелый учебник", 74516, -177496],
			["Обгорелый учебник", 74490, -177255],
			["Обгорелый учебник", -25084, 185926],
			["Обгорелый учебник", -25219, 185976],
			["Обгорелый учебник", -95512, 190290],
			["Обгорелый учебник", -95255, 190031],
			["Обгорелый учебник", -90471, 150360],
			["Обгорелый учебник", -90389, 150363],
			["Обгорелый учебник", -90526, 149815],
			["Обгорелый учебник", -90438, 150628],
			["Обгорелый учебник", -146156, 172998],
			["Обгорелый учебник", -146166, 173011],
			["Обгорелый учебник", -146179, 173189],
			["Обгорелый учебник", -143533, 178999],
			["Обгорелый учебник", -145620, 176997],
			["Обгорелый учебник", -144389, 150181],
			["Обгорелый учебник", 162772, 206561],
			["Обгорелый учебник", 152432, 161955],
			["Обгорелый учебник", 102384, 193279],
			["Обгорелый учебник", 80077, 182450],
			["Обгорелый учебник", 60313, 171607],
			["Обгорелый учебник", 49285, 190508],
			["Обгорелый учебник", 49287, 190483],
			["Обгорелый учебник", 1635, 164570],
			["Обгорелый учебник", 1331, 164506],
			["Обгорелый учебник", 1387, 164551],
			["Обгорелый учебник", 1388, 164554],
			["Обгорелый учебник", 1750, 164561],
			["Обгорелый учебник", 1901, 164112],
			["Обгорелый учебник", 1501, 164377],
			["Обгорелый учебник", 1498, 164378],
			["Обгорелый учебник", 1496, 164378],
			["Обгорелый учебник", 1340, 164512],
			["Обгорелый учебник", 1748, 164740],
			["Обгорелый учебник", 1578, 164760],
			["Обгорелый учебник", 2109, 164312],
			["Обгорелый учебник", 1921, 164432],
			["Обгорелый учебник", 1769, 164326],
			["Обгорелый учебник", 1743, 164294],
			["Обгорелый учебник", 13065, 174495],
			["Обгорелый учебник", 13294, 174346],
			["Обгорелый учебник", 1087, 189974],
			["Обгорелый учебник", 14307, 191182],
			["Обгорелый учебник", 15115, 191200],
			["Обгорелый учебник", 14616, 193332],
			["Обгорелый учебник", 14644, 193225],
			["Обгорелый учебник", 112111, 139802],
			["Обгорелый учебник", 33222, 132337],
			["Обгорелый учебник", 33016, 132221],
			["Обгорелый учебник", -28983, 125153],
			["Обгорелый учебник", -59903, 117105],
			["Обгорелый учебник", -69908, 110738],
			["Обгорелый учебник", -68654, 56114],
			["Обгорелый учебник", -87661, 63471],
			["Обгорелый учебник", -123583, 51145],
			["Обгорелый учебник", -123582, 51145],
			["Обгорелый учебник", -7940, 20796],
			["Обгорелый учебник", -7942, 20794],
			["Обгорелый учебник", -7939, 20797],
			["Обгорелый учебник", -7942, 20796],
			["Обгорелый учебник", -7839, 20808],
			["Обгорелый учебник", -7940, 20834],
			["Обгорелый учебник", -37976, 3842],
			["Обгорелый учебник", -38483, 3761],
			["Обгорелый учебник", -38319, 4188],
			["Обгорелый учебник", -42156, 10680],
			["Обгорелый учебник", -130864, 10734],
			["Обгорелый учебник", -130954, 10680],
			["Обгорелый учебник", -130827, 10723],
			["Обгорелый учебник", -148748, 113453],
			["Обгорелый учебник", -148769, 113553],
			["Обгорелый учебник", -146110, 66023],
			["Обгорелый учебник", -146115, 66022],
			["Обгорелый учебник", -146110, 66023],
			["Обгорелый учебник", -145993, 65956],
			["Обгорелый учебник", -133922, 59195],
			["Обгорелый учебник", 181398, 109523],
			["Обгорелый учебник", 180782, 110701],
			["Обгорелый учебник", 180907, 110641],
			["Обгорелый учебник", 196845, 65569],
			["Обгорелый учебник", 196147, 65595],
			["Обгорелый учебник", 196440, 65726],
			["Обгорелый учебник", 200355, 46392],
			["Обгорелый учебник", 193482, 56303],
			["Обгорелый учебник", 162587, 55656],
			["Обгорелый учебник", 170903, 1686],
			["Обгорелый учебник", 174582, 7442],
			["Обгорелый учебник", 166917, 14827],
			["Обгорелый учебник", 166499, 14883],
			["Обгорелый учебник", 139810, 8448],
			["Обгорелый учебник", 157448, 13517],
			["Обгорелый учебник", 157416, 13553],
			["Обгорелый учебник", 91866, 114978],
			["Обгорелый учебник", 45863, 101217],
			["Обгорелый учебник", 45841, 101217],
			["Обгорелый учебник", 45831, 101236],
			["Обгорелый учебник", 25167, 124405],
			["Обгорелый учебник", 101493, 69428],
			["Обгорелый учебник", 99319, 92244],
			["Обгорелый учебник", 71357, 96518],
			["Обгорелый учебник", 109636, 57343],
			["Обгорелый учебник", 109991, 57651],
			["Обгорелый учебник", 109971, 57677],
			["Обгорелый учебник", 16832, 45574],
			["Обгорелый учебник", 16883, 45422],
			["Обгорелый учебник", 121147, 5525],
			["Обгорелый учебник", 93976, 9043],
			["Обгорелый учебник", 93851, 8991],
			["Обгорелый учебник", 100053, 7986]
			];
	for (var i = 0; i < hlam374.length; i++) {
				hlam_374 = new L.circleMarker([hlam374[i][1],hlam374[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam374[i][0])
					.bindTooltip(hlam374[i][0], {direction: 'top'})
					.addTo(hlam374icons);
			}
	}
	else {
		hlam374icons.clearLayers();
	}
}
var hlam375icons = L.layerGroup().addTo(map);
function Hlam375OnOff() {
	var chbox375;
	chbox375=document.getElementById('Hlam375Button');
	if (chbox375.checked) {
		var hlam375 = [
			["Обеденная вилка", -7813, -13582],
			["Обеденная вилка", -7787, -13622],
			["Обеденная вилка", -8540, -3128],
			["Обеденная вилка", -50697, -13032],
			["Обеденная вилка", -50432, -13717],
			["Обеденная вилка", -50458, -13656],
			["Обеденная вилка", -50903, -14197],
			["Обеденная вилка", -51772, -14255],
			["Обеденная вилка", -53094, -14015],
			["Обеденная вилка", -53073, -14154],
			["Обеденная вилка", -52696, -14004],
			["Обеденная вилка", -52629, -14022],
			["Обеденная вилка", -52291, -13982],
			["Обеденная вилка", -52421, -13001],
			["Обеденная вилка", -52715, -12988],
			["Обеденная вилка", -40418, -2694],
			["Обеденная вилка", -69763, -104019],
			["Обеденная вилка", -152038, -74717],
			["Обеденная вилка", 174210, -17334],
			["Обеденная вилка", 174188, -17355],
			["Обеденная вилка", 173929, -13684],
			["Обеденная вилка", 180530, -12154],
			["Обеденная вилка", 180520, -12124],
			["Обеденная вилка", 180539, -12148],
			["Обеденная вилка", 180569, -12121],
			["Обеденная вилка", 53467, -3038],
			["Обеденная вилка", 53409, -3098],
			["Обеденная вилка", 57321, -27],
			["Обеденная вилка", 35495, -34866],
			["Обеденная вилка", 35429, -35245],
			["Обеденная вилка", 46197, -66174],
			["Обеденная вилка", -8072, -165234],
			["Обеденная вилка", -8170, -165195],
			["Обеденная вилка", -82309, -177677],
			["Обеденная вилка", -82311, -177790],
			["Обеденная вилка", -82337, -177776],
			["Обеденная вилка", -82355, -177826],
			["Обеденная вилка", -82342, -178191],
			["Обеденная вилка", -82315, -178084],
			["Обеденная вилка", 131998, -132436],
			["Обеденная вилка", 2459, -140134],
			["Обеденная вилка", -92867, 183501],
			["Обеденная вилка", -92836, 183463],
			["Обеденная вилка", -96595, 189776],
			["Обеденная вилка", -96486, 189845],
			["Обеденная вилка", -96475, 189871],
			["Обеденная вилка", -96523, 189846],
			["Обеденная вилка", -146168, 174925],
			["Обеденная вилка", 93564, 187453],
			["Обеденная вилка", 111628, 139729],
			["Обеденная вилка", 71017, 137698],
			["Обеденная вилка", 71018, 137698],
			["Обеденная вилка", 71009, 137683],
			["Обеденная вилка", 71012, 137689],
			["Обеденная вилка", 71015, 137694],
			["Обеденная вилка", 71021, 137705],
			["Обеденная вилка", 71399, 136340],
			["Обеденная вилка", 71396, 136054],
			["Обеденная вилка", 71121, 136040],
			["Обеденная вилка", 71146, 136079],
			["Обеденная вилка", 71200, 136062],
			["Обеденная вилка", 71094, 136055],
			["Обеденная вилка", 72314, 135928],
			["Обеденная вилка", -113992, 112769],
			["Обеденная вилка", -18039, 60028],
			["Обеденная вилка", -18039, 60050],
			["Обеденная вилка", -100392, 36317],
			["Обеденная вилка", -48836, 19798],
			["Обеденная вилка", -158147, 56141],
			["Обеденная вилка", 133832, 85741],
			["Обеденная вилка", 133147, 54821],
			["Обеденная вилка", 112381, 79128],
			["Обеденная вилка", 42708, 77045],
			["Обеденная вилка", 15047, 39271],
			["Обеденная вилка", 14943, 39523],
			["Обеденная вилка", 14873, 39597],
			["Обеденная вилка", 14901, 39520],
			["Обеденная вилка", 14690, 39678],
			["Обеденная вилка", 14730, 39706],
			["Обеденная вилка", 14401, 39753],
			["Обеденная вилка", 14420, 39787],
			["Обеденная вилка", 7481, 44366],
			["Обеденная вилка", 7558, 44345],
			["Обеденная вилка", 7500, 44147],
			["Обеденная вилка", 7581, 44122],
			["Обеденная вилка", 7537, 43869],
			["Обеденная вилка", 7513, 43959],
			["Обеденная вилка", 21807, 42897],
			["Обеденная вилка", 27136, 47808],
			["Обеденная вилка", 27155, 47781],
			["Обеденная вилка", 27087, 47746],
			["Обеденная вилка", 51922, 1354],
			["Обеденная вилка", 51830, 1349],
			["Обеденная вилка", 52351, 3680],
			["Обеденная вилка", 52348, 3724],
			["Обеденная вилка", 54926, 1449],
			["Обеденная вилка", 57356, 5],
			["Обеденная вилка", 51471, 12074],
			["Обеденная вилка", 51563, 12081],
			["Обеденная вилка", 55503, 10178],
			["Обеденная вилка", 55979, 12755],
			["Обеденная вилка", 56022, 12806],
			["Обеденная вилка", -59998, 182640],
			["Обеденная вилка", 94525, -3956],
			["Обеденная вилка", -60727, 181997],
			["Обеденная вилка", -147893, -59181]
			];
	for (var i = 0; i < hlam375.length; i++) {
				hlam_375 = new L.circleMarker([hlam375[i][1],hlam375[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam375[i][0])
					.bindTooltip(hlam375[i][0], {direction: 'top'})
					.addTo(hlam375icons);
			}
	}
	else {
		hlam375icons.clearLayers();
	}
}
var hlam376icons = L.layerGroup().addTo(map);
function Hlam376OnOff() {
	var chbox376;
	chbox376=document.getElementById('Hlam376Button');
	if (chbox376.checked) {
		var hlam376 = [
			["Обломки бетона", -96009, 177108]
			];
	for (var i = 0; i < hlam376.length; i++) {
				hlam_376 = new L.circleMarker([hlam376[i][1],hlam376[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam376[i][0])
					.bindTooltip(hlam376[i][0], {direction: 'top'})
					.addTo(hlam376icons);
			}
	}
	else {
		hlam376icons.clearLayers();
	}
}
var hlam377icons = L.layerGroup().addTo(map);
function Hlam377OnOff() {
	var chbox377;
	chbox377=document.getElementById('Hlam377Button');
	if (chbox377.checked) {
		var hlam377 = [
			["Обломки керамики", 70253, 202281]
			];
	for (var i = 0; i < hlam377.length; i++) {
				hlam_377 = new L.circleMarker([hlam377[i][1],hlam377[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam377[i][0])
					.bindTooltip(hlam377[i][0], {direction: 'top'})
					.addTo(hlam377icons);
			}
	}
	else {
		hlam377icons.clearLayers();
	}
}
var hlam378icons = L.layerGroup().addTo(map);
function Hlam378OnOff() {
	var chbox378;
	chbox378=document.getElementById('Hlam378Button');
	if (chbox378.checked) {
		var hlam378 = [

			];
	for (var i = 0; i < hlam378.length; i++) {
				hlam_378 = new L.circleMarker([hlam378[i][1],hlam378[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam378[i][0])
					.bindTooltip(hlam378[i][0], {direction: 'top'})
					.addTo(hlam378icons);
			}
	}
	else {
		hlam378icons.clearLayers();
	}
}
var hlam379icons = L.layerGroup().addTo(map);
function Hlam379OnOff() {
	var chbox379;
	chbox379=document.getElementById('Hlam379Button');
	if (chbox379.checked) {
		var hlam379 = [

			];
	for (var i = 0; i < hlam379.length; i++) {
				hlam_379 = new L.circleMarker([hlam379[i][1],hlam379[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam379[i][0])
					.bindTooltip(hlam379[i][0], {direction: 'top'})
					.addTo(hlam379icons);
			}
	}
	else {
		hlam379icons.clearLayers();
	}
}
var hlam380icons = L.layerGroup().addTo(map);
function Hlam380OnOff() {
	var chbox380;
	chbox380=document.getElementById('Hlam380Button');
	if (chbox380.checked) {
		var hlam380 = [

			];
	for (var i = 0; i < hlam380.length; i++) {
				hlam_380 = new L.circleMarker([hlam380[i][1],hlam380[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam380[i][0])
					.bindTooltip(hlam380[i][0], {direction: 'top'})
					.addTo(hlam380icons);
			}
	}
	else {
		hlam380icons.clearLayers();
	}
}
var hlam381icons = L.layerGroup().addTo(map);
function Hlam381OnOff() {
	var chbox381;
	chbox381=document.getElementById('Hlam381Button');
	if (chbox381.checked) {
		var hlam381 = [
			["Огнетушитель", -54386, -10089],
			["Огнетушитель", -77721, -21786],
			["Огнетушитель", -72529, -7241],
			["Огнетушитель", -17462, -46376],
			["Огнетушитель", -19247, -47035],
			["Огнетушитель", -21599, -44109],
			["Огнетушитель", -19272, -43337],
			["Огнетушитель", -56196, -60313],
			["Огнетушитель", -39620, -59225],
			["Огнетушитель", -46041, -50329],
			["Огнетушитель", -51966, -46527],
			["Огнетушитель", -109227, -60475],
			["Огнетушитель", -12810, -69804],
			["Огнетушитель", -17036, -69357],
			["Огнетушитель", -16044, -68971],
			["Огнетушитель", -46964, -72947],
			["Огнетушитель", -100026, -67263],
			["Огнетушитель", -4113, -130192],
			["Огнетушитель", -10725, -123347],
			["Огнетушитель", -10028, -123490],
			["Огнетушитель", -56394, -108745],
			["Огнетушитель", -61574, -100234],
			["Огнетушитель", -61564, -100216],
			["Огнетушитель", -79348, -107988],
			["Огнетушитель", -69190, -104960],
			["Огнетушитель", -67474, -105199],
			["Огнетушитель", -69070, -105078],
			["Огнетушитель", -103990, -121659],
			["Огнетушитель", -105303, -120053],
			["Огнетушитель", -148529, -57705],
			["Огнетушитель", -148601, -55075],
			["Огнетушитель", -147811, -37679],
			["Огнетушитель", -151764, -74429],
			["Огнетушитель", -150948, -74037],
			["Огнетушитель", -159849, -70359],
			["Огнетушитель", -132641, -121767],
			["Огнетушитель", -131835, -113721],
			["Огнетушитель", -150980, -101865],
			["Огнетушитель", 168050, -18183],
			["Огнетушитель", 131419, -31742],
			["Огнетушитель", 138628, -53644],
			["Огнетушитель", 138602, -53842],
			["Огнетушитель", 149314, -52021],
			["Огнетушитель", 150842, -52335],
			["Огнетушитель", 150830, -52326],
			["Огнетушитель", 150826, -52353],
			["Огнетушитель", 151708, -49233],
			["Огнетушитель", 149460, -46941],
			["Огнетушитель", 149992, -47012],
			["Огнетушитель", 150273, -46473],
			["Огнетушитель", 149809, -45680],
			["Огнетушитель", 150822, -45398],
			["Огнетушитель", 150387, -46269],
			["Огнетушитель", 183549, -77100],
			["Огнетушитель", 148672, -69746],
			["Огнетушитель", 202744, -125306],
			["Огнетушитель", 129465, -27663],
			["Огнетушитель", 129617, -28099],
			["Огнетушитель", 89753, -32251],
			["Огнетушитель", 88699, -20809],
			["Огнетушитель", 76622, -14963],
			["Огнетушитель", 73211, -7888],
			["Огнетушитель", 90753, -6619],
			["Огнетушитель", 48124, -21808],
			["Огнетушитель", 48240, -21945],
			["Огнетушитель", 29535, -21623],
			["Огнетушитель", 111753, -55647],
			["Огнетушитель", 89770, -56963],
			["Огнетушитель", 33728, -32832],
			["Огнетушитель", 24366, -63455],
			["Огнетушитель", 29519, -58407],
			["Огнетушитель", 30809, -33122],
			["Огнетушитель", 30769, -33242],
			["Огнетушитель", 57393, -95311],
			["Огнетушитель", 69163, -104561],
			["Огнетушитель", 52803, -127981],
			["Огнетушитель", 48133, -103906],
			["Огнетушитель", 18337, -123213],
			["Огнетушитель", -4137, -155826],
			["Огнетушитель", -93308, -163603],
			["Огнетушитель", -82129, -161036],
			["Огнетушитель", -115968, -137032],
			["Огнетушитель", -124640, -131750],
			["Огнетушитель", -123196, -131124],
			["Огнетушитель", -121656, -132626],
			["Огнетушитель", -108110, -133708],
			["Огнетушитель", -30432, -188530],
			["Огнетушитель", -53848, -168142],
			["Огнетушитель", -84982, -181538],
			["Огнетушитель", -152480, -161073],
			["Огнетушитель", -135578, -132747],
			["Огнетушитель", -136888, -174857],
			["Огнетушитель", 131432, -132082],
			["Огнетушитель", 193911, -169087],
			["Огнетушитель", 108663, -161077],
			["Огнетушитель", 23103, -149087],
			["Огнетушитель", 26280, -137337],
			["Огнетушитель", 74342, -176966],
			["Огнетушитель", 74652, -176892],
			["Огнетушитель", 74580, -177787],
			["Огнетушитель", 71745, -175161],
			["Огнетушитель", -61280, 180810],
			["Огнетушитель", -97544, 179392],
			["Огнетушитель", -68198, 195296],
			["Огнетушитель", -104859, 195794],
			["Огнетушитель", -17539, 162261],
			["Огнетушитель", -39249, 158534],
			["Огнетушитель", -161880, 200920],
			["Огнетушитель", -144529, 172874],
			["Огнетушитель", -145577, 177440],
			["Огнетушитель", -143131, 135692],
			["Огнетушитель", -143459, 152971],
			["Огнетушитель", -143321, 157807],
			["Огнетушитель", -140840, 156505],
			["Огнетушитель", 188823, 229943],
			["Огнетушитель", 150535, 135630],
			["Огнетушитель", 152105, 139025],
			["Огнетушитель", 153334, 141381],
			["Огнетушитель", 152801, 139715],
			["Огнетушитель", 152571, 161904],
			["Огнетушитель", 152607, 162031],
			["Огнетушитель", 70179, 202021],
			["Огнетушитель", 100627, 195964],
			["Огнетушитель", 80891, 184411],
			["Огнетушитель", 58882, 176669],
			["Огнетушитель", 63368, 176503],
			["Огнетушитель", 26571, 172099],
			["Огнетушитель", 3149, 182096],
			["Огнетушитель", 14953, 191234],
			["Огнетушитель", 72767, 137151],
			["Огнетушитель", 88494, 157752],
			["Огнетушитель", 87692, 157322],
			["Огнетушитель", 22363, 132629],
			["Огнетушитель", 3034, 160314],
			["Огнетушитель", -14862, 119097],
			["Огнетушитель", -129135, 119776],
			["Огнетушитель", -14504, 80833],
			["Огнетушитель", -61432, 85667],
			["Огнетушитель", -42069, 88412],
			["Огнетушитель", -87773, 67720],
			["Огнетушитель", -128298, 83660],
			["Огнетушитель", -128238, 82012],
			["Огнетушитель", -127786, 86887],
			["Огнетушитель", -39342, 47289],
			["Огнетушитель", -51096, 55130],
			["Огнетушитель", -52722, 55549],
			["Огнетушитель", -52676, 57989],
			["Огнетушитель", -104200, 38086],
			["Огнетушитель", -19828, 16823],
			["Огнетушитель", -46175, 2519],
			["Огнетушитель", -46305, 2767],
			["Огнетушитель", -47002, 3480],
			["Огнетушитель", -41938, 2358],
			["Огнетушитель", -41795, 3250],
			["Огнетушитель", -41798, 3275],
			["Огнетушитель", -55204, 9320],
			["Огнетушитель", -58812, 12510],
			["Огнетушитель", -34753, 13347],
			["Огнетушитель", -46637, 27127],
			["Огнетушитель", -48927, 27352],
			["Огнетушитель", -43891, 28338],
			["Огнетушитель", -45526, 28922],
			["Огнетушитель", -43849, 29154],
			["Огнетушитель", -118484, 1192],
			["Огнетушитель", -179947, 74145],
			["Огнетушитель", 182747, 110898],
			["Огнетушитель", 137199, 42948],
			["Огнетушитель", 160774, 58665],
			["Огнетушитель", 131800, 15723],
			["Огнетушитель", 134311, 16482],
			["Огнетушитель", 132667, 21095],
			["Огнетушитель", 130623, 112378],
			["Огнетушитель", 95460, 98753],
			["Огнетушитель", 16319, 44927],
			["Огнетушитель", 27082, 50410],
			["Огнетушитель", 29394, 53720],
			["Огнетушитель", 129240, 16543],
			["Огнетушитель", 87739, 2241]
			];
	for (var i = 0; i < hlam381.length; i++) {
				hlam_381 = new L.circleMarker([hlam381[i][1],hlam381[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam381[i][0])
					.bindTooltip(hlam381[i][0], {direction: 'top'})
					.addTo(hlam381icons);
			}
	}
	else {
		hlam381icons.clearLayers();
	}
}
var hlam382icons = L.layerGroup().addTo(map);
function Hlam382OnOff() {
	var chbox382;
	chbox382=document.getElementById('Hlam382Button');
	if (chbox382.checked) {
		var hlam382 = [
			["Округлая ваза &quotИва&quot", -50947, -12441],
			["Округлая ваза &quotИва&quot", -21706, -57742],
			["Округлая ваза &quotИва&quot", -19567, -47076],
			["Округлая ваза &quotИва&quot", -55392, -60843],
			["Округлая ваза &quotИва&quot", -55000, -48800],
			["Округлая ваза &quotИва&quot", -110341, -58925],
			["Округлая ваза &quotИва&quot", -62359, -129248],
			["Округлая ваза &quotИва&quot", -61182, -100788],
			["Округлая ваза &quotИва&quot", -148157, -58525],
			["Округлая ваза &quotИва&quot", -148323, -58284],
			["Округлая ваза &quotИва&quot", -148121, -54460],
			["Округлая ваза &quotИва&quot", -149522, -55257],
			["Округлая ваза &quotИва&quot", -148628, -55464],
			["Округлая ваза &quotИва&quot", -148108, -55457],
			["Округлая ваза &quotИва&quot", -131512, -92907],
			["Округлая ваза &quotИва&quot", -151735, -74740],
			["Округлая ваза &quotИва&quot", 182246, -13736],
			["Округлая ваза &quotИва&quot", 179036, -10061],
			["Округлая ваза &quotИва&quot", 147261, -78327],
			["Округлая ваза &quotИва&quot", 147533, -77969],
			["Округлая ваза &quotИва&quot", 153150, -75367],
			["Округлая ваза &quotИва&quot", 149894, -67661],
			["Округлая ваза &quotИва&quot", 195277, -103804],
			["Округлая ваза &quotИва&quot", 94291, -11017],
			["Округлая ваза &quotИва&quot", 29586, -21349],
			["Округлая ваза &quotИва&quot", 51864, -40607],
			["Округлая ваза &quotИва&quot", 8606, -85594],
			["Округлая ваза &quotИва&quot", 12824, -83214],
			["Округлая ваза &quotИва&quot", 22224, -104874],
			["Округлая ваза &quotИва&quot", 22092, -105761],
			["Округлая ваза &quotИва&quot", -2427, -159867],
			["Округлая ваза &quotИва&quot", -113941, -169183],
			["Округлая ваза &quotИва&quot", -135322, -155684],
			["Округлая ваза &quotИва&quot", -131803, -158271],
			["Округлая ваза &quotИва&quot", -134193, -153661],
			["Округлая ваза &quotИва&quot", -59544, 180350],
			["Округлая ваза &quotИва&quot", -26722, 143893],
			["Округлая ваза &quotИва&quot", -64047, 132071],
			["Округлая ваза &quotИва&quot", -146077, 174441],
			["Округлая ваза &quotИва&quot", 210, 163972],
			["Округлая ваза &quotИва&quot", 52570, 131966],
			["Округлая ваза &quotИва&quot", 47405, 161984],
			["Округлая ваза &quotИва&quot", 7464, 160818],
			["Округлая ваза &quotИва&quot", -129014, 119417],
			["Округлая ваза &quotИва&quot", -39686, 44832],
			["Округлая ваза &quotИва&quot", -39816, 46793],
			["Округлая ваза &quotИва&quot", -7333, 21084],
			["Округлая ваза &quotИва&quot", -38072, 4697],
			["Округлая ваза &quotИва&quot", -163900, 122235],
			["Округлая ваза &quotИва&quot", -146243, 66080],
			["Округлая ваза &quotИва&quot", -179473, 74372],
			["Округлая ваза &quotИва&quot", 191233, 115660],
			["Округлая ваза &quotИва&quot", 145170, 87397],
			["Округлая ваза &quotИва&quot", 171055, 58845],
			["Округлая ваза &quotИва&quot", 183588, 2488],
			["Округлая ваза &quotИва&quot", 183819, 2048],
			["Округлая ваза &quotИва&quot", 157437, 13518],
			["Округлая ваза &quotИва&quot", 46193, 101283],
			["Округлая ваза &quotИва&quot", 30146, 119466],
			["Округлая ваза &quotИва&quot", 7348, 43478],
			["Округлая ваза &quotИва&quot", 100517, 25818],
			["Округлая ваза &quotИва&quot", 100648, 26522],
			["Округлая ваза &quotИва&quot", 93745, 9103],
			["Округлая ваза &quotИва&quot", 54907, 1491],
			["Округлая ваза &quotИва&quot", 55482, 10351]
			];
	for (var i = 0; i < hlam382.length; i++) {
				hlam_382 = new L.circleMarker([hlam382[i][1],hlam382[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam382[i][0])
					.bindTooltip(hlam382[i][0], {direction: 'top'})
					.addTo(hlam382icons);
			}
	}
	else {
		hlam382icons.clearLayers();
	}
}
var hlam383icons = L.layerGroup().addTo(map);
function Hlam383OnOff() {
	var chbox383;
	chbox383=document.getElementById('Hlam383Button');
	if (chbox383.checked) {
		var hlam383 = [
			["Округлая ваза &quotЦветы&quot", -54203, -9971],
			["Округлая ваза &quotЦветы&quot", -40817, -2128],
			["Округлая ваза &quotЦветы&quot", -37715, -58535],
			["Округлая ваза &quotЦветы&quot", 148462, -79675],
			["Округлая ваза &quotЦветы&quot", 142126, -123782],
			["Округлая ваза &quotЦветы&quot", 21969, -110228],
			["Округлая ваза &quotЦветы&quot", 22164, -105764],
			["Округлая ваза &quotЦветы&quot", 33344, 132173],
			["Округлая ваза &quotЦветы&quot", -39283, 44434],
			["Округлая ваза &quotЦветы&quot", -40602, 8083],
			["Округлая ваза &quotЦветы&quot", 183378, 2633]
			];
	for (var i = 0; i < hlam383.length; i++) {
				hlam_383 = new L.circleMarker([hlam383[i][1],hlam383[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam383[i][0])
					.bindTooltip(hlam383[i][0], {direction: 'top'})
					.addTo(hlam383icons);
			}
	}
	else {
		hlam383icons.clearLayers();
	}
}
var hlam384icons = L.layerGroup().addTo(map);
function Hlam384OnOff() {
	var chbox384;
	chbox384=document.getElementById('Hlam384Button');
	if (chbox384.checked) {
		var hlam384 = [
			["Оптическое волокно", -30511, -188650],
			["Оптическое волокно", -16612, 163819],
			["Оптическое волокно", 20422, 134808],
			["Оптическое волокно", 114786, 68859],
			["Оптическое волокно", 114782, 68862]
			];
	for (var i = 0; i < hlam384.length; i++) {
				hlam_384 = new L.circleMarker([hlam384[i][1],hlam384[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam384[i][0])
					.bindTooltip(hlam384[i][0], {direction: 'top'})
					.addTo(hlam384icons);
			}
	}
	else {
		hlam384icons.clearLayers();
	}
}
var hlam385icons = L.layerGroup().addTo(map);
function Hlam385OnOff() {
	var chbox385;
	chbox385=document.getElementById('Hlam385Button');
	if (chbox385.checked) {
		var hlam385 = [
			["Оранжевая канистра", -44858, -15767],
			["Оранжевая канистра", -40411, -3189],
			["Оранжевая канистра", -37657, -59397],
			["Оранжевая канистра", -38611, -58001],
			["Оранжевая канистра", -51405, -46627],
			["Оранжевая канистра", -29595, -94060],
			["Оранжевая канистра", -34820, -84190],
			["Оранжевая канистра", -114301, -117644],
			["Оранжевая канистра", -114184, -117836],
			["Оранжевая канистра", -151337, -74837],
			["Оранжевая канистра", -150790, -101878],
			["Оранжевая канистра", 175976, -15036],
			["Оранжевая канистра", 127927, -25086],
			["Оранжевая канистра", 48131, -22119],
			["Оранжевая канистра", 48379, -22257],
			["Оранжевая канистра", 9068, -30312],
			["Оранжевая канистра", 52342, -127745],
			["Оранжевая канистра", 60776, -98911],
			["Оранжевая канистра", 10027, -107274],
			["Оранжевая канистра", -61298, -144830],
			["Оранжевая канистра", -93300, -163358],
			["Оранжевая канистра", -121038, -132791],
			["Оранжевая канистра", -152609, -160326],
			["Оранжевая канистра", 193704, -169052],
			["Оранжевая канистра", -38788, 190295],
			["Оранжевая канистра", -68793, 171211],
			["Оранжевая канистра", -5836, 160693],
			["Оранжевая канистра", -38270, 159835],
			["Оранжевая канистра", -144706, 172975],
			["Оранжевая канистра", -138690, 152462],
			["Оранжевая канистра", 179006, 133054],
			["Оранжевая канистра", 147243, 137994],
			["Оранжевая канистра", 153572, 140803],
			["Оранжевая канистра", 152441, 140462],
			["Оранжевая канистра", 101821, 196748],
			["Оранжевая канистра", 15503, 197485],
			["Оранжевая канистра", 70207, 135899],
			["Оранжевая канистра", 1711, 138131],
			["Оранжевая канистра", -103787, 38257],
			["Оранжевая канистра", -104476, 38257],
			["Оранжевая канистра", -47501, 1088],
			["Оранжевая канистра", -47491, 1279],
			["Оранжевая канистра", -34646, 13093],
			["Оранжевая канистра", -47102, 28899],
			["Оранжевая канистра", -121444, 3721],
			["Оранжевая канистра", -121619, 3670],
			["Оранжевая канистра", -118613, 1173],
			["Оранжевая канистра", -153845, 129509],
			["Оранжевая канистра", 144327, 97711],
			["Оранжевая канистра", 137063, 43283],
			["Оранжевая канистра", 183526, 2933],
			["Оранжевая канистра", 93165, 103690],
			["Оранжевая канистра", 93284, 102941],
			["Оранжевая канистра", 93288, 102932],
			["Оранжевая канистра", 129625, 86320],
			["Оранжевая канистра", 115236, 62907],
			["Оранжевая канистра", 121341, 6582]
			];
	for (var i = 0; i < hlam385.length; i++) {
				hlam_385 = new L.circleMarker([hlam385[i][1],hlam385[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam385[i][0])
					.bindTooltip(hlam385[i][0], {direction: 'top'})
					.addTo(hlam385icons);
			}
	}
	else {
		hlam385icons.clearLayers();
	}
}
var hlam386icons = L.layerGroup().addTo(map);
function Hlam386OnOff() {
	var chbox386;
	chbox386=document.getElementById('Hlam386Button');
	if (chbox386.checked) {
		var hlam386 = [
			["Оранжевая миска", -155661, -36679],
			["Оранжевая миска", 50813, -19500],
			["Оранжевая миска", 143358, -151459],
			["Оранжевая миска", 143430, -151424],
			["Оранжевая миска", 54208, 188509],
			["Оранжевая миска", -21387, 11217],
			["Оранжевая миска", 15044, 39292],
			["Оранжевая миска", 14239, 39744],
			["Оранжевая миска", 14396, 39772],
			["Оранжевая миска", 14721, 39684]
			];
	for (var i = 0; i < hlam386.length; i++) {
				hlam_386 = new L.circleMarker([hlam386[i][1],hlam386[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam386[i][0])
					.bindTooltip(hlam386[i][0], {direction: 'top'})
					.addTo(hlam386icons);
			}
	}
	else {
		hlam386icons.clearLayers();
	}
}
var hlam387icons = L.layerGroup().addTo(map);
function Hlam387OnOff() {
	var chbox387;
	chbox387=document.getElementById('Hlam387Button');
	if (chbox387.checked) {
		var hlam387 = [
			["Оранжевая салфетка", -155695, -36664],
			["Оранжевая салфетка", 143194, -151218],
			["Оранжевая салфетка", 143170, -151079],
			["Оранжевая салфетка", 143057, -151152],
			["Оранжевая салфетка", 143068, -151158],
			["Оранжевая салфетка", 143062, -151163],
			["Оранжевая салфетка", 143434, -151382],
			["Оранжевая салфетка", 143435, -151392],
			["Оранжевая салфетка", 130549, 112236],
			["Оранжевая салфетка", 14398, 39755],
			["Оранжевая салфетка", 14422, 39785],
			["Оранжевая салфетка", 14691, 39656],
			["Оранжевая салфетка", 14912, 39528]
			];
	for (var i = 0; i < hlam387.length; i++) {
				hlam_387 = new L.circleMarker([hlam387[i][1],hlam387[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam387[i][0])
					.bindTooltip(hlam387[i][0], {direction: 'top'})
					.addTo(hlam387icons);
			}
	}
	else {
		hlam387icons.clearLayers();
	}
}
var hlam388icons = L.layerGroup().addTo(map);
function Hlam388OnOff() {
	var chbox388;
	chbox388=document.getElementById('Hlam388Button');
	if (chbox388.checked) {
		var hlam388 = [
			["Оранжевый стакан", -33557, 0],
			["Оранжевый стакан", -33513, -12],
			["Оранжевый стакан", -155708, -36632],
			["Оранжевый стакан", 74346, -18255],
			["Оранжевый стакан", 143345, -151649],
			["Оранжевый стакан", 143372, -151654],
			["Оранжевый стакан", 143437, -151637],
			["Оранжевый стакан", 14221, 39316],
			["Оранжевый стакан", 14234, 39737],
			["Оранжевый стакан", 14416, 39778],
			["Оранжевый стакан", 14513, 39755],
			["Оранжевый стакан", 14522, 39776],
			["Оранжевый стакан", 14700, 39678],
			["Оранжевый стакан", 14947, 39536],
			["Оранжевый стакан", 15030, 39280],
			["Оранжевый стакан", 15046, 39277],
			["Оранжевый стакан", 14777, 39325],
			["Оранжевый стакан", 14768, 39327],
			["Оранжевый стакан", 14768, 39336],
			["Оранжевый стакан", 47905, 13852]
			];
	for (var i = 0; i < hlam388.length; i++) {
				hlam_388 = new L.circleMarker([hlam388[i][1],hlam388[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam388[i][0])
					.bindTooltip(hlam388[i][0], {direction: 'top'})
					.addTo(hlam388icons);
			}
	}
	else {
		hlam388icons.clearLayers();
	}
}
var hlam389icons = L.layerGroup().addTo(map);
function Hlam389OnOff() {
	var chbox389;
	chbox389=document.getElementById('Hlam389Button');
	if (chbox389.checked) {
		var hlam389 = [

			];
	for (var i = 0; i < hlam389.length; i++) {
				hlam_389 = new L.circleMarker([hlam389[i][1],hlam389[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam389[i][0])
					.bindTooltip(hlam389[i][0], {direction: 'top'})
					.addTo(hlam389icons);
			}
	}
	else {
		hlam389icons.clearLayers();
	}
}
var hlam390icons = L.layerGroup().addTo(map);
function Hlam390OnOff() {
	var chbox390;
	chbox390=document.getElementById('Hlam390Button');
	if (chbox390.checked) {
		var hlam390 = [
			["Осколки кристалла", 26293, 125031],
			];
	for (var i = 0; i < hlam390.length; i++) {
				hlam_390 = new L.circleMarker([hlam390[i][1],hlam390[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam390[i][0])
					.bindTooltip(hlam390[i][0], {direction: 'top'})
					.addTo(hlam390icons);
			}
	}
	else {
		hlam390icons.clearLayers();
	}
}
var hlam391icons = L.layerGroup().addTo(map);
function Hlam391OnOff() {
	var chbox391;
	chbox391=document.getElementById('Hlam391Button');
	if (chbox391.checked) {
		var hlam391 = [
			["Основная база", -125256, -116136],
			["Основная база", -135954, -5736],
			["Основная база", 148847, -46564],
			["Основная база", 127820, -27604],
			["Основная база", 30890, -62365],
			["Основная база", 16435, -76956],
			["Основная база", -101607, 85232],
			["Основная база", 55137, 16360]
			];
	for (var i = 0; i < hlam391.length; i++) {
				hlam_391 = new L.circleMarker([hlam391[i][1],hlam391[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam391[i][0])
					.bindTooltip(hlam391[i][0], {direction: 'top'})
					.addTo(hlam391icons);
			}
	}
	else {
		hlam391icons.clearLayers();
	}
}
var hlam392icons = L.layerGroup().addTo(map);
function Hlam392OnOff() {
	var chbox392;
	chbox392=document.getElementById('Hlam392Button');
	if (chbox392.checked) {
		var hlam392 = [
			["Отвертка", -8614, -2717],
			["Отвертка", -44652, -15762],
			["Отвертка", -47200, -6335],
			["Отвертка", -77649, -21763],
			["Отвертка", -66765, -22601],
			["Отвертка", -15628, -47405],
			["Отвертка", -18120, -42817],
			["Отвертка", -3580, -44895],
			["Отвертка", -52214, -46421],
			["Отвертка", -84975, -45725],
			["Отвертка", -121926, -64592],
			["Отвертка", -29646, -94403],
			["Отвертка", -29357, -86943],
			["Отвертка", -12173, -69150],
			["Отвертка", -52587, -96620],
			["Отвертка", -34204, -84158],
			["Отвертка", -35623, -80356],
			["Отвертка", -35627, -81032],
			["Отвертка", -93459, -83541],
			["Отвертка", -90753, -80557],
			["Отвертка", -84986, -80410],
			["Отвертка", -131044, -92563],
			["Отвертка", -126343, -74083],
			["Отвертка", -10693, -123694],
			["Отвертка", -81848, -126464],
			["Отвертка", -85235, -110085],
			["Отвертка", -69221, -105000],
			["Отвертка", -122862, -123349],
			["Отвертка", -104845, -120311],
			["Отвертка", -148940, -57928],
			["Отвертка", -148442, -56402],
			["Отвертка", -137650, -97275],
			["Отвертка", -146199, -92909],
			["Отвертка", -131667, -112317],
			["Отвертка", -150728, -101879],
			["Отвертка", -150854, -102090],
			["Отвертка", -164141, -128924],
			["Отвертка", -168929, -116002],
			["Отвертка", -168249, -115725],
			["Отвертка", 195025, -31828],
			["Отвертка", 167428, -24254],
			["Отвертка", 174976, -13020],
			["Отвертка", 131453, -31627],
			["Отвертка", 145011, -54543],
			["Отвертка", 148892, -79819],
			["Отвертка", 201881, -125385],
			["Отвертка", 201413, -126027],
			["Отвертка", 157582, -129060],
			["Отвертка", 128765, -28402],
			["Отвертка", 129798, -27537],
			["Отвертка", 129986, -27189],
			["Отвертка", 102931, -21345],
			["Отвертка", 101649, -13860],
			["Отвертка", 89776, -30665],
			["Отвертка", 88893, -30948],
			["Отвертка", 92028, -30617],
			["Отвертка", 90407, -30560],
			["Отвертка", 90248, -27664],
			["Отвертка", 84726, -19259],
			["Отвертка", 90304, -9908],
			["Отвертка", 94583, -8322],
			["Отвертка", 79074, -1754],
			["Отвертка", 47470, -20611],
			["Отвертка", 48361, -22012],
			["Отвертка", 34521, -6211],
			["Отвертка", 9102, -30370],
			["Отвертка", 29386, -18795],
			["Отвертка", 17949, -2553],
			["Отвертка", 108213, -54888],
			["Отвертка", 111666, -55136],
			["Отвертка", 62013, -58562],
			["Отвертка", 22579, -60515],
			["Отвертка", 29221, -58643],
			["Отвертка", 31169, -33433],
			["Отвертка", 57788, -95200],
			["Отвертка", 16934, -82560],
			["Отвертка", 101271, -100418],
			["Отвертка", 74301, -121252],
			["Отвертка", 69312, -104043],
			["Отвертка", 69283, -103988],
			["Отвертка", 62674, -116196],
			["Отвертка", 63087, -116097],
			["Отвертка", 63192, -116010],
			["Отвертка", 60757, -99248],
			["Отвертка", 18498, -122987],
			["Отвертка", 15765, -107657],
			["Отвертка", 17678, -106476],
			["Отвертка", -61382, -145792],
			["Отвертка", -44327, -133242],
			["Отвертка", -40734, -134336],
			["Отвертка", -93720, -163422],
			["Отвертка", -100408, -156442],
			["Отвертка", -126603, -144606],
			["Отвертка", -116709, -137350],
			["Отвертка", -102645, -135785],
			["Отвертка", -123624, -134351],
			["Отвертка", -122541, -132815],
			["Отвертка", -107928, -133856],
			["Отвертка", -30497, -188614],
			["Отвертка", -42972, -173486],
			["Отвертка", -80757, -183322],
			["Отвертка", -108588, -187370],
			["Отвертка", 176872, -132477],
			["Отвертка", 135619, -156420],
			["Отвертка", 131109, -131857],
			["Отвертка", 131647, -132415],
			["Отвертка", 163875, -169022],
			["Отвертка", 189959, -169446],
			["Отвертка", 189655, -169508],
			["Отвертка", 191746, -169447],
			["Отвертка", 187637, -165385],
			["Отвертка", 189037, -164723],
			["Отвертка", 189927, -165776],
			["Отвертка", 188997, -165162],
			["Отвертка", 189503, -164979],
			["Отвертка", 115224, -157577],
			["Отвертка", 19500, -142126],
			["Отвертка", 74400, -177287],
			["Отвертка", -70936, 198047],
			["Отвертка", -4693, 185459],
			["Отвертка", -13422, 189440],
			["Отвертка", -55456, 165394],
			["Отвертка", -55323, 165785],
			["Отвертка", -38965, 190115],
			["Отвертка", -94572, 174088],
			["Отвертка", -91455, 176806],
			["Отвертка", -91645, 176721],
			["Отвертка", -93213, 183644],
			["Отвертка", -93692, 183914],
			["Отвертка", -92913, 183926],
			["Отвертка", -92714, 183595],
			["Отвертка", -89833, 185760],
			["Отвертка", -10074, 132128],
			["Отвертка", -27212, 162132],
			["Отвертка", -27028, 162555],
			["Отвертка", -5892, 160714],
			["Отвертка", -3972, 161652],
			["Отвертка", -42695, 137687],
			["Отвертка", -38957, 158375],
			["Отвертка", -39754, 158917],
			["Отвертка", -38876, 158699],
			["Отвертка", -41433, 161145],
			["Отвертка", -37897, 159874],
			["Отвертка", -109315, 157388],
			["Отвертка", -109662, 157832],
			["Отвертка", -161632, 201068],
			["Отвертка", -141098, 170412],
			["Отвертка", -146126, 173753],
			["Отвертка", -145684, 172599],
			["Отвертка", -146330, 172696],
			["Отвертка", -143502, 173986],
			["Отвертка", -143594, 178447],
			["Отвертка", -145609, 177382],
			["Отвертка", -156543, 191187],
			["Отвертка", -157420, 191342],
			["Отвертка", -163490, 141941],
			["Отвертка", -140944, 142274],
			["Отвертка", -138882, 141891],
			["Отвертка", -138411, 152633],
			["Отвертка", -163112, 157123],
			["Отвертка", 143803, 137311],
			["Отвертка", 151001, 138351],
			["Отвертка", 153312, 140337],
			["Отвертка", 69980, 202116],
			["Отвертка", 15723, 197729],
			["Отвертка", 103021, 191365],
			["Отвертка", 93529, 192168],
			["Отвертка", 13228, 174555],
			["Отвертка", 26568, 172054],
			["Отвертка", 2356, 179080],
			["Отвертка", 10838, 184073],
			["Отвертка", 127536, 154470],
			["Отвертка", 72021, 138146],
			["Отвертка", 70291, 136041],
			["Отвертка", 72941, 136796],
			["Отвертка", 88244, 156810],
			["Отвертка", 11359, 146323],
			["Отвертка", 6354, 161919],
			["Отвертка", -86511, 115449],
			["Отвертка", -103220, 109860],
			["Отвертка", -103192, 108933],
			["Отвертка", -129239, 119068],
			["Отвертка", -37400, 84385],
			["Отвертка", -38858, 83931],
			["Отвертка", -58242, 88420],
			["Отвертка", -42218, 87925],
			["Отвертка", -87936, 67351],
			["Отвертка", -128276, 79976],
			["Отвертка", -127054, 83605],
			["Отвертка", -40601, 50690],
			["Отвертка", -85941, 65036],
			["Отвертка", -24986, 11726],
			["Отвертка", -46828, 2683],
			["Отвертка", -46026, 1777],
			["Отвертка", -48562, 3513],
			["Отвертка", -42303, 730],
			["Отвертка", -58644, 7128],
			["Отвертка", -52346, 8027],
			["Отвертка", -44010, 6444],
			["Отвертка", -58499, 11885],
			["Отвертка", -55421, 9207],
			["Отвертка", -52552, 11185],
			["Отвертка", -47972, 15343],
			["Отвертка", -43675, 12933],
			["Отвертка", -119454, 1699],
			["Отвертка", -118478, 749],
			["Отвертка", -153906, 129606],
			["Отвертка", -173079, 110049],
			["Отвертка", -160395, 13579],
			["Отвертка", 183744, 112176],
			["Отвертка", 183728, 112186],
			["Отвертка", 161296, 112876],
			["Отвертка", 161643, 112632],
			["Отвертка", 134829, 127183],
			["Отвертка", 139427, 72347],
			["Отвертка", 154320, 77604],
			["Отвертка", 143747, 81975],
			["Отвертка", 137334, 43125],
			["Отвертка", 153167, 57795],
			["Отвертка", 171188, 1471],
			["Отвертка", 131349, 1158],
			["Отвертка", 136415, 15159],
			["Отвертка", 133572, 17201],
			["Отвертка", 133230, 20121],
			["Отвертка", 94590, 98881],
			["Отвертка", 57967, 108279],
			["Отвертка", 1581, 100073],
			["Отвертка", 114347, 72924],
			["Отвертка", 130777, 74545],
			["Отвертка", 73245, 80685],
			["Отвертка", 54911, 95540],
			["Отвертка", 111460, 58131],
			["Отвертка", 72511, 38388],
			["Отвертка", 76437, 37047],
			["Отвертка", 76624, 43287],
			["Отвертка", 60388, 48577],
			["Отвертка", 60003, 57767],
			["Отвертка", 120870, 4872],
			["Отвертка", 121309, 6776],
			["Отвертка", 129856, 18625],
			["Отвертка", 84962, 656],
			["Отвертка", 33765, 8847],
			["Отвертка", -51703, 13155]
			];
	for (var i = 0; i < hlam392.length; i++) {
				hlam_392 = new L.circleMarker([hlam392[i][1],hlam392[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam392[i][0])
					.bindTooltip(hlam392[i][0], {direction: 'top'})
					.addTo(hlam392icons);
			}
	}
	else {
		hlam392icons.clearLayers();
	}
}
var hlam393icons = L.layerGroup().addTo(map);
function Hlam393OnOff() {
	var chbox393;
	chbox393=document.getElementById('Hlam393Button');
	if (chbox393.checked) {
		var hlam393 = [
			["Отработанная кислота", -151815, -73675],
			["Отработанная кислота", 12405, -60611],
			["Отработанная кислота", 189985, -169727],
			["Отработанная кислота", -97232, 184771],
			["Отработанная кислота", 151007, 138402],
			["Отработанная кислота", -128321, 79976],
			["Отработанная кислота", -119500, 1695],
			["Отработанная кислота", 133184, 20121],
			["Отработанная кислота", 121673, 5111]
			];
	for (var i = 0; i < hlam393.length; i++) {
				hlam_393 = new L.circleMarker([hlam393[i][1],hlam393[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam393[i][0])
					.bindTooltip(hlam393[i][0], {direction: 'top'})
					.addTo(hlam393icons);
			}
	}
	else {
		hlam393icons.clearLayers();
	}
}
var hlam394icons = L.layerGroup().addTo(map);
function Hlam394OnOff() {
	var chbox394;
	chbox394=document.getElementById('Hlam394Button');
	if (chbox394.checked) {
		var hlam394 = [
			["Отработанная нефть", -147961, -57184],
			["Отработанная нефть", -147971, -57188],
			["Отработанная нефть", 87699, -53206],
			["Отработанная нефть", 168599, 59078]
			];
	for (var i = 0; i < hlam394.length; i++) {
				hlam_394 = new L.circleMarker([hlam394[i][1],hlam394[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam394[i][0])
					.bindTooltip(hlam394[i][0], {direction: 'top'})
					.addTo(hlam394icons);
			}
	}
	else {
		hlam394icons.clearLayers();
	}
}
var hlam395icons = L.layerGroup().addTo(map);
function Hlam395OnOff() {
	var chbox395;
	chbox395=document.getElementById('Hlam395Button');
	if (chbox395.checked) {
		var hlam395 = [
			["Отработанный антисептик", 103732, -15286],
			["Отработанный антисептик", 103727, -15277],
			["Отработанный антисептик", 84724, -19383],
			["Отработанный антисептик", 12415, -60596],
			["Отработанный антисептик", 93285, -84273],
			["Отработанный антисептик", 15825, -79820],
			["Отработанный антисептик", 189146, -165962],
			["Отработанный антисептик", 26437, -136699]
			];
	for (var i = 0; i < hlam395.length; i++) {
				hlam_395 = new L.circleMarker([hlam395[i][1],hlam395[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam395[i][0])
					.bindTooltip(hlam395[i][0], {direction: 'top'})
					.addTo(hlam395icons);
			}
	}
	else {
		hlam395icons.clearLayers();
	}
}
var hlam396icons = L.layerGroup().addTo(map);
function Hlam396OnOff() {
	var chbox396;
	chbox396=document.getElementById('Hlam396Button');
	if (chbox396.checked) {
		var hlam396 = [
			["Отремонтированный настольный вентилятор", -53446, -168152],
			["Отремонтированный настольный вентилятор", -104163, 38661]
			];
	for (var i = 0; i < hlam396.length; i++) {
				hlam_396 = new L.circleMarker([hlam396[i][1],hlam396[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam396[i][0])
					.bindTooltip(hlam396[i][0], {direction: 'top'})
					.addTo(hlam396icons);
			}
	}
	else {
		hlam396icons.clearLayers();
	}
}
var hlam397icons = L.layerGroup().addTo(map);
function Hlam397OnOff() {
	var chbox397;
	chbox397=document.getElementById('Hlam397Button');
	if (chbox397.checked) {
		var hlam397 = [
			["Офисный настольный вентилятор", -44967, -8648],
			["Офисный настольный вентилятор", -66962, -22803],
			["Офисный настольный вентилятор", -67590, -1272],
			["Офисный настольный вентилятор", -27885, -60066],
			["Офисный настольный вентилятор", -16647, -47140],
			["Офисный настольный вентилятор", -15119, -47017],
			["Офисный настольный вентилятор", -15637, -47085],
			["Офисный настольный вентилятор", -15228, -42006],
			["Офисный настольный вентилятор", -47364, -49477],
			["Офисный настольный вентилятор", -84708, -45278],
			["Офисный настольный вентилятор", -84319, -45723],
			["Офисный настольный вентилятор", -31326, -88094],
			["Офисный настольный вентилятор", -8969, -69460],
			["Офисный настольный вентилятор", -53079, -96819],
			["Офисный настольный вентилятор", -56410, -78533],
			["Офисный настольный вентилятор", -56161, -78821],
			["Офисный настольный вентилятор", -49619, -74855],
			["Офисный настольный вентилятор", -46782, -72914],
			["Офисный настольный вентилятор", -69716, -96480],
			["Офисный настольный вентилятор", -101620, -85090],
			["Офисный настольный вентилятор", -125944, -73589],
			["Офисный настольный вентилятор", -31883, -129896],
			["Офисный настольный вентилятор", -49397, -129549],
			["Офисный настольный вентилятор", -81997, -126287],
			["Офисный настольный вентилятор", -79479, -107776],
			["Офисный настольный вентилятор", -68544, -105427],
			["Офисный настольный вентилятор", -105878, -127783],
			["Офисный настольный вентилятор", -122836, -123596],
			["Офисный настольный вентилятор", -133622, -5553],
			["Офисный настольный вентилятор", -148538, -55974],
			["Офисный настольный вентилятор", -151085, -75417],
			["Офисный настольный вентилятор", -152041, -73292],
			["Офисный настольный вентилятор", -151322, -72312],
			["Офисный настольный вентилятор", -167969, -112661],
			["Офисный настольный вентилятор", 165026, -16793],
			["Офисный настольный вентилятор", 191139, -19003],
			["Офисный настольный вентилятор", 173713, -13769],
			["Офисный настольный вентилятор", 157446, -49378],
			["Офисный настольный вентилятор", 144756, -47989],
			["Офисный настольный вентилятор", 183264, -93818],
			["Офисный настольный вентилятор", 126478, -28781],
			["Офисный настольный вентилятор", 124104, -28930],
			["Офисный настольный вентилятор", 129395, -31459],
			["Офисный настольный вентилятор", 130603, -31531],
			["Офисный настольный вентилятор", 128741, -26152],
			["Офисный настольный вентилятор", 130213, -28238],
			["Офисный настольный вентилятор", 101553, -11927],
			["Офисный настольный вентилятор", 88945, -30898],
			["Офисный настольный вентилятор", 93240, -31353],
			["Офисный настольный вентилятор", 90842, -30509],
			["Офисный настольный вентилятор", 81341, -21335],
			["Офисный настольный вентилятор", 84449, -15926],
			["Офисный настольный вентилятор", 92367, -9763],
			["Офисный настольный вентилятор", 84731, -1946],
			["Офисный настольный вентилятор", 34752, -6434],
			["Офисный настольный вентилятор", 18653, -880],
			["Офисный настольный вентилятор", 90345, -33330],
			["Офисный настольный вентилятор", 17681, -106416],
			["Офисный настольный вентилятор", -4146, -155871],
			["Офисный настольный вентилятор", -61589, -145825],
			["Офисный настольный вентилятор", -72861, -132307],
			["Офисный настольный вентилятор", -117461, -136488],
			["Офисный настольный вентилятор", -123354, -134274],
			["Офисный настольный вентилятор", -124495, -131263],
			["Офисный настольный вентилятор", -120373, -132921],
			["Офисный настольный вентилятор", -108411, -133882],
			["Офисный настольный вентилятор", -99989, -132672],
			["Офисный настольный вентилятор", -87298, -166650],
			["Офисный настольный вентилятор", -152274, -161003],
			["Офисный настольный вентилятор", 189936, -165398],
			["Офисный настольный вентилятор", 108561, -161242],
			["Офисный настольный вентилятор", 115756, -157926],
			["Офисный настольный вентилятор", 108006, -153486],
			["Офисный настольный вентилятор", 19310, -142224],
			["Офисный настольный вентилятор", 26141, -137666],
			["Офисный настольный вентилятор", 74908, -176950],
			["Офисный настольный вентилятор", 74763, -177369],
			["Офисный настольный вентилятор", 74202, -177330],
			["Офисный настольный вентилятор", 74265, -176893],
			["Офисный настольный вентилятор", 75151, -172818],
			["Офисный настольный вентилятор", -13371, 189424],
			["Офисный настольный вентилятор", -94668, 183257],
			["Офисный настольный вентилятор", -93683, 183651],
			["Офисный настольный вентилятор", -93727, 184157],
			["Офисный настольный вентилятор", -92952, 180615],
			["Офисный настольный вентилятор", -95568, 184433],
			["Офисный настольный вентилятор", -72851, 184548],
			["Офисный настольный вентилятор", -3882, 161582],
			["Офисный настольный вентилятор", -90523, 149734],
			["Офисный настольный вентилятор", -109725, 157886],
			["Офисный настольный вентилятор", -163725, 200623],
			["Офисный настольный вентилятор", -169823, 202294],
			["Офисный настольный вентилятор", -146116, 174994],
			["Офисный настольный вентилятор", -146149, 173163],
			["Офисный настольный вентилятор", -145844, 172386],
			["Офисный настольный вентилятор", 153061, 140075],
			["Офисный настольный вентилятор", 152537, 139857],
			["Офисный настольный вентилятор", 103492, 190749],
			["Офисный настольный вентилятор", 95836, 187131],
			["Офисный настольный вентилятор", 44214, 164280],
			["Офисный настольный вентилятор", 64226, 173739],
			["Офисный настольный вентилятор", 48857, 190955],
			["Офисный настольный вентилятор", 2816, 164356],
			["Офисный настольный вентилятор", 13416, 174555],
			["Офисный настольный вентилятор", 15894, 189867],
			["Офисный настольный вентилятор", 14854, 193234],
			["Офисный настольный вентилятор", 2419, 138245],
			["Офисный настольный вентилятор", -13885, 119073],
			["Офисный настольный вентилятор", -13870, 119615],
			["Офисный настольный вентилятор", -14846, 119085],
			["Офисный настольный вентилятор", -14848, 119450],
			["Офисный настольный вентилятор", -32397, 92031],
			["Офисный настольный вентилятор", -42095, 88784],
			["Офисный настольный вентилятор", -33516, 92490],
			["Офисный настольный вентилятор", -18020, 59946],
			["Офисный настольный вентилятор", -123274, 51050],
			["Офисный настольный вентилятор", -33974, 117],
			["Офисный настольный вентилятор", -56146, 10590],
			["Офисный настольный вентилятор", -56710, 13338],
			["Офисный настольный вентилятор", -118166, 3459],
			["Офисный настольный вентилятор", -130448, 10429],
			["Офисный настольный вентилятор", -99514, 8243],
			["Офисный настольный вентилятор", -179475, 74411],
			["Офисный настольный вентилятор", -152369, 1191],
			["Офисный настольный вентилятор", 183010, 112205],
			["Офисный настольный вентилятор", 180642, 110944],
			["Офисный настольный вентилятор", 181464, 110902],
			["Офисный настольный вентилятор", 133434, 121582],
			["Офисный настольный вентилятор", 171321, 1603],
			["Офисный настольный вентилятор", 133864, 15284],
			["Офисный настольный вентилятор", 95001, 98762],
			["Офисный настольный вентилятор", 100203, 91152],
			["Офисный настольный вентилятор", 73967, 38407],
			["Офисный настольный вентилятор", 17045, 45714],
			["Офисный настольный вентилятор", 16909, 45354],
			["Офисный настольный вентилятор", 104178, 6852],
			["Офисный настольный вентилятор", 120374, 5861],
			["Офисный настольный вентилятор", 121732, 5121],
			["Офисный настольный вентилятор", 87378, 28935]
			];
	for (var i = 0; i < hlam397.length; i++) {
				hlam_397 = new L.circleMarker([hlam397[i][1],hlam397[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam397[i][0])
					.bindTooltip(hlam397[i][0], {direction: 'top'})
					.addTo(hlam397icons);
			}
	}
	else {
		hlam397icons.clearLayers();
	}
}
var hlam398icons = L.layerGroup().addTo(map);
function Hlam398OnOff() {
	var chbox398;
	chbox398=document.getElementById('Hlam398Button');
	if (chbox398.checked) {
		var hlam398 = [
			["Пакет для внутривенного вливания", -35828, -80712],
			["Пакет для внутривенного вливания", -35788, -80681],
			["Пакет для внутривенного вливания", -35897, -80705],
			["Пакет для внутривенного вливания", -93851, -129830],
			["Пакет для внутривенного вливания", -93864, -129847],
			["Пакет для внутривенного вливания", -93831, -129682],
			["Пакет для внутривенного вливания", -93891, -129814],
			["Пакет для внутривенного вливания", 151064, -52425],
			["Пакет для внутривенного вливания", 101868, -12355],
			["Пакет для внутривенного вливания", 101868, -12361],
			["Пакет для внутривенного вливания", 103559, -15236],
			["Пакет для внутривенного вливания", 103546, -15228],
			["Пакет для внутривенного вливания", 101199, -12211],
			["Пакет для внутривенного вливания", 101195, -12218],
			["Пакет для внутривенного вливания", 101200, -12202],
			["Пакет для внутривенного вливания", 97020, -21111],
			["Пакет для внутривенного вливания", 12436, -60599],
			["Пакет для внутривенного вливания", 40577, -119494],
			["Пакет для внутривенного вливания", 20492, -108597],
			["Пакет для внутривенного вливания", -72409, -132601],
			["Пакет для внутривенного вливания", -120376, -185803],
			["Пакет для внутривенного вливания", -119942, -187478],
			["Пакет для внутривенного вливания", 144471, -145535],
			["Пакет для внутривенного вливания", 144643, -145799],
			["Пакет для внутривенного вливания", 144644, -145644],
			["Пакет для внутривенного вливания", 144658, -145660],
			["Пакет для внутривенного вливания", 102361, -151578],
			["Пакет для внутривенного вливания", 74190, -172437],
			["Пакет для внутривенного вливания", 74187, -172459],
			["Пакет для внутривенного вливания", 74084, -172388],
			["Пакет для внутривенного вливания", 74145, -172453],
			["Пакет для внутривенного вливания", 74351, -172276],
			["Пакет для внутривенного вливания", 74339, -172456],
			["Пакет для внутривенного вливания", 74111, -172355],
			["Пакет для внутривенного вливания", 74674, -172982],
			["Пакет для внутривенного вливания", 74895, -172940],
			["Пакет для внутривенного вливания", 74670, -172777],
			["Пакет для внутривенного вливания", -62749, 196715],
			["Пакет для внутривенного вливания", 93931, 187360],
			["Пакет для внутривенного вливания", 2682, 163964],
			["Пакет для внутривенного вливания", 2701, 163973],
			["Пакет для внутривенного вливания", 2631, 164200],
			["Пакет для внутривенного вливания", 2603, 164566],
			["Пакет для внутривенного вливания", 2524, 164645],
			["Пакет для внутривенного вливания", 2565, 164632],
			["Пакет для внутривенного вливания", 2536, 164662],
			["Пакет для внутривенного вливания", -59691, 117097],
			["Пакет для внутривенного вливания", -152195, 375],
			["Пакет для внутривенного вливания", -152312, 549],
			["Пакет для внутривенного вливания", 169741, 60237],
			["Пакет для внутривенного вливания", 78679, 52302]
			];
	for (var i = 0; i < hlam398.length; i++) {
				hlam_398 = new L.circleMarker([hlam398[i][1],hlam398[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam398[i][0])
					.bindTooltip(hlam398[i][0], {direction: 'top'})
					.addTo(hlam398icons);
			}
	}
	else {
		hlam398icons.clearLayers();
	}
}
var hlam399icons = L.layerGroup().addTo(map);
function Hlam399OnOff() {
	var chbox399;
	chbox399=document.getElementById('Hlam399Button');
	if (chbox399.checked) {
		var hlam399 = [
			["Папка", -9613, -26989],
			["Папка", -42744, -5922],
			["Папка", -42826, -5829],
			["Папка", -66806, -22824],
			["Папка", -66808, -22821],
			["Папка", -66814, -22828],
			["Папка", -66819, -22822],
			["Папка", -67527, -1448],
			["Папка", -67523, -1445],
			["Папка", -67536, -1454],
			["Папка", -111737, -62105],
			["Папка", -56271, -78593],
			["Папка", -41555, -80491],
			["Папка", -93354, -83600],
			["Папка", -68545, -105447],
			["Папка", -122910, -123563],
			["Папка", -161852, -73783],
			["Папка", -151833, -73450],
			["Папка", 131121, -31568],
			["Папка", 131105, -31585],
			["Папка", 131102, -31575],
			["Папка", 131095, -31580],
			["Папка", 190613, -34719],
			["Папка", 202519, -127273],
			["Папка", 124229, -28908],
			["Папка", 124224, -28912],
			["Папка", 124222, -28908],
			["Папка", 128716, -26133],
			["Папка", 101460, -12414],
			["Папка", 101667, -12116],
			["Папка", 101803, -12060],
			["Папка", 101872, -12234],
			["Папка", 93226, -31382],
			["Папка", 90870, -30522],
			["Папка", 77710, -15269],
			["Папка", 92354, -9749],
			["Папка", 70189, -7331],
			["Папка", 70154, -7359],
			["Папка", 70237, -7333],
			["Папка", 90328, -33359],
			["Папка", 37208, -42542],
			["Папка", 51390, -41266],
			["Папка", 51379, -41292],
			["Папка", 51554, -40786],
			["Папка", 29471, -58277],
			["Папка", 32113, -40227],
			["Папка", 65950, -125227],
			["Папка", 37877, -119546],
			["Папка", 189170, -169100],
			["Папка", 191693, -169317],
			["Папка", 189636, -164971],
			["Папка", 25945, -137533],
			["Папка", 74480, -177398],
			["Папка", -13556, 189925],
			["Папка", -13562, 189907],
			["Папка", -94391, 183314],
			["Папка", -94658, 183225],
			["Папка", -93690, 183686],
			["Папка", -9990, 132305],
			["Папка", -10204, 132164],
			["Папка", -10169, 132089],
			["Папка", -10097, 132115],
			["Папка", -9935, 132238],
			["Папка", -9907, 132204],
			["Папка", -5682, 161952],
			["Папка", -146278, 172609],
			["Папка", -145822, 172428],
			["Папка", 68554, 201815],
			["Папка", 69711, 202353],
			["Папка", 80345, 182203],
			["Папка", 80075, 182264],
			["Папка", 1544, 165102],
			["Папка", 27169, 131978],
			["Папка", -24824, 83164],
			["Папка", -41998, 87935],
			["Папка", -40789, 88331],
			["Папка", -43641, 90730],
			["Папка", -35507, 2425],
			["Папка", -35513, 2431],
			["Папка", -35378, 2250],
			["Папка", -35375, 2237],
			["Папка", -35369, 2238],
			["Папка", -35367, 2233],
			["Папка", -33666, 218],
			["Папка", -33666, 218],
			["Папка", -56725, 13337],
			["Папка", -56728, 13338],
			["Папка", -56706, 13530],
			["Папка", -56611, 13590],
			["Папка", -56614, 13597],
			["Папка", -47917, 15354],
			["Папка", -47839, 15177],
			["Папка", -47837, 15176],
			["Папка", -47832, 15181],
			["Папка", -47829, 15178],
			["Папка", -44251, 28101],
			["Папка", -118352, 1814],
			["Папка", 180667, 111002],
			["Папка", 171300, 1445],
			["Папка", 182702, 3165],
			["Папка", 182765, 3155],
			["Папка", 87904, 104899],
			["Папка", 25141, 124321],
			["Папка", 109275, 56444],
			["Папка", 111739, 55778],
			["Папка", 59097, 55328],
			["Папка", 14289, 38846],
			["Папка", 23502, 42297],
			["Папка", 23543, 42308],
			["Папка", 23484, 42364],
			["Папка", 22889, 44561],
			["Папка", 22905, 44541],
			["Папка", 16836, 45553],
			["Папка", 17052, 45740]
			];
	for (var i = 0; i < hlam399.length; i++) {
				hlam_399 = new L.circleMarker([hlam399[i][1],hlam399[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam399[i][0])
					.bindTooltip(hlam399[i][0], {direction: 'top'})
					.addTo(hlam399icons);
			}
	}
	else {
		hlam399icons.clearLayers();
	}
}
var hlam400icons = L.layerGroup().addTo(map);
function Hlam400OnOff() {
	var chbox400;
	chbox400=document.getElementById('Hlam400Button');
	if (chbox400.checked) {
		var hlam400 = [
			["Папка с делом", -93353, -83597],
			["Папка с делом", -161886, -73496],
			["Папка с делом", 74543, -177245],
			["Папка с делом", 74547, -177225],
			["Папка с делом", -13882, 118915],
			["Папка с делом", -14040, 119093],
			["Папка с делом", 182737, 3184],
			["Папка с делом", 22868, 44553]
			];
	for (var i = 0; i < hlam400.length; i++) {
				hlam_400 = new L.circleMarker([hlam400[i][1],hlam400[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam400[i][0])
					.bindTooltip(hlam400[i][0], {direction: 'top'})
					.addTo(hlam400icons);
			}
	}
	else {
		hlam400icons.clearLayers();
	}
}