var hlam401icons = L.layerGroup().addTo(map);
function Hlam401OnOff() {
	var chbox401;
	chbox401=document.getElementById('Hlam401Button');
	if (chbox401.checked) {
		var hlam401 = [
			["Пачка сигарет", -9463, -26970],
			["Пачка сигарет", -35856, -17929],
			["Пачка сигарет", -49887, -12797],
			["Пачка сигарет", -55873, -10271],
			["Пачка сигарет", -54978, -9444],
			["Пачка сигарет", -43179, -5657],
			["Пачка сигарет", -40839, -2546],
			["Пачка сигарет", -86814, -13469],
			["Пачка сигарет", -72372, -7076],
			["Пачка сигарет", -108906, -23011],
			["Пачка сигарет", -20961, -44324],
			["Пачка сигарет", -20955, -44349],
			["Пачка сигарет", -60507, -57782],
			["Пачка сигарет", -37654, -56992],
			["Пачка сигарет", -46449, -50746],
			["Пачка сигарет", -47670, -49540],
			["Пачка сигарет", -41328, -37563],
			["Пачка сигарет", -73248, -61487],
			["Пачка сигарет", -117777, -63040],
			["Пачка сигарет", -111023, -58824],
			["Пачка сигарет", -46681, -72906],
			["Пачка сигарет", -100324, -66903],
			["Пачка сигарет", -27832, -105980],
			["Пачка сигарет", -48196, -128129],
			["Пачка сигарет", -48214, -128112],
			["Пачка сигарет", -43274, -127604],
			["Пачка сигарет", -50764, -111949],
			["Пачка сигарет", -87396, -112501],
			["Пачка сигарет", -79648, -107656],
			["Пачка сигарет", -105893, -115312],
			["Пачка сигарет", -148987, -57909],
			["Пачка сигарет", -151592, -74004],
			["Пачка сигарет", -159981, -69903],
			["Пачка сигарет", -151340, -72032],
			["Пачка сигарет", -151338, -72040],
			["Пачка сигарет", -150842, -72884],
			["Пачка сигарет", -151433, -71523],
			["Пачка сигарет", -132429, -121441],
			["Пачка сигарет", 199126, -31905],
			["Пачка сигарет", 199118, -31928],
			["Пачка сигарет", 199094, -31899],
			["Пачка сигарет", 199106, -31904],
			["Пачка сигарет", 199122, -31923],
			["Пачка сигарет", 199143, -31924],
			["Пачка сигарет", 199061, -31888],
			["Пачка сигарет", 199111, -31917],
			["Пачка сигарет", 199090, -31880],
			["Пачка сигарет", 188371, -29330],
			["Пачка сигарет", 164624, -21476],
			["Пачка сигарет", 167105, -22425],
			["Пачка сигарет", 173389, -11534],
			["Пачка сигарет", 180349, -37738],
			["Пачка сигарет", 143055, -58579],
			["Пачка сигарет", 143063, -58574],
			["Пачка сигарет", 142941, -59284],
			["Пачка сигарет", 148809, -52350],
			["Пачка сигарет", 185140, -66812],
			["Пачка сигарет", 178081, -122464],
			["Пачка сигарет", 152963, -103876],
			["Пачка сигарет", 152991, -104521],
			["Пачка сигарет", 102608, -29498],
			["Пачка сигарет", 128426, -30335],
			["Пачка сигарет", 128582, -30287],
			["Пачка сигарет", 128599, -30285],
			["Пачка сигарет", 98698, -22406],
			["Пачка сигарет", 103994, -14471],
			["Пачка сигарет", 101370, -11653],
			["Пачка сигарет", 88922, -31218],
			["Пачка сигарет", 90927, -31306],
			["Пачка сигарет", 90567, -29469],
			["Пачка сигарет", 90320, -27772],
			["Пачка сигарет", 74341, -18287],
			["Пачка сигарет", 70679, -7478],
			["Пачка сигарет", 91382, -4637],
			["Пачка сигарет", 84346, -2017],
			["Пачка сигарет", 49089, -21305],
			["Пачка сигарет", 47896, -21299],
			["Пачка сигарет", 34766, -6318],
			["Пачка сигарет", 29534, -21152],
			["Пачка сигарет", 89531, -52716],
			["Пачка сигарет", 39425, -37829],
			["Пачка сигарет", 51820, -40580],
			["Пачка сигарет", 24684, -63655],
			["Пачка сигарет", 68111, -87968],
			["Пачка сигарет", 79438, -81860],
			["Пачка сигарет", 57765, -94913],
			["Пачка сигарет", 9583, -82773],
			["Пачка сигарет", 12708, -85774],
			["Пачка сигарет", 11247, -77242],
			["Пачка сигарет", 65677, -105527],
			["Пачка сигарет", 54286, -128597],
			["Пачка сигарет", 47306, -104416],
			["Пачка сигарет", 27231, -102378],
			["Пачка сигарет", 29495, -101205],
			["Пачка сигарет", 29388, -101128],
			["Пачка сигарет", -61356, -145485],
			["Пачка сигарет", -41755, -135704],
			["Пачка сигарет", -38942, -132690],
			["Пачка сигарет", -126390, -135330],
			["Пачка сигарет", -124437, -131507],
			["Пачка сигарет", -25768, -175173],
			["Пачка сигарет", -74803, -176074],
			["Пачка сигарет", -127929, -165557],
			["Пачка сигарет", -132080, -148768],
			["Пачка сигарет", 135645, -156626],
			["Пачка сигарет", 143420, -148971],
			["Пачка сигарет", 108514, -161273],
			["Пачка сигарет", 115213, -157641],
			["Пачка сигарет", 52180, -149204],
			["Пачка сигарет", 23705, -148759],
			["Пачка сигарет", 76685, -179234],
			["Пачка сигарет", 74425, -177867],
			["Пачка сигарет", 74249, -177010],
			["Пачка сигарет", -63701, 202877],
			["Пачка сигарет", -97403, 199800],
			["Пачка сигарет", -25397, 186053],
			["Пачка сигарет", -4038, 184574],
			["Пачка сигарет", -38967, 190115],
			["Пачка сигарет", -105110, 195147],
			["Пачка сигарет", -1092, 158364],
			["Пачка сигарет", -5853, 160699],
			["Пачка сигарет", -35556, 158644],
			["Пачка сигарет", -40948, 161720],
			["Пачка сигарет", -88146, 152624],
			["Пачка сигарет", -121402, 143208],
			["Пачка сигарет", -98633, 147880],
			["Пачка сигарет", -163255, 200838],
			["Пачка сигарет", -169788, 202323],
			["Пачка сигарет", -155171, 164518],
			["Пачка сигарет", -144621, 173185],
			["Пачка сигарет", -145348, 174298],
			["Пачка сигарет", -147062, 178566],
			["Пачка сигарет", -143458, 178997],
			["Пачка сигарет", -143671, 178713],
			["Пачка сигарет", -156650, 190960],
			["Пачка сигарет", -156647, 190959],
			["Пачка сигарет", -156697, 190958],
			["Пачка сигарет", -143130, 138691],
			["Пачка сигарет", -141217, 142913],
			["Пачка сигарет", -143475, 156706],
			["Пачка сигарет", -140894, 156333],
			["Пачка сигарет", -140887, 156334],
			["Пачка сигарет", 143770, 137286],
			["Пачка сигарет", 143810, 137321],
			["Пачка сигарет", 151254, 136358],
			["Пачка сигарет", 101744, 196628],
			["Пачка сигарет", 70077, 202622],
			["Пачка сигарет", 103256, 191141],
			["Пачка сигарет", 66348, 176895],
			["Пачка сигарет", 66367, 176835],
			["Пачка сигарет", 66342, 176847],
			["Пачка сигарет", 66350, 176863],
			["Пачка сигарет", 66379, 176807],
			["Пачка сигарет", 66365, 176836],
			["Пачка сигарет", 95998, 187307],
			["Пачка сигарет", 93530, 189230],
			["Пачка сигарет", 91100, 188903],
			["Пачка сигарет", 91790, 188921],
			["Пачка сигарет", 1826, 164512],
			["Пачка сигарет", 99576, 151451],
			["Пачка сигарет", 88037, 156718],
			["Пачка сигарет", 88047, 156717],
			["Пачка сигарет", 47915, 143524],
			["Пачка сигарет", 2391, 138412],
			["Пачка сигарет", -129511, 119268],
			["Пачка сигарет", -129368, 119105],
			["Пачка сигарет", -129208, 119790],
			["Пачка сигарет", -24903, 83090],
			["Пачка сигарет", -38552, 84747],
			["Пачка сигарет", -56390, 86912],
			["Пачка сигарет", -42430, 87290],
			["Пачка сигарет", -40907, 90786],
			["Пачка сигарет", -79265, 89089],
			["Пачка сигарет", -127059, 83625],
			["Пачка сигарет", -128244, 83927],
			["Пачка сигарет", -128790, 88460],
			["Пачка сигарет", -99481, 36165],
			["Пачка сигарет", -46807, 1180],
			["Пачка сигарет", -47315, 2495],
			["Пачка сигарет", -47825, 1655],
			["Пачка сигарет", -41369, 2647],
			["Пачка сигарет", -41616, 2610],
			["Пачка сигарет", -41618, 2622],
			["Пачка сигарет", -39248, 3483],
			["Пачка сигарет", -39275, 3489],
			["Пачка сигарет", -37968, 3206],
			["Пачка сигарет", -33646, 118],
			["Пачка сигарет", -33639, 115],
			["Пачка сигарет", -33633, 113],
			["Пачка сигарет", -49240, 5049],
			["Пачка сигарет", -49293, 5153],
			["Пачка сигарет", -47828, 15387],
			["Пачка сигарет", -34788, 13341],
			["Пачка сигарет", -47727, 20559],
			["Пачка сигарет", -65822, 4705],
			["Пачка сигарет", -130659, 10306],
			["Пачка сигарет", -146225, 66251],
			["Пачка сигарет", -131985, 12495],
			["Пачка сигарет", -131934, 12576],
			["Пачка сигарет", 191219, 115679],
			["Пачка сигарет", 144603, 106234],
			["Пачка сигарет", 135190, 115568],
			["Пачка сигарет", 132142, 80042],
			["Пачка сигарет", 145045, 87398],
			["Пачка сигарет", 171691, 57850],
			["Пачка сигарет", 194056, 58298],
			["Пачка сигарет", 170977, 1547],
			["Пачка сигарет", 135828, 14939],
			["Пачка сигарет", 133411, 20620],
			["Пачка сигарет", 149555, 30921],
			["Пачка сигарет", 94388, 103951],
			["Пачка сигарет", 95102, 103928],
			["Пачка сигарет", 94452, 104510],
			["Пачка сигарет", 1947, 100195],
			["Пачка сигарет", 100096, 91194],
			["Пачка сигарет", 77849, 33929],
			["Пачка сигарет", 68653, 38861],
			["Пачка сигарет", 13968, 38775],
			["Пачка сигарет", 15992, 43624],
			["Пачка сигарет", 16917, 45377],
			["Пачка сигарет", 103533, 4107],
			["Пачка сигарет", 120546, 5614],
			["Пачка сигарет", 120350, 5562],
			["Пачка сигарет", 121663, 6498],
			["Пачка сигарет", 121690, 6556],
			["Пачка сигарет", 43746, 2079],
			["Пачка сигарет", 47915, 13875],
			["Пачка сигарет", 41226, 23033],
			["Пачка сигарет", 66370, 176887],
			["Пачка сигарет", 7495, -31719],
			["Пачка сигарет", 27110, 171739]
			];
	for (var i = 0; i < hlam401.length; i++) {
				hlam_401 = new L.circleMarker([hlam401[i][1],hlam401[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam401[i][0])
					.bindTooltip(hlam401[i][0], {direction: 'top'})
					.addTo(hlam401icons);
			}
	}
	else {
		hlam401icons.clearLayers();
	}
}
var hlam402icons = L.layerGroup().addTo(map);
function Hlam402OnOff() {
	var chbox402;
	chbox402=document.getElementById('Hlam402Button');
	if (chbox402.checked) {
		var hlam402 = [
			["Паяльная лампа", -44637, -15651],
			["Паяльная лампа", -120185, -14308],
			["Паяльная лампа", -52311, -46368],
			["Паяльная лампа", -84863, -45663],
			["Паяльная лампа", -119750, -45981],
			["Паяльная лампа", -29439, -93758],
			["Паяльная лампа", -46725, -72895],
			["Паяльная лампа", -107645, -84554],
			["Паяльная лампа", -125279, -74264],
			["Паяльная лампа", -100170, -67095],
			["Паяльная лампа", -80144, -128090],
			["Паяльная лампа", -112592, -121355],
			["Паяльная лампа", -115438, -99703],
			["Паяльная лампа", -146204, -95961],
			["Паяльная лампа", -138315, -97313],
			["Паяльная лампа", -151832, -73710],
			["Паяльная лампа", -149003, -125703],
			["Паяльная лампа", -145587, -126581],
			["Паяльная лампа", -131792, -121617],
			["Паяльная лампа", -133497, -121928],
			["Паяльная лампа", 188330, -29340],
			["Паяльная лампа", 129241, -28458],
			["Паяльная лампа", 81752, -20853],
			["Паяльная лампа", 48572, -21890],
			["Паяльная лампа", 111727, -56038],
			["Паяльная лампа", 24615, -63296],
			["Паяльная лампа", 29264, -58613],
			["Паяльная лампа", 57540, -94527],
			["Паяльная лампа", 16215, -80377],
			["Паяльная лампа", 15800, -107721],
			["Паяльная лампа", 17867, -108542],
			["Паяльная лампа", 20225, -103979],
			["Паяльная лампа", -6974, -161580],
			["Паяльная лампа", -81959, -161106],
			["Паяльная лампа", -81695, -161328],
			["Паяльная лампа", -117765, -162672],
			["Паяльная лампа", -126436, -135331],
			["Паяльная лампа", -126529, -134122],
			["Паяльная лампа", -122631, -132637],
			["Паяльная лампа", -14632, -173655],
			["Паяльная лампа", -122232, -188080],
			["Паяльная лампа", -114301, -169439],
			["Паяльная лампа", -113757, -170518],
			["Паяльная лампа", 131585, -132172],
			["Паяльная лампа", 188914, -165978],
			["Паяльная лампа", 109579, -158645],
			["Паяльная лампа", 115176, -157622],
			["Паяльная лампа", -67846, 201692],
			["Паяльная лампа", -71368, 169988],
			["Паяльная лампа", -94162, 190615],
			["Паяльная лампа", -19802, 145495],
			["Паяльная лампа", -26963, 162715],
			["Паяльная лампа", -40899, 161668],
			["Паяльная лампа", -143571, 173905],
			["Паяльная лампа", -145676, 177161],
			["Паяльная лампа", -143607, 178971],
			["Паяльная лампа", -142406, 142594],
			["Паяльная лампа", -138618, 152459],
			["Паяльная лампа", 69764, 202540],
			["Паяльная лампа", 102240, 191497],
			["Паяльная лампа", 101272, 192420],
			["Паяльная лампа", 101651, 191029],
			["Паяльная лампа", 103445, 191174],
			["Паяльная лампа", 101652, 193820],
			["Паяльная лампа", 104239, 196097],
			["Паяльная лампа", 82418, 184091],
			["Паяльная лампа", 95957, 187278],
			["Паяльная лампа", 95917, 192121],
			["Паяльная лампа", 3139, 182202],
			["Паяльная лампа", 71868, 138362],
			["Паяльная лампа", 22790, 133901],
			["Паяльная лампа", -41599, 88028],
			["Паяльная лампа", -52889, 57093],
			["Паяльная лампа", -104473, 38259],
			["Паяльная лампа", -33881, 533],
			["Паяльная лампа", -46907, 26679],
			["Паяльная лампа", -47110, 28347],
			["Паяльная лампа", -46699, 26954],
			["Паяльная лампа", -46431, 28833],
			["Паяльная лампа", -43805, 28874],
			["Паяльная лампа", -148455, 113753],
			["Паяльная лампа", 179484, 111784],
			["Паяльная лампа", 182482, 111984],
			["Паяльная лампа", 182046, 112122],
			["Паяльная лампа", 183898, 111882],
			["Паяльная лампа", 154399, 77663],
			["Паяльная лампа", 153189, 57675],
			["Паяльная лампа", 160496, 58504],
			["Паяльная лампа", 183080, 2743],
			["Паяльная лампа", 133486, 17686],
			["Паяльная лампа", 25708, 71282],
			["Паяльная лампа", 105313, 52386],
			["Паяльная лампа", 106945, 51787],
			["Паяльная лампа", 107907, 60672],
			["Паяльная лампа", 111577, 58098],
			["Паяльная лампа", 107212, 61572],
			["Паяльная лампа", 79670, 55876],
			["Паяльная лампа", 55332, 8381],
			["Паяльная лампа", -138212, -139768]
			];
	for (var i = 0; i < hlam402.length; i++) {
				hlam_402 = new L.circleMarker([hlam402[i][1],hlam402[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam402[i][0])
					.bindTooltip(hlam402[i][0], {direction: 'top'})
					.addTo(hlam402icons);
			}
	}
	else {
		hlam402icons.clearLayers();
	}
}
var hlam403icons = L.layerGroup().addTo(map);
function Hlam403OnOff() {
	var chbox403;
	chbox403=document.getElementById('Hlam403Button');
	if (chbox403.checked) {
		var hlam403 = [
			["Паяльная лампа &quotФумигус&quot", -29699, -94081],
			["Паяльная лампа &quotФумигус&quot", -93538, -130833],
			["Паяльная лампа &quotФумигус&quot", -85394, -109852],
			["Паяльная лампа &quotФумигус&quot", -85387, -109875],
			["Паяльная лампа &quotФумигус&quot", -124370, -127937],
			["Паяльная лампа &quotФумигус&quot", -124394, -127932],
			["Паяльная лампа &quotФумигус&quot", -148584, -57501],
			["Паяльная лампа &quotФумигус&quot", -131319, -113711],
			["Паяльная лампа &quotФумигус&quot", 202981, -126388],
			["Паяльная лампа &quotФумигус&quot", 89573, -53161],
			["Паяльная лампа &quotФумигус&quot", -4476, -156154],
			["Паяльная лампа &quotФумигус&quot", -4514, -155621],
			["Паяльная лампа &quotФумигус&quot", -120370, -132872],
			["Паяльная лампа &quotФумигус&quot", 192175, -169181],
			["Паяльная лампа &quotФумигус&quot", 108318, -153684],
			["Паяльная лампа &quotФумигус&quot", 188962, 229861],
			["Паяльная лампа &quotФумигус&quot", 66311, 177167],
			["Паяльная лампа &quotФумигус&quot", -129759, 84876],
			["Паяльная лампа &quotФумигус&quot", -119874, 3628],
			["Паяльная лампа &quotФумигус&quot", 182022, 109455],
			["Паяльная лампа &quotФумигус&quot", 134369, 16396],
			["Паяльная лампа &quotФумигус&quot", 133023, 18388],
			["Паяльная лампа &quotФумигус&quot", 20918, 125544]
			];
	for (var i = 0; i < hlam403.length; i++) {
				hlam_403 = new L.circleMarker([hlam403[i][1],hlam403[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam403[i][0])
					.bindTooltip(hlam403[i][0], {direction: 'top'})
					.addTo(hlam403icons);
			}
	}
	else {
		hlam403icons.clearLayers();
	}
}
var hlam404icons = L.layerGroup().addTo(map);
function Hlam404OnOff() {
	var chbox404;
	chbox404=document.getElementById('Hlam404Button');
	if (chbox404.checked) {
		var hlam404 = [
			["Пепельница", -50138, -17527],
			["Пепельница", -77749, -21557],
			["Пепельница", -113639, -47355],
			["Пепельница", -59013, -91759],
			["Пепельница", -49603, -74878],
			["Пепельница", -110954, -91047],
			["Пепельница", -125925, -73950],
			["Пепельница", -46436, -104728],
			["Пепельница", -94616, -126783],
			["Пепельница", -68556, -106788],
			["Пепельница", -79540, -105273],
			["Пепельница", -162157, -54215],
			["Пепельница", -148319, -56870],
			["Пепельница", -138098, -98036],
			["Пепельница", -137477, -97050],
			["Пепельница", -152039, -75385],
			["Пепельница", -152096, -75335],
			["Пепельница", -152256, -73288],
			["Пепельница", 166909, -25874],
			["Пепельница", 167309, -24522],
			["Пепельница", 157497, -49497],
			["Пепельница", 150561, -46514],
			["Пепельница", 150554, -46524],
			["Пепельница", 196739, -91203],
			["Пепельница", 128455, -30315],
			["Пепельница", 129975, -27152],
			["Пепельница", 102301, -12497],
			["Пепельница", 102105, -12446],
			["Пепельница", 101365, -11663],
			["Пепельница", 86464, -32629],
			["Пепельница", 88461, -31974],
			["Пепельница", 91067, -27530],
			["Пепельница", 88311, -21356],
			["Пепельница", 84726, -19373],
			["Пепельница", 77202, -15077],
			["Пепельница", 70690, -7484],
			["Пепельница", 48661, -22129],
			["Пепельница", 48556, -22156],
			["Пепельница", 47722, -20268],
			["Пепельница", 29524, -21158],
			["Пепельница", 90193, -33002],
			["Пепельница", 34496, -37106],
			["Пепельница", 51849, -40514],
			["Пепельница", 35472, -35154],
			["Пепельница", 35545, -35030],
			["Пепельница", 35809, -35029],
			["Пепельница", 37969, -35012],
			["Пепельница", 37905, -34902],
			["Пепельница", 38201, -35339],
			["Пепельница", 29493, -58308],
			["Пепельница", 18567, -106691],
			["Пепельница", 17804, -108715],
			["Пепельница", 20187, -104143],
			["Пепельница", -35199, -150745],
			["Пепельница", -60509, -145558],
			["Пепельница", -118177, -162805],
			["Пепельница", -118162, -162859],
			["Пепельница", -25769, -175163],
			["Пепельница", -83127, -179518],
			["Пепельница", -152747, -160619],
			["Пепельница", -133490, -153257],
			["Пепельница", 74198, -177297],
			["Пепельница", -23238, 189590],
			["Пепельница", -59461, 180934],
			["Пепельница", -39058, 190435],
			["Пепельница", -10004, 132186],
			["Пепельница", -26686, 143908],
			["Пепельница", -147014, 164164],
			["Пепельница", -138599, 152655],
			["Пепельница", 151250, 136547],
			["Пепельница", 151343, 135786],
			["Пепельница", 151278, 135932],
			["Пепельница", 151606, 136397],
			["Пепельница", 151615, 136785],
			["Пепельница", 152124, 136705],
			["Пепельница", 137586, 145368],
			["Пепельница", 137122, 145340],
			["Пепельница", 70290, 202248],
			["Пепельница", 60345, 173298],
			["Пепельница", 2929, 182088],
			["Пепельница", 14922, 188135],
			["Пепельница", 99394, 151374],
			["Пепельница", 89574, 151967],
			["Пепельница", 47884, 143528],
			["Пепельница", 47375, 161984],
			["Пепельница", -14994, 118656],
			["Пепельница", -14052, 119439],
			["Пепельница", -13874, 119702],
			["Пепельница", -13923, 119101],
			["Пепельница", -13866, 118912],
			["Пепельница", -13478, 119257],
			["Пепельница", -15044, 119790],
			["Пепельница", -14740, 120201],
			["Пепельница", -14915, 120218],
			["Пепельница", -129335, 119326],
			["Пепельница", -129413, 119869],
			["Пепельница", -128804, 120269],
			["Пепельница", -87836, 67815],
			["Пепельница", -91224, 63286],
			["Пепельница", -23243, 14109],
			["Пепельница", -118458, 961],
			["Пепельница", -163888, 122308],
			["Пепельница", -132057, 12368],
			["Пепельница", 132249, 54951],
			["Пепельница", 111598, 58587],
			["Пепельница", 23885, 49117],
			["Пепельница", 129585, 19404]
			];
	for (var i = 0; i < hlam404.length; i++) {
				hlam_404 = new L.circleMarker([hlam404[i][1],hlam404[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam404[i][0])
					.bindTooltip(hlam404[i][0], {direction: 'top'})
					.addTo(hlam404icons);
			}
	}
	else {
		hlam404icons.clearLayers();
	}
}
var hlam405icons = L.layerGroup().addTo(map);
function Hlam405OnOff() {
	var chbox405;
	chbox405=document.getElementById('Hlam405Button');
	if (chbox405.checked) {
		var hlam405 = [
			["Передняя нога робопони &quotЛютик&quot", 89507, -53038],
			["Передняя нога робопони &quotЛютик&quot", 192090, -169459],
			["Передняя нога робопони &quotЛютик&quot", -129551, 131119],
			["Передняя нога робопони &quotЛютик&quot", -129494, 131108]
			];
	for (var i = 0; i < hlam405.length; i++) {
				hlam_405 = new L.circleMarker([hlam405[i][1],hlam405[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam405[i][0])
					.bindTooltip(hlam405[i][0], {direction: 'top'})
					.addTo(hlam405icons);
			}
	}
	else {
		hlam405icons.clearLayers();
	}
}
var hlam406icons = L.layerGroup().addTo(map);
function Hlam406OnOff() {
	var chbox406;
	chbox406=document.getElementById('Hlam406Button');
	if (chbox406.checked) {
		var hlam406 = [
			["Перечница", -50686, -12440],
			["Перечница", -55743, -60332],
			["Перечница", -46971, -51148],
			["Перечница", -63040, -128970],
			["Перечница", 91591, -59219],
			["Перечница", 16927, -82313],
			["Перечница", 140745, -147245],
			["Перечница", -61057, 181574],
			["Перечница", 150650, 136180],
			["Перечница", 150935, 135485],
			["Перечница", 151622, 136807],
			["Перечница", 15370, 197940],
			["Перечница", 48725, 190545],
			["Перечница", 2679, 137895],
			["Перечница", -17818, 60237],
			["Перечница", -39704, 44572],
			["Перечница", -98513, 8227],
			["Перечница", -158517, 57584],
			["Перечница", 169631, 56238],
			["Перечница", 94956, 98752]
			];
	for (var i = 0; i < hlam406.length; i++) {
				hlam_406 = new L.circleMarker([hlam406[i][1],hlam406[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam406[i][0])
					.bindTooltip(hlam406[i][0], {direction: 'top'})
					.addTo(hlam406icons);
			}
	}
	else {
		hlam406icons.clearLayers();
	}
}
var hlam407icons = L.layerGroup().addTo(map);
function Hlam407OnOff() {
	var chbox407;
	chbox407=document.getElementById('Hlam407Button');
	if (chbox407.checked) {
		var hlam407 = [
			["Пестик маслобойки", 64848, -58632],
			["Пестик маслобойки", 93897, -85031],
			["Пестик маслобойки", 46864, 161069],
			["Пестик маслобойки", 172413, 39852],
			["Пестик маслобойки", 191197, 62171]
			];
	for (var i = 0; i < hlam407.length; i++) {
				hlam_407 = new L.circleMarker([hlam407[i][1],hlam407[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam407[i][0])
					.bindTooltip(hlam407[i][0], {direction: 'top'})
					.addTo(hlam407icons);
			}
	}
	else {
		hlam407icons.clearLayers();
	}
}
var hlam408icons = L.layerGroup().addTo(map);
function Hlam408OnOff() {
	var chbox408;
	chbox408=document.getElementById('Hlam408Button');
	if (chbox408.checked) {
		var hlam408 = [
			["Печатная машинка &quotКарлайл&quot", -44367, -7924],
			["Печатная машинка &quotКарлайл&quot", -47473, -49310],
			["Печатная машинка &quotКарлайл&quot", -46065, -103447],
			["Печатная машинка &quotКарлайл&quot", 179650, -121798],
			["Печатная машинка &quotКарлайл&quot", 87486, 158011],
			["Печатная машинка &quotКарлайл&quot", -19303, 17221],
			["Печатная машинка &quotКарлайл&quot", -19610, 17151],
			["Печатная машинка &quotКарлайл&quot", -46815, 2464],
			["Печатная машинка &quotКарлайл&quot", -39169, 3785],
			["Печатная машинка &quotКарлайл&quot", 157957, 67781],
			["Печатная машинка &quotКарлайл&quot", 139440, 3504],
			["Печатная машинка &quotКарлайл&quot", 54843, 52441],
			["Печатная машинка &quotКарлайл&quot", 100151, 25042]
			];
	for (var i = 0; i < hlam408.length; i++) {
				hlam_408 = new L.circleMarker([hlam408[i][1],hlam408[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam408[i][0])
					.bindTooltip(hlam408[i][0], {direction: 'top'})
					.addTo(hlam408icons);
			}
	}
	else {
		hlam408icons.clearLayers();
	}
}
var hlam409icons = L.layerGroup().addTo(map);
function Hlam409OnOff() {
	var chbox409;
	chbox409=document.getElementById('Hlam409Button');
	if (chbox409.checked) {
		var hlam409 = [

			];
	for (var i = 0; i < hlam409.length; i++) {
				hlam_409 = new L.circleMarker([hlam409[i][1],hlam409[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam409[i][0])
					.bindTooltip(hlam409[i][0], {direction: 'top'})
					.addTo(hlam409icons);
			}
	}
	else {
		hlam409icons.clearLayers();
	}
}
var hlam410icons = L.layerGroup().addTo(map);
function Hlam410OnOff() {
	var chbox410;
	chbox410=document.getElementById('Hlam410Button');
	if (chbox410.checked) {
		var hlam410 = [
			["Пивная бутылка из Кларксберга", 167435, -16831],
			["Пивная бутылка из Кларксберга", 167420, -16867],
			["Пивная бутылка из Кларксберга", 167423, -16830],
			["Пивная бутылка из Кларксберга", 167441, -16844],
			["Пивная бутылка из Кларксберга", 167583, -17189],
			["Пивная бутылка из Кларксберга", 167603, -17179],
			["Пивная бутылка из Кларксберга", 167645, -17539],
			["Пивная бутылка из Кларксберга", 167659, -17542],
			["Пивная бутылка из Кларксберга", 167179, -16065],
			["Пивная бутылка из Кларксберга", 167116, -16092],
			["Пивная бутылка из Кларксберга", 167084, -16084],
			["Пивная бутылка из Кларксберга", 167143, -16058],
			["Пивная бутылка из Кларксберга", 167134, -16082],
			["Пивная бутылка из Кларксберга", 170583, -14654],
			["Пивная бутылка из Кларксберга", 170573, -14607],
			["Пивная бутылка из Кларксберга", 170585, -14637],
			["Пивная бутылка из Кларксберга", 170588, -14674],
			["Пивная бутылка из Кларксберга", 169965, -15403],
			["Пивная бутылка из Кларксберга", 170001, -15415],
			["Пивная бутылка из Кларксберга", 170002, -15371],
			["Пивная бутылка из Кларксберга", 170021, -15434],
			["Пивная бутылка из Кларксберга", 170020, -15432],
			["Пивная бутылка из Кларксберга", 170022, -15437],
			["Пивная бутылка из Кларксберга", 170024, -15443],
			["Пивная бутылка из Кларксберга", 170032, -15469]
			];
	for (var i = 0; i < hlam410.length; i++) {
				hlam_410 = new L.circleMarker([hlam410[i][1],hlam410[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam410[i][0])
					.bindTooltip(hlam410[i][0], {direction: 'top'})
					.addTo(hlam410icons);
			}
	}
	else {
		hlam410icons.clearLayers();
	}
}
var hlam411icons = L.layerGroup().addTo(map);
function Hlam411OnOff() {
	var chbox411;
	chbox411=document.getElementById('Hlam411Button');
	if (chbox411.checked) {
		var hlam411 = [
			["Пила", 69947, -104204],
			["Пила", 69666, -102673],
			["Пила", 69708, -104642],
			["Пила", 69924, -104176],
			["Пила", 69929, -104217],
			["Пила", 56777, 152736],
			["Пила", 188557, 57287]
			];
	for (var i = 0; i < hlam411.length; i++) {
				hlam_411 = new L.circleMarker([hlam411[i][1],hlam411[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam411[i][0])
					.bindTooltip(hlam411[i][0], {direction: 'top'})
					.addTo(hlam411icons);
			}
	}
	else {
		hlam411icons.clearLayers();
	}
}
var hlam412icons = L.layerGroup().addTo(map);
function Hlam412OnOff() {
	var chbox412;
	chbox412=document.getElementById('Hlam412Button');
	if (chbox412.checked) {
		var hlam412 = [
			["Пила", -31465, -65884],
			["Пила", -61839, -127556],
			["Пила", 146883, -56070],
			["Пила", 182151, -92180],
			["Пила", 92922, -8617],
			["Пила", 50840, -45211],
			["Пила", 20242, -103922],
			["Пила", -82693, -178540],
			["Пила", 53049, -149217],
			["Пила", -3964, 161363],
			["Пила", -140909, 178908],
			["Пила", -150515, 150719],
			["Пила", 80890, 184508],
			["Пила", 7103, 162248],
			["Пила", -59849, 116975],
			["Пила", -59690, 117328],
			["Пила", -14685, 80970],
			["Пила", 182976, 112649],
			["Пила", 188752, 57117],
			["Пила", 182824, 2948],
			["Пила", 27607, 130944],
			["Пила", 49882, 85128],
			["Пила", 73268, 41736],
			["Пила", 27135, 49790],
			["Пила", 55315, 8430]
			];
	for (var i = 0; i < hlam412.length; i++) {
				hlam_412 = new L.circleMarker([hlam412[i][1],hlam412[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam412[i][0])
					.bindTooltip(hlam412[i][0], {direction: 'top'})
					.addTo(hlam412icons);
			}
	}
	else {
		hlam412icons.clearLayers();
	}
}
var hlam413icons = L.layerGroup().addTo(map);
function Hlam413OnOff() {
	var chbox413;
	chbox413=document.getElementById('Hlam413Button');
	if (chbox413.checked) {
		var hlam413 = [
			["Пила", -1532, -5395],
			["Пила", -29355, -49358],
			["Пила", -46698, -50895],
			["Пила", -51981, -46623],
			["Пила", -59064, -39744],
			["Пила", -31471, -65904],
			["Пила", -61699, -127584],
			["Пила", -126218, -109756],
			["Пила", -164183, -128983],
			["Пила", 146889, -56080],
			["Пила", 149176, -51920],
			["Пила", 183016, -93334],
			["Пила", 81911, -18998],
			["Пила", 69155, -15814],
			["Пила", 113660, -56080],
			["Пила", 24674, -63663],
			["Пила", 101503, -98611],
			["Пила", -95031, -176603],
			["Пила", 187992, -169518],
			["Пила", 189689, -169362],
			["Пила", 189477, -168661],
			["Пила", 53037, -149184],
			["Пила", 50190, -166421],
			["Пила", -16578, 163864],
			["Пила", -42749, 137705],
			["Пила", -41375, 161404],
			["Пила", -88927, 150705],
			["Пила", -121332, 143241],
			["Пила", -141104, 170370],
			["Пила", 143400, 194342],
			["Пила", 35073, 173149],
			["Пила", 72017, 133132],
			["Пила", 56871, 152833],
			["Пила", 20378, 134843],
			["Пила", -59763, 117439],
			["Пила", -14676, 81033],
			["Пила", -37507, 84671],
			["Пила", -47133, 28801],
			["Пила", 136385, 124073],
			["Пила", 134479, 127441],
			["Пила", 189164, 57116],
			["Пила", 183051, 2758],
			["Пила", 136379, 14636],
			["Пила", 133287, 17968],
			["Пила", 95401, 99057],
			["Пила", 92513, 114197],
			["Пила", 34763, 130270],
			["Пила", 78152, 33875],
			["Пила", 74364, 44204],
			["Пила", 79674, 55859],
			["Пила", 60396, 48565],
			["Пила", 27121, 49768],
			["Пила", 54543, 8953]
			];
	for (var i = 0; i < hlam413.length; i++) {
				hlam_413 = new L.circleMarker([hlam413[i][1],hlam413[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam413[i][0])
					.bindTooltip(hlam413[i][0], {direction: 'top'})
					.addTo(hlam413icons);
			}
	}
	else {
		hlam413icons.clearLayers();
	}
}
var hlam414icons = L.layerGroup().addTo(map);
function Hlam414OnOff() {
	var chbox414;
	chbox414=document.getElementById('Hlam414Button');
	if (chbox414.checked) {
		var hlam414 = [
			["Пишущая машинка", -6218, -63908],
			["Пишущая машинка", -55323, -60416],
			["Пишущая машинка", -13031, -65836],
			["Пишущая машинка", -11724, -69126],
			["Пишущая машинка", -56171, -78765],
			["Пишущая машинка", -27819, -106007],
			["Пишущая машинка", -63390, -103302],
			["Пишущая машинка", -46041, -103502],
			["Пишущая машинка", -46236, -104954],
			["Пишущая машинка", -46471, -104683],
			["Пишущая машинка", -46548, -104509],
			["Пишущая машинка", -111000, -112676],
			["Пишущая машинка", -124078, -105113],
			["Пишущая машинка", -151371, -72230],
			["Пишущая машинка", 167352, -24339],
			["Пишущая машинка", 182257, -13711],
			["Пишущая машинка", 173373, -11514],
			["Пишущая машинка", 148887, -52468],
			["Пишущая машинка", 147650, -78290],
			["Пишущая машинка", 150208, -67606],
			["Пишущая машинка", 81389, -21032],
			["Пишущая машинка", 92311, -9734],
			["Пишущая машинка", 94723, -8492],
			["Пишущая машинка", 73361, -7247],
			["Пишущая машинка", 73435, -7294],
			["Пишущая машинка", 28100, -31698],
			["Пишущая машинка", 28712, -31264],
			["Пишущая машинка", 29455, -21313],
			["Пишущая машинка", 29674, -21232],
			["Пишущая машинка", 29463, -18830],
			["Пишущая машинка", 89800, -57059],
			["Пишущая машинка", 29505, -58336],
			["Пишущая машинка", 32174, -40238],
			["Пишущая машинка", 75647, -76720],
			["Пишущая машинка", 60576, -96644],
			["Пишущая машинка", 21202, -109070],
			["Пишущая машинка", 21129, -109322],
			["Пишущая машинка", -24099, -179942],
			["Пишущая машинка", -87752, -165907],
			["Пишущая машинка", -108055, -178989],
			["Пишущая машинка", -108237, -179015],
			["Пишущая машинка", -134276, -154323],
			["Пишущая машинка", 135887, -156749],
			["Пишущая машинка", 189217, -169103],
			["Пишущая машинка", 187892, -165276],
			["Пишущая машинка", 189060, -165503],
			["Пишущая машинка", 115737, -157957],
			["Пишущая машинка", 102696, -151421],
			["Пишущая машинка", 27802, -137095],
			["Пишущая машинка", 74492, -177300],
			["Пишущая машинка", 71788, -175155],
			["Пишущая машинка", -33121, 171547],
			["Пишущая машинка", -38969, 190052],
			["Пишущая машинка", -83713, 165581],
			["Пишущая машинка", -93222, 183851],
			["Пишущая машинка", -93229, 183696],
			["Пишущая машинка", -93234, 183541],
			["Пишущая машинка", -92611, 183813],
			["Пишущая машинка", -92622, 183504],
			["Пишущая машинка", -93381, 183826],
			["Пишущая машинка", -93387, 183672],
			["Пишущая машинка", -93392, 183517],
			["Пишущая машинка", -93640, 183801],
			["Пишущая машинка", -92697, 183764],
			["Пишущая машинка", -95036, 190431],
			["Пишущая машинка", -27347, 162851],
			["Пишущая машинка", -5717, 161912],
			["Пишущая машинка", -5630, 162125],
			["Пишущая машинка", -6081, 162143],
			["Пишущая машинка", -3459, 162773],
			["Пишущая машинка", -144985, 178020],
			["Пишущая машинка", 124945, 168808],
			["Пишущая машинка", 79906, 182493],
			["Пишущая машинка", 48893, 190956],
			["Пишущая машинка", 1412, 164454],
			["Пишущая машинка", 72811, 136645],
			["Пишущая машинка", 2923, 163293],
			["Пишущая машинка", 2891, 163493],
			["Пишущая машинка", 3721, 160328],
			["Пишущая машинка", -42513, 87291],
			["Пишущая машинка", -41094, 88351],
			["Пишущая машинка", -42405, 88049],
			["Пишущая машинка", -47173, 51001],
			["Пишущая машинка", -99625, 7858],
			["Пишущая машинка", -139394, 91009],
			["Пишущая машинка", 133438, 121618],
			["Пишущая машинка", 182915, 2787],
			["Пишущая машинка", 190612, 31067],
			["Пишущая машинка", 26371, 124951],
			["Пишущая машинка", 25297, 124761],
			["Пишущая машинка", 70328, 41832],
			["Пишущая машинка", 70172, 41823],
			["Пишущая машинка", 69992, 41829],
			["Пишущая машинка", 120810, 6504],
			["Пишущая машинка", 58190, 10781]
			];
	for (var i = 0; i < hlam414.length; i++) {
				hlam_414 = new L.circleMarker([hlam414[i][1],hlam414[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam414[i][0])
					.bindTooltip(hlam414[i][0], {direction: 'top'})
					.addTo(hlam414icons);
			}
	}
	else {
		hlam414icons.clearLayers();
	}
}
var hlam415icons = L.layerGroup().addTo(map);
function Hlam415OnOff() {
	var chbox415;
	chbox415=document.getElementById('Hlam415Button');
	if (chbox415.checked) {
		var hlam415 = [
			["Планшет", -72487, -7265],
			["Планшет", -38177, 3199],
			["Планшет", 146162, 107479]
			];
	for (var i = 0; i < hlam415.length; i++) {
				hlam_415 = new L.circleMarker([hlam415[i][1],hlam415[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam415[i][0])
					.bindTooltip(hlam415[i][0], {direction: 'top'})
					.addTo(hlam415icons);
			}
	}
	else {
		hlam415icons.clearLayers();
	}
}
var hlam416icons = L.layerGroup().addTo(map);
function Hlam416OnOff() {
	var chbox416;
	chbox416=document.getElementById('Hlam416Button');
	if (chbox416.checked) {
		var hlam416 = [
			["Пластиковая вилка", -50254, -14639],
			["Пластиковая вилка", -50258, -14661],
			["Пластиковая вилка", -25207, -57372],
			["Пластиковая вилка", -25251, -57245],
			["Пластиковая вилка", -25259, -57310],
			["Пластиковая вилка", -52209, -66874],
			["Пластиковая вилка", -52158, -66904],
			["Пластиковая вилка", 103165, -11079],
			["Пластиковая вилка", 88652, -31201],
			["Пластиковая вилка", 88223, -20993],
			["Пластиковая вилка", 88285, -21304],
			["Пластиковая вилка", 94505, -11277],
			["Пластиковая вилка", 53467, -3011],
			["Пластиковая вилка", 17072, -106974],
			["Пластиковая вилка", 17184, -106516],
			["Пластиковая вилка", 17188, -106502],
			["Пластиковая вилка", 18112, -107158],
			["Пластиковая вилка", 19466, -107071],
			["Пластиковая вилка", 19693, -104387],
			["Пластиковая вилка", -93936, -175235],
			["Пластиковая вилка", -122109, -187973],
			["Пластиковая вилка", 54708, -167767],
			["Пластиковая вилка", 54688, -167788],
			["Пластиковая вилка", -146179, 174927],
			["Пластиковая вилка", 152823, 161850],
			["Пластиковая вилка", 15362, 197936],
			["Пластиковая вилка", 26041, 172347],
			["Пластиковая вилка", -61723, 90453],
			["Пластиковая вилка", 171058, 1796],
			["Пластиковая вилка", 130532, 112253],
			["Пластиковая вилка", 7581, 44376],
			["Пластиковая вилка", 7604, 44135],
			["Пластиковая вилка", 7498, 43856],
			["Пластиковая вилка", 51465, 12115]
			];
	for (var i = 0; i < hlam416.length; i++) {
				hlam_416 = new L.circleMarker([hlam416[i][1],hlam416[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam416[i][0])
					.bindTooltip(hlam416[i][0], {direction: 'top'})
					.addTo(hlam416icons);
			}
	}
	else {
		hlam416icons.clearLayers();
	}
}
var hlam417icons = L.layerGroup().addTo(map);
function Hlam417OnOff() {
	var chbox417;
	chbox417=document.getElementById('Hlam417Button');
	if (chbox417.checked) {
		var hlam417 = [
			["Пластиковая вилка", -155780, -36635],
			["Пластиковая вилка", 103186, -11010],
			["Пластиковая вилка", -76773, -176237],
			["Пластиковая вилка", 183365, -166177]
			];
	for (var i = 0; i < hlam417.length; i++) {
				hlam_417 = new L.circleMarker([hlam417[i][1],hlam417[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam417[i][0])
					.bindTooltip(hlam417[i][0], {direction: 'top'})
					.addTo(hlam417icons);
			}
	}
	else {
		hlam417icons.clearLayers();
	}
}
var hlam418icons = L.layerGroup().addTo(map);
function Hlam418OnOff() {
	var chbox418;
	chbox418=document.getElementById('Hlam418Button');
	if (chbox418.checked) {
		var hlam418 = [
			["Пластиковая вилка", -155687, -36660],
			["Пластиковая вилка", 169551, -123187],
			["Пластиковая вилка", 82167, -21637]
			];
	for (var i = 0; i < hlam418.length; i++) {
				hlam_418 = new L.circleMarker([hlam418[i][1],hlam418[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam418[i][0])
					.bindTooltip(hlam418[i][0], {direction: 'top'})
					.addTo(hlam418icons);
			}
	}
	else {
		hlam418icons.clearLayers();
	}
}
var hlam419icons = L.layerGroup().addTo(map);
function Hlam419OnOff() {
	var chbox419;
	chbox419=document.getElementById('Hlam419Button');
	if (chbox419.checked) {
		var hlam419 = [
			["Пластиковая канистра для бензина", 101970, -12323],
			["Пластиковая канистра для бензина", 102304, -10918],
			["Пластиковая канистра для бензина", 103123, -11364],
			["Пластиковая канистра для бензина", 102858, -11289]
			];
	for (var i = 0; i < hlam419.length; i++) {
				hlam_419 = new L.circleMarker([hlam419[i][1],hlam419[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam419[i][0])
					.bindTooltip(hlam419[i][0], {direction: 'top'})
					.addTo(hlam419icons);
			}
	}
	else {
		hlam419icons.clearLayers();
	}
}
var hlam420icons = L.layerGroup().addTo(map);
function Hlam420OnOff() {
	var chbox420;
	chbox420=document.getElementById('Hlam420Button');
	if (chbox420.checked) {
		var hlam420 = [
			["Пластиковая ложка", -50261, -14642],
			["Пластиковая ложка", -50274, -14650],
			["Пластиковая ложка", -50263, -14656],
			["Пластиковая ложка", -50267, -14639],
			["Пластиковая ложка", -56330, -11107],
			["Пластиковая ложка", -56750, -11033],
			["Пластиковая ложка", -56595, -11175],
			["Пластиковая ложка", -56602, -11168],
			["Пластиковая ложка", -56597, -11152],
			["Пластиковая ложка", -52804, -12182],
			["Пластиковая ложка", -52850, -12138],
			["Пластиковая ложка", -107690, -30627],
			["Пластиковая ложка", -19237, -46975],
			["Пластиковая ложка", -56148, -83294],
			["Пластиковая ложка", -13841, -125538],
			["Пластиковая ложка", -13850, -125541],
			["Пластиковая ложка", -13310, -125191],
			["Пластиковая ложка", -13334, -125203],
			["Пластиковая ложка", -148096, -57151],
			["Пластиковая ложка", -167934, -115658],
			["Пластиковая ложка", 149104, -52471],
			["Пластиковая ложка", 203032, -126435],
			["Пластиковая ложка", 94492, -11275],
			["Пластиковая ложка", 50245, -23252],
			["Пластиковая ложка", 30580, -33008],
			["Пластиковая ложка", 30579, -33067],
			["Пластиковая ложка", 79087, -75027],
			["Пластиковая ложка", 79061, -74918],
			["Пластиковая ложка", 20394, -108338],
			["Пластиковая ложка", -6226, -171368],
			["Пластиковая ложка", -80366, -180836],
			["Пластиковая ложка", -139591, -144670],
			["Пластиковая ложка", 6289, -165128],
			["Пластиковая ложка", -64009, 202993],
			["Пластиковая ложка", -63984, 202992],
			["Пластиковая ложка", -63725, 202806],
			["Пластиковая ложка", -63824, 202846],
			["Пластиковая ложка", -64098, 202715],
			["Пластиковая ложка", -64089, 202591],
			["Пластиковая ложка", 193946, 167550],
			["Пластиковая ложка", 101508, 193097],
			["Пластиковая ложка", 91731, 188861],
			["Пластиковая ложка", 60335, 173244],
			["Пластиковая ложка", -47398, 2836],
			["Пластиковая ложка", -41709, 3169],
			["Пластиковая ложка", -46929, 18614],
			["Пластиковая ложка", -46958, 18815],
			["Пластиковая ложка", -46933, 18710],
			["Пластиковая ложка", 133136, 126870],
			["Пластиковая ложка", 8495, 49480],
			["Пластиковая ложка", 8782, 49527],
			["Пластиковая ложка", 8800, 49529],
			["Пластиковая ложка", 8846, 49504],
			["Пластиковая ложка", 8802, 49518]
			];
	for (var i = 0; i < hlam420.length; i++) {
				hlam_420 = new L.circleMarker([hlam420[i][1],hlam420[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam420[i][0])
					.bindTooltip(hlam420[i][0], {direction: 'top'})
					.addTo(hlam420icons);
			}
	}
	else {
		hlam420icons.clearLayers();
	}
}
var hlam421icons = L.layerGroup().addTo(map);
function Hlam421OnOff() {
	var chbox421;
	chbox421=document.getElementById('Hlam421Button');
	if (chbox421.checked) {
		var hlam421 = [
			["Пластиковая ложка", -155763, -36632]
			];
	for (var i = 0; i < hlam421.length; i++) {
				hlam_421 = new L.circleMarker([hlam421[i][1],hlam421[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam421[i][0])
					.bindTooltip(hlam421[i][0], {direction: 'top'})
					.addTo(hlam421icons);
			}
	}
	else {
		hlam421icons.clearLayers();
	}
}
var hlam422icons = L.layerGroup().addTo(map);
function Hlam422OnOff() {
	var chbox422;
	chbox422=document.getElementById('Hlam422Button');
	if (chbox422.checked) {
		var hlam422 = [
			["Пластиковая ложка", -155747, -36611],
			["Пластиковая ложка", -60079, 117255]
			];
	for (var i = 0; i < hlam422.length; i++) {
				hlam_422 = new L.circleMarker([hlam422[i][1],hlam422[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam422[i][0])
					.bindTooltip(hlam422[i][0], {direction: 'top'})
					.addTo(hlam422icons);
			}
	}
	else {
		hlam422icons.clearLayers();
	}
}
var hlam423icons = L.layerGroup().addTo(map);
function Hlam423OnOff() {
	var chbox423;
	chbox423=document.getElementById('Hlam423Button');
	if (chbox423.checked) {
		var hlam423 = [
			["Пластиковая миска", -50262, -14644],
			["Пластиковая миска", -50273, -14636],
			["Пластиковая миска", -41266, -3213],
			["Пластиковая миска", -90887, -42650],
			["Пластиковая миска", -10570, -123492],
			["Пластиковая миска", -151515, -72076],
			["Пластиковая миска", -150855, -72858],
			["Пластиковая миска", -168027, -115316],
			["Пластиковая миска", 183789, -91777],
			["Пластиковая миска", 148645, -79796],
			["Пластиковая миска", 203015, -126429],
			["Пластиковая миска", 203029, -126429],
			["Пластиковая миска", 203029, -126428],
			["Пластиковая миска", 203029, -126428],
			["Пластиковая миска", 88654, -31189],
			["Пластиковая миска", 89004, -20816],
			["Пластиковая миска", 94491, -11275],
			["Пластиковая миска", 20119, -119000],
			["Пластиковая миска", -80342, -180954],
			["Пластиковая миска", 132003, -132444],
			["Пластиковая миска", -63987, 203031],
			["Пластиковая миска", -64006, 202998],
			["Пластиковая миска", -63994, 202993],
			["Пластиковая миска", -63847, 202800],
			["Пластиковая миска", -64097, 202584],
			["Пластиковая миска", -64111, 202623],
			["Пластиковая миска", -146175, 172984],
			["Пластиковая миска", 152826, 161895],
			["Пластиковая миска", 15368, 197937],
			["Пластиковая миска", 14943, 188314],
			["Пластиковая миска", 14943, 188313],
			["Пластиковая миска", 14957, 188338],
			["Пластиковая миска", -103890, 109364],
			["Пластиковая миска", -37246, 48923],
			["Пластиковая миска", -47402, 2848],
			["Пластиковая миска", -46932, 18595],
			["Пластиковая миска", -46940, 18460],
			["Пластиковая миска", 168597, 56454],
			["Пластиковая миска", 168580, 56459],
			["Пластиковая миска", 168580, 56442],
			["Пластиковая миска", 171069, 1789],
			["Пластиковая миска", 130223, 74616],
			["Пластиковая миска", 130208, 74595],
			["Пластиковая миска", 58392, 53337],
			["Пластиковая миска", 90622, 7986]
			];
	for (var i = 0; i < hlam423.length; i++) {
				hlam_423 = new L.circleMarker([hlam423[i][1],hlam423[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam423[i][0])
					.bindTooltip(hlam423[i][0], {direction: 'top'})
					.addTo(hlam423icons);
			}
	}
	else {
		hlam423icons.clearLayers();
	}
}
var hlam424icons = L.layerGroup().addTo(map);
function Hlam424OnOff() {
	var chbox424;
	chbox424=document.getElementById('Hlam424Button');
	if (chbox424.checked) {
		var hlam424 = [
			["Пластиковая тарелка", -50254, -14646],
			["Пластиковая тарелка", -50245, -14641],
			["Пластиковая тарелка", -19359, -47155],
			["Пластиковая тарелка", -41101, -37731],
			["Пластиковая тарелка", -41103, -37700],
			["Пластиковая тарелка", -41157, -37713],
			["Пластиковая тарелка", -108321, -59335],
			["Пластиковая тарелка", -108271, -59367],
			["Пластиковая тарелка", -108190, -59298],
			["Пластиковая тарелка", -108404, -59396],
			["Пластиковая тарелка", -108658, -59474],
			["Пластиковая тарелка", -108656, -59438],
			["Пластиковая тарелка", -108741, -59501],
			["Пластиковая тарелка", -109413, -59634],
			["Пластиковая тарелка", -109364, -59617],
			["Пластиковая тарелка", -109497, -59668],
			["Пластиковая тарелка", -109272, -59619],
			["Пластиковая тарелка", -109154, -59603],
			["Пластиковая тарелка", -109166, -59561],
			["Пластиковая тарелка", -109019, -59525],
			["Пластиковая тарелка", -108983, -59565],
			["Пластиковая тарелка", -45051, -70030],
			["Пластиковая тарелка", -49032, -128343],
			["Пластиковая тарелка", -48778, -128443],
			["Пластиковая тарелка", -48798, -128370],
			["Пластиковая тарелка", -44048, -130170],
			["Пластиковая тарелка", -43984, -130141],
			["Пластиковая тарелка", -128867, -119190],
			["Пластиковая тарелка", -150828, -74885],
			["Пластиковая тарелка", 199229, -29711],
			["Пластиковая тарелка", 198658, -27797],
			["Пластиковая тарелка", 193997, -29288],
			["Пластиковая тарелка", 179373, -9569],
			["Пластиковая тарелка", 179397, -9580],
			["Пластиковая тарелка", 179399, -9579],
			["Пластиковая тарелка", 179358, -9528],
			["Пластиковая тарелка", 179445, -9512],
			["Пластиковая тарелка", 179363, -9526],
			["Пластиковая тарелка", 168265, -742],
			["Пластиковая тарелка", 168412, -783],
			["Пластиковая тарелка", 168427, -816],
			["Пластиковая тарелка", 168730, -198],
			["Пластиковая тарелка", 168774, -146],
			["Пластиковая тарелка", 138427, -53853],
			["Пластиковая тарелка", 149339, -52215],
			["Пластиковая тарелка", 142130, -123843],
			["Пластиковая тарелка", 103166, -11074],
			["Пластиковая тарелка", 94491, -11276],
			["Пластиковая тарелка", 50226, -23143],
			["Пластиковая тарелка", 98754, -124530],
			["Пластиковая тарелка", 98643, -124500],
			["Пластиковая тарелка", 17054, -106957],
			["Пластиковая тарелка", 17061, -106749],
			["Пластиковая тарелка", 17113, -106707],
			["Пластиковая тарелка", 18107, -107141],
			["Пластиковая тарелка", 18122, -107012],
			["Пластиковая тарелка", 19470, -107087],
			["Пластиковая тарелка", -133887, -153840],
			["Пластиковая тарелка", -60959, 181190],
			["Пластиковая тарелка", 193934, 167536],
			["Пластиковая тарелка", -18062, 60127],
			["Пластиковая тарелка", -18040, 60133],
			["Пластиковая тарелка", -18041, 60137],
			["Пластиковая тарелка", -18041, 60140],
			["Пластиковая тарелка", -17636, 60180],
			["Пластиковая тарелка", 193080, 113049],
			["Пластиковая тарелка", 135225, 115449],
			["Пластиковая тарелка", 135223, 115448],
			["Пластиковая тарелка", 135228, 115447],
			["Пластиковая тарелка", 135225, 115446],
			["Пластиковая тарелка", 183618, 2310],
			["Пластиковая тарелка", 183559, 2389],
			["Пластиковая тарелка", 183556, 2390],
			["Пластиковая тарелка", 183574, 2403],
			["Пластиковая тарелка", 183566, 2374],
			["Пластиковая тарелка", 183570, 2372],
			["Пластиковая тарелка", 46271, 100689],
			["Пластиковая тарелка", 46271, 100689],
			["Пластиковая тарелка", 46272, 100691],
			["Пластиковая тарелка", 46256, 100671],
			["Пластиковая тарелка", 46254, 100668],
			["Пластиковая тарелка", 46366, 100702],
			["Пластиковая тарелка", 46311, 100690],
			["Пластиковая тарелка", 46367, 100702],
			["Пластиковая тарелка", 21834, 43040],
			["Пластиковая тарелка", 29097, 53741]
			];
	for (var i = 0; i < hlam424.length; i++) {
				hlam_424 = new L.circleMarker([hlam424[i][1],hlam424[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam424[i][0])
					.bindTooltip(hlam424[i][0], {direction: 'top'})
					.addTo(hlam424icons);
			}
	}
	else {
		hlam424icons.clearLayers();
	}
}
var hlam425icons = L.layerGroup().addTo(map);
function Hlam425OnOff() {
	var chbox425;
	chbox425=document.getElementById('Hlam425Button');
	if (chbox425.checked) {
		var hlam425 = [
			["Пластиковая тарелка", -155807, -36668],
			["Пластиковая тарелка", 142190, -123945],
			["Пластиковая тарелка", 143091, -151157],
			["Пластиковая тарелка", 14929, 39540]
			];
	for (var i = 0; i < hlam425.length; i++) {
				hlam_425 = new L.circleMarker([hlam425[i][1],hlam425[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam425[i][0])
					.bindTooltip(hlam425[i][0], {direction: 'top'})
					.addTo(hlam425icons);
			}
	}
	else {
		hlam425icons.clearLayers();
	}
}
var hlam426icons = L.layerGroup().addTo(map);
function Hlam426OnOff() {
	var chbox426;
	chbox426=document.getElementById('Hlam426Button');
	if (chbox426.checked) {
		var hlam426 = [
			["Пластиковая тарелка", -155680, -36640],
			["Пластиковая тарелка", -151614, -73982],
			["Пластиковая тарелка", 169506, -123177],
			["Пластиковая тарелка", 142181, -123874],
			["Пластиковая тарелка", 56080, -129791],
			["Пластиковая тарелка", 143060, -151132],
			["Пластиковая тарелка", 15101, 39156],
			["Пластиковая тарелка", 15105, 39152],
			["Пластиковая тарелка", 15106, 39153],
			["Пластиковая тарелка", 15101, 39155],
			["Пластиковая тарелка", 15101, 39154],
			["Пластиковая тарелка", 14927, 39509]
			];
	for (var i = 0; i < hlam426.length; i++) {
				hlam_426 = new L.circleMarker([hlam426[i][1],hlam426[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam426[i][0])
					.bindTooltip(hlam426[i][0], {direction: 'top'})
					.addTo(hlam426icons);
			}
	}
	else {
		hlam426icons.clearLayers();
	}
}
var hlam427icons = L.layerGroup().addTo(map);
function Hlam427OnOff() {
	var chbox427;
	chbox427=document.getElementById('Hlam427Button');
	if (chbox427.checked) {
		var hlam427 = [
			["Пластиковая тарелка", -43039, -5563],
			["Пластиковая тарелка", -42776, -5894],
			["Пластиковая тарелка", -20948, 16635],
			["Пластиковая тарелка", -20831, 16558],
			["Пластиковая тарелка", -18828, 17574],
			["Пластиковая тарелка", -38156, 3391],
			["Пластиковая тарелка", -38275, 3410],
			["Пластиковая тарелка", -38735, 3927],
			["Пластиковая тарелка", -38829, 3620],
			["Пластиковая тарелка", -38814, 3627],
			["Пластиковая тарелка", -38439, 4182],
			["Пластиковая тарелка", 15055, 38963],
			["Пластиковая тарелка", 15026, 39264],
			["Пластиковая тарелка", 14423, 39762],
			["Пластиковая тарелка", 14321, 39790],
			["Пластиковая тарелка", 14324, 39790],
			["Пластиковая тарелка", 47513, 13862],
			["Пластиковая тарелка", 47628, 13886]
			];
	for (var i = 0; i < hlam427.length; i++) {
				hlam_427 = new L.circleMarker([hlam427[i][1],hlam427[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam427[i][0])
					.bindTooltip(hlam427[i][0], {direction: 'top'})
					.addTo(hlam427icons);
			}
	}
	else {
		hlam427icons.clearLayers();
	}
}
var hlam428icons = L.layerGroup().addTo(map);
function Hlam428OnOff() {
	var chbox428;
	chbox428=document.getElementById('Hlam428Button');
	if (chbox428.checked) {
		var hlam428 = [
			["Пластиковая тарелка", -45149, -8937],
			["Пластиковая тарелка", -42439, -6223],
			["Пластиковая тарелка", -42474, -5101],
			["Пластиковая тарелка", -42489, -5112],
			["Пластиковая тарелка", -139232, -144042],
			["Пластиковая тарелка", 133318, 126676]
			];
	for (var i = 0; i < hlam428.length; i++) {
				hlam_428 = new L.circleMarker([hlam428[i][1],hlam428[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam428[i][0])
					.bindTooltip(hlam428[i][0], {direction: 'top'})
					.addTo(hlam428icons);
			}
	}
	else {
		hlam428icons.clearLayers();
	}
}
var hlam429icons = L.layerGroup().addTo(map);
function Hlam429OnOff() {
	var chbox429;
	chbox429=document.getElementById('Hlam429Button');
	if (chbox429.checked) {
		var hlam429 = [
			["Пластиковая тыква", -50254, -14641],
			["Пластиковая тыква", -10646, -50231],
			["Пластиковая тыква", -72405, -98495],
			["Пластиковая тыква", -118187, -112150],
			["Пластиковая тыква", -147436, -56556],
			["Пластиковая тыква", -155440, -36503],
			["Пластиковая тыква", 191126, -27217],
			["Пластиковая тыква", 191286, -26257],
			["Пластиковая тыква", 190640, -25988],
			["Пластиковая тыква", 173837, -13470],
			["Пластиковая тыква", 148819, -13176],
			["Пластиковая тыква", 90008, -56578],
			["Пластиковая тыква", 29560, -58444],
			["Пластиковая тыква", -1582, -164392],
			["Пластиковая тыква", 143155, -151725],
			["Пластиковая тыква", 143231, -151684],
			["Пластиковая тыква", 143104, -151135],
			["Пластиковая тыква", 69625, -177430],
			["Пластиковая тыква", 71382, -173892],
			["Пластиковая тыква", -31460, 196384],
			["Пластиковая тыква", -97342, 179192],
			["Пластиковая тыква", -26973, 162752],
			["Пластиковая тыква", -35053, 145102],
			["Пластиковая тыква", 79901, 182297],
			["Пластиковая тыква", 111811, 139615],
			["Пластиковая тыква", -37361, 83593],
			["Пластиковая тыква", -42193, 88801],
			["Пластиковая тыква", -42853, 88704],
			["Пластиковая тыква", -41439, 88133],
			["Пластиковая тыква", -42992, 88298],
			["Пластиковая тыква", -42705, 88143],
			["Пластиковая тыква", -41963, 87891],
			["Пластиковая тыква", -33541, 92001],
			["Пластиковая тыква", -33739, 91911],
			["Пластиковая тыква", -80360, 89626],
			["Пластиковая тыква", -110769, 81615],
			["Пластиковая тыква", -127829, 86685],
			["Пластиковая тыква", 181632, 109504],
			["Пластиковая тыква", 181314, 111091],
			["Пластиковая тыква", 181964, 110885],
			["Пластиковая тыква", 182237, 111673],
			["Пластиковая тыква", 183541, 111526],
			["Пластиковая тыква", 146241, 107254],
			["Пластиковая тыква", 146242, 107249],
			["Пластиковая тыква", 133213, 126804],
			["Пластиковая тыква", 132666, 126037],
			["Пластиковая тыква", 132929, 126371],
			["Пластиковая тыква", 132887, 126843],
			["Пластиковая тыква", 189542, 84170],
			["Пластиковая тыква", 130970, 111939],
			["Пластиковая тыква", 129153, 112232],
			["Пластиковая тыква", 14757, 39371],
			["Пластиковая тыква", 27581, 47080],
			["Пластиковая тыква", 79756, 409],
			["Пластиковая тыква", 58288, 11530],
			["Пластиковая тыква", 58210, 11615]
			];
	for (var i = 0; i < hlam429.length; i++) {
				hlam_429 = new L.circleMarker([hlam429[i][1],hlam429[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam429[i][0])
					.bindTooltip(hlam429[i][0], {direction: 'top'})
					.addTo(hlam429icons);
			}
	}
	else {
		hlam429icons.clearLayers();
	}
}
var hlam430icons = L.layerGroup().addTo(map);
function Hlam430OnOff() {
	var chbox430;
	chbox430=document.getElementById('Hlam430Button');
	if (chbox430.checked) {
		var hlam430 = [
			["Пластиковый нож", -50255, -14653],
			["Пластиковый нож", -50254, -14640],
			["Пластиковый нож", -50255, -14649],
			["Пластиковый нож", -25217, -57342],
			["Пластиковый нож", -25241, -57249],
			["Пластиковый нож", -76233, -69476],
			["Пластиковый нож", -76241, -69444],
			["Пластиковый нож", 103180, -11021],
			["Пластиковый нож", 88122, -20840],
			["Пластиковый нож", 88285, -21298],
			["Пластиковый нож", 94477, -11274],
			["Пластиковый нож", 18112, -107166],
			["Пластиковый нож", -93958, -175216],
			["Пластиковый нож", -122032, -188000],
			["Пластиковый нож", 26045, 172333],
			["Пластиковый нож", 172619, 59025]
			];
	for (var i = 0; i < hlam430.length; i++) {
				hlam_430 = new L.circleMarker([hlam430[i][1],hlam430[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam430[i][0])
					.bindTooltip(hlam430[i][0], {direction: 'top'})
					.addTo(hlam430icons);
			}
	}
	else {
		hlam430icons.clearLayers();
	}
}
var hlam431icons = L.layerGroup().addTo(map);
function Hlam431OnOff() {
	var chbox431;
	chbox431=document.getElementById('Hlam431Button');
	if (chbox431.checked) {
		var hlam431 = [
			["Пластиковый нож", -155786, -36602],
			["Пластиковый нож", -76794, -176231],
			["Пластиковый нож", 74503, -177417]
			];
	for (var i = 0; i < hlam431.length; i++) {
				hlam_431 = new L.circleMarker([hlam431[i][1],hlam431[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam431[i][0])
					.bindTooltip(hlam431[i][0], {direction: 'top'})
					.addTo(hlam431icons);
			}
	}
	else {
		hlam431icons.clearLayers();
	}
}
var hlam432icons = L.layerGroup().addTo(map);
function Hlam432OnOff() {
	var chbox432;
	chbox432=document.getElementById('Hlam432Button');
	if (chbox432.checked) {
		var hlam432 = [
			["Пластиковый нож", -155684, -36627],
			["Пластиковый нож", 82117, -21638]
			];
	for (var i = 0; i < hlam432.length; i++) {
				hlam_432 = new L.circleMarker([hlam432[i][1],hlam432[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam432[i][0])
					.bindTooltip(hlam432[i][0], {direction: 'top'})
					.addTo(hlam432icons);
			}
	}
	else {
		hlam432icons.clearLayers();
	}
}
var hlam433icons = L.layerGroup().addTo(map);
function Hlam433OnOff() {
	var chbox433;
	chbox433=document.getElementById('Hlam433Button');
	if (chbox433.checked) {
		var hlam433 = [
			["Плитка", -9637, -27189],
			["Плитка", -52767, -13345],
			["Плитка", -67545, -1448],
			["Плитка", -24899, -59817],
			["Плитка", -17365, -46338],
			["Плитка", -40285, -58707],
			["Плитка", -47462, -51027],
			["Плитка", -112443, -58601],
			["Плитка", -111020, -58805],
			["Плитка", -119929, -45568],
			["Плитка", -31267, -87870],
			["Плитка", -59102, -91707],
			["Плитка", -58207, -85981],
			["Плитка", -41524, -80474],
			["Плитка", -126313, -74110],
			["Плитка", -122021, -66365],
			["Плитка", -48592, -127454],
			["Плитка", -56494, -108376],
			["Плитка", -43997, -107546],
			["Плитка", -61316, -100003],
			["Плитка", -48628, -99581],
			["Плитка", -48668, -100257],
			["Плитка", -81813, -126444],
			["Плитка", -85552, -106673],
			["Плитка", -68136, -106775],
			["Плитка", -80970, -102532],
			["Плитка", -122846, -123341],
			["Плитка", -105352, -119268],
			["Плитка", -147779, -56223],
			["Плитка", -152016, -74658],
			["Плитка", -150806, -74961],
			["Плитка", -146910, -70839],
			["Плитка", -168947, -116039],
			["Плитка", -168291, -115732],
			["Плитка", -167989, -115692],
			["Плитка", -167862, -114965],
			["Плитка", 167722, -23943],
			["Плитка", 172230, -11622],
			["Плитка", 140213, -3077],
			["Плитка", 190718, -35083],
			["Плитка", 160816, -91652],
			["Плитка", 181255, -122949],
			["Плитка", 103828, -21476],
			["Плитка", 99799, -16490],
			["Плитка", 77765, -15054],
			["Плитка", 95295, -8206],
			["Плитка", 73981, -6730],
			["Плитка", 48625, -21968],
			["Плитка", 29282, -21601],
			["Плитка", 31719, -21205],
			["Плитка", 31011, -19790],
			["Плитка", 50243, -44079],
			["Плитка", 34018, -36306],
			["Плитка", 47928, -103795],
			["Плитка", 19990, -119107],
			["Плитка", 12452, -111995],
			["Плитка", -61418, -145774],
			["Плитка", -39022, -132681],
			["Плитка", -123634, -132277],
			["Плитка", -120365, -189665],
			["Плитка", -119650, -188990],
			["Плитка", -121030, -189252],
			["Плитка", -152574, -160323],
			["Плитка", -133847, -153815],
			["Плитка", 102505, -151837],
			["Плитка", 74202, -177221],
			["Плитка", -23364, 189532],
			["Плитка", -60327, 181098],
			["Плитка", -38971, 190072],
			["Плитка", -97512, 179383],
			["Плитка", -92874, 183348],
			["Плитка", -94198, 190828],
			["Плитка", -98833, 183535],
			["Плитка", -39315, 160031],
			["Плитка", -145666, 172599],
			["Плитка", -143587, 178404],
			["Плитка", -138667, 152457],
			["Плитка", -138637, 152456],
			["Плитка", 170413, 240501],
			["Плитка", 162421, 206637],
			["Плитка", 152178, 161199],
			["Плитка", 99289, 202098],
			["Плитка", 70273, 202346],
			["Плитка", 15632, 198402],
			["Плитка", 91704, 188860],
			["Плитка", 91819, 188957],
			["Плитка", 91363, 188784],
			["Плитка", 91586, 188753],
			["Плитка", 61219, 172372],
			["Плитка", 60267, 173256],
			["Плитка", 13302, 174357],
			["Плитка", 26684, 172143],
			["Плитка", 26691, 172124],
			["Плитка", 3415, 182806],
			["Плитка", 2676, 182388],
			["Плитка", 78447, 152588],
			["Плитка", 27414, 131665],
			["Плитка", 2418, 137990],
			["Плитка", 8282, 161546],
			["Плитка", -114001, 112746],
			["Плитка", -129250, 119596],
			["Плитка", -128720, 120285],
			["Плитка", -56609, 88506],
			["Плитка", -41087, 87949],
			["Плитка", -41135, 90642],
			["Плитка", -33594, 91973],
			["Плитка", -18118, 60339],
			["Плитка", -68719, 55652],
			["Плитка", -42152, 2867],
			["Плитка", -38584, 3397],
			["Плитка", -118687, 1163],
			["Плитка", -130575, 10553],
			["Плитка", 182395, 112724],
			["Плитка", 200205, 46457],
			["Плитка", 169091, 56239],
			["Плитка", 171727, 59159],
			["Плитка", 172129, 58078],
			["Плитка", 172737, 58283],
			["Плитка", 93784, 106177],
			["Плитка", 26090, 129132],
			["Плитка", 26980, 127432],
			["Плитка", 112397, 79059],
			["Плитка", 24293, 69299],
			["Плитка", 107062, 51381],
			["Плитка", 111795, 55809],
			["Плитка", 23673, 44222],
			["Плитка", 16840, 45573],
			["Плитка", 24826, 54763],
			["Плитка", 29073, 53769],
			["Плитка", 104235, 6907],
			["Плитка", 66917, 19338],
			["Плитка", 25405, -109268]
			];
	for (var i = 0; i < hlam433.length; i++) {
				hlam_433 = new L.circleMarker([hlam433[i][1],hlam433[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam433[i][0])
					.bindTooltip(hlam433[i][0], {direction: 'top'})
					.addTo(hlam433icons);
			}
	}
	else {
		hlam433icons.clearLayers();
	}
}
var hlam434icons = L.layerGroup().addTo(map);
function Hlam434OnOff() {
	var chbox434;
	chbox434=document.getElementById('Hlam434Button');
	if (chbox434.checked) {
		var hlam434 = [
			["Плюшевый гризли", -108487, -22291],
			["Плюшевый гризли", -119948, -14239],
			["Плюшевый гризли", -6109, -64077],
			["Плюшевый гризли", -28926, -49051],
			["Плюшевый гризли", -90826, -107785],
			["Плюшевый гризли", -127435, -111496],
			["Плюшевый гризли", 193624, -34598],
			["Плюшевый гризли", 101657, -11692],
			["Плюшевый гризли", 90270, -9490],
			["Плюшевый гризли", 62463, -95442],
			["Плюшевый гризли", 22208, -105436],
			["Плюшевый гризли", -116817, -136554],
			["Плюшевый гризли", -71833, -164081],
			["Плюшевый гризли", 141540, -148929],
			["Плюшевый гризли", -137726, 204257],
			["Плюшевый гризли", 87733, 157138],
			["Плюшевый гризли", 3747, 156251],
			["Плюшевый гризли", 3745, 160683],
			["Плюшевый гризли", 180528, 111203],
			["Плюшевый гризли", 144990, 87364],
			["Плюшевый гризли", 202571, 54653],
			["Плюшевый гризли", 162649, 55656],
			["Плюшевый гризли", 73580, 101325],
			["Плюшевый гризли", 97069, 105058],
			["Плюшевый гризли", 119646, 80943],
			["Плюшевый гризли", 30240, 65837],
			["Плюшевый гризли", -63526, 3241],
			["Плюшевый гризли", -44674, -54694],
			["Плюшевый гризли", 85369, -2755],
			["Плюшевый гризли", -146223, 66234],
			["Плюшевый гризли", 167384, -25971],
			["Плюшевый гризли", 167384, -25971],
			["Плюшевый гризли", 91040, -23703],
			["Плюшевый гризли", -89620, 82717],
			["Плюшевый гризли", -37861, -15904]
			];
	for (var i = 0; i < hlam434.length; i++) {
				hlam_434 = new L.circleMarker([hlam434[i][1],hlam434[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam434[i][0])
					.bindTooltip(hlam434[i][0], {direction: 'top'})
					.addTo(hlam434icons);
			}
	}
	else {
		hlam434icons.clearLayers();
	}
}
var hlam435icons = L.layerGroup().addTo(map);
function Hlam435OnOff() {
	var chbox435;
	chbox435=document.getElementById('Hlam435Button');
	if (chbox435.checked) {
		var hlam435 = [
			["Плюшевый мишка", -119983, -14114],
			["Плюшевый мишка", -119976, -14270],
			["Плюшевый мишка", -120013, -14240],
			["Плюшевый мишка", -6082, -64082],
			["Плюшевый мишка", -61709, -57458],
			["Плюшевый мишка", -29873, -93045],
			["Плюшевый мишка", -8198, -121370],
			["Плюшевый мишка", -4855, -115570],
			["Плюшевый мишка", -62557, -128973],
			["Плюшевый мишка", -63651, -103048],
			["Плюшевый мишка", -68845, -103675],
			["Плюшевый мишка", -68814, -103730],
			["Плюшевый мишка", -68792, -103697],
			["Плюшевый мишка", -127251, -111959],
			["Плюшевый мишка", -126398, -110865],
			["Плюшевый мишка", -156423, -14538],
			["Плюшевый мишка", -147671, -58836],
			["Плюшевый мишка", -148310, -54659],
			["Плюшевый мишка", 194356, -22733],
			["Плюшевый мишка", 154492, -32244],
			["Плюшевый мишка", 183598, -93011],
			["Плюшевый мишка", 149820, -67632],
			["Плюшевый мишка", 8124, -32309],
			["Плюшевый мишка", 8128, -32326],
			["Плюшевый мишка", 27706, -31351],
			["Плюшевый мишка", 91888, -58981],
			["Плюшевый мишка", 88332, -55513],
			["Плюшевый мишка", 31264, -33704],
			["Плюшевый мишка", 59591, -84111],
			["Плюшевый мишка", 59617, -84167],
			["Плюшевый мишка", 59564, -84153],
			["Плюшевый мишка", 9244, -79770],
			["Плюшевый мишка", 18956, -106849],
			["Плюшевый мишка", 26946, -102225],
			["Плюшевый мишка", -2331, -159607],
			["Плюшевый мишка", -59134, -149660],
			["Плюшевый мишка", -39035, -132710],
			["Плюшевый мишка", -8080, -165019],
			["Плюшевый мишка", -40881, -181157],
			["Плюшевый мишка", -40861, -181150],
			["Плюшевый мишка", -51069, -177647],
			["Плюшевый мишка", -51095, -177639],
			["Плюшевый мишка", -38395, -174204],
			["Плюшевый мишка", -116815, -189567],
			["Плюшевый мишка", 146189, -149432],
			["Плюшевый мишка", 157935, -132687],
			["Плюшевый мишка", 157923, -132705],
			["Плюшевый мишка", 187180, -166665],
			["Плюшевый мишка", 47221, -153273],
			["Плюшевый мишка", 60539, -145111],
			["Плюшевый мишка", 60497, -145221],
			["Плюшевый мишка", 60531, -145271],
			["Плюшевый мишка", -376, 173631],
			["Плюшевый мишка", -396, 173625],
			["Плюшевый мишка", -23382, 188900],
			["Плюшевый мишка", -114716, 180988],
			["Плюшевый мишка", -5955, 162790],
			["Плюшевый мишка", -177887, 165343],
			["Плюшевый мишка", -144741, 148934],
			["Плюшевый мишка", 179050, 133065],
			["Плюшевый мишка", 84869, 151122],
			["Плюшевый мишка", 85766, 152064],
			["Плюшевый мишка", 87770, 157071],
			["Плюшевый мишка", -40965, 87660],
			["Плюшевый мишка", -39737, 46932],
			["Плюшевый мишка", -74198, 49004],
			["Плюшевый мишка", -64865, 5553],
			["Плюшевый мишка", -47517, 18730],
			["Плюшевый мишка", -148611, 112105],
			["Плюшевый мишка", 151722, 54469],
			["Плюшевый мишка", 20953, 125570],
			["Плюшевый мишка", 20975, 125593],
			["Плюшевый мишка", 20937, 125595],
			["Плюшевый мишка", 20960, 125587],
			["Плюшевый мишка", 80605, 57351],
			["Плюшевый мишка", 34535, 40453],
			["Плюшевый мишка", 22835, 43491],
			["Плюшевый мишка", 23586, 48892],
			["Плюшевый мишка", 122103, 6115],
			["Плюшевый мишка", 124882, 9209],
			["Плюшевый мишка", 124867, 9195],
			["Плюшевый мишка", 75609, 9275],
			["Плюшевый мишка", 58744, 10820],
			["Плюшевый мишка", 8177, -32303],
			["Плюшевый мишка", 20478, -108373],
			["Плюшевый мишка", 20448, -108340],
			["Плюшевый мишка", -5831, -160927],
			["Плюшевый мишка", 187991, 60856],
			["Плюшевый мишка", 122038, 5183],
			["Плюшевый мишка", 20525, 125529],
			["Плюшевый мишка", 51097, -43908],
			["Плюшевый мишка", 51097, -43908],
			["Плюшевый мишка", -74337, 5117],
			["Плюшевый мишка", -38932, -132648],
			["Плюшевый мишка", -38963, -132678],
			["Плюшевый мишка", -59017, -91780],
			["Плюшевый мишка", -44701, -54657],
			["Плюшевый мишка", 183596, -93187],
			["Плюшевый мишка", 153004, -104532],
			["Плюшевый мишка", 26349, 24460],
			["Плюшевый мишка", -104297, 21646],
			["Плюшевый мишка", 188928, 229850],
			["Плюшевый мишка", -71722, -177085],
			["Плюшевый мишка", -71722, -177085],
			["Плюшевый мишка", -148127, -58317],
			["Плюшевый мишка", -9573, 193061]
			];
	for (var i = 0; i < hlam435.length; i++) {
				hlam_435 = new L.circleMarker([hlam435[i][1],hlam435[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam435[i][0])
					.bindTooltip(hlam435[i][0], {direction: 'top'})
					.addTo(hlam435icons);
			}
	}
	else {
		hlam435icons.clearLayers();
	}
}
var hlam436icons = L.layerGroup().addTo(map);
function Hlam436OnOff() {
	var chbox436;
	chbox436=document.getElementById('Hlam436Button');
	if (chbox436.checked) {
		var hlam436 = [
			["Погремушка", -51960, -12894],
			["Погремушка", -54803, -11921],
			["Погремушка", -54978, -9854],
			["Погремушка", -51331, -12153],
			["Погремушка", -44232, -7673],
			["Погремушка", -42729, -4282],
			["Погремушка", -52627, -1185],
			["Погремушка", -55422, -59565],
			["Погремушка", -49701, -55631],
			["Погремушка", -109355, -59573],
			["Погремушка", -58980, -66545],
			["Погремушка", -62443, -129033],
			["Погремушка", -144132, -13412],
			["Погремушка", 192132, -30568],
			["Погремушка", 167416, -22167],
			["Погремушка", 185079, -66866],
			["Погремушка", 101795, -29413],
			["Погремушка", 108220, -54387],
			["Погремушка", 5886, -59033],
			["Погремушка", 17264, -44502],
			["Погремушка", 79069, -74931],
			["Погремушка", 13853, -82737],
			["Погремушка", 12544, -83478],
			["Погремушка", 14483, -75542],
			["Погремушка", 93378, -111717],
			["Погремушка", 22193, -105385],
			["Погремушка", -2340, -159704],
			["Погремушка", -22973, -173194],
			["Погремушка", 193199, -145280],
			["Погремушка", -27195, 162735],
			["Погремушка", -142928, 138308],
			["Погремушка", -143333, 157345],
			["Погремушка", 150212, 135292],
			["Погремушка", 151170, 136042],
			["Погремушка", 2335, 161470],
			["Погремушка", -127921, 86113],
			["Погремушка", -92527, 65014],
			["Погремушка", -44457, 8483],
			["Погремушка", -47146, 20552],
			["Погремушка", -154814, 51718],
			["Погремушка", -132172, 10981],
			["Погремушка", 196451, 62211],
			["Погремушка", 30315, 65837],
			["Погремушка", 57072, 54427],
			["Погремушка", 16598, 45433],
			["Погремушка", 93490, 9981],
			["Погремушка", 51604, -69415],
			["Погремушка", -129926, -156088],
			["Погремушка", -2256, -159649]
			];
	for (var i = 0; i < hlam436.length; i++) {
				hlam_436 = new L.circleMarker([hlam436[i][1],hlam436[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam436[i][0])
					.bindTooltip(hlam436[i][0], {direction: 'top'})
					.addTo(hlam436icons);
			}
	}
	else {
		hlam436icons.clearLayers();
	}
}
var hlam437icons = L.layerGroup().addTo(map);
function Hlam437OnOff() {
	var chbox437;
	chbox437=document.getElementById('Hlam437Button');
	if (chbox437.checked) {
		var hlam437 = [
			["Поднос", -20554, -44237],
			["Поднос", -56385, -60359],
			["Поднос", -48539, -128027],
			["Поднос", -70167, -104666],
			["Поднос", -70181, -104631],
			["Поднос", -69927, -104724],
			["Поднос", -69753, -104053],
			["Поднос", -69877, -104210],
			["Поднос", -69756, -104198],
			["Поднос", -148114, -57179],
			["Поднос", -167949, -115692],
			["Поднос", -167968, -115665],
			["Поднос", -167969, -115666],
			["Поднос", 167524, -24005],
			["Поднос", 173214, -11055],
			["Поднос", 104563, -21229],
			["Поднос", 104279, -21443],
			["Поднос", 103592, -21226],
			["Поднос", 32139, -21458],
			["Поднос", 18901, -123217],
			["Поднос", 18854, -123269],
			["Поднос", 16780, -107224],
			["Поднос", 16975, -106710],
			["Поднос", -133936, -153897],
			["Поднос", 115218, -157612],
			["Поднос", -10016, 192739],
			["Поднос", -10300, 192616],
			["Поднос", -9612, 193179],
			["Поднос", -10300, 193317],
			["Поднос", -17432, 162852],
			["Поднос", 151406, 135933],
			["Поднос", 151057, 135468],
			["Поднос", 150962, 135870],
			["Поднос", 150997, 135934],
			["Поднос", 152046, 138173],
			["Поднос", 152046, 138173],
			["Поднос", 151839, 137508],
			["Поднос", 152927, 161474],
			["Поднос", 152806, 161403],
			["Поднос", 91582, 188696],
			["Поднос", 91794, 188736],
			["Поднос", 91714, 188883],
			["Поднос", 91714, 188885],
			["Поднос", 91714, 188886],
			["Поднос", 91729, 188839],
			["Поднос", 91145, 188918],
			["Поднос", 91145, 188921],
			["Поднос", 91146, 188922],
			["Поднос", 91181, 188960],
			["Поднос", 60344, 173231],
			["Поднос", 168337, 56226],
			["Поднос", 168468, 56426],
			["Поднос", 168506, 56426],
			["Поднос", 169421, 56529],
			["Поднос", 169322, 56542],
			["Поднос", 170496, 56500],
			["Поднос", 170165, 56705],
			["Поднос", 170247, 56725],
			["Поднос", 170344, 59397],
			["Поднос", 172007, 59250],
			["Поднос", 100240, 91145],
			["Поднос", 20194, 89850],
			["Поднос", 60307, 57541],
			["Поднос", 60316, 57548],
			["Поднос", 27563, 50343],
			["Поднос", 27638, 50346],
			["Поднос", 27706, 50337],
			["Поднос", 66583, 19822],
			["Поднос", 71109, 20438],
			["Поднос", 71650, 21130],
			["Поднос", 71371, 20913],
			["Поднос", 71363, 21018],
			["Поднос", 71154, 20598],
			["Поднос", 77938, 20860]
			];
	for (var i = 0; i < hlam437.length; i++) {
				hlam_437 = new L.circleMarker([hlam437[i][1],hlam437[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam437[i][0])
					.bindTooltip(hlam437[i][0], {direction: 'top'})
					.addTo(hlam437icons);
			}
	}
	else {
		hlam437icons.clearLayers();
	}
}
var hlam438icons = L.layerGroup().addTo(map);
function Hlam438OnOff() {
	var chbox438;
	chbox438=document.getElementById('Hlam438Button');
	if (chbox438.checked) {
		var hlam438 = [
			["Поднос", -52963, -11245],
			["Поднос", -52957, -11257],
			["Поднос", -109381, -21192],
			["Поднос", -108929, -59894],
			["Поднос", -109448, -59677],
			["Поднос", -109110, -59589],
			["Поднос", -108894, -59495],
			["Поднос", -108899, -59538],
			["Поднос", -108712, -59456],
			["Поднос", -108401, -59361],
			["Поднос", -107865, -58954],
			["Поднос", -107832, -59057],
			["Поднос", -13649, -66424],
			["Поднос", -41958, -86282],
			["Поднос", -85566, -106797],
			["Поднос", -111026, -112643],
			["Поднос", -150812, -74908],
			["Поднос", -151021, -74872],
			["Поднос", 193339, -26642],
			["Поднос", 194135, -26958],
			["Поднос", 194301, -26628],
			["Поднос", 194368, -26682],
			["Поднос", 194014, -26424],
			["Поднос", 193941, -26282],
			["Поднос", 192911, -28464],
			["Поднос", 179491, -11133],
			["Поднос", 183567, -67706],
			["Поднос", 183195, -67860],
			["Поднос", 183298, -67163],
			["Поднос", 160794, -92040],
			["Поднос", 160409, -92007],
			["Поднос", 127984, -32143],
			["Поднос", 93306, -4351],
			["Поднос", 37894, -35155],
			["Поднос", 13696, -107268],
			["Поднос", 29049, -101044],
			["Поднос", -80309, -180890],
			["Поднос", -79174, -181314],
			["Поднос", -79744, -182157],
			["Поднос", -120579, -188627],
			["Поднос", -136114, -183811],
			["Поднос", 190600, -169472],
			["Поднос", 79344, -154086],
			["Поднос", 23690, -148754],
			["Поднос", 74187, -177287],
			["Поднос", 71781, -175151],
			["Поднос", 71777, -175150],
			["Поднос", 71778, -175147],
			["Поднос", -83247, 165952],
			["Поднос", -83769, 165589],
			["Поднос", -39105, 158732],
			["Поднос", -39449, 160090],
			["Поднос", -39468, 160108],
			["Поднос", 149553, 136939],
			["Поднос", 149979, 137025],
			["Поднос", 149743, 137480],
			["Поднос", 152799, 161792],
			["Поднос", 152804, 161792],
			["Поднос", 152804, 161792],
			["Поднос", 152818, 161842],
			["Поднос", 103110, 190913],
			["Поднос", 99528, 151526],
			["Поднос", -65184, 74458],
			["Поднос", -104562, 38412],
			["Поднос", -104548, 38377],
			["Поднос", -104550, 38377],
			["Поднос", -41765, 3188],
			["Поднос", -92224, 26792],
			["Поднос", -148806, 39792],
			["Поднос", 182963, 112432],
			["Поднос", 170445, 57116],
			["Поднос", 170338, 57089],
			["Поднос", 170376, 56474],
			["Поднос", 170029, 57005],
			["Поднос", 170126, 56738],
			["Поднос", 138975, 1217],
			["Поднос", 138776, 804],
			["Поднос", 88265, 105650],
			["Поднос", 95345, 103833],
			["Поднос", 95349, 103837],
			["Поднос", 34473, 128449],
			["Поднос", 18825, 122911],
			["Поднос", 18597, 123085],
			["Поднос", 27218, 127612],
			["Поднос", 27004, 127397],
			["Поднос", 27524, 127639],
			["Поднос", 28553, 129155],
			["Поднос", 27143, 127643],
			["Поднос", 20592, 91009],
			["Поднос", 58747, 53859],
			["Поднос", 58421, 53399],
			["Поднос", 27870, 47422]
			];
	for (var i = 0; i < hlam438.length; i++) {
				hlam_438 = new L.circleMarker([hlam438[i][1],hlam438[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam438[i][0])
					.bindTooltip(hlam438[i][0], {direction: 'top'})
					.addTo(hlam438icons);
			}
	}
	else {
		hlam438icons.clearLayers();
	}
}
var hlam439icons = L.layerGroup().addTo(map);
function Hlam439OnOff() {
	var chbox439;
	chbox439=document.getElementById('Hlam439Button');
	if (chbox439.checked) {
		var hlam439 = [
			["Поднос для инструментов", -8556, -3154],
			["Поднос для инструментов", -52200, -13352],
			["Поднос для инструментов", -39946, -53576],
			["Поднос для инструментов", -12886, -69680],
			["Поднос для инструментов", -35256, -80381],
			["Поднос для инструментов", -35195, -80579],
			["Поднос для инструментов", -36219, -80761],
			["Поднос для инструментов", -35601, -80361],
			["Поднос для инструментов", -35828, -80707],
			["Поднос для инструментов", -51078, -111438],
			["Поднос для инструментов", -51046, -111352],
			["Поднос для инструментов", -51473, -111287],
			["Поднос для инструментов", -51542, -111384],
			["Поднос для инструментов", -61178, -100901],
			["Поднос для инструментов", -60748, -100746],
			["Поднос для инструментов", -49267, -100064],
			["Поднос для инструментов", -49062, -100189],
			["Поднос для инструментов", -93893, -129807],
			["Поднос для инструментов", -68867, -105447],
			["Поднос для инструментов", -166563, -14096],
			["Поднос для инструментов", -152230, -73312],
			["Поднос для инструментов", 151126, -52362],
			["Поднос для инструментов", 184307, -91787],
			["Поднос для инструментов", 184345, -91717],
			["Поднос для инструментов", 101460, -12291],
			["Поднос для инструментов", 101946, -12463],
			["Поднос для инструментов", 102139, -12377],
			["Поднос для инструментов", 104204, -12799],
			["Поднос для инструментов", 101213, -12155],
			["Поднос для инструментов", 101663, -12199],
			["Поднос для инструментов", 86848, -14378],
			["Поднос для инструментов", 97099, -13780],
			["Поднос для инструментов", 48873, -21568],
			["Поднос для инструментов", 48779, -21501],
			["Поднос для инструментов", 21585, -109623],
			["Поднос для инструментов", 20505, -109214],
			["Поднос для инструментов", 5537, -102939],
			["Поднос для инструментов", 5585, -102770],
			["Поднос для инструментов", 5561, -102805],
			["Поднос для инструментов", -72523, -132654],
			["Поднос для инструментов", -123473, -131278],
			["Поднос для инструментов", -43397, -174114],
			["Поднос для инструментов", -120370, -185663],
			["Поднос для инструментов", 144466, -145535],
			["Поднос для инструментов", 102648, -151410],
			["Поднос для инструментов", 74946, -176962],
			["Поднос для инструментов", 74151, -176942],
			["Поднос для инструментов", 74330, -177786],
			["Поднос для инструментов", 74138, -172450],
			["Поднос для инструментов", 74334, -172451],
			["Поднос для инструментов", 74829, -172979],
			["Поднос для инструментов", 74836, -172944],
			["Поднос для инструментов", -93711, 180036],
			["Поднос для инструментов", -95577, 184429],
			["Поднос для инструментов", -20944, 150671],
			["Поднос для инструментов", -38183, 159654],
			["Поднос для инструментов", -90453, 149296],
			["Поднос для инструментов", -90400, 149106],
			["Поднос для инструментов", -90290, 149111],
			["Поднос для инструментов", -90133, 149404],
			["Поднос для инструментов", 70234, 202233],
			["Поднос для инструментов", 16186, 198094],
			["Поднос для инструментов", 16149, 197885],
			["Поднос для инструментов", 2538, 164201],
			["Поднос для инструментов", 2559, 164618],
			["Поднос для инструментов", 3303, 182818],
			["Поднос для инструментов", 126074, 160424],
			["Поднос для инструментов", -46109, 1727],
			["Поднос для инструментов", -44034, 6424],
			["Поднос для инструментов", -55327, 9752],
			["Поднос для инструментов", -55410, 9192],
			["Поднос для инструментов", 193013, 113292],
			["Поднос для инструментов", 171500, 56629],
			["Поднос для инструментов", 183525, 3067],
			["Поднос для инструментов", 190354, 30926],
			["Поднос для инструментов", 78805, 52408],
			["Поднос для инструментов", 52850, 52347],
			["Поднос для инструментов", 52931, 52258],
			["Поднос для инструментов", 54768, 52300],
			["Поднос для инструментов", 54768, 52296]
			];
	for (var i = 0; i < hlam439.length; i++) {
				hlam_439 = new L.circleMarker([hlam439[i][1],hlam439[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam439[i][0])
					.bindTooltip(hlam439[i][0], {direction: 'top'})
					.addTo(hlam439icons);
			}
	}
	else {
		hlam439icons.clearLayers();
	}
}
var hlam440icons = L.layerGroup().addTo(map);
function Hlam440OnOff() {
	var chbox440;
	chbox440=document.getElementById('Hlam440Button');
	if (chbox440.checked) {
		var hlam440 = [
			["Подставка для зонтиков", -51226, -12695],
			["Подставка для зонтиков", -51227, -12733],
			["Подставка для зонтиков", -43661, -7041],
			["Подставка для зонтиков", -52817, -1046],
			["Подставка для зонтиков", -40951, -2861],
			["Подставка для зонтиков", -55649, -61582],
			["Подставка для зонтиков", -47799, -49895],
			["Подставка для зонтиков", -46615, -104372],
			["Подставка для зонтиков", -61498, -101089],
			["Подставка для зонтиков", 48111, -21673],
			["Подставка для зонтиков", -27507, -131802],
			["Подставка для зонтиков", 73914, -177674],
			["Подставка для зонтиков", -60106, 183186],
			["Подставка для зонтиков", 79889, 182559],
			["Подставка для зонтиков", 48746, 190372],
			["Подставка для зонтиков", -104222, 123713],
			["Подставка для зонтиков", -39344, 46814],
			["Подставка для зонтиков", -78354, 18278],
			["Подставка для зонтиков", -179946, 74354],
			["Подставка для зонтиков", 111505, 55985]
			];
	for (var i = 0; i < hlam440.length; i++) {
				hlam_440 = new L.circleMarker([hlam440[i][1],hlam440[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam440[i][0])
					.bindTooltip(hlam440[i][0], {direction: 'top'})
					.addTo(hlam440icons);
			}
	}
	else {
		hlam440icons.clearLayers();
	}
}
var hlam441icons = L.layerGroup().addTo(map);
function Hlam441OnOff() {
	var chbox441;
	chbox441=document.getElementById('Hlam441Button');
	if (chbox441.checked) {
		var hlam441 = [
			["Подушка", -42055, -5284],
			["Подушка", -122108, -27494],
			["Подушка", -120502, -14223],
			["Подушка", -108300, -14037],
			["Подушка", -21455, -44749],
			["Подушка", -19715, -43077],
			["Подушка", -56324, -60818],
			["Подушка", -49704, -55631],
			["Подушка", -47341, -50571],
			["Подушка", -47645, -49608],
			["Подушка", -120271, -45828],
			["Подушка", -113904, -46873],
			["Подушка", -26937, -89341],
			["Подушка", -13985, -66825],
			["Подушка", -62847, -80292],
			["Подушка", -41694, -69350],
			["Подушка", -72447, -98224],
			["Подушка", -101637, -130196],
			["Подушка", -101627, -130283],
			["Подушка", -111628, -122240],
			["Подушка", -156556, -15133],
			["Подушка", -137740, -8499],
			["Подушка", -137781, -8047],
			["Подушка", -133413, -5968],
			["Подушка", -147788, -59263],
			["Подушка", -147837, -59302],
			["Подушка", -168999, -115826],
			["Подушка", -169850, -116666],
			["Подушка", -169893, -116761],
			["Подушка", -168317, -112753],
			["Подушка", 151073, -52231],
			["Подушка", 205042, -92272],
			["Подушка", 143582, -89051],
			["Подушка", 147531, -78495],
			["Подушка", 153083, -75332],
			["Подушка", 101998, -29209],
			["Подушка", 101529, -11631],
			["Подушка", 76353, -19050],
			["Подушка", 76357, -19068],
			["Подушка", 78930, -12790],
			["Подушка", 89496, -8675],
			["Подушка", 90318, -9546],
			["Подушка", 90305, -9505],
			["Подушка", 76207, -4952],
			["Подушка", 74733, -4599],
			["Подушка", 83582, -6210],
			["Подушка", 83558, -6392],
			["Подушка", 89031, -5863],
			["Подушка", 93291, -4532],
			["Подушка", 80076, -3796],
			["Подушка", 85673, -1424],
			["Подушка", 59983, -23194],
			["Подушка", 91623, -59040],
			["Подушка", 29604, -58617],
			["Подушка", 29549, -58632],
			["Подушка", 75275, -76786],
			["Подушка", 11171, -87575],
			["Подушка", 9034, -82867],
			["Подушка", 8655, -85398],
			["Подушка", 16861, -81614],
			["Подушка", 52009, -127685],
			["Подушка", 52117, -128015],
			["Подушка", 52102, -127932],
			["Подушка", 54030, -128913],
			["Подушка", 54037, -128916],
			["Подушка", 54334, -128808],
			["Подушка", 54428, -128766],
			["Подушка", 53035, -126022],
			["Подушка", 54777, -126106],
			["Подушка", 13410, -111287],
			["Подушка", 28629, -106076],
			["Подушка", 29029, -101148],
			["Подушка", -1747, -159461],
			["Подушка", -55140, -160429],
			["Подушка", -126631, -144630],
			["Подушка", -108739, -134660],
			["Подушка", -120362, -190063],
			["Подушка", -120405, -190039],
			["Подушка", -114047, -169204],
			["Подушка", -135235, -183069],
			["Подушка", -135020, -180974],
			["Подушка", 187297, -153303],
			["Подушка", 193231, -145719],
			["Подушка", 173579, -139944],
			["Подушка", 132164, -132626],
			["Подушка", 61991, -134058],
			["Подушка", 23233, -148959],
			["Подушка", 71892, -175112],
			["Подушка", -82718, 202026],
			["Подушка", -23189, 189506],
			["Подушка", -55749, 166152],
			["Подушка", -97356, 179268],
			["Подушка", -90983, 183757],
			["Подушка", -87584, 184231],
			["Подушка", -90946, 184464],
			["Подушка", -90942, 184423],
			["Подушка", -88194, 184366],
			["Подушка", -94010, 190483],
			["Подушка", -98616, 183474],
			["Подушка", -19909, 146156],
			["Подушка", -26941, 162429],
			["Подушка", -63948, 132028],
			["Подушка", -139449, 171801],
			["Подушка", -146079, 174501],
			["Подушка", -160802, 151748],
			["Подушка", -149889, 151662],
			["Подушка", 145360, 141390],
			["Подушка", 152677, 162047],
			["Подушка", 15391, 198169],
			["Подушка", 15136, 198088],
			["Подушка", 125007, 169182],
			["Подушка", 93830, 186999],
			["Подушка", 96083, 188892],
			["Подушка", 13399, 193312],
			["Подушка", 75509, 151039],
			["Подушка", 57221, 152404],
			["Подушка", 2648, 137499],
			["Подушка", 1524, 137604],
			["Подушка", 2424, 162067],
			["Подушка", -59277, 98761],
			["Подушка", -114011, 112494],
			["Подушка", -129139, 119748],
			["Подушка", -37849, 95734],
			["Подушка", -39900, 44826],
			["Подушка", -39800, 46732],
			["Подушка", -39567, 47071],
			["Подушка", -39772, 46959],
			["Подушка", -37039, 49183],
			["Подушка", -68782, 55911],
			["Подушка", -123604, 51050],
			["Подушка", -47170, 1234],
			["Подушка", -47207, 1684],
			["Подушка", -47218, 1586],
			["Подушка", -41719, 3276],
			["Подушка", -56238, 10551],
			["Подушка", -129704, 8043],
			["Подушка", -98687, 8085],
			["Подушка", -148332, 112067],
			["Подушка", -148508, 112323],
			["Подушка", -148608, 112085],
			["Подушка", -172645, 109577],
			["Подушка", -179511, 74529],
			["Подушка", -179683, 74125],
			["Подушка", -179599, 74537],
			["Подушка", -132440, 11089],
			["Подушка", 199192, 93831],
			["Подушка", 134103, 85865],
			["Подушка", 133893, 85880],
			["Подушка", 133715, 85884],
			["Подушка", 171034, 56877],
			["Подушка", 171111, 56601],
			["Подушка", 170773, 56796],
			["Подушка", 170850, 56520],
			["Подушка", 171393, 57220],
			["Подушка", 170747, 58356],
			["Подушка", 170811, 58758],
			["Подушка", 171257, 58439],
			["Подушка", 171024, 58809],
			["Подушка", 168532, 57557],
			["Подушка", 168500, 57546],
			["Подушка", 168211, 57798],
			["Подушка", 168196, 57766],
			["Подушка", 169667, 59758],
			["Подушка", 162604, 55696],
			["Подушка", 173733, 7803],
			["Подушка", 95039, 98761],
			["Подушка", 95128, 98780],
			["Подушка", 26219, 128980],
			["Подушка", 27409, 127269],
			["Подушка", 129829, 74348],
			["Подушка", 128698, 85359],
			["Подушка", 130352, 86575],
			["Подушка", 55467, 52010],
			["Подушка", 9663, 48128],
			["Подушка", 27919, 47335],
			["Подушка", 28005, 47278],
			["Подушка", 27703, 47546],
			["Подушка", 27702, 47539],
			["Подушка", 15428, 49924],
			["Подушка", 101152, 7060],
			["Подушка", 100622, 25890],
			["Подушка", 100591, 25988],
			["Подушка", 84536, 136],
			["Подушка", 58266, 10508],
			["Подушка", 58496, 10247],
			["Подушка", 58346, 10111],
			["Подушка", 58340, 10095],
			["Подушка", 58083, 10022],
			["Подушка", 47950, 14006],
			["Подушка", 131947, 84855],
			["Подушка", 138306, 19350],
			["Подушка", -19704, 16766],
			["Подушка", 98960, 86213],
			["Подушка", 98960, 86213]
			];
	for (var i = 0; i < hlam441.length; i++) {
				hlam_441 = new L.circleMarker([hlam441[i][1],hlam441[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam441[i][0])
					.bindTooltip(hlam441[i][0], {direction: 'top'})
					.addTo(hlam441icons);
			}
	}
	else {
		hlam441icons.clearLayers();
	}
}
var hlam442icons = L.layerGroup().addTo(map);
function Hlam442OnOff() {
	var chbox442;
	chbox442=document.getElementById('Hlam442Button');
	if (chbox442.checked) {
		var hlam442 = [
			["Подушка", -41976, -5483],
			["Подушка", -120667, -14221],
			["Подушка", -108019, -14040],
			["Подушка", -29589, -49732],
			["Подушка", -29747, -49747],
			["Подушка", -47592, -49565],
			["Подушка", -114666, -46341],
			["Подушка", -62857, -80252],
			["Подушка", -62526, -128991],
			["Подушка", -61815, -129032],
			["Подушка", -135583, -5921],
			["Подушка", -135954, -6061],
			["Подушка", -168109, -116272],
			["Подушка", -168213, -116138],
			["Подушка", -168404, -116279],
			["Подушка", -169573, -116864],
			["Подушка", -167957, -112753],
			["Подушка", 143529, -89011],
			["Подушка", 147545, -78493],
			["Подушка", 102016, -29133],
			["Подушка", 101688, -11669],
			["Подушка", 90318, -9521],
			["Подушка", 90319, -9531],
			["Подушка", 34367, -29772],
			["Подушка", 60320, -96263],
			["Подушка", 8638, -84748],
			["Подушка", 8789, -85475],
			["Подушка", 16708, -81957],
			["Подушка", 52476, -127965],
			["Подушка", 52448, -127861],
			["Подушка", 52286, -127605],
			["Подушка", 52395, -127587],
			["Подушка", 52012, -127687],
			["Подушка", 54283, -129044],
			["Подушка", 54205, -128997],
			["Подушка", 55142, -125983],
			["Подушка", 55153, -125890],
			["Подушка", 54723, -126098],
			["Подушка", 2191, -114122],
			["Подушка", 20263, -108959],
			["Подушка", -1894, -159406],
			["Подушка", -135310, -182975],
			["Подушка", 197603, -142793],
			["Подушка", 173275, -139767],
			["Подушка", 71896, -175157],
			["Подушка", -97269, 179320],
			["Подушка", -90981, 183715],
			["Подушка", -87582, 184189],
			["Подушка", -26824, 162499],
			["Подушка", -149868, 151782],
			["Подушка", 96145, 188559],
			["Подушка", 57035, 152763],
			["Подушка", 1736, 137593],
			["Подушка", 1594, 137839],
			["Подушка", -58573, 99004],
			["Подушка", -58435, 99264],
			["Подушка", -58523, 99281],
			["Подушка", -59411, 98898],
			["Подушка", -36986, 48809],
			["Подушка", -55987, 10671],
			["Подушка", -48686, 18669],
			["Подушка", -98779, 8242],
			["Подушка", -148622, 112258],
			["Подушка", -132512, 11086],
			["Подушка", 133771, 85791],
			["Подушка", 171065, 56762],
			["Подушка", 171135, 56511],
			["Подушка", 170804, 56681],
			["Подушка", 170873, 56430],
			["Подушка", 168747, 55910],
			["Подушка", 170810, 56453],
			["Подушка", 167540, 59969],
			["Подушка", 170923, 59382],
			["Подушка", 170911, 58243],
			["Подушка", 170692, 58552],
			["Подушка", 171122, 58270],
			["Подушка", 171202, 58699],
			["Подушка", 169039, 59543],
			["Подушка", 170859, 57497],
			["Подушка", 169924, 59911],
			["Подушка", 168188, 57768],
			["Подушка", 168179, 57798],
			["Подушка", 168724, 59844],
			["Подушка", 169658, 59796],
			["Подушка", 92879, 115055],
			["Подушка", 92857, 114840],
			["Подушка", 92104, 115936],
			["Подушка", 92155, 116163],
			["Подушка", 91976, 116173],
			["Подушка", 91899, 116037],
			["Подушка", 27660, 47058],
			["Подушка", 27746, 46989],
			["Подушка", 15537, 50287],
			["Подушка", 100559, 25988],
			["Подушка", 58149, 9942],
			["Подушка", 58436, 10313],
			["Подушка", 58284, 10515]
			];
	for (var i = 0; i < hlam442.length; i++) {
				hlam_442 = new L.circleMarker([hlam442[i][1],hlam442[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam442[i][0])
					.bindTooltip(hlam442[i][0], {direction: 'top'})
					.addTo(hlam442icons);
			}
	}
	else {
		hlam442icons.clearLayers();
	}
}
var hlam443icons = L.layerGroup().addTo(map);
function Hlam443OnOff() {
	var chbox443;
	chbox443=document.getElementById('Hlam443Button');
	if (chbox443.checked) {
		var hlam443 = [
			["Подушка с соломой", -121945, -27235],
			["Подушка с соломой", -120197, -14015],
			["Подушка с соломой", -84416, -45170],
			["Подушка с соломой", -114771, -47556],
			["Подушка с соломой", -114812, -47596],
			["Подушка с соломой", -114795, -47765],
			["Подушка с соломой", -114982, -47805],
			["Подушка с соломой", -114031, -46812],
			["Подушка с соломой", -114218, -46885],
			["Подушка с соломой", -40672, -70016],
			["Подушка с соломой", -41594, -69403],
			["Подушка с соломой", -63679, -103015],
			["Подушка с соломой", -63656, -103062],
			["Подушка с соломой", -168645, -116780],
			["Подушка с соломой", 180350, -11985],
			["Подушка с соломой", 180429, -11862],
			["Подушка с соломой", 131478, -31702],
			["Подушка с соломой", 149822, -29634],
			["Подушка с соломой", 160514, -29961],
			["Подушка с соломой", 160573, -30480],
			["Подушка с соломой", 141788, -57740],
			["Подушка с соломой", 146925, -56645],
			["Подушка с соломой", 141736, -49161],
			["Подушка с соломой", 147192, -51662],
			["Подушка с соломой", 157140, -47101],
			["Подушка с соломой", 150887, -44852],
			["Подушка с соломой", 148641, -70056],
			["Подушка с соломой", 100610, -29381],
			["Подушка с соломой", 101703, -29339],
			["Подушка с соломой", 90892, -30198],
			["Подушка с соломой", 48081, -22248],
			["Подушка с соломой", 34765, -6831],
			["Подушка с соломой", 31830, -21084],
			["Подушка с соломой", 101152, -100434],
			["Подушка с соломой", 101244, -99919],
			["Подушка с соломой", 101262, -99920],
			["Подушка с соломой", 101229, -99950],
			["Подушка с соломой", 101136, -100239],
			["Подушка с соломой", 101133, -100226],
			["Подушка с соломой", 37512, -119750],
			["Подушка с соломой", -73498, -174131],
			["Подушка с соломой", -135427, -155783],
			["Подушка с соломой", -135273, -155902],
			["Подушка с соломой", -133005, -158864],
			["Подушка с соломой", -133267, -159133],
			["Подушка с соломой", -131774, -158261],
			["Подушка с соломой", -131907, -158339],
			["Подушка с соломой", -132180, -157726],
			["Подушка с соломой", -136531, -151903],
			["Подушка с соломой", -138317, -152268],
			["Подушка с соломой", -133955, -153767],
			["Подушка с соломой", 197330, -142776],
			["Подушка с соломой", 107705, -153822],
			["Подушка с соломой", -31380, 196484],
			["Подушка с соломой", -94487, 190384],
			["Подушка с соломой", -94596, 190359],
			["Подушка с соломой", -94106, 190449],
			["Подушка с соломой", -93286, 190792],
			["Подушка с соломой", -93330, 190572],
			["Подушка с соломой", -98701, 183522],
			["Подушка с соломой", -2666, 158392],
			["Подушка с соломой", -27784, 162734],
			["Подушка с соломой", -27676, 162862],
			["Подушка с соломой", -27706, 162788],
			["Подушка с соломой", -27082, 162826],
			["Подушка с соломой", -27145, 162561],
			["Подушка с соломой", -27382, 162541],
			["Подушка с соломой", -63648, 131302],
			["Подушка с соломой", -39767, 159576],
			["Подушка с соломой", -39942, 159248],
			["Подушка с соломой", -39491, 162151],
			["Подушка с соломой", -40046, 162009],
			["Подушка с соломой", -39729, 162448],
			["Подушка с соломой", 64797, 174053],
			["Подушка с соломой", 64622, 174109],
			["Подушка с соломой", 116, 164117],
			["Подушка с соломой", 16678, 192451],
			["Подушка с соломой", 14218, 193642],
			["Подушка с соломой", 14401, 193850],
			["Подушка с соломой", 14829, 193382],
			["Подушка с соломой", 72282, 133135],
			["Подушка с соломой", 72550, 133308],
			["Подушка с соломой", 69790, 136209],
			["Подушка с соломой", 72504, 136008],
			["Подушка с соломой", 72324, 135855],
			["Подушка с соломой", 71931, 136290],
			["Подушка с соломой", 71862, 136286],
			["Подушка с соломой", 72297, 137305],
			["Подушка с соломой", 72986, 136882],
			["Подушка с соломой", 72477, 137083],
			["Подушка с соломой", 77639, 151106],
			["Подушка с соломой", 77423, 151219],
			["Подушка с соломой", 74552, 150806],
			["Подушка с соломой", 75420, 150837],
			["Подушка с соломой", 74582, 150718],
			["Подушка с соломой", -103948, 109183],
			["Подушка с соломой", -104546, 123722],
			["Подушка с соломой", -5459, 33814],
			["Подушка с соломой", -123709, 51171],
			["Подушка с соломой", -7067, 21127],
			["Подушка с соломой", -164797, 122230],
			["Подушка с соломой", -132190, 10881],
			["Подушка с соломой", 191054, 115803],
			["Подушка с соломой", 199176, 94024],
			["Подушка с соломой", 199386, 45333],
			["Подушка с соломой", 198809, 45146],
			["Подушка с соломой", 189143, 60620],
			["Подушка с соломой", 189228, 60940],
			["Подушка с соломой", 188818, 60651],
			["Подушка с соломой", 189675, 63338],
			["Подушка с соломой", 189769, 63520],
			["Подушка с соломой", 190338, 63701],
			["Подушка с соломой", 174373, 7329],
			["Подушка с соломой", 88515, 105711],
			["Подушка с соломой", 23870, 69254],
			["Подушка с соломой", 104800, 43938],
			["Подушка с соломой", 110498, 55458],
			["Подушка с соломой", 110502, 55642],
			["Подушка с соломой", 35777, 40306],
			["Подушка с соломой", 36055, 39141],
			["Подушка с соломой", 7413, 43488],
			["Подушка с соломой", 9848, 48342],
			["Подушка с соломой", 24439, 45928],
			["Подушка с соломой", 24504, 45958],
			["Подушка с соломой", 55085, 9173],
			["Подушка с соломой", 55147, 9237],
			["Подушка с соломой", 55337, 9143],
			["Подушка с соломой", 131704, 54816],
			["Подушка с соломой", -83504, 166097]
			];
	for (var i = 0; i < hlam443.length; i++) {
				hlam_443 = new L.circleMarker([hlam443[i][1],hlam443[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam443[i][0])
					.bindTooltip(hlam443[i][0], {direction: 'top'})
					.addTo(hlam443icons);
			}
	}
	else {
		hlam443icons.clearLayers();
	}
}
var hlam444icons = L.layerGroup().addTo(map);
function Hlam444OnOff() {
	var chbox444;
	chbox444=document.getElementById('Hlam444Button');
	if (chbox444.checked) {
		var hlam444 = [
			["Подфарник", -168093, -112479],
			["Подфарник", 88935, -31269],
			["Подфарник", 22555, -102021],
			["Подфарник", -71156, 145733],
			["Подфарник", -37700, 83639],
			["Подфарник", 170879, 1566]
			];
	for (var i = 0; i < hlam444.length; i++) {
				hlam_444 = new L.circleMarker([hlam444[i][1],hlam444[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam444[i][0])
					.bindTooltip(hlam444[i][0], {direction: 'top'})
					.addTo(hlam444icons);
			}
	}
	else {
		hlam444icons.clearLayers();
	}
}
var hlam445icons = L.layerGroup().addTo(map);
function Hlam445OnOff() {
	var chbox445;
	chbox445=document.getElementById('Hlam445Button');
	if (chbox445.checked) {
		var hlam445 = [
			["Позвоночник", -72187, -77928],
			["Позвоночник", -72241, -78024],
			["Позвоночник", -114622, -99533],
			["Позвоночник", 184667, -19294],
			["Позвоночник", 109694, -20783],
			["Позвоночник", 45755, -74705],
			["Позвоночник", 37979, -119360],
			["Позвоночник", -102688, -179749],
			["Позвоночник", 165702, -132943],
			["Позвоночник", 69084, 202617],
			["Позвоночник", 70022, 202539],
			["Позвоночник", 57288, 191235],
			["Позвоночник", 26688, 184833],
			["Позвоночник", -80844, 102892],
			["Позвоночник", -56614, 8853],
			["Позвоночник", -56636, 8616],
			["Позвоночник", -150980, 1935],
			["Позвоночник", 183663, 3354],
			["Позвоночник", 52273, 8533],
			["Позвоночник", -101626, 84876]
			];
	for (var i = 0; i < hlam445.length; i++) {
				hlam_445 = new L.circleMarker([hlam445[i][1],hlam445[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam445[i][0])
					.bindTooltip(hlam445[i][0], {direction: 'top'})
					.addTo(hlam445icons);
			}
	}
	else {
		hlam445icons.clearLayers();
	}
}
var hlam446icons = L.layerGroup().addTo(map);
function Hlam446OnOff() {
	var chbox446;
	chbox446=document.getElementById('Hlam446Button');
	if (chbox446.checked) {
		var hlam446 = [
			["Позолоченная зажигалка", -55879, -10276],
			["Позолоченная зажигалка", -86800, -13475],
			["Позолоченная зажигалка", -46432, -50728],
			["Позолоченная зажигалка", -46655, -72828],
			["Позолоченная зажигалка", -46695, -72909],
			["Позолоченная зажигалка", -121591, -112522],
			["Позолоченная зажигалка", -148303, -58297],
			["Позолоченная зажигалка", -151445, -71539],
			["Позолоченная зажигалка", 103989, -14465],
			["Позолоченная зажигалка", 76360, -6746],
			["Позолоченная зажигалка", 7439, -31730],
			["Позолоченная зажигалка", 29387, -101123],
			["Позолоченная зажигалка", -81970, -161086],
			["Позолоченная зажигалка", -74809, -176053],
			["Позолоченная зажигалка", -5845, 160697],
			["Позолоченная зажигалка", -40935, 161730],
			["Позолоченная зажигалка", -143597, 179007],
			["Позолоченная зажигалка", 95979, 187281],
			["Позолоченная зажигалка", 93523, 189222],
			["Позолоченная зажигалка", -128032, 80410],
			["Позолоченная зажигалка", -127064, 83625],
			["Позолоченная зажигалка", -128250, 83924],
			["Позолоченная зажигалка", -65909, 35888],
			["Позолоченная зажигалка", -22837, 12071],
			["Позолоченная зажигалка", -46679, 26966],
			["Позолоченная зажигалка", 133025, 126504],
			["Позолоченная зажигалка", -61793, -55671]
			];
	for (var i = 0; i < hlam446.length; i++) {
				hlam_446 = new L.circleMarker([hlam446[i][1],hlam446[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam446[i][0])
					.bindTooltip(hlam446[i][0], {direction: 'top'})
					.addTo(hlam446icons);
			}
	}
	else {
		hlam446icons.clearLayers();
	}
}
var hlam447icons = L.layerGroup().addTo(map);
function Hlam447OnOff() {
	var chbox447;
	chbox447=document.getElementById('Hlam447Button');
	if (chbox447.checked) {
		var hlam447 = [
			["Позолоченное стекло", -44071, -6718],
			["Позолоченное стекло", -121329, -132820]
			];
	for (var i = 0; i < hlam447.length; i++) {
				hlam_447 = new L.circleMarker([hlam447[i][1],hlam447[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam447[i][0])
					.bindTooltip(hlam447[i][0], {direction: 'top'})
					.addTo(hlam447icons);
			}
	}
	else {
		hlam447icons.clearLayers();
	}
}
var hlam448icons = L.layerGroup().addTo(map);
function Hlam448OnOff() {
	var chbox448;
	chbox448=document.getElementById('Hlam448Button');
	if (chbox448.checked) {
		var hlam448 = [
			["Половник", -17365, -46378],
			["Половник", -19277, -47142],
			["Половник", -19322, -43497],
			["Половник", -19365, -43504],
			["Половник", -45517, -70317],
			["Половник", -48960, -128784],
			["Половник", -70434, -104571],
			["Половник", -147575, -58451],
			["Половник", 180638, -12194],
			["Половник", 138712, -53823],
			["Половник", 149405, -51989],
			["Половник", 158979, -49439],
			["Половник", 183982, -93151],
			["Половник", 183380, -66960],
			["Половник", 103635, -21239],
			["Половник", 50242, -23418],
			["Половник", 113634, -55965],
			["Половник", 64818, -58620],
			["Половник", 34001, -33079],
			["Половник", 17074, -107025],
			["Половник", -99436, -132056],
			["Половник", -92789, -176864],
			["Половник", -120834, -189623],
			["Половник", -139215, -144007],
			["Половник", -55974, 166262],
			["Половник", -60496, 180459],
			["Половник", -60617, 181778],
			["Половник", -71150, 169885],
			["Половник", -161563, 194211],
			["Половник", 105079, 156722],
			["Половник", 71828, 137244],
			["Половник", 7144, 161463],
			["Половник", -65582, 129524],
			["Половник", -103811, 109572],
			["Половник", -103965, 109407],
			["Половник", -46982, 18600],
			["Половник", -127937, 30772],
			["Половник", -164318, 121978],
			["Половник", -138429, 89107],
			["Половник", -138971, 90675],
			["Половник", 146079, 107408],
			["Половник", 95294, 103772],
			["Половник", 130232, 74595],
			["Половник", 72466, 37795],
			["Половник", 14519, 48672],
			["Половник", 8586, 49496],
			["Половник", 29203, 53910]
			];
	for (var i = 0; i < hlam448.length; i++) {
				hlam_448 = new L.circleMarker([hlam448[i][1],hlam448[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam448[i][0])
					.bindTooltip(hlam448[i][0], {direction: 'top'})
					.addTo(hlam448icons);
			}
	}
	else {
		hlam448icons.clearLayers();
	}
}
var hlam449icons = L.layerGroup().addTo(map);
function Hlam449OnOff() {
	var chbox449;
	chbox449=document.getElementById('Hlam449Button');
	if (chbox449.checked) {
		var hlam449 = [
			["Портативный топливный бак", -8662, -2971],
			["Портативный топливный бак", -121350, -27654],
			["Портативный топливный бак", -119372, -13577],
			["Портативный топливный бак", -127047, -1327],
			["Портативный топливный бак", -127037, -1933],
			["Портативный топливный бак", -96720, -60624],
			["Портативный топливный бак", -114023, -47795],
			["Портативный топливный бак", -59493, -79241],
			["Портативный топливный бак", -58851, -79323],
			["Портативный топливный бак", -100537, -67240],
			["Портативный топливный бак", -80650, -121420],
			["Портативный топливный бак", -79906, -108054],
			["Портативный топливный бак", -79852, -108077],
			["Портативный топливный бак", -124793, -127871],
			["Портативный топливный бак", -124783, -127910],
			["Портативный топливный бак", -101235, -107299],
			["Портативный топливный бак", -101244, -106823],
			["Портативный топливный бак", -160424, -41489],
			["Портативный топливный бак", -160501, -41599],
			["Портативный топливный бак", -151385, -74735],
			["Портативный топливный бак", -151377, -74766],
			["Портативный топливный бак", -132770, -121315],
			["Портативный топливный бак", -132188, -112496],
			["Портативный топливный бак", -169552, -116632],
			["Портативный топливный бак", -169100, -116816],
			["Портативный топливный бак", 132527, -55270],
			["Портативный топливный бак", 132477, -55233],
			["Портативный топливный бак", 196896, -90902],
			["Портативный топливный бак", 173636, -75433],
			["Портативный топливный бак", 158149, -68831],
			["Портативный топливный бак", 104457, -20171],
			["Портативный топливный бак", 102577, -10585],
			["Портативный топливный бак", 9070, -31166],
			["Портативный топливный бак", 29953, -20580],
			["Портативный топливный бак", 29462, -20912],
			["Портативный топливный бак", 38622, -48565],
			["Портативный топливный бак", 38431, -48779],
			["Портативный топливный бак", 37391, -38857],
			["Портативный топливный бак", -82396, -178323],
			["Портативный топливный бак", -82878, -179584],
			["Портативный топливный бак", -80826, -179240],
			["Портативный топливный бак", 198007, -143242],
			["Портативный топливный бак", 203309, -138618],
			["Портативный топливный бак", 164780, -149182],
			["Портативный топливный бак", 189951, -164709],
			["Портативный топливный бак", 50543, -149914],
			["Портативный топливный бак", 50571, -149806],
			["Портативный топливный бак", -32524, 171288],
			["Портативный топливный бак", -4136, 184397],
			["Портативный топливный бак", -4112, 184396],
			["Портативный топливный бак", -4103, 184388],
			["Портативный топливный бак", -99219, 183413],
			["Портативный топливный бак", 3464, 182818],
			["Портативный топливный бак", 15454, 188366],
			["Портативный топливный бак", 99717, 151299],
			["Портативный топливный бак", 77173, 151371],
			["Портативный топливный бак", 74869, 150498],
			["Портативный топливный бак", 78358, 152255],
			["Портативный топливный бак", -58632, 99291],
			["Портативный топливный бак", -59613, 99740],
			["Портативный топливный бак", -58249, 99146],
			["Портативный топливный бак", -49250, 109546],
			["Портативный топливный бак", -49314, 109738],
			["Портативный топливный бак", -63356, 74400],
			["Портативный топливный бак", -63347, 74371],
			["Портативный топливный бак", -49366, 86232],
			["Портативный топливный бак", -49385, 86229],
			["Портативный топливный бак", -49399, 86270],
			["Портативный топливный бак", -49373, 86275],
			["Портативный топливный бак", -33876, 91619],
			["Портативный топливный бак", -95680, 85270],
			["Портативный топливный бак", -120891, 44720],
			["Портативный топливный бак", -46786, 2407],
			["Портативный топливный бак", -44308, 4354],
			["Портативный топливный бак", -49626, 28035],
			["Портативный топливный бак", -46373, 28228],
			["Портативный топливный бак", -127725, 30898],
			["Портативный топливный бак", 133332, 55148],
			["Портативный топливный бак", 133409, 55122],
			["Портативный топливный бак", 133372, 17061],
			["Портативный топливный бак", 134277, 19838],
			["Портативный топливный бак", 132713, 20408],
			["Портативный топливный бак", 91652, 114905],
			["Портативный топливный бак", 92044, 115968],
			["Портативный топливный бак", 92715, 115110],
			["Портативный топливный бак", 92674, 115099],
			["Портативный топливный бак", 43133, 110375],
			["Портативный топливный бак", 43155, 110357],
			["Портативный топливный бак", 42713, 109487],
			["Портативный топливный бак", 42890, 109628],
			["Портативный топливный бак", 36059, 125189],
			["Портативный топливный бак", 7134, 105085],
			["Портативный топливный бак", 7253, 105053],
			["Портативный топливный бак", 49523, 84529],
			["Портативный топливный бак", 49925, 85367],
			["Портативный топливный бак", 17241, 75956],
			["Портативный топливный бак", 19996, 90086],
			["Портативный топливный бак", 19918, 90154],
			["Портативный топливный бак", 20090, 91073],
			["Портативный топливный бак", 20241, 91106],
			["Портативный топливный бак", 20002, 90872],
			["Портативный топливный бак", 85410, 46527],
			["Портативный топливный бак", 7493, 43967],
			["Портативный топливный бак", 7505, 44466],
			["Портативный топливный бак", 6104, 42100],
			["Портативный топливный бак", 15138, 46401],
			["Портативный топливный бак", 15087, 46370],
			["Портативный топливный бак", 20169, 50887],
			["Портативный топливный бак", 51819, 1331],
			["Портативный топливный бак", 51574, 12099]
			];
	for (var i = 0; i < hlam449.length; i++) {
				hlam_449 = new L.circleMarker([hlam449[i][1],hlam449[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam449[i][0])
					.bindTooltip(hlam449[i][0], {direction: 'top'})
					.addTo(hlam449icons);
			}
	}
	else {
		hlam449icons.clearLayers();
	}
}
var hlam450icons = L.layerGroup().addTo(map);
function Hlam450OnOff() {
	var chbox450;
	chbox450=document.getElementById('Hlam450Button');
	if (chbox450.checked) {
		var hlam450 = [
			["Потрепанный планшет", -51694, -13058],
			["Потрепанный планшет", -51680, -12780],
			["Потрепанный планшет", -54528, -10316],
			["Потрепанный планшет", -52044, -11258],
			["Потрепанный планшет", -67507, -1210],
			["Потрепанный планшет", -14272, -52352],
			["Потрепанный планшет", -14978, -52412],
			["Потрепанный планшет", -15762, -47374],
			["Потрепанный планшет", -15690, -47104],
			["Потрепанный планшет", -15761, -47129],
			["Потрепанный планшет", -16259, -47085],
			["Потрепанный планшет", -15135, -46941],
			["Потрепанный планшет", -21210, -44264],
			["Потрепанный планшет", -20971, -43960],
			["Потрепанный планшет", -21547, -44406],
			["Потрепанный планшет", -18704, -43251],
			["Потрепанный планшет", -18827, -43267],
			["Потрепанный планшет", -18709, -42428],
			["Потрепанный планшет", -18144, -43262],
			["Потрепанный планшет", -15419, -42261],
			["Потрепанный планшет", -15285, -42030],
			["Потрепанный планшет", -15246, -41999],
			["Потрепанный планшет", -37831, -58550],
			["Потрепанный планшет", -117331, -62963],
			["Потрепанный планшет", -112652, -58888],
			["Потрепанный планшет", -112371, -58802],
			["Потрепанный планшет", -111015, -58907],
			["Потрепанный планшет", -110343, -58096],
			["Потрепанный планшет", -110337, -58053],
			["Потрепанный планшет", -11882, -69635],
			["Потрепанный планшет", -12375, -69460],
			["Потрепанный планшет", -12403, -69464],
			["Потрепанный планшет", -12401, -69473],
			["Потрепанный планшет", -12400, -69478],
			["Потрепанный планшет", -12365, -69094],
			["Потрепанный планшет", -12349, -69116],
			["Потрепанный планшет", -13417, -66169],
			["Потрепанный планшет", -11869, -68964],
			["Потрепанный планшет", -12164, -69162],
			["Потрепанный планшет", -12127, -69379],
			["Потрепанный планшет", -12120, -69374],
			["Потрепанный планшет", -12117, -69366],
			["Потрепанный планшет", -11779, -69085],
			["Потрепанный планшет", -11779, -69076],
			["Потрепанный планшет", -11782, -69093],
			["Потрепанный планшет", -12027, -69218],
			["Потрепанный планшет", -12023, -69244],
			["Потрепанный планшет", -12028, -69252],
			["Потрепанный планшет", -12110, -69289],
			["Потрепанный планшет", -12134, -69300],
			["Потрепанный планшет", -12143, -69297],
			["Потрепанный планшет", -11686, -69167],
			["Потрепанный планшет", -11715, -69223],
			["Потрепанный планшет", -11740, -69193],
			["Потрепанный планшет", -11746, -69184],
			["Потрепанный планшет", -11746, -69202],
			["Потрепанный планшет", -12036, -68895],
			["Потрепанный планшет", -12048, -68888],
			["Потрепанный планшет", -12026, -68888],
			["Потрепанный планшет", -12009, -68947],
			["Потрепанный планшет", -12065, -68918],
			["Потрепанный планшет", -11846, -69545],
			["Потрепанный планшет", -11906, -69563],
			["Потрепанный планшет", -11635, -68567],
			["Потрепанный планшет", -11635, -68573],
			["Потрепанный планшет", -12186, -68673],
			["Потрепанный планшет", -12156, -68694],
			["Потрепанный планшет", -44594, -86374],
			["Потрепанный планшет", -44457, -86520],
			["Потрепанный планшет", -57713, -85884],
			["Потрепанный планшет", -56445, -78373],
			["Потрепанный планшет", -56363, -78565],
			["Потрепанный планшет", -47021, -72222],
			["Потрепанный планшет", -70165, -96408],
			["Потрепанный планшет", -120206, -73739],
			["Потрепанный планшет", -125964, -73578],
			["Потрепанный планшет", -15562, -124444],
			["Потрепанный планшет", -15691, -124266],
			["Потрепанный планшет", -48917, -128202],
			["Потрепанный планшет", -48229, -128131],
			["Потрепанный планшет", -43507, -127629],
			["Потрепанный планшет", -37274, -129098],
			["Потрепанный планшет", -38638, -126379],
			["Потрепанный планшет", -51160, -111780],
			["Потрепанный планшет", -46181, -104176],
			["Потрепанный планшет", -45993, -104079],
			["Потрепанный планшет", -46452, -104721],
			["Потрепанный планшет", -49427, -99878],
			["Потрепанный планшет", -48288, -100191],
			["Потрепанный планшет", -82200, -126669],
			["Потрепанный планшет", -82340, -126243],
			["Потрепанный планшет", -72354, -98463],
			["Потрепанный планшет", -122883, -123558],
			["Потрепанный планшет", -113096, -124975],
			["Потрепанный планшет", -101312, -107039],
			["Потрепанный планшет", -149520, -58122],
			["Потрепанный планшет", -148051, -58788],
			["Потрепанный планшет", -147759, -57016],
			["Потрепанный планшет", -149443, -55861],
			["Потрепанный планшет", -147973, -56169],
			["Потрепанный планшет", -151174, -74896],
			["Потрепанный планшет", -151003, -75300],
			["Потрепанный планшет", -162028, -73491],
			["Потрепанный планшет", -161853, -73579],
			["Потрепанный планшет", -152117, -71842],
			["Потрепанный планшет", -151928, -73459],
			["Потрепанный планшет", -152016, -73458],
			["Потрепанный планшет", -151347, -72007],
			["Потрепанный планшет", -149358, -125992],
			["Потрепанный планшет", -145575, -126852],
			["Потрепанный планшет", -168077, -112799],
			["Потрепанный планшет", 167343, -25727],
			["Потрепанный планшет", 191158, -18961],
			["Потрепанный планшет", 181983, -13459],
			["Потрепанный планшет", 144793, -54794],
			["Потрепанный планшет", 148845, -52408],
			["Потрепанный планшет", 149855, -52288],
			["Потрепанный планшет", 149279, -52188],
			["Потрепанный планшет", 148985, -52424],
			["Потрепанный планшет", 151273, -51931],
			["Потрепанный планшет", 151100, -52467],
			["Потрепанный планшет", 144161, -48377],
			["Потрепанный планшет", 144686, -48063],
			["Потрепанный планшет", 183347, -65861],
			["Потрепанный планшет", 183162, -65977],
			["Потрепанный планшет", 183160, -66030],
			["Потрепанный планшет", 183157, -66025],
			["Потрепанный планшет", 147338, -78352],
			["Потрепанный планшет", 202160, -125756],
			["Потрепанный планшет", 152902, -103868],
			["Потрепанный планшет", 124277, -28889],
			["Потрепанный планшет", 129329, -31267],
			["Потрепанный планшет", 126646, -28615],
			["Потрепанный планшет", 130132, -28153],
			["Потрепанный планшет", 129925, -27612],
			["Потрепанный планшет", 100930, -15297],
			["Потрепанный планшет", 101737, -13803],
			["Потрепанный планшет", 103636, -14631],
			["Потрепанный планшет", 101200, -12212],
			["Потрепанный планшет", 88718, -31065],
			["Потрепанный планшет", 93261, -31357],
			["Потрепанный планшет", 84513, -18763],
			["Потрепанный планшет", 84697, -19225],
			["Потрепанный планшет", 77786, -12044],
			["Потрепанный планшет", 77805, -12018],
			["Потрепанный планшет", 90364, -9911],
			["Потрепанный планшет", 73288, -7145],
			["Потрепанный планшет", 81449, -1121],
			["Потрепанный планшет", 47885, -21318],
			["Потрепанный планшет", 47390, -20699],
			["Потрепанный планшет", 49157, -21302],
			["Потрепанный планшет", 34657, -6484],
			["Потрепанный планшет", 34735, -6279],
			["Потрепанный планшет", 8248, -32133],
			["Потрепанный планшет", 28255, -31720],
			["Потрепанный планшет", 28757, -31342],
			["Потрепанный планшет", 28740, -31273],
			["Потрепанный планшет", 29364, -18561],
			["Потрепанный планшет", 111674, -55225],
			["Потрепанный планшет", 90368, -33333],
			["Потрепанный планшет", 50313, -42706],
			["Потрепанный планшет", 50216, -44016],
			["Потрепанный планшет", 49868, -43836],
			["Потрепанный планшет", 51575, -42597],
			["Потрепанный планшет", 51609, -42530],
			["Потрепанный планшет", 51545, -42454],
			["Потрепанный планшет", 50814, -43144],
			["Потрепанный планшет", 51144, -43349],
			["Потрепанный планшет", 50468, -43257],
			["Потрепанный планшет", 50223, -41755],
			["Потрепанный планшет", 50206, -41737],
			["Потрепанный планшет", 50219, -41613],
			["Потрепанный планшет", 34465, -36947],
			["Потрепанный планшет", 34467, -36921],
			["Потрепанный планшет", 51417, -39890],
			["Потрепанный планшет", 51838, -40456],
			["Потрепанный планшет", 35478, -35298],
			["Потрепанный планшет", 13052, -60183],
			["Потрепанный планшет", 29263, -58623],
			["Потрепанный планшет", 16914, -44474],
			["Потрепанный планшет", 32359, -40263],
			["Потрепанный планшет", 32241, -40101],
			["Потрепанный планшет", 79457, -81838],
			["Потрепанный планшет", 12603, -91614],
			["Потрепанный планшет", 37937, -119492],
			["Потрепанный планшет", 37518, -119428],
			["Потрепанный планшет", 18145, -106821],
			["Потрепанный планшет", 17687, -106521],
			["Потрепанный планшет", 21511, -109493],
			["Потрепанный планшет", 20622, -108495],
			["Потрепанный планшет", 21246, -109422],
			["Потрепанный планшет", -6839, -161121],
			["Потрепанный планшет", -4332, -156006],
			["Потрепанный планшет", -4148, -155850],
			["Потрепанный планшет", -61568, -145829],
			["Потрепанный планшет", -61396, -145438],
			["Потрепанный планшет", -61319, -145703],
			["Потрепанный планшет", -43257, -134743],
			["Потрепанный планшет", -116779, -136560],
			["Потрепанный планшет", -123494, -132394],
			["Потрепанный планшет", -124427, -131253],
			["Потрепанный планшет", -24060, -179924],
			["Потрепанный планшет", -24144, -179789],
			["Потрепанный планшет", -42927, -173511],
			["Потрепанный планшет", -79976, -182398],
			["Потрепанный планшет", -79203, -181102],
			["Потрепанный планшет", -152930, -161013],
			["Потрепанный планшет", -152711, -161035],
			["Потрепанный планшет", -133388, -153419],
			["Потрепанный планшет", -133374, -153356],
			["Потрепанный планшет", -132174, -148796],
			["Потрепанный планшет", -145934, -143124],
			["Потрепанный планшет", -134060, -131667],
			["Потрепанный планшет", 131852, -132251],
			["Потрепанный планшет", 189259, -164726],
			["Потрепанный планшет", 108700, -161205],
			["Потрепанный планшет", 115275, -157969],
			["Потрепанный планшет", 115273, -157972],
			["Потрепанный планшет", 102365, -151799],
			["Потрепанный планшет", 102275, -151568],
			["Потрепанный планшет", 102727, -151448],
			["Потрепанный планшет", 75968, -180519],
			["Потрепанный планшет", 76673, -179390],
			["Потрепанный планшет", 74499, -177207],
			["Потрепанный планшет", 74534, -177322],
			["Потрепанный планшет", 74455, -177483],
			["Потрепанный планшет", 74271, -172821],
			["Потрепанный планшет", -71509, 198524],
			["Потрепанный планшет", -69627, 196707],
			["Потрепанный планшет", -69621, 196711],
			["Потрепанный планшет", -60749, 181069],
			["Потрепанный планшет", -91508, 177005],
			["Потрепанный планшет", -91474, 176726],
			["Потрепанный планшет", -94371, 183304],
			["Потрепанный планшет", -94459, 183333],
			["Потрепанный планшет", -94561, 182357],
			["Потрепанный планшет", -92819, 183635],
			["Потрепанный планшет", -93433, 183686],
			["Потрепанный планшет", -93695, 183635],
			["Потрепанный планшет", -92800, 180621],
			["Потрепанный планшет", -92857, 180623],
			["Потрепанный планшет", -97226, 184758],
			["Потрепанный планшет", -93175, 184323],
			["Потрепанный планшет", -94988, 190500],
			["Потрепанный планшет", -95676, 190243],
			["Потрепанный планшет", -95754, 190047],
			["Потрепанный планшет", -68232, 195566],
			["Потрепанный планшет", -105281, 195136],
			["Потрепанный планшет", -1042, 158316],
			["Потрепанный планшет", -5993, 161922],
			["Потрепанный планшет", -5734, 161848],
			["Потрепанный планшет", -5633, 162064],
			["Потрепанный планшет", -5830, 162132],
			["Потрепанный планшет", -6051, 162222],
			["Потрепанный планшет", -5728, 160591],
			["Потрепанный планшет", -3484, 162690],
			["Потрепанный планшет", -3484, 162724],
			["Потрепанный планшет", -3952, 161519],
			["Потрепанный планшет", -3981, 161653],
			["Потрепанный планшет", -43047, 157643],
			["Потрепанный планшет", -38132, 159611],
			["Потрепанный планшет", -37756, 156589],
			["Потрепанный планшет", -40398, 161397],
			["Потрепанный планшет", -38010, 159803],
			["Потрепанный планшет", -37805, 159837],
			["Потрепанный планшет", -90519, 150059],
			["Потрепанный планшет", -90524, 150026],
			["Потрепанный планшет", -89576, 148696],
			["Потрепанный планшет", -88153, 152702],
			["Потрепанный планшет", -109427, 158994],
			["Потрепанный планшет", -163720, 200688],
			["Потрепанный планшет", -163624, 200320],
			["Потрепанный планшет", -163570, 200333],
			["Потрепанный планшет", -161802, 200847],
			["Потрепанный планшет", -163244, 200827],
			["Потрепанный планшет", -163197, 200824],
			["Потрепанный планшет", -169781, 202296],
			["Потрепанный планшет", -145796, 172421],
			["Потрепанный планшет", -146300, 172604],
			["Потрепанный планшет", -145576, 177300],
			["Потрепанный планшет", -146996, 178622],
			["Потрепанный планшет", -146994, 178623],
			["Потрепанный планшет", -157303, 191390],
			["Потрепанный планшет", -157302, 191400],
			["Потрепанный планшет", -157300, 191392],
			["Потрепанный планшет", -142204, 143564],
			["Потрепанный планшет", -141787, 143538],
			["Потрепанный планшет", -139405, 148718],
			["Потрепанный планшет", 151453, 137379],
			["Потрепанный планшет", 152376, 139910],
			["Потрепанный планшет", 137634, 145457],
			["Потрепанный планшет", 68593, 201733],
			["Потрепанный планшет", 69984, 202284],
			["Потрепанный планшет", 16180, 197904],
			["Потрепанный планшет", 16403, 197739],
			["Потрепанный планшет", 103471, 190745],
			["Потрепанный планшет", 93259, 192203],
			["Потрепанный планшет", 64268, 173771],
			["Потрепанный планшет", 63511, 177160],
			["Потрепанный планшет", 1751, 164555],
			["Потрепанный планшет", 1555, 165176],
			["Потрепанный планшет", 3442, 167883],
			["Потрепанный планшет", 2840, 164318],
			["Потрепанный планшет", 3333, 182814],
			["Потрепанный планшет", 87977, 156843],
			["Потрепанный планшет", 87478, 158068],
			["Потрепанный планшет", 2995, 162479],
			["Потрепанный планшет", 2304, 162077],
			["Потрепанный планшет", 2404, 162247],
			["Потрепанный планшет", 3898, 160383],
			["Потрепанный планшет", 4229, 160684],
			["Потрепанный планшет", 6287, 161459],
			["Потрепанный планшет", 5694, 160491],
			["Потрепанный планшет", -16713, 117859],
			["Потрепанный планшет", -14954, 120218],
			["Потрепанный планшет", -13882, 119655],
			["Потрепанный планшет", -14050, 119093],
			["Потрепанный планшет", -129368, 119098],
			["Потрепанный планшет", -129145, 119230],
			["Потрепанный планшет", -32282, 92087],
			["Потрепанный планшет", -56622, 88642],
			["Потрепанный планшет", -41041, 88144],
			["Потрепанный планшет", -40676, 88165],
			["Потрепанный планшет", -43690, 90663],
			["Потрепанный планшет", -40985, 90788],
			["Потрепанный планшет", -127953, 80429],
			["Потрепанный планшет", -127717, 80878],
			["Потрепанный планшет", -17861, 59765],
			["Потрепанный планшет", -91255, 63286],
			["Потрепанный планшет", -90872, 65402],
			["Потрепанный планшет", -87871, 63822],
			["Потрепанный планшет", -121984, 40741],
			["Потрепанный планшет", -104827, 41787],
			["Потрепанный планшет", -24631, 10001],
			["Потрепанный планшет", -19029, 17211],
			["Потрепанный планшет", -19495, 16702],
			["Потрепанный планшет", -42106, 1922],
			["Потрепанный планшет", -35503, 2398],
			["Потрепанный планшет", -51014, 7075],
			["Потрепанный планшет", -53517, 11156],
			["Потрепанный планшет", -47166, 13397],
			["Потрепанный планшет", -46858, 13262],
			["Потрепанный планшет", -44216, 28133],
			["Потрепанный планшет", -68061, 2797],
			["Потрепанный планшет", -118562, 1154],
			["Потрепанный планшет", -99697, 7845],
			["Потрепанный планшет", -99045, 7277],
			["Потрепанный планшет", -130751, 10413],
			["Потрепанный планшет", -130686, 10605],
			["Потрепанный планшет", -130455, 10449],
			["Потрепанный планшет", -148353, 112300],
			["Потрепанный планшет", -160699, 78441],
			["Потрепанный планшет", -139367, 90776],
			["Потрепанный планшет", -132552, 9663],
			["Потрепанный планшет", -132019, 12404],
			["Потрепанный планшет", -131821, 12552],
			["Потрепанный планшет", -161303, 31308],
			["Потрепанный планшет", 181377, 110795],
			["Потрепанный планшет", 182954, 112248],
			["Потрепанный планшет", 183086, 112005],
			["Потрепанный планшет", 143608, 98445],
			["Потрепанный планшет", 131309, 85955],
			["Потрепанный планшет", 131352, 85917],
			["Потрепанный планшет", 131155, 86061],
			["Потрепанный планшет", 133643, 87280],
			["Потрепанный планшет", 193775, 57899],
			["Потрепанный планшет", 140470, 41137],
			["Потрепанный планшет", 171255, 1420],
			["Потрепанный планшет", 171155, 1678],
			["Потрепанный планшет", 139194, 1174],
			["Потрепанный планшет", 141551, 4203],
			["Потрепанный планшет", 139547, 8486],
			["Потрепанный планшет", 132721, 15961],
			["Потрепанный планшет", 132370, 21627],
			["Потрепанный планшет", 88052, 104824],
			["Потрепанный планшет", 24005, 122084],
			["Потрепанный планшет", 23793, 122285],
			["Потрепанный планшет", 24320, 122292],
			["Потрепанный планшет", 25246, 124416],
			["Потрепанный планшет", 99545, 92054],
			["Потрепанный планшет", 98647, 92488],
			["Потрепанный планшет", 71359, 96507],
			["Потрепанный планшет", 69268, 37624],
			["Потрепанный планшет", 70287, 37390],
			["Потрепанный планшет", 70518, 44364],
			["Потрепанный планшет", 53331, 52191],
			["Потрепанный планшет", 58262, 53097],
			["Потрепанный планшет", 13801, 39230],
			["Потрепанный планшет", 14157, 38985],
			["Потрепанный планшет", 17003, 45617],
			["Потрепанный планшет", 17030, 45628],
			["Потрепанный планшет", 16929, 45424],
			["Потрепанный планшет", 28469, 48860],
			["Потрепанный планшет", 23963, 49287],
			["Потрепанный планшет", 23946, 49266],
			["Потрепанный планшет", 28643, 52728],
			["Потрепанный планшет", 104249, 6940],
			["Потрепанный планшет", 120560, 5491],
			["Потрепанный планшет", 121710, 6547],
			["Потрепанный планшет", 130519, 17589],
			["Потрепанный планшет", 129551, 19429],
			["Потрепанный планшет", 130085, 20105],
			["Потрепанный планшет", 88781, 2855],
			["Потрепанный планшет", 57011, 4883],
			["Потрепанный планшет", 58341, 10590],
			["Потрепанный планшет", 58265, 10641],
			["Потрепанный планшет", 57504, 12535],
			["Потрепанный планшет", 57386, 12704],
			["Потрепанный планшет", 183603, -92885],
			["Потрепанный планшет", -110437, -95452],
			["Потрепанный планшет", -59254, 123218]
			];
	for (var i = 0; i < hlam450.length; i++) {
				hlam_450 = new L.circleMarker([hlam450[i][1],hlam450[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam450[i][0])
					.bindTooltip(hlam450[i][0], {direction: 'top'})
					.addTo(hlam450icons);
			}
	}
	else {
		hlam450icons.clearLayers();
	}
}
var hlam451icons = L.layerGroup().addTo(map);
function Hlam451OnOff() {
	var chbox451;
	chbox451=document.getElementById('Hlam451Button');
	if (chbox451.checked) {
		var hlam451 = [
			["Правая рука куклы", -109852, -23538],
			["Правая рука куклы", -76258, -69597],
			["Правая рука куклы", -93938, -175218],
			["Правая рука куклы", 178979, 134048]
			];
	for (var i = 0; i < hlam451.length; i++) {
				hlam_451 = new L.circleMarker([hlam451[i][1],hlam451[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam451[i][0])
					.bindTooltip(hlam451[i][0], {direction: 'top'})
					.addTo(hlam451icons);
			}
	}
	else {
		hlam451icons.clearLayers();
	}
}
var hlam452icons = L.layerGroup().addTo(map);
function Hlam452OnOff() {
	var chbox452;
	chbox452=document.getElementById('Hlam452Button');
	if (chbox452.checked) {
		var hlam452 = [
			["Предохранитель", -51476, -3970],
			["Предохранитель", -51479, -3963],
			["Предохранитель", -45935, -50198],
			["Предохранитель", -33248, -93646],
			["Предохранитель", -33256, -93658],
			["Предохранитель", -33262, -93648],
			["Предохранитель", -34149, -84697],
			["Предохранитель", -34154, -84699],
			["Предохранитель", -34147, -84690],
			["Предохранитель", -46778, -72894],
			["Предохранитель", -100146, -66923],
			["Предохранитель", -100141, -66929],
			["Предохранитель", -100149, -66934],
			["Предохранитель", -39754, -129430],
			["Предохранитель", -93239, -130969],
			["Предохранитель", -85659, -109689],
			["Предохранитель", -85642, -109676],
			["Предохранитель", -124103, -127777],
			["Предохранитель", -124101, -127787],
			["Предохранитель", -124099, -127799],
			["Предохранитель", -106158, -115709],
			["Предохранитель", -106102, -115560],
			["Предохранитель", -106108, -115558],
			["Предохранитель", -115390, -99751],
			["Предохранитель", -115395, -99762],
			["Предохранитель", -149664, -125823],
			["Предохранитель", -149669, -125840],
			["Предохранитель", -149694, -125799],
			["Предохранитель", -149677, -125746],
			["Предохранитель", -145493, -126831],
			["Предохранитель", 188888, -29537],
			["Предохранитель", 188898, -29529],
			["Предохранитель", 188900, -29540],
			["Предохранитель", 167050, -25643],
			["Предохранитель", 130043, -27262],
			["Предохранитель", 100945, -15326],
			["Предохранитель", 89763, -10269],
			["Предохранитель", 90355, -9907],
			["Предохранитель", -93365, -163717],
			["Предохранитель", -14675, -173642],
			["Предохранитель", -108567, -178871],
			["Предохранитель", 19496, -142088],
			["Предохранитель", 74368, -176860],
			["Предохранитель", -97336, 200134],
			["Предохранитель", -38971, 190247],
			["Предохранитель", -38972, 190250],
			["Предохранитель", -10096, 132109],
			["Предохранитель", -40520, 161185],
			["Предохранитель", -40523, 161183],
			["Предохранитель", -37844, 159746],
			["Предохранитель", -143540, 179075],
			["Предохранитель", -158658, 185729],
			["Предохранитель", -141659, 143072],
			["Предохранитель", -141643, 143043],
			["Предохранитель", -141639, 143046],
			["Предохранитель", -141641, 143053],
			["Предохранитель", -163021, 156959],
			["Предохранитель", 152607, 161842],
			["Предохранитель", 95868, 187222],
			["Предохранитель", 93539, 189221],
			["Предохранитель", 62226, 172893],
			["Предохранитель", -129485, 119429],
			["Предохранитель", -129569, 119490],
			["Предохранитель", -128356, 120013],
			["Предохранитель", -37533, 84754],
			["Предохранитель", -37505, 84806],
			["Предохранитель", -37510, 84814],
			["Предохранитель", -37512, 84800],
			["Предохранитель", -41855, 88064],
			["Предохранитель", -41876, 88027],
			["Предохранитель", -41891, 88033],
			["Предохранитель", -33639, 91955],
			["Предохранитель", -33630, 91954],
			["Предохранитель", -65715, 36009],
			["Предохранитель", -65716, 36004],
			["Предохранитель", -44010, 6415],
			["Предохранитель", -55417, 9188],
			["Предохранитель", -55414, 9213],
			["Предохранитель", -47885, 15389],
			["Предохранитель", -47892, 15380],
			["Предохранитель", -43824, 28962],
			["Предохранитель", 181728, 109294],
			["Предохранитель", 181697, 109315],
			["Предохранитель", 181691, 109317],
			["Предохранитель", 183800, 111830],
			["Предохранитель", 183790, 111864],
			["Предохранитель", 183132, 111486],
			["Предохранитель", 183134, 111475],
			["Предохранитель", 183128, 111469],
			["Предохранитель", 183127, 111476],
			["Предохранитель", 161263, 112836],
			["Предохранитель", 161195, 112818],
			["Предохранитель", 183612, 2644],
			["Предохранитель", 114695, 69104],
			["Предохранитель", 129986, 15802],
			["Предохранитель", 129784, 16422],
			["Предохранитель", 129785, 16418]
			];
	for (var i = 0; i < hlam452.length; i++) {
				hlam_452 = new L.circleMarker([hlam452[i][1],hlam452[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam452[i][0])
					.bindTooltip(hlam452[i][0], {direction: 'top'})
					.addTo(hlam452icons);
			}
	}
	else {
		hlam452icons.clearLayers();
	}
}
var hlam453icons = L.layerGroup().addTo(map);
function Hlam453OnOff() {
	var chbox453;
	chbox453=document.getElementById('Hlam453Button');
	if (chbox453.checked) {
		var hlam453 = [
			["Прихватка", -53196, -13244],
			["Прихватка", -56836, -11178],
			["Прихватка", -27888, -60023],
			["Прихватка", -19389, -47064],
			["Прихватка", -19229, -47110],
			["Прихватка", -55784, -60428],
			["Прихватка", -63159, -129199],
			["Прихватка", -51170, -106504],
			["Прихватка", -47434, -106333],
			["Прихватка", -61362, -100037],
			["Прихватка", -80949, -102474],
			["Прихватка", -147762, -56934],
			["Прихватка", -150805, -74858],
			["Прихватка", -168084, -115411],
			["Прихватка", 167382, -24417],
			["Прихватка", 168418, -24460],
			["Прихватка", 173674, -13514],
			["Прихватка", 149464, -51992],
			["Прихватка", 183776, -92899],
			["Прихватка", 149901, -66980],
			["Прихватка", 88672, -31117],
			["Прихватка", 72868, -7680],
			["Прихватка", 73262, -6991],
			["Прихватка", 88214, -3732],
			["Прихватка", 34062, -32670],
			["Прихватка", 48750, -22035],
			["Прихватка", 50291, -23360],
			["Прихватка", 51056, -19486],
			["Прихватка", 28406, -31146],
			["Прихватка", 29797, -20681],
			["Прихватка", 107897, -54332],
			["Прихватка", 33942, -32936],
			["Прихватка", 34275, -36294],
			["Прихватка", 30940, -33106],
			["Прихватка", 11129, -88396],
			["Прихватка", 9787, -79039],
			["Прихватка", 38094, -119259],
			["Прихватка", 13814, -107316],
			["Прихватка", -120727, -189627],
			["Прихватка", -139286, -143980],
			["Прихватка", 22170, -150366],
			["Прихватка", -4339, 185041],
			["Прихватка", -60941, 181382],
			["Прихватка", -61275, 180975],
			["Прихватка", -92957, 183345],
			["Прихватка", -95761, 189997],
			["Прихватка", -27313, 162883],
			["Прихватка", -146182, 172918],
			["Прихватка", 179367, 134086],
			["Прихватка", 151762, 138449],
			["Прихватка", 48414, 190517],
			["Прихватка", 14567, 196035],
			["Прихватка", 71605, 137143],
			["Прихватка", -128955, 120035],
			["Прихватка", -40987, 88733],
			["Прихватка", -18009, 59971],
			["Прихватка", -17684, 60248],
			["Прихватка", 168198, 55706],
			["Прихватка", 168729, 56239],
			["Прихватка", 168841, 56053],
			["Прихватка", 169267, 56174],
			["Прихватка", 171127, 1742],
			["Прихватка", 49065, 85784],
			["Прихватка", 23540, 44077],
			["Прихватка", 27093, 50123],
			["Прихватка", 25092, 55018]
			];
	for (var i = 0; i < hlam453.length; i++) {
				hlam_453 = new L.circleMarker([hlam453[i][1],hlam453[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam453[i][0])
					.bindTooltip(hlam453[i][0], {direction: 'top'})
					.addTo(hlam453icons);
			}
	}
	else {
		hlam453icons.clearLayers();
	}
}
var hlam454icons = L.layerGroup().addTo(map);
function Hlam454OnOff() {
	var chbox454;
	chbox454=document.getElementById('Hlam454Button');
	if (chbox454.checked) {
		var hlam454 = [
			["Пробирка", -35611, -80582],
			["Пробирка", -35632, -80586],
			["Пробирка", -35630, -80598],
			["Пробирка", 68580, -88338],
			["Пробирка", 68577, -88349],
			["Пробирка", 68579, -88377],
			["Пробирка", 68577, -88353],
			["Пробирка", 68577, -88357],
			["Пробирка", 68580, -88355],
			["Пробирка", 68585, -88343],
			["Пробирка", -21101, 150728],
			["Пробирка", -21101, 150711],
			["Пробирка", 69123, 202274],
			["Пробирка", 69123, 202261],
			["Пробирка", 126071, 160558],
			["Пробирка", 2445, 163053]
			];
	for (var i = 0; i < hlam454.length; i++) {
				hlam_454 = new L.circleMarker([hlam454[i][1],hlam454[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam454[i][0])
					.bindTooltip(hlam454[i][0], {direction: 'top'})
					.addTo(hlam454icons);
			}
	}
	else {
		hlam454icons.clearLayers();
	}
}
var hlam455icons = L.layerGroup().addTo(map);
function Hlam455OnOff() {
	var chbox455;
	chbox455=document.getElementById('Hlam455Button');
	if (chbox455.checked) {
		var hlam455 = [
			["Пробитая канистра с газом &quotГаллюциГен&quot", -84619, -45458],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -48099, -130315],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -48059, -130293],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -47977, -130405],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -48214, -130552],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -48169, -130353],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -48149, -130312],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -45263, -130390],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -45192, -130498],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -45201, -130521],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -45357, -130362],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -45051, -130043],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -68289, -154750],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -68284, -154926],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -124183, -186327],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -124811, -186221],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -124787, -186028],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -119671, -188000],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -119596, -187680],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -61755, 142002],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -59893, 142505],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -141436, 190152],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -138150, 135703],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -138139, 135735],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -87981, 116683],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -87973, 116705],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -20641, 12114],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -20630, 12133],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -68638, 2604],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -68407, 2475],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -172428, 111485],
			["Пробитая канистра с газом &quotГаллюциГен&quot", -173918, 110836],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 112711, 119507],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 81892, 55735],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 43998, 52608],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 43351, 52657],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 42492, 53899],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 118826, 4018],
			["Пробитая канистра с газом &quotГаллюциГен&quot", 118711, 4145]
			];
	for (var i = 0; i < hlam455.length; i++) {
				hlam_455 = new L.circleMarker([hlam455[i][1],hlam455[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam455[i][0])
					.bindTooltip(hlam455[i][0], {direction: 'top'})
					.addTo(hlam455icons);
			}
	}
	else {
		hlam455icons.clearLayers();
	}
}
var hlam456icons = L.layerGroup().addTo(map);
function Hlam456OnOff() {
	var chbox456;
	chbox456=document.getElementById('Hlam456Button');
	if (chbox456.checked) {
		var hlam456 = [
			["Пром. чистящее средство &quotАбраксо&quot", -49804, -14652],
			["Пром. чистящее средство &quotАбраксо&quot", -55128, -9502],
			["Пром. чистящее средство &quotАбраксо&quot", -72463, -7271],
			["Пром. чистящее средство &quotАбраксо&quot", -46266, -50105],
			["Пром. чистящее средство &quotАбраксо&quot", -61685, -100463],
			["Пром. чистящее средство &quotАбраксо&quot", -81019, -102586],
			["Пром. чистящее средство &quotАбраксо&quot", -148136, -57945],
			["Пром. чистящее средство &quotАбраксо&quot", -148008, -56671],
			["Пром. чистящее средство &quotАбраксо&quot", -148324, -56497],
			["Пром. чистящее средство &quotАбраксо&quot", -151143, -75251],
			["Пром. чистящее средство &quotАбраксо&quot", -132225, -121478],
			["Пром. чистящее средство &quotАбраксо&quot", 183959, -93127],
			["Пром. чистящее средство &quotАбраксо&quot", 184362, -91656],
			["Пром. чистящее средство &quotАбраксо&quot", 147484, -78199],
			["Пром. чистящее средство &quotАбраксо&quot", 77289, -14993],
			["Пром. чистящее средство &quotАбраксо&quot", 88997, -5831],
			["Пром. чистящее средство &quotАбраксо&quot", 48872, -21608],
			["Пром. чистящее средство &quotАбраксо&quot", 48594, -21891],
			["Пром. чистящее средство &quotАбраксо&quot", 24449, -63712],
			["Пром. чистящее средство &quotАбраксо&quot", 24710, -63837],
			["Пром. чистящее средство &quotАбраксо&quot", 29284, -58166],
			["Пром. чистящее средство &quotАбраксо&quot", 94985, -84421],
			["Пром. чистящее средство &quotАбраксо&quot", 9935, -79466],
			["Пром. чистящее средство &quotАбраксо&quot", 38168, -119165],
			["Пром. чистящее средство &quotАбраксо&quot", 47928, -103815],
			["Пром. чистящее средство &quotАбраксо&quot", 20529, -115585],
			["Пром. чистящее средство &quotАбраксо&quot", -121889, -135875],
			["Пром. чистящее средство &quotАбраксо&quot", -126577, -134106],
			["Пром. чистящее средство &quotАбраксо&quot", -121463, -132632],
			["Пром. чистящее средство &quotАбраксо&quot", -6121, -170920],
			["Пром. чистящее средство &quotАбраксо&quot", -43354, -174250],
			["Пром. чистящее средство &quotАбраксо&quot", -109000, -179101],
			["Пром. чистящее средство &quotАбраксо&quot", -114591, -171331],
			["Пром. чистящее средство &quotАбраксо&quot", -172587, -149511],
			["Пром. чистящее средство &quotАбраксо&quot", -160712, 152044],
			["Пром. чистящее средство &quotАбраксо&quot", 149994, 135114],
			["Пром. чистящее средство &quotАбраксо&quot", 147491, 137900],
			["Пром. чистящее средство &quotАбраксо&quot", 152413, 138708],
			["Пром. чистящее средство &quotАбраксо&quot", 152343, 138482],
			["Пром. чистящее средство &quotАбраксо&quot", 148804, 140801],
			["Пром. чистящее средство &quotАбраксо&quot", 148730, 140778],
			["Пром. чистящее средство &quotАбраксо&quot", 103230, 190784],
			["Пром. чистящее средство &quotАбраксо&quot", 93400, 188944],
			["Пром. чистящее средство &quotАбраксо&quot", 19191, 134088],
			["Пром. чистящее средство &quotАбраксо&quot", 28695, 131490],
			["Пром. чистящее средство &quotАбраксо&quot", 3004, 160690],
			["Пром. чистящее средство &quotАбраксо&quot", -104668, 123048],
			["Пром. чистящее средство &quotАбраксо&quot", -18115, 60365],
			["Пром. чистящее средство &quotАбраксо&quot", -65757, 35927],
			["Пром. чистящее средство &quotАбраксо&quot", -47007, 1572],
			["Пром. чистящее средство &quotАбраксо&quot", -47252, 1649],
			["Пром. чистящее средство &quotАбраксо&quot", -47264, 1394],
			["Пром. чистящее средство &quotАбраксо&quot", -47259, 1368],
			["Пром. чистящее средство &quotАбраксо&quot", -38131, 4820],
			["Пром. чистящее средство &quotАбраксо&quot", -47129, 28609],
			["Пром. чистящее средство &quotАбраксо&quot", -47141, 28857],
			["Пром. чистящее средство &quotАбраксо&quot", -152180, 689],
			["Пром. чистящее средство &quotАбраксо&quot", -152195, 689],
			["Пром. чистящее средство &quotАбраксо&quot", -152253, 1200],
			["Пром. чистящее средство &quotАбраксо&quot", 160279, 58664],
			["Пром. чистящее средство &quotАбраксо&quot", 94836, 98810],
			["Пром. чистящее средство &quotАбраксо&quot", 93703, 106888],
			["Пром. чистящее средство &quotАбраксо&quot", 16383, 44697]
			];
	for (var i = 0; i < hlam456.length; i++) {
				hlam_456 = new L.circleMarker([hlam456[i][1],hlam456[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam456[i][0])
					.bindTooltip(hlam456[i][0], {direction: 'top'})
					.addTo(hlam456icons);
			}
	}
	else {
		hlam456icons.clearLayers();
	}
}
var hlam457icons = L.layerGroup().addTo(map);
function Hlam457OnOff() {
	var chbox457;
	chbox457=document.getElementById('Hlam457Button');
	if (chbox457.checked) {
		var hlam457 = [
			["Промышленная масленка", -53601, -12874],
			["Промышленная масленка", -41892, -13466],
			["Промышленная масленка", -43011, -6744],
			["Промышленная масленка", -60234, -57404],
			["Промышленная масленка", -89895, -42260],
			["Промышленная масленка", -71263, -69089],
			["Промышленная масленка", -30480, -130215],
			["Промышленная масленка", -69190, -105040],
			["Промышленная масленка", -148959, -57932],
			["Промышленная масленка", 129655, -28084],
			["Промышленная масленка", 88640, -31321],
			["Промышленная масленка", 48110, -20729],
			["Промышленная масленка", 50322, -43192],
			["Промышленная масленка", 24937, -63569],
			["Промышленная масленка", 69294, -104025],
			["Промышленная масленка", -4719, -155779],
			["Промышленная масленка", 115273, -157938],
			["Промышленная масленка", -97970, 200229],
			["Промышленная масленка", -67186, 201515],
			["Промышленная масленка", -22948, 189471],
			["Промышленная масленка", -55569, 165211],
			["Промышленная масленка", -56665, 165426],
			["Промышленная масленка", -97342, 189523],
			["Промышленная масленка", -378, 137331],
			["Промышленная масленка", -38606, 158732],
			["Промышленная масленка", -158165, 185810],
			["Промышленная масленка", 147652, 137804],
			["Промышленная масленка", 152563, 161596],
			["Промышленная масленка", 70042, 202268],
			["Промышленная масленка", -42338, 112963],
			["Промышленная масленка", -104604, 123173],
			["Промышленная масленка", -37633, 84134],
			["Промышленная масленка", -59796, 89414],
			["Промышленная масленка", -55993, 88296],
			["Промышленная масленка", -90860, 66956],
			["Промышленная масленка", -128057, 81023],
			["Промышленная масленка", -52317, 59102],
			["Промышленная масленка", -46597, 2523],
			["Промышленная масленка", -42394, 2725],
			["Промышленная масленка", -37892, 5781],
			["Промышленная масленка", -54911, 10558],
			["Промышленная масленка", -54891, 10585],
			["Промышленная масленка", -51625, 13163],
			["Промышленная масленка", -41009, 12573],
			["Промышленная масленка", -119377, 3483],
			["Промышленная масленка", -163962, 122573],
			["Промышленная масленка", 170955, 1856],
			["Промышленная масленка", 182882, 3154],
			["Промышленная масленка", 183479, 2908],
			["Промышленная масленка", 92787, 103053],
			["Промышленная масленка", 20721, 125712],
			["Промышленная масленка", 70286, 37096],
			["Промышленная масленка", 76101, 37093],
			["Промышленная масленка", 80059, 55699],
			["Промышленная масленка", 16522, 48728],
			["Промышленная масленка", 129548, 19393]
			];
	for (var i = 0; i < hlam457.length; i++) {
				hlam_457 = new L.circleMarker([hlam457[i][1],hlam457[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam457[i][0])
					.bindTooltip(hlam457[i][0], {direction: 'top'})
					.addTo(hlam457icons);
			}
	}
	else {
		hlam457icons.clearLayers();
	}
}
var hlam458icons = L.layerGroup().addTo(map);
function Hlam458OnOff() {
	var chbox458;
	chbox458=document.getElementById('Hlam458Button');
	if (chbox458.checked) {
		var hlam458 = [
			["Промышленный очиститель", -100213, -67338],
			["Промышленный очиститель", -78969, -108768],
			["Промышленный очиститель", -79892, -108143],
			["Промышленный очиститель", -133392, -121217],
			["Промышленный очиститель", -132780, -121404],
			["Промышленный очиститель", 88161, -21496],
			["Промышленный очиститель", 76029, -108755],
			["Промышленный очиститель", 84108, -109866],
			["Промышленный очиститель", 84870, -109063],
			["Промышленный очиститель", 3146, 182239]
			];
	for (var i = 0; i < hlam458.length; i++) {
				hlam_458 = new L.circleMarker([hlam458[i][1],hlam458[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam458[i][0])
					.bindTooltip(hlam458[i][0], {direction: 'top'})
					.addTo(hlam458icons);
			}
	}
	else {
		hlam458icons.clearLayers();
	}
}
var hlam459icons = L.layerGroup().addTo(map);
function Hlam459OnOff() {
	var chbox459;
	chbox459=document.getElementById('Hlam459Button');
	if (chbox459.checked) {
		var hlam459 = [
			["Промышленный разрыхлитель", -53224, -13765],
			["Промышленный разрыхлитель", -56698, -11107],
			["Промышленный разрыхлитель", -28003, -60070],
			["Промышленный разрыхлитель", -19156, -46876],
			["Промышленный разрыхлитель", -47289, -51206],
			["Промышленный разрыхлитель", -70368, -104778],
			["Промышленный разрыхлитель", 149108, -52492],
			["Промышленный разрыхлитель", 181269, -123134],
			["Промышленный разрыхлитель", 180004, -121774],
			["Промышленный разрыхлитель", 153239, -103823],
			["Промышленный разрыхлитель", 88966, -21215],
			["Промышленный разрыхлитель", 73900, -6792],
			["Промышленный разрыхлитель", 34058, -36294],
			["Промышленный разрыхлитель", 11840, -83557],
			["Промышленный разрыхлитель", -120704, -189620],
			["Промышленный разрыхлитель", -120658, -189506],
			["Промышленный разрыхлитель", -120836, -188671],
			["Промышленный разрыхлитель", -134098, -153643],
			["Промышленный разрыхлитель", -139292, -143981],
			["Промышленный разрыхлитель", -136749, -177178],
			["Промышленный разрыхлитель", 22225, -150288],
			["Промышленный разрыхлитель", -60588, 181888],
			["Промышленный разрыхлитель", -60957, 181191],
			["Промышленный разрыхлитель", -87456, 183864],
			["Промышленный разрыхлитель", -89562, 183932],
			["Промышленный разрыхлитель", -17774, 161860],
			["Промышленный разрыхлитель", -42535, 137681],
			["Промышленный разрыхлитель", -160426, 152126],
			["Промышленный разрыхлитель", 88571, 156967],
			["Промышленный разрыхлитель", 28906, 131501],
			["Промышленный разрыхлитель", 2439, 137995],
			["Промышленный разрыхлитель", 2968, 162494],
			["Промышленный разрыхлитель", 2737, 161380],
			["Промышленный разрыхлитель", -39519, 46346],
			["Промышленный разрыхлитель", -68780, 55660],
			["Промышленный разрыхлитель", -93557, 62925],
			["Промышленный разрыхлитель", -88141, 63525],
			["Промышленный разрыхлитель", -98746, 8272],
			["Промышленный разрыхлитель", 183995, 2986],
			["Промышленный разрыхлитель", 183438, 2537],
			["Промышленный разрыхлитель", 46477, 100756],
			["Промышленный разрыхлитель", 80933, 59707],
			["Промышленный разрыхлитель", 21011, 46427]
			];
	for (var i = 0; i < hlam459.length; i++) {
				hlam_459 = new L.circleMarker([hlam459[i][1],hlam459[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam459[i][0])
					.bindTooltip(hlam459[i][0], {direction: 'top'})
					.addTo(hlam459icons);
			}
	}
	else {
		hlam459icons.clearLayers();
	}
}
var hlam460icons = L.layerGroup().addTo(map);
function Hlam460OnOff() {
	var chbox460;
	chbox460=document.getElementById('Hlam460Button');
	if (chbox460.checked) {
		var hlam460 = [
			["Промышленный растворитель", -41397, -1828],
			["Промышленный растворитель", -41275, -1732],
			["Промышленный растворитель", -68252, -14214],
			["Промышленный растворитель", -45974, -50236],
			["Промышленный растворитель", -29599, -94069],
			["Промышленный растворитель", -34622, -84514],
			["Промышленный растворитель", -100152, -67044],
			["Промышленный растворитель", -93291, -130952],
			["Промышленный растворитель", -114158, -116863],
			["Промышленный растворитель", -151121, -75237],
			["Промышленный растворитель", -149674, -125789],
			["Промышленный растворитель", -132223, -121601],
			["Промышленный растворитель", -133413, -121920],
			["Промышленный растворитель", 191704, -28448],
			["Промышленный растворитель", 77291, -15005],
			["Промышленный растворитель", 25773, -104455],
			["Промышленный растворитель", -121438, -132634],
			["Промышленный растворитель", -14704, -173689],
			["Промышленный растворитель", -95644, -176688],
			["Промышленный растворитель", 115109, -157942],
			["Промышленный растворитель", -84310, 165948],
			["Промышленный растворитель", -37814, 159731],
			["Промышленный растворитель", -147485, 152000],
			["Промышленный растворитель", 103214, 190804],
			["Промышленный растворитель", -61865, 90410],
			["Промышленный растворитель", -40751, 50822],
			["Промышленный растворитель", -45900, 1818],
			["Промышленный растворитель", 202921, 55289],
			["Промышленный растворитель", 182994, 2712],
			["Промышленный растворитель", 183558, 2896],
			["Промышленный растворитель", 182840, 2937],
			["Промышленный растворитель", 71363, 96723]
			];
	for (var i = 0; i < hlam460.length; i++) {
				hlam_460 = new L.circleMarker([hlam460[i][1],hlam460[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam460[i][0])
					.bindTooltip(hlam460[i][0], {direction: 'top'})
					.addTo(hlam460icons);
			}
	}
	else {
		hlam460icons.clearLayers();
	}
}
var hlam461icons = L.layerGroup().addTo(map);
function Hlam461OnOff() {
	var chbox461;
	chbox461=document.getElementById('Hlam461Button');
	if (chbox461.checked) {
		var hlam461 = [
			["Пружина", -148432, -56859],
			["Пружина", 26181, -137051],
			["Пружина", 27624, -137672],
			["Пружина", -70987, 197940],
			["Пружина", 70253, 202067],
			["Пружина", -47092, 2541],
			["Пружина", 115077, 69315]
			];
	for (var i = 0; i < hlam461.length; i++) {
				hlam_461 = new L.circleMarker([hlam461[i][1],hlam461[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam461[i][0])
					.bindTooltip(hlam461[i][0], {direction: 'top'})
					.addTo(hlam461icons);
			}
	}
	else {
		hlam461icons.clearLayers();
	}
}
var hlam462icons = L.layerGroup().addTo(map);
function Hlam462OnOff() {
	var chbox462;
	chbox462=document.getElementById('Hlam462Button');
	if (chbox462.checked) {
		var hlam462 = [
			["Пустая банка", 101182, -100268],
			["Пустая банка", -37433, -157178],
			["Пустая банка", 150936, 138488],
			["Пустая банка", 131751, 11871],
			["Пустая банка", 55226, 9133]
			];
	for (var i = 0; i < hlam462.length; i++) {
				hlam_462 = new L.circleMarker([hlam462[i][1],hlam462[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam462[i][0])
					.bindTooltip(hlam462[i][0], {direction: 'top'})
					.addTo(hlam462icons);
			}
	}
	else {
		hlam462icons.clearLayers();
	}
}
var hlam463icons = L.layerGroup().addTo(map);
function Hlam463OnOff() {
	var chbox463;
	chbox463=document.getElementById('Hlam463Button');
	if (chbox463.checked) {
		var hlam463 = [
			["Пустая банка из-под краски", -44465, -15966],
			["Пустая банка из-под краски", -40544, -4131],
			["Пустая банка из-под краски", -66969, -22552],
			["Пустая банка из-под краски", -67359, -1398],
			["Пустая банка из-под краски", -61693, -57623],
			["Пустая банка из-под краски", -61679, -57686],
			["Пустая банка из-под краски", -61550, -57714],
			["Пустая банка из-под краски", -61487, -57605],
			["Пустая банка из-под краски", -51517, -46883],
			["Пустая банка из-под краски", -51427, -46511],
			["Пустая банка из-под краски", -59088, -39612],
			["Пустая банка из-под краски", -59056, -39616],
			["Пустая банка из-под краски", -117608, -62584],
			["Пустая банка из-под краски", -117630, -62589],
			["Пустая банка из-под краски", -119920, -45576],
			["Пустая банка из-под краски", -29657, -94077],
			["Пустая банка из-под краски", -29790, -87346],
			["Пустая банка из-под краски", -34440, -84492],
			["Пустая банка из-под краски", -34477, -84398],
			["Пустая банка из-под краски", -34202, -84089],
			["Пустая банка из-под краски", -34223, -84018],
			["Пустая банка из-под краски", -36472, -80702],
			["Пустая банка из-под краски", -36573, -80738],
			["Пустая банка из-под краски", -46735, -72388],
			["Пустая банка из-под краски", -84631, -80253],
			["Пустая банка из-под краски", -84493, -80190],
			["Пустая банка из-под краски", -10354, -123937],
			["Пустая банка из-под краски", -10385, -123941],
			["Пустая банка из-под краски", -42959, -125303],
			["Пустая банка из-под краски", -84017, -106105],
			["Пустая банка из-под краски", -128884, -119171],
			["Пустая банка из-под краски", -128860, -119148],
			["Пустая банка из-под краски", -128885, -119136],
			["Пустая банка из-под краски", -159397, -40533],
			["Пустая банка из-под краски", -146122, -96017],
			["Пустая банка из-под краски", -146092, -95958],
			["Пустая банка из-под краски", -131443, -92860],
			["Пустая банка из-под краски", -159526, -75513],
			["Пустая банка из-под краски", -159221, -75680],
			["Пустая банка из-под краски", -161898, -73458],
			["Пустая банка из-под краски", -150664, -101824],
			["Пустая банка из-под краски", -150907, -102098],
			["Пустая банка из-под краски", 170326, -31561],
			["Пустая банка из-под краски", 188044, -28872],
			["Пустая банка из-под краски", 188538, -29793],
			["Пустая банка из-под краски", 195060, -31784],
			["Пустая банка из-под краски", 167323, -26391],
			["Пустая банка из-под краски", 167579, -25955],
			["Пустая банка из-под краски", 167388, -25892],
			["Пустая банка из-под краски", 167413, -25889],
			["Пустая банка из-под краски", 167378, -25892],
			["Пустая банка из-под краски", 167526, -25892],
			["Пустая банка из-под краски", 167597, -22913],
			["Пустая банка из-под краски", 164948, -22821],
			["Пустая банка из-под краски", 166376, -21335],
			["Пустая банка из-под краски", 141207, -251],
			["Пустая банка из-под краски", 141223, -230],
			["Пустая банка из-под краски", 140107, -2939],
			["Пустая банка из-под краски", 172268, -42916],
			["Пустая банка из-под краски", 149105, -51853],
			["Пустая банка из-под краски", 158110, -68820],
			["Пустая банка из-под краски", 180086, -126099],
			["Пустая банка из-под краски", 129179, -28708],
			["Пустая банка из-под краски", 130200, -27711],
			["Пустая банка из-под краски", 130193, -27713],
			["Пустая банка из-под краски", 129242, -28475],
			["Пустая банка из-под краски", 130027, -27190],
			["Пустая банка из-под краски", 130143, -27709],
			["Пустая банка из-под краски", 127735, -24940],
			["Пустая банка из-под краски", 82376, -21079],
			["Пустая банка из-под краски", 84736, -18922],
			["Пустая банка из-под краски", 74464, -5915],
			["Пустая банка из-под краски", 74353, -5809],
			["Пустая банка из-под краски", 62081, -58156],
			["Пустая банка из-под краски", 62419, -58182],
			["Пустая банка из-под краски", 24452, -63584],
			["Пустая банка из-под краски", 24584, -63757],
			["Пустая банка из-под краски", 22807, -61090],
			["Пустая банка из-под краски", 22738, -61091],
			["Пустая банка из-под краски", 22546, -60480],
			["Пустая банка из-под краски", 108552, -100742],
			["Пустая банка из-под краски", 84064, -109488],
			["Пустая банка из-под краски", 84152, -109554],
			["Пустая банка из-под краски", 84132, -109569],
			["Пустая банка из-под краски", 70119, -105029],
			["Пустая банка из-под краски", 22738, -106843],
			["Пустая банка из-под краски", -55411, -160458],
			["Пустая банка из-под краски", -55361, -160389],
			["Пустая банка из-под краски", -93488, -131181],
			["Пустая банка из-под краски", -24907, -172451],
			["Пустая банка из-под краски", -24874, -172448],
			["Пустая банка из-под краски", -24693, -172194],
			["Пустая банка из-под краски", -82772, -178518],
			["Пустая банка из-под краски", -130726, -189880],
			["Пустая банка из-под краски", -122837, -184463],
			["Пустая банка из-под краски", -138313, -139916],
			["Пустая банка из-под краски", 189613, -169349],
			["Пустая банка из-под краски", 189787, -169632],
			["Пустая банка из-под краски", 189763, -169621],
			["Пустая банка из-под краски", 189930, -165721],
			["Пустая банка из-под краски", -13012, 189319],
			["Пустая банка из-под краски", -39456, 190265],
			["Пустая банка из-под краски", -92922, 183899],
			["Пустая банка из-под краски", -92581, 184137],
			["Пустая банка из-под краски", -92666, 183516],
			["Пустая банка из-под краски", -92738, 183397],
			["Пустая банка из-под краски", -92129, 183445],
			["Пустая банка из-под краски", -92080, 183392],
			["Пустая банка из-под краски", -89740, 185747],
			["Пустая банка из-под краски", -89733, 185311],
			["Пустая банка из-под краски", -89718, 185737],
			["Пустая банка из-под краски", -94998, 190012],
			["Пустая банка из-под краски", -94998, 190262],
			["Пустая банка из-под краски", -26963, 162574],
			["Пустая банка из-под краски", -17583, 162885],
			["Пустая банка из-под краски", -71205, 145723],
			["Пустая банка из-под краски", -71201, 145694],
			["Пустая банка из-под краски", -98571, 147795],
			["Пустая банка из-под краски", -109700, 157632],
			["Пустая банка из-под краски", -146238, 173699],
			["Пустая банка из-под краски", -146090, 173672],
			["Пустая банка из-под краски", -146111, 173798],
			["Пустая банка из-под краски", -146188, 173758],
			["Пустая банка из-под краски", -146085, 173791],
			["Пустая банка из-под краски", -146072, 173807],
			["Пустая банка из-под краски", -163574, 141776],
			["Пустая банка из-под краски", 179058, 133059],
			["Пустая банка из-под краски", 151903, 138069],
			["Пустая банка из-под краски", 72164, 132981],
			["Пустая банка из-под краски", 85496, 152473],
			["Пустая банка из-под краски", 43257, 161586],
			["Пустая банка из-под краски", 14283, 136552],
			["Пустая банка из-под краски", -37800, 84897],
			["Пустая банка из-под краски", -37808, 84857],
			["Пустая банка из-под краски", -61124, 89550],
			["Пустая банка из-под краски", -61113, 89686],
			["Пустая банка из-под краски", -43416, 88151],
			["Пустая банка из-под краски", -103938, 37624],
			["Пустая банка из-под краски", -48501, 3633],
			["Пустая банка из-под краски", -48862, 2955],
			["Пустая банка из-под краски", -46406, 3672],
			["Пустая банка из-под краски", -46573, 3745],
			["Пустая банка из-под краски", -46557, 3758],
			["Пустая банка из-под краски", -46435, 3678],
			["Пустая банка из-под краски", -46498, 3793],
			["Пустая банка из-под краски", -39457, 7423],
			["Пустая банка из-под краски", -56300, 9105],
			["Пустая банка из-под краски", -42960, 8618],
			["Пустая банка из-под краски", -41276, 10643],
			["Пустая банка из-под краски", -41002, 10314],
			["Пустая банка из-под краски", -58811, 12440],
			["Пустая банка из-под краски", -47899, 15166],
			["Пустая банка из-под краски", -47873, 15159],
			["Пустая банка из-под краски", -34417, 13619],
			["Пустая банка из-под краски", -118689, 1165],
			["Пустая банка из-под краски", -148435, 113879],
			["Пустая банка из-под краски", -156858, 123774],
			["Пустая банка из-под краски", -164510, 123397],
			["Пустая банка из-под краски", 182921, 109849],
			["Пустая банка из-под краски", 181684, 109559],
			["Пустая банка из-под краски", 183601, 111073],
			["Пустая банка из-под краски", 180314, 111322],
			["Пустая банка из-под краски", 183504, 112332],
			["Пустая банка из-под краски", 183449, 112370],
			["Пустая банка из-под краски", 191303, 115645],
			["Пустая банка из-под краски", 134775, 127101],
			["Пустая банка из-под краски", 139913, 73284],
			["Пустая банка из-под краски", 154377, 77585],
			["Пустая банка из-под краски", 153100, 77023],
			["Пустая банка из-под краски", 153100, 77008],
			["Пустая банка из-под краски", 153931, 77435],
			["Пустая банка из-под краски", 154027, 77556],
			["Пустая банка из-под краски", 144064, 80472],
			["Пустая банка из-под краски", 144076, 80462],
			["Пустая банка из-под краски", 144304, 81144],
			["Пустая банка из-под краски", 144340, 82082],
			["Пустая банка из-под краски", 152365, 57271],
			["Пустая банка из-под краски", 152399, 57305],
			["Пустая банка из-под краски", 152421, 57302],
			["Пустая банка из-под краски", 153154, 57713],
			["Пустая банка из-под краски", 153212, 57639],
			["Пустая банка из-под краски", 153146, 57605],
			["Пустая банка из-под краски", 182515, 3340],
			["Пустая банка из-под краски", 183701, 2896],
			["Пустая банка из-под краски", 136830, 15550],
			["Пустая банка из-под краски", 94606, 98904],
			["Пустая банка из-под краски", 94588, 98890],
			["Пустая банка из-под краски", 94787, 98751],
			["Пустая банка из-под краски", 130730, 74423],
			["Пустая банка из-под краски", 130749, 74579],
			["Пустая банка из-под краски", 111685, 58136],
			["Пустая банка из-под краски", 60440, 57671],
			["Пустая банка из-под краски", 16523, 44000],
			["Пустая банка из-под краски", 9681, 50292],
			["Пустая банка из-под краски", 9703, 50311],
			["Пустая банка из-под краски", 100705, 27247],
			["Пустая банка из-под краски", 84715, 859],
			["Пустая банка из-под краски", 77120, 21088],
			["Пустая банка из-под краски", 58961, 12072],
			["Пустая банка из-под краски", 58642, 10297],
			["Пустая банка из-под краски", 41246, 23373],
			["Пустая банка из-под краски", -94722, 10285]
			];
	for (var i = 0; i < hlam463.length; i++) {
				hlam_463 = new L.circleMarker([hlam463[i][1],hlam463[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam463[i][0])
					.bindTooltip(hlam463[i][0], {direction: 'top'})
					.addTo(hlam463icons);
			}
	}
	else {
		hlam463icons.clearLayers();
	}
}
var hlam464icons = L.layerGroup().addTo(map);
function Hlam464OnOff() {
	var chbox464;
	chbox464=document.getElementById('Hlam464Button');
	if (chbox464.checked) {
		var hlam464 = [
			["Пустая ваза-бутон &quotИва&quot", -55505, -61633],
			["Пустая ваза-бутон &quotИва&quot", -110348, -58883],
			["Пустая ваза-бутон &quotИва&quot", -13261, -66120],
			["Пустая ваза-бутон &quotИва&quot", -148112, -58523],
			["Пустая ваза-бутон &quotИва&quot", 166999, -22242],
			["Пустая ваза-бутон &quotИва&quot", 3445, 166768],
			["Пустая ваза-бутон &quotИва&quot", -29548, 125245],
			["Пустая ваза-бутон &quotИва&quot", -29804, 125451],
			["Пустая ваза-бутон &quotИва&quot", 167189, 59767],
			["Пустая ваза-бутон &quotИва&quot", 172560, 57842],
			["Пустая ваза-бутон &quotИва&quot", 172439, 58385],
			["Пустая ваза-бутон &quotИва&quot", 172111, 58197]
			];
	for (var i = 0; i < hlam464.length; i++) {
				hlam_464 = new L.circleMarker([hlam464[i][1],hlam464[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam464[i][0])
					.bindTooltip(hlam464[i][0], {direction: 'top'})
					.addTo(hlam464icons);
			}
	}
	else {
		hlam464icons.clearLayers();
	}
}
var hlam465icons = L.layerGroup().addTo(map);
function Hlam465OnOff() {
	var chbox465;
	chbox465=document.getElementById('Hlam465Button');
	if (chbox465.checked) {
		var hlam465 = [
			["Пустая ваза-бутон &quotЦветы&quot", -45138, -8589],
			["Пустая ваза-бутон &quotЦветы&quot", -44860, -8928],
			["Пустая ваза-бутон &quotЦветы&quot", -18870, -43613],
			["Пустая ваза-бутон &quotЦветы&quot", -38686, -59750],
			["Пустая ваза-бутон &quotЦветы&quot", -37045, -58482],
			["Пустая ваза-бутон &quotЦветы&quot", -61011, -100612],
			["Пустая ваза-бутон &quotЦветы&quot", 50252, -22966],
			["Пустая ваза-бутон &quotЦветы&quot", 3484, 166732],
			["Пустая ваза-бутон &quotЦветы&quot", 2375, 138469],
			["Пустая ваза-бутон &quotЦветы&quot", -29778, 125441],
			["Пустая ваза-бутон &quotЦветы&quot", -27776, 124466],
			["Пустая ваза-бутон &quotЦветы&quot", -39640, 47283],
			["Пустая ваза-бутон &quotЦветы&quot", -179773, 73969],
			["Пустая ваза-бутон &quotЦветы&quot", 183044, 2708],
			["Пустая ваза-бутон &quotЦветы&quot", 25325, 124733]
			];
	for (var i = 0; i < hlam465.length; i++) {
				hlam_465 = new L.circleMarker([hlam465[i][1],hlam465[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam465[i][0])
					.bindTooltip(hlam465[i][0], {direction: 'top'})
					.addTo(hlam465icons);
			}
	}
	else {
		hlam465icons.clearLayers();
	}
}
var hlam466icons = L.layerGroup().addTo(map);
function Hlam466OnOff() {
	var chbox466;
	chbox466=document.getElementById('Hlam466Button');
	if (chbox466.checked) {
		var hlam466 = [
			["Пустая ваза-купол &quotИва&quot", -52551, -12312],
			["Пустая ваза-купол &quotИва&quot", -45170, -8551],
			["Пустая ваза-купол &quotИва&quot", -52944, -862],
			["Пустая ваза-купол &quotИва&quot", -56007, -60839],
			["Пустая ваза-купол &quotИва&quot", -55210, -48612],
			["Пустая ваза-купол &quotИва&quot", -61416, -100395],
			["Пустая ваза-купол &quotИва&quot", 180797, -123798],
			["Пустая ваза-купол &quotИва&quot", 69845, -7705],
			["Пустая ваза-купол &quotИва&quot", 3328, 166885],
			["Пустая ваза-купол &quotИва&quot", -29241, 125162],
			["Пустая ваза-купол &quotИва&quot", -29741, 125505],
			["Пустая ваза-купол &quotИва&quot", 167767, 59913],
			["Пустая ваза-купол &quotИва&quot", 171627, 57639],
			["Пустая ваза-купол &quotИва&quot", 171759, 57998],
			["Пустая ваза-купол &quotИва&quot", 191235, 61328],
			["Пустая ваза-купол &quotИва&quot", 183618, 3146],
			["Пустая ваза-купол &quotИва&quot", 100535, 25605],
			["Пустая ваза-купол &quotИва&quot", 57644, 9882]
			];
	for (var i = 0; i < hlam466.length; i++) {
				hlam_466 = new L.circleMarker([hlam466[i][1],hlam466[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam466[i][0])
					.bindTooltip(hlam466[i][0], {direction: 'top'})
					.addTo(hlam466icons);
			}
	}
	else {
		hlam466icons.clearLayers();
	}
}
var hlam467icons = L.layerGroup().addTo(map);
function Hlam467OnOff() {
	var chbox467;
	chbox467=document.getElementById('Hlam467Button');
	if (chbox467.checked) {
		var hlam467 = [
			["Пустая ваза-купол &quotЦветы&quot", -44862, -8940],
			["Пустая ваза-купол &quotЦветы&quot", -43147, -6179],
			["Пустая ваза-купол &quotЦветы&quot", -55724, -59981],
			["Пустая ваза-купол &quotЦветы&quot", -39168, -60008],
			["Пустая ваза-купол &quotЦветы&quot", -37100, -58554],
			["Пустая ваза-купол &quotЦветы&quot", -47779, -49167],
			["Пустая ваза-купол &quotЦветы&quot", -47404, -50075],
			["Пустая ваза-купол &quotЦветы&quot", -46952, -49884],
			["Пустая ваза-купол &quotЦветы&quot", -55125, -47832],
			["Пустая ваза-купол &quotЦветы&quot", -110309, -58971],
			["Пустая ваза-купол &quotЦветы&quot", 149596, -76293],
			["Пустая ваза-купол &quotЦветы&quot", 49091, 190413],
			["Пустая ваза-купол &quotЦветы&quot", 486, 167813],
			["Пустая ваза-купол &quotЦветы&quot", 33105, 131258],
			["Пустая ваза-купол &quotЦветы&quot", -29732, 125442],
			["Пустая ваза-купол &quotЦветы&quot", -27742, 124417],
			["Пустая ваза-купол &quotЦветы&quot", -146247, 66060],
			["Пустая ваза-купол &quotЦветы&quot", 196418, 65705],
			["Пустая ваза-купол &quotЦветы&quot", 133737, 85744],
			["Пустая ваза-купол &quotЦветы&quot", 168812, 55945],
			["Пустая ваза-купол &quotЦветы&quot", 170787, 56400],
			["Пустая ваза-купол &quotЦветы&quot", 193713, 56121],
			["Пустая ваза-купол &quotЦветы&quot", 167585, 60056],
			["Пустая ваза-купол &quotЦветы&quot", 170897, 59387],
			["Пустая ваза-купол &quotЦветы&quot", 170788, 57409],
			["Пустая ваза-купол &quotЦветы&quot", 171790, 59414],
			["Пустая ваза-купол &quotЦветы&quot", 169901, 59858],
			["Пустая ваза-купол &quotЦветы&quot", 172185, 59366],
			["Пустая ваза-купол &quotЦветы&quot", 183368, 2944],
			["Пустая ваза-купол &quotЦветы&quot", 186399, 13895],
			["Пустая ваза-купол &quotЦветы&quot", 45891, 101253],
			["Пустая ваза-купол &quotЦветы&quot", 100430, 25599]
			];
	for (var i = 0; i < hlam467.length; i++) {
				hlam_467 = new L.circleMarker([hlam467[i][1],hlam467[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam467[i][0])
					.bindTooltip(hlam467[i][0], {direction: 'top'})
					.addTo(hlam467icons);
			}
	}
	else {
		hlam467icons.clearLayers();
	}
}
var hlam468icons = L.layerGroup().addTo(map);
function Hlam468OnOff() {
	var chbox468;
	chbox468=document.getElementById('Hlam468Button');
	if (chbox468.checked) {
		var hlam468 = [
			["Пустая масленка", -44628, -15719],
			["Пустая масленка", -44611, -15663],
			["Пустая масленка", -77781, -21638],
			["Пустая масленка", -77789, -21621],
			["Пустая масленка", -45832, -50213],
			["Пустая масленка", -51635, -46767],
			["Пустая масленка", -41775, -37806],
			["Пустая масленка", -126255, -45647],
			["Пустая масленка", -119818, -46880],
			["Пустая масленка", -29517, -94488],
			["Пустая масленка", -29820, -93571],
			["Пустая масленка", -29537, -87724],
			["Пустая масленка", -34203, -84081],
			["Пустая масленка", -34653, -83070],
			["Пустая масленка", -35878, -81396],
			["Пустая масленка", -46636, -72898],
			["Пустая масленка", -84738, -80159],
			["Пустая масленка", -71159, -69396],
			["Пустая масленка", -117996, -85288],
			["Пустая масленка", -100155, -66977],
			["Пустая масленка", -97750, -126268],
			["Пустая масленка", -95202, -113808],
			["Пустая масленка", -79099, -105333],
			["Пустая масленка", -103696, -121050],
			["Пустая масленка", -106195, -114734],
			["Пустая масленка", -101794, -114688],
			["Пустая масленка", -117417, -102456],
			["Пустая масленка", -115267, -99145],
			["Пустая масленка", -148169, -57549],
			["Пустая масленка", -159769, -40572],
			["Пустая масленка", -146235, -96009],
			["Пустая масленка", -131500, -92847],
			["Пустая масленка", -151333, -74840],
			["Пустая масленка", -149690, -125788],
			["Пустая масленка", -132226, -121493],
			["Пустая масленка", -132565, -112408],
			["Пустая масленка", -150928, -102099],
			["Пустая масленка", -168113, -112490],
			["Пустая масленка", 188873, -29683],
			["Пустая масленка", 167408, -25393],
			["Пустая масленка", 167781, -25797],
			["Пустая масленка", 167048, -25645],
			["Пустая масленка", 131481, -31643],
			["Пустая масленка", 141227, -289],
			["Пустая масленка", 140488, -2694],
			["Пустая масленка", 160596, -91795],
			["Пустая масленка", 132236, -88729],
			["Пустая масленка", 158226, -68780],
			["Пустая масленка", 180078, -125916],
			["Пустая масленка", 130780, -31781],
			["Пустая масленка", 128790, -28561],
			["Пустая масленка", 127970, -25067],
			["Пустая масленка", 104936, -20667],
			["Пустая масленка", 103077, -11067],
			["Пустая масленка", 88938, -31246],
			["Пустая масленка", 82014, -21229],
			["Пустая масленка", 84763, -18877],
			["Пустая масленка", 94443, -12171],
			["Пустая масленка", 48096, -22170],
			["Пустая масленка", 34113, -6000],
			["Пустая масленка", 35023, -6151],
			["Пустая масленка", 8442, -30286],
			["Пустая масленка", 111678, -56098],
			["Пустая масленка", 111082, -55656],
			["Пустая масленка", 111609, -55493],
			["Пустая масленка", 111281, -55220],
			["Пустая масленка", 90207, -56921],
			["Пустая масленка", 62021, -58504],
			["Пустая масленка", 24909, -63568],
			["Пустая масленка", 29199, -58691],
			["Пустая масленка", 57272, -94340],
			["Пустая масленка", 57736, -94643],
			["Пустая масленка", 55864, -66151],
			["Пустая масленка", 782, -86526],
			["Пустая масленка", 108549, -100684],
			["Пустая масленка", 70118, -105098],
			["Пустая масленка", 37129, -119094],
			["Пустая масленка", 38144, -119151],
			["Пустая масленка", 9468, -107116],
			["Пустая масленка", 22571, -101975],
			["Пустая масленка", -4034, -155754],
			["Пустая масленка", -55295, -160597],
			["Пустая масленка", -93777, -163360],
			["Пустая масленка", -93058, -163489],
			["Пустая масленка", -93476, -131191],
			["Пустая масленка", -73088, -132587],
			["Пустая масленка", -72207, -132858],
			["Пустая масленка", -116693, -137345],
			["Пустая масленка", -122556, -132821],
			["Пустая масленка", -1244, -164897],
			["Пустая масленка", -111299, -177489],
			["Пустая масленка", -111307, -177473],
			["Пустая масленка", 194263, -144888],
			["Пустая масленка", 194258, -144910],
			["Пустая масленка", 194212, -144957],
			["Пустая масленка", 194193, -144946],
			["Пустая масленка", 174265, -139303],
			["Пустая масленка", 131357, -131865],
			["Пустая масленка", 131096, -131849],
			["Пустая масленка", 189985, -169707],
			["Пустая масленка", 191687, -169291],
			["Пустая масленка", 189068, -165396],
			["Пустая масленка", 115349, -157998],
			["Пустая масленка", 52094, -149218],
			["Пустая масленка", 19409, -142041],
			["Пустая масленка", 76174, -177364],
			["Пустая масленка", -64101, 202619],
			["Пустая масленка", -16975, 163982],
			["Пустая масленка", -23392, 188907],
			["Пустая масленка", -13374, 189207],
			["Пустая масленка", -13389, 189185],
			["Пустая масленка", -13822, 189066],
			["Пустая масленка", -55375, 165139],
			["Пустая масленка", -38957, 190286],
			["Пустая масленка", -39400, 190284],
			["Пустая масленка", -93138, 179569],
			["Пустая масленка", -97370, 184204],
			["Пустая масленка", -90241, 180733],
			["Пустая масленка", -88608, 185188],
			["Пустая масленка", -94982, 190454],
			["Пустая масленка", -98503, 183626],
			["Пустая масленка", -19892, 145770],
			["Пустая масленка", -2754, 158374],
			["Пустая масленка", -5901, 160720],
			["Пустая масленка", -63898, 131610],
			["Пустая масленка", -42704, 137701],
			["Пустая масленка", -37940, 159596],
			["Пустая масленка", -41475, 161165],
			["Пустая масленка", -40949, 161741],
			["Пустая масленка", -109780, 132811],
			["Пустая масленка", -155450, 165413],
			["Пустая масленка", -163439, 141933],
			["Пустая масленка", -163172, 157127],
			["Пустая масленка", 162631, 206529],
			["Пустая масленка", 179048, 133037],
			["Пустая масленка", 146819, 136281],
			["Пустая масленка", 147649, 137899],
			["Пустая масленка", 150531, 141253],
			["Пустая масленка", 15784, 197711],
			["Пустая масленка", 97331, 193339],
			["Пустая масленка", 6167, 164201],
			["Пустая масленка", 26566, 172071],
			["Пустая масленка", 11078, 183984],
			["Пустая масленка", 14399, 195876],
			["Пустая масленка", 48212, 162799],
			["Пустая масленка", 19938, 134576],
			["Пустая масленка", 22568, 134001],
			["Пустая масленка", 230, 139655],
			["Пустая масленка", 239, 139650],
			["Пустая масленка", 245, 139663],
			["Пустая масленка", 236, 139668],
			["Пустая масленка", -86641, 115336],
			["Пустая масленка", -65638, 129730],
			["Пустая масленка", -129017, 120070],
			["Пустая масленка", -129516, 119260],
			["Пустая масленка", -129280, 119093],
			["Пустая масленка", -103412, 121492],
			["Пустая масленка", -129640, 130912],
			["Пустая масленка", -37859, 84789],
			["Пустая масленка", -37581, 84790],
			["Пустая масленка", -63801, 87010],
			["Пустая масленка", -41708, 88097],
			["Пустая масленка", -33966, 92151],
			["Пустая масленка", -88020, 67541],
			["Пустая масленка", -87860, 67498],
			["Пустая масленка", -128051, 80415],
			["Пустая масленка", -52778, 55281],
			["Пустая масленка", -65768, 35899],
			["Пустая масленка", -68489, 55867],
			["Пустая масленка", -103339, 38585],
			["Пустая масленка", -25114, 11753],
			["Пустая масленка", -24186, 10214],
			["Пустая масленка", -46891, 2589],
			["Пустая масленка", -48190, 2201],
			["Пустая масленка", -42239, 2657],
			["Пустая масленка", -47971, 15365],
			["Пустая масленка", -34467, 13586],
			["Пустая масленка", -53961, 22200],
			["Пустая масленка", -118484, 730],
			["Пустая масленка", -148779, 113651],
			["Пустая масленка", -153891, 130033],
			["Пустая масленка", -138276, 88052],
			["Пустая масленка", -139745, 90835],
			["Пустая масленка", -132334, 10579],
			["Пустая масленка", 183533, 112313],
			["Пустая масленка", 182359, 111179],
			["Пустая масленка", 182375, 112696],
			["Пустая масленка", 183017, 112216],
			["Пустая масленка", 134823, 127001],
			["Пустая масленка", 168620, 59075],
			["Пустая масленка", 194042, 58326],
			["Пустая масленка", 160477, 58505],
			["Пустая масленка", 170899, 1554],
			["Пустая масленка", 132539, 20893],
			["Пустая масленка", 87857, 105680],
			["Пустая масленка", 88442, 104929],
			["Пустая масленка", 29210, 129621],
			["Пустая масленка", 110321, 55456],
			["Пустая масленка", 111006, 57877],
			["Пустая масленка", 80105, 55476],
			["Пустая масленка", 80062, 55645],
			["Пустая масленка", 16116, 45822],
			["Пустая масленка", 103333, 3842],
			["Пустая масленка", 130544, 19130],
			["Пустая масленка", 128733, 19324],
			["Пустая масленка", 100723, 27258],
			["Пустая масленка", 92526, 32154]
			];
	for (var i = 0; i < hlam468.length; i++) {
				hlam_468 = new L.circleMarker([hlam468[i][1],hlam468[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam468[i][0])
					.bindTooltip(hlam468[i][0], {direction: 'top'})
					.addTo(hlam468icons);
			}
	}
	else {
		hlam468icons.clearLayers();
	}
}
var hlam469icons = L.layerGroup().addTo(map);
function Hlam469OnOff() {
	var chbox469;
	chbox469=document.getElementById('Hlam469Button');
	if (chbox469.checked) {
		var hlam469 = [
			["Пустая округлая ваза &quotИва&quot", -46933, -50684],
			["Пустая округлая ваза &quotИва&quot", -110289, -59028],
			["Пустая округлая ваза &quotИва&quot", -13601, -66655],
			["Пустая округлая ваза &quotИва&quot", -61385, -100430],
			["Пустая округлая ваза &quotИва&quot", -61396, -101195],
			["Пустая округлая ваза &quotИва&quot", -61026, -100608],
			["Пустая округлая ваза &quotИва&quot", 154378, -32308],
			["Пустая округлая ваза &quotИва&quot", 148463, -79690],
			["Пустая округлая ваза &quotИва&quot", 149051, -76156],
			["Пустая округлая ваза &quotИва&quot", 149804, -67357],
			["Пустая округлая ваза &quotИва&quot", 50265, -22977],
			["Пустая округлая ваза &quotИва&quot", -139498, -143879],
			["Пустая округлая ваза &quotИва&quot", 74130, -179069],
			["Пустая округлая ваза &quotИва&quot", -59980, 180205],
			["Пустая округлая ваза &quotИва&quot", -60774, 181034],
			["Пустая округлая ваза &quotИва&quot", -29446, 125238],
			["Пустая округлая ваза &quotИва&quot", -29877, 125407],
			["Пустая округлая ваза &quotИва&quot", -99410, 7852],
			["Пустая округлая ваза &quotИва&quot", 193738, 57953],
			["Пустая округлая ваза &quotИва&quot", 183276, 3712],
			["Пустая округлая ваза &quotИва&quot", 23211, 43430]
			];
	for (var i = 0; i < hlam469.length; i++) {
				hlam_469 = new L.circleMarker([hlam469[i][1],hlam469[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam469[i][0])
					.bindTooltip(hlam469[i][0], {direction: 'top'})
					.addTo(hlam469icons);
			}
	}
	else {
		hlam469icons.clearLayers();
	}
}
var hlam470icons = L.layerGroup().addTo(map);
function Hlam470OnOff() {
	var chbox470;
	chbox470=document.getElementById('Hlam470Button');
	if (chbox470.checked) {
		var hlam470 = [
			["Пустая округлая ваза &quotЦветы&quot", -2120, -5362],
			["Пустая округлая ваза &quotЦветы&quot", -19046, -43417],
			["Пустая округлая ваза &quotЦветы&quot", -38128, -59751],
			["Пустая округлая ваза &quotЦветы&quot", -55168, -47815],
			["Пустая округлая ваза &quotЦветы&quot", -55226, -48618],
			["Пустая округлая ваза &quotЦветы&quot", -110309, -59007],
			["Пустая округлая ваза &quotЦветы&quot", 168565, -24374],
			["Пустая округлая ваза &quotЦветы&quot", 94484, -11302],
			["Пустая округлая ваза &quotЦветы&quot", 18418, -1030],
			["Пустая округлая ваза &quotЦветы&quot", 18159, -486],
			["Пустая округлая ваза &quotЦветы&quot", 74186, -179250],
			["Пустая округлая ваза &quotЦветы&quot", -29451, 125196],
			["Пустая округлая ваза &quotЦветы&quot", -29783, 125423],
			["Пустая округлая ваза &quotЦветы&quot", 167165, 59761],
			["Пустая округлая ваза &quotЦветы&quot", 172557, 57858],
			["Пустая округлая ваза &quotЦветы&quot", 172127, 58195],
			["Пустая округлая ваза &quotЦветы&quot", 172362, 58323],
			["Пустая округлая ваза &quotЦветы&quot", 24409, 121878],
			["Пустая округлая ваза &quotЦветы&quot", 30110, 119837],
			["Пустая округлая ваза &quotЦветы&quot", 25326, 124715],
			["Пустая округлая ваза &quotЦветы&quot", 25074, 124636],
			["Пустая округлая ваза &quotЦветы&quot", 16378, 44603]
			];
	for (var i = 0; i < hlam470.length; i++) {
				hlam_470 = new L.circleMarker([hlam470[i][1],hlam470[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam470[i][0])
					.bindTooltip(hlam470[i][0], {direction: 'top'})
					.addTo(hlam470icons);
			}
	}
	else {
		hlam470icons.clearLayers();
	}
}
var hlam471icons = L.layerGroup().addTo(map);
function Hlam471OnOff() {
	var chbox471;
	chbox471=document.getElementById('Hlam471Button');
	if (chbox471.checked) {
		var hlam471 = [
			["Пустая расширяющаяся ваза &quotИва&quot", -52737, -13642],
			["Пустая расширяющаяся ваза &quotИва&quot", -44867, -9057],
			["Пустая расширяющаяся ваза &quotИва&quot", -44811, -8546],
			["Пустая расширяющаяся ваза &quotИва&quot", -61351, -55966],
			["Пустая расширяющаяся ваза &quotИва&quot", -110302, -59048],
			["Пустая расширяющаяся ваза &quotИва&quot", 149305, -75751],
			["Пустая расширяющаяся ваза &quotИва&quot", 149391, -75789],
			["Пустая расширяющаяся ваза &quotИва&quot", 50949, -40882],
			["Пустая расширяющаяся ваза &quotИва&quot", 60132, -96604],
			["Пустая расширяющаяся ваза &quotИва&quot", 22176, -105500],
			["Пустая расширяющаяся ваза &quotИва&quot", -27725, -131733],
			["Пустая расширяющаяся ваза &quotИва&quot", 74167, -179249],
			["Пустая расширяющаяся ваза &quotИва&quot", -29452, 125167],
			["Пустая расширяющаяся ваза &quotИва&quot", -29856, 125431],
			["Пустая расширяющаяся ваза &quotИва&quot", 196791, 65601],
			["Пустая расширяющаяся ваза &quotИва&quot", 193848, 56245],
			["Пустая расширяющаяся ваза &quotИва&quot", 182882, 2839],
			["Пустая расширяющаяся ваза &quotИва&quot", 182679, 3092],
			["Пустая расширяющаяся ваза &quotИва&quot", 182622, 3167],
			["Пустая расширяющаяся ваза &quotИва&quot", 98094, 106413]
			];
	for (var i = 0; i < hlam471.length; i++) {
				hlam_471 = new L.circleMarker([hlam471[i][1],hlam471[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam471[i][0])
					.bindTooltip(hlam471[i][0], {direction: 'top'})
					.addTo(hlam471icons);
			}
	}
	else {
		hlam471icons.clearLayers();
	}
}
var hlam472icons = L.layerGroup().addTo(map);
function Hlam472OnOff() {
	var chbox472;
	chbox472=document.getElementById('Hlam472Button');
	if (chbox472.checked) {
		var hlam472 = [
			["Пустая расширяющаяся ваза &quotЦветы&quot", -39389, -61648],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -35993, -57014],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -110328, -58910],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -110368, -58845],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -13065, -65863],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 77819, -11222],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -29751, 125456],
			["Пустая расширяющаяся ваза &quotЦветы&quot", -49638, 10482],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 196411, 65743],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 171200, 58292],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 171631, 57624],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 171752, 57984],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 172460, 58015],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 183159, 2792],
			["Пустая расширяющаяся ваза &quotЦветы&quot", 24326, 121590]
			];
	for (var i = 0; i < hlam472.length; i++) {
				hlam_472 = new L.circleMarker([hlam472[i][1],hlam472[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam472[i][0])
					.bindTooltip(hlam472[i][0], {direction: 'top'})
					.addTo(hlam472icons);
			}
	}
	else {
		hlam472icons.clearLayers();
	}
}
var hlam473icons = L.layerGroup().addTo(map);
function Hlam473OnOff() {
	var chbox473;
	chbox473=document.getElementById('Hlam473Button');
	if (chbox473.checked) {
		var hlam473 = [
			["Пустая сине-зеленая ваза-бутон", -55668, -48754],
			["Пустая сине-зеленая ваза-бутон", -61540, -100177],
			["Пустая сине-зеленая ваза-бутон", -47889, -101318],
			["Пустая сине-зеленая ваза-бутон", 149787, -67439],
			["Пустая сине-зеленая ваза-бутон", 149790, -67469],
			["Пустая сине-зеленая ваза-бутон", 84938, 151093],
			["Пустая сине-зеленая ваза-бутон", -29843, 125440],
			["Пустая сине-зеленая ваза-бутон", -98945, 8157],
			["Пустая сине-зеленая ваза-бутон", 183632, 3050],
			["Пустая сине-зеленая ваза-бутон", 183613, 3073],
			["Пустая сине-зеленая ваза-бутон", 23200, 43415]
			];
	for (var i = 0; i < hlam473.length; i++) {
				hlam_473 = new L.circleMarker([hlam473[i][1],hlam473[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam473[i][0])
					.bindTooltip(hlam473[i][0], {direction: 'top'})
					.addTo(hlam473icons);
			}
	}
	else {
		hlam473icons.clearLayers();
	}
}
var hlam474icons = L.layerGroup().addTo(map);
function Hlam474OnOff() {
	var chbox474;
	chbox474=document.getElementById('Hlam474Button');
	if (chbox474.checked) {
		var hlam474 = [
			["Пустая сине-зеленая ваза-купол", -110341, -58884],
			["Пустая сине-зеленая ваза-купол", -49647, -74872],
			["Пустая сине-зеленая ваза-купол", -61558, -100200],
			["Пустая сине-зеленая ваза-купол", -47898, -101302],
			["Пустая сине-зеленая ваза-купол", -148293, -54996],
			["Пустая сине-зеленая ваза-купол", 50855, -22999],
			["Пустая сине-зеленая ваза-купол", 50530, -23061],
			["Пустая сине-зеленая ваза-купол", 29087, -58450],
			["Пустая сине-зеленая ваза-купол", 74144, -179025],
			["Пустая сине-зеленая ваза-купол", 74275, -179261],
			["Пустая сине-зеленая ваза-купол", -32818, 171507],
			["Пустая сине-зеленая ваза-купол", -143287, 157289],
			["Пустая сине-зеленая ваза-купол", -29712, 125464],
			["Пустая сине-зеленая ваза-купол", 15976, 43619],
			["Пустая сине-зеленая ваза-купол", 23274, 43542],
			["Пустая сине-зеленая ваза-купол", 100120, 26312]
			];
	for (var i = 0; i < hlam474.length; i++) {
				hlam_474 = new L.circleMarker([hlam474[i][1],hlam474[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam474[i][0])
					.bindTooltip(hlam474[i][0], {direction: 'top'})
					.addTo(hlam474icons);
			}
	}
	else {
		hlam474icons.clearLayers();
	}
}
var hlam475icons = L.layerGroup().addTo(map);
function Hlam475OnOff() {
	var chbox475;
	chbox475=document.getElementById('Hlam475Button');
	if (chbox475.checked) {
		var hlam475 = [
			["Пустая сине-зеленая округлая ваза", -55403, -59887],
			["Пустая сине-зеленая округлая ваза", -55652, -48747],
			["Пустая сине-зеленая округлая ваза", -110329, -58950],
			["Пустая сине-зеленая округлая ваза", -47908, -101282],
			["Пустая сине-зеленая округлая ваза", 29101, -58460],
			["Пустая сине-зеленая округлая ваза", -144428, 137609],
			["Пустая сине-зеленая округлая ваза", 4049, 167165],
			["Пустая сине-зеленая округлая ваза", 84939, 151111],
			["Пустая сине-зеленая округлая ваза", -29887, 125383],
			["Пустая сине-зеленая округлая ваза", 132930, 85201],
			["Пустая сине-зеленая округлая ваза", 182762, 2994],
			["Пустая сине-зеленая округлая ваза", 23296, 43581]
			];
	for (var i = 0; i < hlam475.length; i++) {
				hlam_475 = new L.circleMarker([hlam475[i][1],hlam475[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam475[i][0])
					.bindTooltip(hlam475[i][0], {direction: 'top'})
					.addTo(hlam475icons);
			}
	}
	else {
		hlam475icons.clearLayers();
	}
}
var hlam476icons = L.layerGroup().addTo(map);
function Hlam476OnOff() {
	var chbox476;
	chbox476=document.getElementById('Hlam476Button');
	if (chbox476.checked) {
		var hlam476 = [
			["Пустая сине-зеленая расширяющаяся ваза", -7775, -13545],
			["Пустая сине-зеленая расширяющаяся ваза", -63519, -103196],
			["Пустая сине-зеленая расширяющаяся ваза", -61548, -100187],
			["Пустая сине-зеленая расширяющаяся ваза", 160655, -58702],
			["Пустая сине-зеленая расширяющаяся ваза", 50277, -22984],
			["Пустая сине-зеленая расширяющаяся ваза", 50616, -23116],
			["Пустая сине-зеленая расширяющаяся ваза", -32884, 171730],
			["Пустая сине-зеленая расширяющаяся ваза", -27376, 162875],
			["Пустая сине-зеленая расширяющаяся ваза", 1958, 138533],
			["Пустая сине-зеленая расширяющаяся ваза", -29756, 125428],
			["Пустая сине-зеленая расширяющаяся ваза", 182818, 2915]
			];
	for (var i = 0; i < hlam476.length; i++) {
				hlam_476 = new L.circleMarker([hlam476[i][1],hlam476[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam476[i][0])
					.bindTooltip(hlam476[i][0], {direction: 'top'})
					.addTo(hlam476icons);
			}
	}
	else {
		hlam476icons.clearLayers();
	}
}
var hlam477icons = L.layerGroup().addTo(map);
function Hlam477OnOff() {
	var chbox477;
	chbox477=document.getElementById('Hlam477Button');
	if (chbox477.checked) {
		var hlam477 = [
			["Пустая сине-зеленая цилиндрическая ваза", -110355, -58839],
			["Пустая сине-зеленая цилиндрическая ваза", 151156, 135915],
			["Пустая сине-зеленая цилиндрическая ваза", 151671, 136831],
			["Пустая сине-зеленая цилиндрическая ваза", 151590, 136868],
			["Пустая сине-зеленая цилиндрическая ваза", 3464, 166750],
			["Пустая сине-зеленая цилиндрическая ваза", -29466, 125218],
			["Пустая сине-зеленая цилиндрическая ваза", -29837, 125487],
			["Пустая сине-зеленая цилиндрическая ваза", 167749, 59909],
			["Пустая сине-зеленая цилиндрическая ваза", 182866, 3811]
			];
	for (var i = 0; i < hlam477.length; i++) {
				hlam_477 = new L.circleMarker([hlam477[i][1],hlam477[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam477[i][0])
					.bindTooltip(hlam477[i][0], {direction: 'top'})
					.addTo(hlam477icons);
			}
	}
	else {
		hlam477icons.clearLayers();
	}
}
var hlam478icons = L.layerGroup().addTo(map);
function Hlam478OnOff() {
	var chbox478;
	chbox478=document.getElementById('Hlam478Button');
	if (chbox478.checked) {
		var hlam478 = [
			["Пустая цилиндрическая ваза &quotИва&quot", -52697, -14009],
			["Пустая цилиндрическая ваза &quotИва&quot", -52315, -13982],
			["Пустая цилиндрическая ваза &quotИва&quot", -51783, -14274],
			["Пустая цилиндрическая ваза &quotИва&quot", -52348, -14288],
			["Пустая цилиндрическая ваза &quotИва&quot", -52023, -14283],
			["Пустая цилиндрическая ваза &quotИва&quot", -53088, -14112],
			["Пустая цилиндрическая ваза &quotИва&quot", -53086, -14036],
			["Пустая цилиндрическая ваза &quotИва&quot", -52513, -13239],
			["Пустая цилиндрическая ваза &quotИва&quot", -52446, -12983],
			["Пустая цилиндрическая ваза &quotИва&quot", -51944, -13171],
			["Пустая цилиндрическая ваза &quotИва&quot", -45131, -8966],
			["Пустая цилиндрическая ваза &quotИва&quot", -43089, -6220],
			["Пустая цилиндрическая ваза &quotИва&quot", 183579, -93316],
			["Пустая цилиндрическая ваза &quotИва&quot", 77829, -11233],
			["Пустая цилиндрическая ваза &quotИва&quot", 18143, -485],
			["Пустая цилиндрическая ваза &quotИва&quot", -1760, -159657],
			["Пустая цилиндрическая ваза &quotИва&quot", -59078, 181035],
			["Пустая цилиндрическая ваза &quotИва&quot", -59146, 180244],
			["Пустая цилиндрическая ваза &quotИва&quot", -61043, 181923],
			["Пустая цилиндрическая ваза &quotИва&quot", 3423, 166788],
			["Пустая цилиндрическая ваза &quotИва&quot", -29524, 125121],
			["Пустая цилиндрическая ваза &quotИва&quot", -29790, 125437],
			["Пустая цилиндрическая ваза &quotИва&quot", -39296, 44447],
			["Пустая цилиндрическая ваза &quotИва&quot", -38803, 3626],
			["Пустая цилиндрическая ваза &quotИва&quot", -42836, 12001],
			["Пустая цилиндрическая ваза &quotИва&quot", 132942, 85190],
			["Пустая цилиндрическая ваза &quotИва&quot", 132235, 84690],
			["Пустая цилиндрическая ваза &quotИва&quot", 100488, 25604],
			["Пустая цилиндрическая ваза &quotИва&quot", 75234, 9797]
			];
	for (var i = 0; i < hlam478.length; i++) {
				hlam_478 = new L.circleMarker([hlam478[i][1],hlam478[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam478[i][0])
					.bindTooltip(hlam478[i][0], {direction: 'top'})
					.addTo(hlam478icons);
			}
	}
	else {
		hlam478icons.clearLayers();
	}
}
var hlam479icons = L.layerGroup().addTo(map);
function Hlam479OnOff() {
	var chbox479;
	chbox479=document.getElementById('Hlam479Button');
	if (chbox479.checked) {
		var hlam479 = [
			["Пустая цилиндрическая ваза &quotЦветы&quot", -61424, -100381],
			["Пустая цилиндрическая ваза &quotЦветы&quot", 51518, -40683],
			["Пустая цилиндрическая ваза &quotЦветы&quot", -27734, -131741],
			["Пустая цилиндрическая ваза &quotЦветы&quot", -29768, 125424],
			["Пустая цилиндрическая ваза &quotЦветы&quot", -27733, 124447],
			["Пустая цилиндрическая ваза &quotЦветы&quot", -39260, 4542],
			["Пустая цилиндрическая ваза &quotЦветы&quot", -39751, 6339],
			["Пустая цилиндрическая ваза &quotЦветы&quot", 198545, 44969],
			["Пустая цилиндрическая ваза &quotЦветы&quot", 171806, 59422],
			["Пустая цилиндрическая ваза &quotЦветы&quot", 172473, 58020],
			["Пустая цилиндрическая ваза &quotЦветы&quot", 100512, 26055]
			];
	for (var i = 0; i < hlam479.length; i++) {
				hlam_479 = new L.circleMarker([hlam479[i][1],hlam479[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam479[i][0])
					.bindTooltip(hlam479[i][0], {direction: 'top'})
					.addTo(hlam479icons);
			}
	}
	else {
		hlam479icons.clearLayers();
	}
}
var hlam480icons = L.layerGroup().addTo(map);
function Hlam480OnOff() {
	var chbox480;
	chbox480=document.getElementById('Hlam480Button');
	if (chbox480.checked) {
		var hlam480 = [
			["Пустой пакет из-под крови", -978, -34857],
			["Пустой пакет из-под крови", -110650, -60618],
			["Пустой пакет из-под крови", -35255, -80398],
			["Пустой пакет из-под крови", -60974, -100698],
			["Пустой пакет из-под крови", -133463, -121929],
			["Пустой пакет из-под крови", 113840, -56142],
			["Пустой пакет из-под крови", 113837, -56091],
			["Пустой пакет из-под крови", 113517, -55832],
			["Пустой пакет из-под крови", 74302, -177779],
			["Пустой пакет из-под крови", 74990, -172421],
			["Пустой пакет из-под крови", 75014, -172416],
			["Пустой пакет из-под крови", 74614, -172383],
			["Пустой пакет из-под крови", -20911, 150685],
			["Пустой пакет из-под крови", -90481, 149324],
			["Пустой пакет из-под крови", -90485, 149338],
			["Пустой пакет из-под крови", -90254, 149323],
			["Пустой пакет из-под крови", 193004, 113295],
			["Пустой пакет из-под крови", 193181, 113281],
			["Пустой пакет из-под крови", 115254, 111194],
			["Пустой пакет из-под крови", 70414, 37190],
			["Пустой пакет из-под крови", 70320, 37378],
			["Пустой пакет из-под крови", 58353, 11730]
			];
	for (var i = 0; i < hlam480.length; i++) {
				hlam_480 = new L.circleMarker([hlam480[i][1],hlam480[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam480[i][0])
					.bindTooltip(hlam480[i][0], {direction: 'top'})
					.addTo(hlam480icons);
			}
	}
	else {
		hlam480icons.clearLayers();
	}
}
var hlam481icons = L.layerGroup().addTo(map);
function Hlam481OnOff() {
	var chbox481;
	chbox481=document.getElementById('Hlam481Button');
	if (chbox481.checked) {
		var hlam481 = [
			["Рад-мишка", -24582, -3106],
			["Рад-мишка", -8151, -3379],
			["Рад-мишка", -36198, -17515],
			["Рад-мишка", -90964, -42278],
			["Рад-мишка", -24019, -73030],
			["Рад-мишка", -167928, -115083],
			["Рад-мишка", 147438, -78238],
			["Рад-мишка", 105102, -15514],
			["Рад-мишка", 82138, -21617],
			["Рад-мишка", -41985, -161919],
			["Рад-мишка", -115804, -187334],
			["Рад-мишка", 143097, -151187],
			["Рад-мишка", 80096, -149893],
			["Рад-мишка", -160381, 152246],
			["Рад-мишка", -29080, 125170],
			["Рад-мишка", -69571, 110887],
			["Рад-мишка", 202575, 54532],
			["Рад-мишка", 202575, 54636],
			["Рад-мишка", -44636, -54738],
			["Рад-мишка", -89738, 82664],
			["Рад-мишка", 18759, -123091],
			["Рад-мишка", -59242, 123218]
			];
	for (var i = 0; i < hlam481.length; i++) {
				hlam_481 = new L.circleMarker([hlam481[i][1],hlam481[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam481[i][0])
					.bindTooltip(hlam481[i][0], {direction: 'top'})
					.addTo(hlam481icons);
			}
	}
	else {
		hlam481icons.clearLayers();
	}
}
var hlam482icons = L.layerGroup().addTo(map);
function Hlam482OnOff() {
	var chbox482;
	chbox482=document.getElementById('Hlam482Button');
	if (chbox482.checked) {
		var hlam482 = [
			["Разбитая желтая канистра", -44818, -15771],
			["Разбитая желтая канистра", -44781, -15782],
			["Разбитая желтая канистра", -47306, -6448],
			["Разбитая желтая канистра", -59909, -57082],
			["Разбитая желтая канистра", -51448, -46496],
			["Разбитая желтая канистра", -110070, -57743],
			["Разбитая желтая канистра", -126266, -45635],
			["Разбитая желтая канистра", -29824, -87068],
			["Разбитая желтая канистра", -36279, -80780],
			["Разбитая желтая канистра", -121790, -66428],
			["Разбитая желтая канистра", -1776, -130363],
			["Разбитая желтая канистра", -1295, -130156],
			["Разбитая желтая канистра", -15738, -124877],
			["Разбитая желтая канистра", -10287, -123877],
			["Разбитая желтая канистра", -10304, -123873],
			["Разбитая желтая канистра", -86034, -116638],
			["Разбитая желтая канистра", -88886, -107006],
			["Разбитая желтая канистра", -110888, -112658],
			["Разбитая желтая канистра", -110371, -112834],
			["Разбитая желтая канистра", -166756, -14200],
			["Разбитая желтая канистра", -131826, -113530],
			["Разбитая желтая канистра", -168157, -112490],
			["Разбитая желтая канистра", 175874, -14676],
			["Разбитая желтая канистра", 157948, -68917],
			["Разбитая желтая канистра", 127916, -24909],
			["Разбитая желтая канистра", 130044, -27259],
			["Разбитая желтая канистра", 88927, -30980],
			["Разбитая желтая канистра", 88949, -31297],
			["Разбитая желтая канистра", 90271, -27677],
			["Разбитая желтая канистра", 97084, -13435],
			["Разбитая желтая канистра", 48034, -22253],
			["Разбитая желтая канистра", 34905, -6725],
			["Разбитая желтая канистра", 5536, -32469],
			["Разбитая желтая канистра", 9049, -30311],
			["Разбитая желтая канистра", 111701, -55287],
			["Разбитая желтая канистра", 36067, -35410],
			["Разбитая желтая канистра", 12939, -92019],
			["Разбитая желтая канистра", 29232, -84038],
			["Разбитая желтая канистра", 29212, -83939],
			["Разбитая желтая канистра", 101333, -100418],
			["Разбитая желтая канистра", 20974, -110039],
			["Разбитая желтая канистра", -4357, -156021],
			["Разбитая желтая канистра", -4350, -156042],
			["Разбитая желтая канистра", -27709, -131405],
			["Разбитая желтая канистра", -61304, -144865],
			["Разбитая желтая канистра", -93776, -163362],
			["Разбитая желтая канистра", -124643, -136495],
			["Разбитая желтая канистра", -1153, -164750],
			["Разбитая желтая канистра", -42257, -172796],
			["Разбитая желтая канистра", -42114, -172953],
			["Разбитая желтая канистра", -42093, -172949],
			["Разбитая желтая канистра", -81726, -179677],
			["Разбитая желтая канистра", 197195, -143315],
			["Разбитая желтая канистра", 164444, -150419],
			["Разбитая желтая канистра", 188562, -165396],
			["Разбитая желтая канистра", 27649, -137670],
			["Разбитая желтая канистра", 28261, -138278],
			["Разбитая желтая канистра", -38790, 190280],
			["Разбитая желтая канистра", -38663, 190308],
			["Разбитая желтая канистра", -83602, 165776],
			["Разбитая желтая канистра", -83961, 166190],
			["Разбитая желтая канистра", -83787, 165785],
			["Разбитая желтая канистра", -97532, 179167],
			["Разбитая желтая канистра", -96695, 189943],
			["Разбитая желтая канистра", -27357, 162907],
			["Разбитая желтая канистра", -38113, 159600],
			["Разбитая желтая канистра", -139342, 171831],
			["Разбитая желтая канистра", -146351, 172721],
			["Разбитая желтая канистра", 145241, 141466],
			["Разбитая желтая канистра", 153132, 141709],
			["Разбитая желтая канистра", 79956, 184446],
			["Разбитая желтая канистра", 3083, 181951],
			["Разбитая желтая канистра", -59602, 117304],
			["Разбитая желтая канистра", -59592, 117287],
			["Разбитая желтая канистра", -59766, 117479],
			["Разбитая желтая канистра", -59760, 117471],
			["Разбитая желтая канистра", -48274, 1935],
			["Разбитая желтая канистра", -47852, 1201],
			["Разбитая желтая канистра", -34678, 13028],
			["Разбитая желтая канистра", -121442, 3708],
			["Разбитая желтая канистра", -129328, 29007],
			["Разбитая желтая канистра", -138215, 88124],
			["Разбитая желтая канистра", -138209, 88137],
			["Разбитая желтая канистра", -138219, 88113],
			["Разбитая желтая канистра", -139095, 88491],
			["Разбитая желтая канистра", 137076, 43215],
			["Разбитая желтая канистра", 171146, 1454],
			["Разбитая желтая канистра", 170847, 1565],
			["Разбитая желтая канистра", 183464, 2917],
			["Разбитая желтая канистра", 95132, 98834],
			["Разбитая желтая канистра", 93290, 103169],
			["Разбитая желтая канистра", 109888, 57676],
			["Разбитая желтая канистра", 115245, 62951],
			["Разбитая желтая канистра", 15899, 45109],
			["Разбитая желтая канистра", 41337, 23195]
			];
	for (var i = 0; i < hlam482.length; i++) {
				hlam_482 = new L.circleMarker([hlam482[i][1],hlam482[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam482[i][0])
					.bindTooltip(hlam482[i][0], {direction: 'top'})
					.addTo(hlam482icons);
			}
	}
	else {
		hlam482icons.clearLayers();
	}
}
var hlam483icons = L.layerGroup().addTo(map);
function Hlam483OnOff() {
	var chbox483;
	chbox483=document.getElementById('Hlam483Button');
	if (chbox483.checked) {
		var hlam483 = [
			["Разбитая канистра с ацетоном", -55535, -2188],
			["Разбитая канистра с ацетоном", -38017, -60388],
			["Разбитая канистра с ацетоном", -51536, -46904],
			["Разбитая канистра с ацетоном", -120744, -65176],
			["Разбитая канистра с ацетоном", -110068, -57763],
			["Разбитая канистра с ацетоном", -119577, -46699],
			["Разбитая канистра с ацетоном", -18465, -75602],
			["Разбитая канистра с ацетоном", -35187, -80636],
			["Разбитая канистра с ацетоном", -129919, -91939],
			["Разбитая канистра с ацетоном", -121798, -66257],
			["Разбитая канистра с ацетоном", -15646, -125210],
			["Разбитая канистра с ацетоном", -132198, -112276],
			["Разбитая канистра с ацетоном", 131493, -31546],
			["Разбитая канистра с ацетоном", 127966, -25089],
			["Разбитая канистра с ацетоном", 129255, -28472],
			["Разбитая канистра с ацетоном", 102756, -11239],
			["Разбитая канистра с ацетоном", 84722, -18729],
			["Разбитая канистра с ацетоном", 88090, -5018],
			["Разбитая канистра с ацетоном", 48716, -22162],
			["Разбитая канистра с ацетоном", 48225, -22277],
			["Разбитая канистра с ацетоном", 111278, -55221],
			["Разбитая канистра с ацетоном", 36070, -35397],
			["Разбитая канистра с ацетоном", 60914, -98812],
			["Разбитая канистра с ацетоном", 60737, -99146],
			["Разбитая канистра с ацетоном", 15740, -107570],
			["Разбитая канистра с ацетоном", -6989, -161535],
			["Разбитая канистра с ацетоном", -7014, -161529],
			["Разбитая канистра с ацетоном", -4538, -156118],
			["Разбитая канистра с ацетоном", -122110, -136594],
			["Разбитая канистра с ацетоном", -115691, -136475],
			["Разбитая канистра с ацетоном", -1560, -164332],
			["Разбитая канистра с ацетоном", -1325, -164970],
			["Разбитая канистра с ацетоном", -42852, -175752],
			["Разбитая канистра с ацетоном", -42873, -174127],
			["Разбитая канистра с ацетоном", -42190, -172863],
			["Разбитая канистра с ацетоном", -76542, -184227],
			["Разбитая канистра с ацетоном", -82577, -178102],
			["Разбитая канистра с ацетоном", -81243, -179140],
			["Разбитая канистра с ацетоном", -80867, -179308],
			["Разбитая канистра с ацетоном", 164480, -150438],
			["Разбитая канистра с ацетоном", 189036, -169150],
			["Разбитая канистра с ацетоном", 188668, -164973],
			["Разбитая канистра с ацетоном", 28231, -138343],
			["Разбитая канистра с ацетоном", -61631, 182365],
			["Разбитая канистра с ацетоном", -60016, 180439],
			["Разбитая канистра с ацетоном", -97380, 179446],
			["Разбитая канистра с ацетоном", -97324, 183812],
			["Разбитая канистра с ацетоном", -96678, 189949],
			["Разбитая канистра с ацетоном", -99253, 183379],
			["Разбитая канистра с ацетоном", -27067, 162146],
			["Разбитая канистра с ацетоном", -27295, 162866],
			["Разбитая канистра с ацетоном", -5714, 160577],
			["Разбитая канистра с ацетоном", -40853, 161544],
			["Разбитая канистра с ацетоном", -117179, 131551],
			["Разбитая канистра с ацетоном", 152309, 140663],
			["Разбитая канистра с ацетоном", 72917, 136978],
			["Разбитая канистра с ацетоном", -48904, 110174],
			["Разбитая канистра с ацетоном", -59575, 117338],
			["Разбитая канистра с ацетоном", -5280, 33991],
			["Разбитая канистра с ацетоном", -48208, 1821],
			["Разбитая канистра с ацетоном", -138698, 88912],
			["Разбитая канистра с ацетоном", -139072, 88522],
			["Разбитая канистра с ацетоном", 131740, 11886],
			["Разбитая канистра с ацетоном", 113488, 116400],
			["Разбитая канистра с ацетоном", 93464, 103159],
			["Разбитая канистра с ацетоном", 93106, 103021]
			];
	for (var i = 0; i < hlam483.length; i++) {
				hlam_483 = new L.circleMarker([hlam483[i][1],hlam483[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam483[i][0])
					.bindTooltip(hlam483[i][0], {direction: 'top'})
					.addTo(hlam483icons);
			}
	}
	else {
		hlam483icons.clearLayers();
	}
}
var hlam484icons = L.layerGroup().addTo(map);
function Hlam484OnOff() {
	var chbox484;
	chbox484=document.getElementById('Hlam484Button');
	if (chbox484.checked) {
		var hlam484 = [
			["Разбитая лампочка", -117763, -63036],
			["Разбитая лампочка", 201954, -125312],
			["Разбитая лампочка", 201966, -125302],
			["Разбитая лампочка", -61588, -145567],
			["Разбитая лампочка", -143787, 178600],
			["Разбитая лампочка", -130673, 10303]
			];
	for (var i = 0; i < hlam484.length; i++) {
				hlam_484 = new L.circleMarker([hlam484[i][1],hlam484[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam484[i][0])
					.bindTooltip(hlam484[i][0], {direction: 'top'})
					.addTo(hlam484icons);
			}
	}
	else {
		hlam484icons.clearLayers();
	}
}
var hlam485icons = L.layerGroup().addTo(map);
function Hlam485OnOff() {
	var chbox485;
	chbox485=document.getElementById('Hlam485Button');
	if (chbox485.checked) {
		var hlam485 = [
			["Разбитая оранжевая канистра", -44840, -15755],
			["Разбитая оранжевая канистра", -47195, -6349],
			["Разбитая оранжевая канистра", -621, -36247],
			["Разбитая оранжевая канистра", -38966, -59300],
			["Разбитая оранжевая канистра", -37228, -58505],
			["Разбитая оранжевая канистра", -62357, -56519],
			["Разбитая оранжевая канистра", -120706, -65302],
			["Разбитая оранжевая канистра", -120981, -64776],
			["Разбитая оранжевая канистра", -120835, -64376],
			["Разбитая оранжевая канистра", -121923, -64617],
			["Разбитая оранжевая канистра", -110024, -57748],
			["Разбитая оранжевая канистра", -126282, -45619],
			["Разбитая оранжевая канистра", -120631, -45556],
			["Разбитая оранжевая канистра", -120615, -45564],
			["Разбитая оранжевая канистра", -29552, -94498],
			["Разбитая оранжевая канистра", -29369, -94414],
			["Разбитая оранжевая канистра", -28845, -93914],
			["Разбитая оранжевая канистра", -29726, -87325],
			["Разбитая оранжевая канистра", -34195, -84083],
			["Разбитая оранжевая канистра", -15750, -124917],
			["Разбитая оранжевая канистра", -85235, -110090],
			["Разбитая оранжевая канистра", -122960, -122751],
			["Разбитая оранжевая канистра", 167637, -22881],
			["Разбитая оранжевая канистра", 175839, -14691],
			["Разбитая оранжевая канистра", 156943, -69751],
			["Разбитая оранжевая канистра", 129214, -28681],
			["Разбитая оранжевая канистра", 130060, -27282],
			["Разбитая оранжевая канистра", 102984, -10510],
			["Разбитая оранжевая канистра", 88883, -31249],
			["Разбитая оранжевая канистра", 81728, -20809],
			["Разбитая оранжевая канистра", 48454, -22313],
			["Разбитая оранжевая канистра", 111688, -55150],
			["Разбитая оранжевая канистра", 36074, -35424],
			["Разбитая оранжевая канистра", 57126, -94561],
			["Разбитая оранжевая канистра", 7693, -96901],
			["Разбитая оранжевая канистра", 101381, -100266],
			["Разбитая оранжевая канистра", 108520, -100689],
			["Разбитая оранжевая канистра", 18496, -122993],
			["Разбитая оранжевая канистра", -4423, -156057],
			["Разбитая оранжевая канистра", -14751, -173862],
			["Разбитая оранжевая канистра", -42713, -177058],
			["Разбитая оранжевая канистра", -41819, -175611],
			["Разбитая оранжевая канистра", -41977, -175483],
			["Разбитая оранжевая канистра", -42272, -175415],
			["Разбитая оранжевая канистра", -82051, -179567],
			["Разбитая оранжевая канистра", -81768, -179805],
			["Разбитая оранжевая канистра", 189376, -169365],
			["Разбитая оранжевая канистра", 189939, -165240],
			["Разбитая оранжевая канистра", 26454, -136683],
			["Разбитая оранжевая канистра", 28610, -138322],
			["Разбитая оранжевая канистра", 74200, -177171],
			["Разбитая оранжевая канистра", -13275, 189080],
			["Разбитая оранжевая канистра", -38986, 190044],
			["Разбитая оранжевая канистра", -97395, 179456],
			["Разбитая оранжевая канистра", -97528, 183898],
			["Разбитая оранжевая канистра", -145507, 173179],
			["Разбитая оранжевая канистра", -138649, 152469],
			["Разбитая оранжевая канистра", 179271, 134371],
			["Разбитая оранжевая канистра", 147697, 137909],
			["Разбитая оранжевая канистра", 60318, 171579],
			["Разбитая оранжевая канистра", 64633, 174110],
			["Разбитая оранжевая канистра", 63174, 172891],
			["Разбитая оранжевая канистра", 2300, 179040],
			["Разбитая оранжевая канистра", 3429, 182812],
			["Разбитая оранжевая канистра", 126079, 160346],
			["Разбитая оранжевая канистра", 71996, 138117],
			["Разбитая оранжевая канистра", -63600, 74642],
			["Разбитая оранжевая канистра", -68917, 55608],
			["Разбитая оранжевая канистра", -118982, 40059],
			["Разбитая оранжевая канистра", -56154, 10528],
			["Разбитая оранжевая канистра", -34756, 13338],
			["Разбитая оранжевая канистра", -53973, 22252],
			["Разбитая оранжевая канистра", -148442, 113579],
			["Разбитая оранжевая канистра", -154382, 51655],
			["Разбитая оранжевая канистра", 138960, 71183],
			["Разбитая оранжевая канистра", 139923, 73288],
			["Разбитая оранжевая канистра", 144345, 97720],
			["Разбитая оранжевая канистра", 170919, 1606],
			["Разбитая оранжевая канистра", 183480, 2903],
			["Разбитая оранжевая канистра", 131917, 11999],
			["Разбитая оранжевая канистра", 133575, 17206],
			["Разбитая оранжевая канистра", 136176, 18267],
			["Разбитая оранжевая канистра", 93244, 103889],
			["Разбитая оранжевая канистра", 93498, 103262],
			["Разбитая оранжевая канистра", 39274, 115293],
			["Разбитая оранжевая канистра", 54594, 95024],
			["Разбитая оранжевая канистра", 110014, 57633],
			["Разбитая оранжевая канистра", 76432, 37050],
			["Разбитая оранжевая канистра", 100790, 27240],
			["Разбитая оранжевая канистра", 55505, 8008],
			["Разбитая оранжевая канистра", 55144, 8184],
			["Разбитая оранжевая канистра", 55219, 8416],
			["Разбитая оранжевая канистра", 54468, 8898],
			["Разбитая оранжевая канистра", 55272, 8357],
			["Разбитая оранжевая канистра", 51756, 15361]
			];
	for (var i = 0; i < hlam485.length; i++) {
				hlam_485 = new L.circleMarker([hlam485[i][1],hlam485[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam485[i][0])
					.bindTooltip(hlam485[i][0], {direction: 'top'})
					.addTo(hlam485icons);
			}
	}
	else {
		hlam485icons.clearLayers();
	}
}
var hlam486icons = L.layerGroup().addTo(map);
function Hlam486OnOff() {
	var chbox486;
	chbox486=document.getElementById('Hlam486Button');
	if (chbox486.checked) {
		var hlam486 = [
			["Разбитая ржавая канистра", -44788, -15765],
			["Разбитая ржавая канистра", -121325, -27575],
			["Разбитая ржавая канистра", -107613, -14380],
			["Разбитая ржавая канистра", -39571, -58828],
			["Разбитая ржавая канистра", -38027, -57369],
			["Разбитая ржавая канистра", -61425, -56633],
			["Разбитая ржавая канистра", -60002, -56958],
			["Разбитая ржавая канистра", -46003, -50551],
			["Разбитая ржавая канистра", -121044, -64830],
			["Разбитая ржавая канистра", -120818, -65224],
			["Разбитая ржавая канистра", -120810, -65218],
			["Разбитая ржавая канистра", -120810, -65231],
			["Разбитая ржавая канистра", -110161, -64766],
			["Разбитая ржавая канистра", -119896, -46901],
			["Разбитая ржавая канистра", -114601, -47299],
			["Разбитая ржавая канистра", -29870, -93056],
			["Разбитая ржавая канистра", -88886, -106867],
			["Разбитая ржавая канистра", -85957, -106586],
			["Разбитая ржавая канистра", -114465, -117772],
			["Разбитая ржавая канистра", -155789, -14737],
			["Разбитая ржавая канистра", -178592, -2879],
			["Разбитая ржавая канистра", -167968, -115727],
			["Разбитая ржавая канистра", -168134, -115176],
			["Разбитая ржавая канистра", 173219, -18070],
			["Разбитая ржавая канистра", 157604, -69463],
			["Разбитая ржавая канистра", 88608, -31286],
			["Разбитая ржавая канистра", 90964, -8615],
			["Разбитая ржавая канистра", 71131, -1700],
			["Разбитая ржавая канистра", 48444, -22338],
			["Разбитая ржавая канистра", 48137, -22108],
			["Разбитая ржавая канистра", 59623, -22990],
			["Разбитая ржавая канистра", 8983, -30310],
			["Разбитая ржавая канистра", 111284, -55254],
			["Разбитая ржавая канистра", 63888, -50124],
			["Разбитая ржавая канистра", 35947, -35306],
			["Разбитая ржавая канистра", 28635, -106089],
			["Разбитая ржавая канистра", -7026, -161520],
			["Разбитая ржавая канистра", -7177, -161341],
			["Разбитая ржавая канистра", -7164, -161328],
			["Разбитая ржавая канистра", -7194, -161348],
			["Разбитая ржавая канистра", -61211, -145489],
			["Разбитая ржавая канистра", -93782, -163373],
			["Разбитая ржавая канистра", -126490, -135198],
			["Разбитая ржавая канистра", -42914, -174110],
			["Разбитая ржавая канистра", -43588, -173491],
			["Разбитая ржавая канистра", -42186, -172882],
			["Разбитая ржавая канистра", -42171, -172874],
			["Разбитая ржавая канистра", -76423, -184243],
			["Разбитая ржавая канистра", -82625, -178533],
			["Разбитая ржавая канистра", -81926, -177876],
			["Разбитая ржавая канистра", -82109, -179711],
			["Разбитая ржавая канистра", -80862, -179294],
			["Разбитая ржавая канистра", 164460, -150424],
			["Разбитая ржавая канистра", 165022, -149023],
			["Разбитая ржавая канистра", 193200, -145304],
			["Разбитая ржавая канистра", 73760, -177675],
			["Разбитая ржавая канистра", -61669, 182200],
			["Разбитая ржавая канистра", -60635, 182058],
			["Разбитая ржавая канистра", -38780, 190280],
			["Разбитая ржавая канистра", -96645, 189966],
			["Разбитая ржавая канистра", -67800, 196361],
			["Разбитая ржавая канистра", -98854, 183531],
			["Разбитая ржавая канистра", -2691, 158430],
			["Разбитая ржавая канистра", -5793, 160640],
			["Разбитая ржавая канистра", -40947, 161320],
			["Разбитая ржавая канистра", -40658, 161366],
			["Разбитая ржавая канистра", -37945, 159910],
			["Разбитая ржавая канистра", -146158, 173093],
			["Разбитая ржавая канистра", -146920, 178642],
			["Разбитая ржавая канистра", 147353, 138266],
			["Разбитая ржавая канистра", 63121, 172898],
			["Разбитая ржавая канистра", 6293, 164115],
			["Разбитая ржавая канистра", 2592, 181994],
			["Разбитая ржавая канистра", 75068, 151245],
			["Разбитая ржавая канистра", -5285, 33978],
			["Разбитая ржавая канистра", -17686, 60513],
			["Разбитая ржавая канистра", -69137, 55530],
			["Разбитая ржавая канистра", -34650, 13094],
			["Разбитая ржавая канистра", -98945, 7668],
			["Разбитая ржавая канистра", -130925, 10594],
			["Разбитая ржавая канистра", -139112, 88501],
			["Разбитая ржавая канистра", 172797, 39210],
			["Разбитая ржавая канистра", 137077, 43232],
			["Разбитая ржавая канистра", 137061, 43264],
			["Разбитая ржавая канистра", 171000, 1871],
			["Разбитая ржавая канистра", 131740, 11821],
			["Разбитая ржавая канистра", 133786, 20383],
			["Разбитая ржавая канистра", 93470, 103268],
			["Разбитая ржавая канистра", 98100, 106377]
			];
	for (var i = 0; i < hlam486.length; i++) {
				hlam_486 = new L.circleMarker([hlam486[i][1],hlam486[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam486[i][0])
					.bindTooltip(hlam486[i][0], {direction: 'top'})
					.addTo(hlam486icons);
			}
	}
	else {
		hlam486icons.clearLayers();
	}
}
var hlam487icons = L.layerGroup().addTo(map);
function Hlam487OnOff() {
	var chbox487;
	chbox487=document.getElementById('Hlam487Button');
	if (chbox487.checked) {
		var hlam487 = [
			["Разбитое яйцо когтя смерти", -19360, -47152],
			["Разбитое яйцо когтя смерти", 161984, 136402],
			["Разбитое яйцо когтя смерти", 162076, 136458],
			["Разбитое яйцо когтя смерти", 161948, 136322],
			["Разбитое яйцо когтя смерти", 26823, 184673],
			["Разбитое яйцо когтя смерти", 113333, 116221],
			["Разбитое яйцо когтя смерти", 113254, 115773]
			];
	for (var i = 0; i < hlam487.length; i++) {
				hlam_487 = new L.circleMarker([hlam487[i][1],hlam487[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam487[i][0])
					.bindTooltip(hlam487[i][0], {direction: 'top'})
					.addTo(hlam487icons);
			}
	}
	else {
		hlam487icons.clearLayers();
	}
}
var hlam488icons = L.layerGroup().addTo(map);
function Hlam488OnOff() {
	var chbox488;
	chbox488=document.getElementById('Hlam488Button');
	if (chbox488.checked) {
		var hlam488 = [
			["Разводной ключ", -44665, -15754],
			["Разводной ключ", -77642, -21767],
			["Разводной ключ", -74464, -3786],
			["Разводной ключ", -45958, -50217],
			["Разводной ключ", -46895, -50671],
			["Разводной ключ", -51692, -46533],
			["Разводной ключ", -51842, -46538],
			["Разводной ключ", -89130, -48765],
			["Разводной ключ", -85021, -46098],
			["Разводной ключ", -84962, -45748],
			["Разводной ключ", -29465, -94467],
			["Разводной ключ", -29825, -86995],
			["Разводной ключ", -35676, -81200],
			["Разводной ключ", -93445, -83586],
			["Разводной ключ", -71038, -69158],
			["Разводной ключ", -118424, -86394],
			["Разводной ключ", -125242, -74249],
			["Разводной ключ", -126184, -74232],
			["Разводной ключ", -11802, -123235],
			["Разводной ключ", -10692, -123705],
			["Разводной ключ", -43083, -127616],
			["Разводной ключ", -93267, -130957],
			["Разводной ключ", -80150, -128051],
			["Разводной ключ", -85143, -107644],
			["Разводной ключ", -85249, -110059],
			["Разводной ключ", -112560, -121343],
			["Разводной ключ", -103735, -121226],
			["Разводной ключ", -104865, -120312],
			["Разводной ключ", -148807, -57962],
			["Разводной ключ", -148093, -56682],
			["Разводной ключ", -155690, -36248],
			["Разводной ключ", -138278, -97290],
			["Разводной ключ", -131448, -92888],
			["Разводной ключ", -152240, -74868],
			["Разводной ключ", -164151, -128882],
			["Разводной ключ", 197433, -30840],
			["Разводной ключ", 188241, -29523],
			["Разводной ключ", 181464, -59723],
			["Разводной ключ", 184259, -92701],
			["Разводной ключ", 129840, -27638],
			["Разводной ключ", 103856, -14784],
			["Разводной ключ", 103027, -11016],
			["Разводной ключ", 81953, -18999],
			["Разводной ключ", 84525, -19198],
			["Разводной ключ", 74524, -12093],
			["Разводной ключ", 70213, -7876],
			["Разводной ключ", 78998, -1782],
			["Разводной ключ", 48659, -21925],
			["Разводной ключ", 48382, -22026],
			["Разводной ключ", 34082, -5969],
			["Разводной ключ", 9055, -30333],
			["Разводной ключ", 31094, -19792],
			["Разводной ключ", 17962, -2651],
			["Разводной ключ", 108104, -54972],
			["Разводной ключ", 62009, -58554],
			["Разводной ключ", 51483, -43669],
			["Разводной ключ", 24923, -63591],
			["Разводной ключ", 22874, -61083],
			["Разводной ключ", 57843, -95272],
			["Разводной ключ", 13383, -92122],
			["Разводной ключ", 792, -86551],
			["Разводной ключ", 38194, -119150],
			["Разводной ключ", 63162, -115988],
			["Разводной ключ", 60796, -98926],
			["Разводной ключ", 18495, -122959],
			["Разводной ключ", -4496, -156139],
			["Разводной ключ", -40697, -134364],
			["Разводной ключ", -93382, -163716],
			["Разводной ключ", -92742, -136370],
			["Разводной ключ", -72179, -132893],
			["Разводной ключ", -72680, -132244],
			["Разводной ключ", -124348, -136601],
			["Разводной ключ", -117459, -136420],
			["Разводной ключ", -24981, -172384],
			["Разводной ключ", -24704, -172269],
			["Разводной ключ", -14693, -173667],
			["Разводной ключ", -43625, -173594],
			["Разводной ключ", -42957, -173472],
			["Разводной ключ", -82474, -176514],
			["Разводной ключ", -82216, -176458],
			["Разводной ключ", -81895, -177829],
			["Разводной ключ", -120415, -189788],
			["Разводной ключ", -113720, -170505],
			["Разводной ключ", 131402, -132089],
			["Разводной ключ", 191728, -169469],
			["Разводной ключ", 189047, -164707],
			["Разводной ключ", 188641, -165425],
			["Разводной ключ", 188964, -165239],
			["Разводной ключ", 115364, -157749],
			["Разводной ключ", 51885, -149150],
			["Разводной ключ", 26222, -136971],
			["Разводной ключ", 27606, -137659],
			["Разводной ключ", 75467, -174756],
			["Разводной ключ", 75468, -173398],
			["Разводной ключ", -67142, 201577],
			["Разводной ключ", -13399, 189164],
			["Разводной ключ", -13801, 189102],
			["Разводной ключ", -55603, 165191],
			["Разводной ключ", -39091, 190451],
			["Разводной ключ", -83945, 165654],
			["Разводной ключ", -84313, 166012],
			["Разводной ключ", -95840, 181773],
			["Разводной ключ", -97229, 184440],
			["Разводной ключ", -93220, 184323],
			["Разводной ключ", -95266, 189968],
			["Разводной ключ", -95300, 190221],
			["Разводной ключ", -94871, 190249],
			["Разводной ключ", -98965, 183489],
			["Разводной ключ", -10056, 132142],
			["Разводной ключ", -1725, 158484],
			["Разводной ключ", -16611, 163816],
			["Разводной ключ", -16670, 163740],
			["Разводной ключ", -42742, 137686],
			["Разводной ключ", -40428, 161430],
			["Разводной ключ", -98610, 147872],
			["Разводной ключ", -161586, 200916],
			["Разводной ключ", -155440, 165402],
			["Разводной ключ", -155123, 164551],
			["Разводной ключ", -143560, 173944],
			["Разводной ключ", -158644, 185689],
			["Разводной ключ", -140997, 142323],
			["Разводной ключ", -149581, 150199],
			["Разводной ключ", 188918, 229859],
			["Разводной ключ", 156670, 184606],
			["Разводной ключ", 143420, 194343],
			["Разводной ключ", 150983, 138375],
			["Разводной ключ", 101360, 192414],
			["Разводной ключ", 102215, 191470],
			["Разводной ключ", 101620, 193861],
			["Разводной ключ", 79955, 184427],
			["Разводной ключ", 92735, 191867],
			["Разводной ключ", 95938, 192161],
			["Разводной ключ", 26686, 171935],
			["Разводной ключ", 13343, 174593],
			["Разводной ключ", 2334, 179118],
			["Разводной ключ", 10844, 184074],
			["Разводной ключ", 2194, 187312],
			["Разводной ключ", 72017, 138161],
			["Разводной ключ", 71998, 138111],
			["Разводной ключ", 45997, 156304],
			["Разводной ключ", 20426, 134809],
			["Разводной ключ", 20500, 134748],
			["Разводной ключ", 1716, 138081],
			["Разводной ключ", 2658, 163109],
			["Разводной ключ", 3826, 160227],
			["Разводной ключ", 7077, 162419],
			["Разводной ключ", -104694, 123048],
			["Разводной ключ", -129563, 130889],
			["Разводной ключ", -14457, 80848],
			["Разводной ключ", -37687, 84393],
			["Разводной ключ", -59880, 86844],
			["Разводной ключ", -87885, 67307],
			["Разводной ключ", -128288, 79973],
			["Разводной ключ", -40689, 50834],
			["Разводной ключ", -52779, 55371],
			["Разводной ключ", -52256, 55167],
			["Разводной ключ", -103988, 38612],
			["Разводной ключ", -1271, 1379],
			["Разводной ключ", -24589, 10018],
			["Разводной ключ", -14059, 24136],
			["Разводной ключ", -45920, 1804],
			["Разводной ключ", -42063, 1934],
			["Разводной ключ", -42332, 2610],
			["Разводной ключ", -33916, 557],
			["Разводной ключ", -42426, 8010],
			["Разводной ключ", -58529, 11894],
			["Разводной ключ", -55317, 9359],
			["Разводной ключ", -56169, 10569],
			["Разводной ключ", -52540, 11204],
			["Разводной ключ", -68033, 2826],
			["Разводной ключ", -121599, 3631],
			["Разводной ключ", -119466, 1695],
			["Разводной ключ", -98503, 7612],
			["Разводной ключ", -153764, 129859],
			["Разводной ключ", -138791, 90745],
			["Разводной ключ", -146614, 17822],
			["Разводной ключ", 182501, 110249],
			["Разводной ключ", 180992, 110666],
			["Разводной ключ", 180376, 111084],
			["Разводной ключ", 134499, 127443],
			["Разводной ключ", 148575, 65586],
			["Разводной ключ", 198066, 46737],
			["Разводной ключ", 195351, 65508],
			["Разводной ключ", 133290, 17948],
			["Разводной ключ", 133571, 17172],
			["Разводной ключ", 133218, 20118],
			["Разводной ключ", 95420, 99051],
			["Разводной ключ", 87981, 104730],
			["Разводной ключ", 114215, 73194],
			["Разводной ключ", 114347, 72881],
			["Разводной ключ", 114342, 72904],
			["Разводной ключ", 49847, 84697],
			["Разводной ключ", 76466, 37046],
			["Разводной ключ", 74384, 44207],
			["Разводной ключ", 79943, 55790],
			["Разводной ключ", 16302, 44729],
			["Разводной ключ", 16357, 44703],
			["Разводной ключ", 102333, 3317],
			["Разводной ключ", 121073, 4865],
			["Разводной ключ", 121706, 5109],
			["Разводной ключ", 130040, 20105],
			["Разводной ключ", 84732, 878]
			];
	for (var i = 0; i < hlam488.length; i++) {
				hlam_488 = new L.circleMarker([hlam488[i][1],hlam488[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam488[i][0])
					.bindTooltip(hlam488[i][0], {direction: 'top'})
					.addTo(hlam488icons);
			}
	}
	else {
		hlam488icons.clearLayers();
	}
}
var hlam489icons = L.layerGroup().addTo(map);
function Hlam489OnOff() {
	var chbox489;
	chbox489=document.getElementById('Hlam489Button');
	if (chbox489.checked) {
		var hlam489 = [
			["Разделочная доска", -8607, -3041],
			["Разделочная доска", -53196, -13390],
			["Разделочная доска", -19180, -47114],
			["Разделочная доска", -20532, -44122],
			["Разделочная доска", -55821, -60422],
			["Разделочная доска", -47146, -72524],
			["Разделочная доска", -46621, -72871],
			["Разделочная доска", -61425, -100101],
			["Разделочная доска", -104928, -119115],
			["Разделочная доска", -171394, -11024],
			["Разделочная доска", -178916, -2912],
			["Разделочная доска", -147755, -56981],
			["Разделочная доска", -151071, -74865],
			["Разделочная доска", -151049, -75037],
			["Разделочная доска", -168052, -115170],
			["Разделочная доска", 166914, -22010],
			["Разделочная доска", 167888, -17847],
			["Разделочная доска", 173845, -13688],
			["Разделочная доска", 138660, -53826],
			["Разделочная доска", 149424, -51996],
			["Разделочная доска", 183588, -93156],
			["Разделочная доска", 127928, -31560],
			["Разделочная доска", 88639, -31246],
			["Разделочная доска", 73263, -6968],
			["Разделочная доска", 48800, -22051],
			["Разделочная доска", 50330, -23318],
			["Разделочная доска", 33944, -32880],
			["Разделочная доска", 34148, -36468],
			["Разделочная доска", 33981, -36343],
			["Разделочная доска", 60829, -96436],
			["Разделочная доска", 83721, -109617],
			["Разделочная доска", 13873, -107333],
			["Разделочная доска", 19772, -104342],
			["Разделочная доска", -126572, -144641],
			["Разделочная доска", -121041, -189305],
			["Разделочная доска", 140837, -147237],
			["Разделочная доска", -54304, 192596],
			["Разделочная доска", -95164, 183090],
			["Разделочная доска", -92999, 183345],
			["Разделочная доска", -160280, 152526],
			["Разделочная доска", 152350, 137592],
			["Разделочная доска", 152210, 138821],
			["Разделочная доска", 152009, 161357],
			["Разделочная доска", 152187, 161353],
			["Разделочная доска", 107740, 173271],
			["Разделочная доска", 48565, 190486],
			["Разделочная доска", 11608, 183011],
			["Разделочная доска", -128960, 120041],
			["Разделочная доска", -17672, 60247],
			["Разделочная доска", -18100, 60370],
			["Разделочная доска", -46432, 28174],
			["Разделочная доска", 133473, 126773],
			["Разделочная доска", 171024, 1825],
			["Разделочная доска", 183646, 2294],
			["Разделочная доска", 46388, 100725],
			["Разделочная доска", 23541, 44309],
			["Разделочная доска", 27130, 50097],
			["Разделочная доска", 29219, 53882],
			["Разделочная доска", 71369, 21058],
			["Разделочная доска", -129585, 80789]
			];
	for (var i = 0; i < hlam489.length; i++) {
				hlam_489 = new L.circleMarker([hlam489[i][1],hlam489[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam489[i][0])
					.bindTooltip(hlam489[i][0], {direction: 'top'})
					.addTo(hlam489icons);
			}
	}
	else {
		hlam489icons.clearLayers();
	}
}
var hlam490icons = L.layerGroup().addTo(map);
function Hlam490OnOff() {
	var chbox490;
	chbox490=document.getElementById('Hlam490Button');
	if (chbox490.checked) {
		var hlam490 = [
			["Разделочная доска", -52736, -14194],
			["Разделочная доска", -109622, -58374],
			["Разделочная доска", -162684, -53805],
			["Разделочная доска", -151356, -74135],
			["Разделочная доска", -151484, -72073],
			["Разделочная доска", 182330, -29937],
			["Разделочная доска", 148566, -79672],
			["Разделочная доска", 17972, -1035],
			["Разделочная доска", 29035, -58260],
			["Разделочная доска", 13023, -111241],
			["Разделочная доска", 2724, 161607],
			["Разделочная доска", -17785, 59977],
			["Разделочная доска", -48836, 19804]
			];
	for (var i = 0; i < hlam490.length; i++) {
				hlam_490 = new L.circleMarker([hlam490[i][1],hlam490[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam490[i][0])
					.bindTooltip(hlam490[i][0], {direction: 'top'})
					.addTo(hlam490icons);
			}
	}
	else {
		hlam490icons.clearLayers();
	}
}
var hlam491icons = L.layerGroup().addTo(map);
function Hlam491OnOff() {
	var chbox491;
	chbox491=document.getElementById('Hlam491Button');
	if (chbox491.checked) {
		var hlam491 = [
			["Растительное масло", -8549, -3050],
			["Растительное масло", -53223, -13597],
			["Растительное масло", -28017, -60077],
			["Растительное масло", -17371, -46323],
			["Растительное масло", -19462, -47111],
			["Растительное масло", -20631, -44126],
			["Растительное масло", -56442, -60299],
			["Растительное масло", -47455, -51057],
			["Растительное масло", -107775, -59248],
			["Растительное масло", -127937, -112024],
			["Растительное масло", -127942, -112011],
			["Растительное масло", -126192, -104582],
			["Растительное масло", -148006, -56615],
			["Растительное масло", -150816, -74906],
			["Растительное масло", -151252, -74725],
			["Растительное масло", -151376, -74122],
			["Растительное масло", -151069, -75019],
			["Растительное масло", -168021, -115361],
			["Растительное масло", 167830, -22855],
			["Растительное масло", 168694, -24278],
			["Растительное масло", 167936, -17905],
			["Растительное масло", 138673, -53859],
			["Растительное масло", 149443, -51976],
			["Растительное масло", 183762, -93336],
			["Растительное масло", 160819, -91656],
			["Растительное масло", 160813, -91635],
			["Растительное масло", 161367, -92083],
			["Растительное масло", 147395, -78096],
			["Растительное масло", 160321, -129306],
			["Растительное масло", 152986, -104498],
			["Растительное масло", 88621, -31161],
			["Растительное масло", 88650, -6289],
			["Растительное масло", 28465, -31216],
			["Растительное масло", 91670, -59415],
			["Растительное масло", 34202, -32831],
			["Растительное масло", 33939, -36333],
			["Растительное масло", 15819, -79809],
			["Растительное масло", 13861, -107309],
			["Растительное масло", 17461, -106924],
			["Растительное масло", -53316, -175212],
			["Растительное масло", -121057, -189324],
			["Растительное масло", -108623, -178869],
			["Растительное масло", -139224, -144066],
			["Растительное масло", -136116, -183827],
			["Растительное масло", 140731, -146958],
			["Растительное масло", 22338, -150415],
			["Растительное масло", 65604, -182653],
			["Растительное масло", -5451, 182757],
			["Растительное масло", -61299, 181223],
			["Растительное масло", -60588, 181703],
			["Растительное масло", -91621, 183600],
			["Растительное масло", -6221, 146070],
			["Растительное масло", -141980, 134743],
			["Растительное масло", 151750, 139152],
			["Растительное масло", 152348, 138502],
			["Растительное масло", 142375, 139418],
			["Растительное масло", 48503, 190353],
			["Растительное масло", 71998, 133681],
			["Растительное масло", 71992, 133687],
			["Растительное масло", 71996, 133696],
			["Растительное масло", 71990, 133702],
			["Растительное масло", 2467, 137750],
			["Растительное масло", 2469, 137735],
			["Растительное масло", -17879, 60174],
			["Растительное масло", -17619, 59837],
			["Растительное масло", -17987, 60479],
			["Растительное масло", -65740, 35967],
			["Растительное масло", -121984, 40889],
			["Растительное масло", -20913, 16623],
			["Растительное масло", 192963, 113313],
			["Растительное масло", 192979, 113158],
			["Растительное масло", 135196, 115452],
			["Растительное масло", 168285, 55566],
			["Растительное масло", 168848, 56046],
			["Растительное масло", 171108, 1806],
			["Растительное масло", 183781, 2291],
			["Растительное масло", 39289, 115306],
			["Растительное масло", 39703, 115402],
			["Растительное масло", 114673, 68824],
			["Растительное масло", 114142, 7587]
			];
	for (var i = 0; i < hlam491.length; i++) {
				hlam_491 = new L.circleMarker([hlam491[i][1],hlam491[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam491[i][0])
					.bindTooltip(hlam491[i][0], {direction: 'top'})
					.addTo(hlam491icons);
			}
	}
	else {
		hlam491icons.clearLayers();
	}
}
var hlam492icons = L.layerGroup().addTo(map);
function Hlam492OnOff() {
	var chbox492;
	chbox492=document.getElementById('Hlam492Button');
	if (chbox492.checked) {
		var hlam492 = [
			["Расширяющаяся ваза &quotИва&quot", -55798, -61303],
			["Расширяющаяся ваза &quotИва&quot", -55723, -61154],
			["Расширяющаяся ваза &quotИва&quot", -48044, -49428],
			["Расширяющаяся ваза &quotИва&quot", -47928, -49312],
			["Расширяющаяся ваза &quotИва&quot", -148389, -57452],
			["Расширяющаяся ваза &quotИва&quot", 160523, -58366],
			["Расширяющаяся ваза &quotИва&quot", 154666, -46636],
			["Расширяющаяся ваза &quotИва&quot", 105489, -7138],
			["Расширяющаяся ваза &quotИва&quot", 88837, -6693],
			["Расширяющаяся ваза &quotИва&quot", 79067, -1738],
			["Расширяющаяся ваза &quotИва&quot", 31737, -21225],
			["Расширяющаяся ваза &quotИва&quot", -31153, 196285],
			["Расширяющаяся ваза &quotИва&quot", -59390, 180905],
			["Расширяющаяся ваза &quotИва&quot", -60439, 181434],
			["Расширяющаяся ваза &quotИва&quot", 112144, 139818],
			["Расширяющаяся ваза &quotИва&quot", 33103, 132153],
			["Расширяющаяся ваза &quotИва&quot", -14038, 119106],
			["Расширяющаяся ваза &quotИва&quot", -41849, 87907],
			["Расширяющаяся ваза &quotИва&quot", 28639, 48939],
			["Расширяющаяся ваза &quotИва&quot", 100083, 25460],
			["Расширяющаяся ваза &quotИва&quot", 76047, 9688]
			];
	for (var i = 0; i < hlam492.length; i++) {
				hlam_492 = new L.circleMarker([hlam492[i][1],hlam492[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam492[i][0])
					.bindTooltip(hlam492[i][0], {direction: 'top'})
					.addTo(hlam492icons);
			}
	}
	else {
		hlam492icons.clearLayers();
	}
}
var hlam493icons = L.layerGroup().addTo(map);
function Hlam493OnOff() {
	var chbox493;
	chbox493=document.getElementById('Hlam493Button');
	if (chbox493.checked) {
		var hlam493 = [
			["Расширяющаяся ваза &quotЦветы&quot", -50941, -12593],
			["Расширяющаяся ваза &quotЦветы&quot", -51414, -13866],
			["Расширяющаяся ваза &quotЦветы&quot", -20355, -46603],
			["Расширяющаяся ваза &quotЦветы&quot", -46272, -104752],
			["Расширяющаяся ваза &quotЦветы&quot", -46401, -104813],
			["Расширяющаяся ваза &quotЦветы&quot", 142185, -123924],
			["Расширяющаяся ваза &quotЦветы&quot", 78027, -11713],
			["Расширяющаяся ваза &quotЦветы&quot", 22207, -105470],
			["Расширяющаяся ваза &quotЦветы&quot", -8138, -165198],
			["Расширяющаяся ваза &quotЦветы&quot", 88199, 158470],
			["Расширяющаяся ваза &quotЦветы&quot", -45612, 20407],
			["Расширяющаяся ваза &quotЦветы&quot", 171063, 58794]
			];
	for (var i = 0; i < hlam493.length; i++) {
				hlam_493 = new L.circleMarker([hlam493[i][1],hlam493[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam493[i][0])
					.bindTooltip(hlam493[i][0], {direction: 'top'})
					.addTo(hlam493icons);
			}
	}
	else {
		hlam493icons.clearLayers();
	}
}
var hlam494icons = L.layerGroup().addTo(map);
function Hlam494OnOff() {
	var chbox494;
	chbox494=document.getElementById('Hlam494Button');
	if (chbox494.checked) {
		var hlam494 = [
			["Ребра и таз", -18216, -44505],
			["Ребра и таз", -49184, -80716],
			["Ребра и таз", -72135, -78012],
			["Ребра и таз", -125057, -116254],
			["Ребра и таз", -158823, -57811],
			["Ребра и таз", 99918, -20853],
			["Ребра и таз", 104922, -22489],
			["Ребра и таз", 113085, -20919],
			["Ребра и таз", 103240, -15909],
			["Ребра и таз", 103384, -8338],
			["Ребра и таз", 34921, -6392],
			["Ребра и таз", 99945, -84531],
			["Ребра и таз", -102615, -179637],
			["Ребра и таз", 166424, 179080],
			["Ребра и таз", 166506, 178795],
			["Ребра и таз", 38627, 146126],
			["Ребра и таз", 37748, 146027],
			["Ребра и таз", 38163, 144872],
			["Ребра и таз", 39126, 144652],
			["Ребра и таз", 38090, 146077],
			["Ребра и таз", 38844, 146428],
			["Ребра и таз", 39031, 146251],
			["Ребра и таз", 38766, 146438],
			["Ребра и таз", 38814, 146262],
			["Ребра и таз", 39229, 145902],
			["Ребра и таз", -104344, 123368],
			["Ребра и таз", -19895, 16782],
			["Ребра и таз", -19401, 16704],
			["Ребра и таз", -56379, 8889],
			["Ребра и таз", -56725, 8501],
			["Ребра и таз", -152119, 427],
			["Ребра и таз", 144607, 98460],
			["Ребра и таз", 94849, 98918],
			["Ребра и таз", 29748, 15087]
			];
	for (var i = 0; i < hlam494.length; i++) {
				hlam_494 = new L.circleMarker([hlam494[i][1],hlam494[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam494[i][0])
					.bindTooltip(hlam494[i][0], {direction: 'top'})
					.addTo(hlam494icons);
			}
	}
	else {
		hlam494icons.clearLayers();
	}
}
var hlam495icons = L.layerGroup().addTo(map);
function Hlam495OnOff() {
	var chbox495;
	chbox495=document.getElementById('Hlam495Button');
	if (chbox495.checked) {
		var hlam495 = [
			["Резак для бумаги", 177991, -123689],
			["Резак для бумаги", 28236, -138305]
			];
	for (var i = 0; i < hlam495.length; i++) {
				hlam_495 = new L.circleMarker([hlam495[i][1],hlam495[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam495[i][0])
					.bindTooltip(hlam495[i][0], {direction: 'top'})
					.addTo(hlam495icons);
			}
	}
	else {
		hlam495icons.clearLayers();
	}
}
var hlam496icons = L.layerGroup().addTo(map);
function Hlam496OnOff() {
	var chbox496;
	chbox496=document.getElementById('Hlam496Button');
	if (chbox496.checked) {
		var hlam496 = [
			["Резак для бумаги", -52113, -46050],
			["Резак для бумаги", -29856, -93461],
			["Резак для бумаги", 129089, -28749],
			["Резак для бумаги", 17282, -44174],
			["Резак для бумаги", -55424, -160470],
			["Резак для бумаги", 28775, -138338],
			["Резак для бумаги", -40807, 161571],
			["Резак для бумаги", 88191, 156795],
			["Резак для бумаги", 137100, 42907]
			];
	for (var i = 0; i < hlam496.length; i++) {
				hlam_496 = new L.circleMarker([hlam496[i][1],hlam496[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam496[i][0])
					.bindTooltip(hlam496[i][0], {direction: 'top'})
					.addTo(hlam496icons);
			}
	}
	else {
		hlam496icons.clearLayers();
	}
}
var hlam497icons = L.layerGroup().addTo(map);
function Hlam497OnOff() {
	var chbox497;
	chbox497=document.getElementById('Hlam497Button');
	if (chbox497.checked) {
		var hlam497 = [
			["Ржавая канистра", -8458, -3109],
			["Ржавая канистра", -55751, -60294],
			["Ржавая канистра", -62440, -56594],
			["Ржавая канистра", -37619, -56972],
			["Ржавая канистра", -46474, -50648],
			["Ржавая канистра", -120391, -47061],
			["Ржавая канистра", -129765, -91970],
			["Ржавая канистра", -126361, -73884],
			["Ржавая канистра", -86037, -116609],
			["Ржавая канистра", -86079, -116607],
			["Ржавая канистра", -131827, -113464],
			["Ржавая канистра", 101524, -14005],
			["Ржавая канистра", 102972, -10520],
			["Ржавая канистра", 86656, -32682],
			["Ржавая канистра", 90967, -27703],
			["Ржавая канистра", 84737, -18787],
			["Ржавая канистра", 88111, -5028],
			["Ржавая канистра", 48598, -21618],
			["Ржавая канистра", 8941, -30412],
			["Ржавая канистра", 90526, -33302],
			["Ржавая канистра", 60734, -99199],
			["Ржавая канистра", -93782, -163406],
			["Ржавая канистра", -81681, -160607],
			["Ржавая канистра", -72481, -132799],
			["Ржавая канистра", -125931, -134229],
			["Ржавая канистра", 188654, -164984],
			["Ржавая канистра", 188645, -164974],
			["Ржавая канистра", -97713, 200541],
			["Ржавая канистра", -60043, 180478],
			["Ржавая канистра", -97026, 184392],
			["Ржавая канистра", -99259, 183346],
			["Ржавая канистра", -163801, 200873],
			["Ржавая канистра", -147193, 164076],
			["Ржавая канистра", -144887, 175294],
			["Ржавая канистра", -144703, 172992],
			["Ржавая канистра", 60318, 171564],
			["Ржавая канистра", -127724, 80673],
			["Ржавая канистра", -36932, 48858],
			["Ржавая канистра", -40720, 50815],
			["Ржавая канистра", -103607, 38711],
			["Ржавая канистра", -117567, 54664],
			["Ржавая канистра", -47160, 2506],
			["Ржавая канистра", -42261, 2653],
			["Ржавая канистра", -64693, 5661],
			["Ржавая канистра", -49739, 27427],
			["Ржавая канистра", -49531, 28331],
			["Ржавая канистра", -49397, 26829],
			["Ржавая канистра", -46186, 26702],
			["Ржавая канистра", -148435, 113406],
			["Ржавая канистра", 196627, 63248],
			["Ржавая канистра", 190606, 62313],
			["Ржавая канистра", 93469, 103279],
			["Ржавая канистра", 110023, 57622]
			];
	for (var i = 0; i < hlam497.length; i++) {
				hlam_497 = new L.circleMarker([hlam497[i][1],hlam497[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam497[i][0])
					.bindTooltip(hlam497[i][0], {direction: 'top'})
					.addTo(hlam497icons);
			}
	}
	else {
		hlam497icons.clearLayers();
	}
}
var hlam498icons = L.layerGroup().addTo(map);
function Hlam498OnOff() {
	var chbox498;
	chbox498=document.getElementById('Hlam498Button');
	if (chbox498.checked) {
		var hlam498 = [
			["Робопони &quotЛютик&quot", -689, -29873],
			["Робопони &quotЛютик&quot", -42304, -5294],
			["Робопони &quotЛютик&quot", -44114, -7895],
			["Робопони &quotЛютик&quot", -47172, -50810],
			["Робопони &quotЛютик&quot", -1910, -160145],
			["Робопони &quotЛютик&quot", 138897, -145684],
			["Робопони &quotЛютик&quot", 29185, -140286],
			["Робопони &quotЛютик&quot", 48486, 190861],
			["Робопони &quotЛютик&quot", 14428, 193419],
			["Робопони &quotЛютик&quot", 46746, 161174],
			["Робопони &quotЛютик&quot", -129682, 130767],
			["Робопони &quotЛютик&quot", -129627, 130754],
			["Робопони &quotЛютик&quot", -84875, 66377],
			["Робопони &quotЛютик&quot", 143912, 98642],
			["Робопони &quotЛютик&quot", 58605, 10315],
			["Робопони &quotЛютик&quot", -5826, -160928],
			["Робопони &quotЛютик&quot", -19857, 15500]
			];
	for (var i = 0; i < hlam498.length; i++) {
				hlam_498 = new L.circleMarker([hlam498[i][1],hlam498[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam498[i][0])
					.bindTooltip(hlam498[i][0], {direction: 'top'})
					.addTo(hlam498icons);
			}
	}
	else {
		hlam498icons.clearLayers();
	}
}
var hlam499icons = L.layerGroup().addTo(map);
function Hlam499OnOff() {
	var chbox499;
	chbox499=document.getElementById('Hlam499Button');
	if (chbox499.checked) {
		var hlam499 = [
			["Рука горелого в банке", 101936, -12437],
			["Рука горелого в банке", 101845, -12431]
			];
	for (var i = 0; i < hlam499.length; i++) {
				hlam_499 = new L.circleMarker([hlam499[i][1],hlam499[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam499[i][0])
					.bindTooltip(hlam499[i][0], {direction: 'top'})
					.addTo(hlam499icons);
			}
	}
	else {
		hlam499icons.clearLayers();
	}
}
var hlam500icons = L.layerGroup().addTo(map);
function Hlam500OnOff() {
	var chbox500;
	chbox500=document.getElementById('Hlam500Button');
	if (chbox500.checked) {
		var hlam500 = [
			["Ручка", -9613, -26990],
			["Ручка", -52360, -13887],
			["Ручка", -43602, -7050],
			["Ручка", -42170, -5672],
			["Ручка", -66810, -22806],
			["Ручка", -111739, -62120],
			["Ручка", -110337, -58028],
			["Ручка", -56368, -78585],
			["Ручка", -49631, -74886],
			["Ручка", -104879, -121687],
			["Ручка", -105332, -119308],
			["Ручка", 191161, -18874],
			["Ручка", 191167, -18869],
			["Ручка", 179149, -9919],
			["Ручка", 147478, -78277],
			["Ручка", 147630, -78310],
			["Ручка", 202161, -125751],
			["Ручка", 124164, -28923],
			["Ручка", 103644, -14624],
			["Ручка", 92292, -9768],
			["Ручка", 84701, -1944],
			["Ручка", 84666, -1946],
			["Ручка", 28129, -31725],
			["Ручка", 29651, -21230],
			["Ручка", 115620, -63489],
			["Ручка", 115684, -63338],
			["Ручка", 29495, -58313],
			["Ручка", 29240, -58788],
			["Ручка", 29555, -58611],
			["Ручка", 32152, -40245],
			["Ручка", 12906, -83150],
			["Ручка", 20384, -108459],
			["Ручка", 19670, -104221],
			["Ручка", -4218, -155911],
			["Ручка", -4380, -156034],
			["Ручка", -24132, -179944],
			["Ручка", -24201, -179786],
			["Ручка", -24077, -179935],
			["Ручка", -87739, -165972],
			["Ручка", -134274, -154312],
			["Ручка", 189985, -169305],
			["Ручка", 102286, -151762],
			["Ручка", 102675, -151411],
			["Ручка", 22987, -149577],
			["Ручка", -97669, 200276],
			["Ручка", -94451, 183290],
			["Ручка", -93602, 183642],
			["Ручка", -68242, 195577],
			["Ручка", -951, 158629],
			["Ручка", -5710, 161934],
			["Ручка", -5857, 161904],
			["Ручка", -5699, 161939],
			["Ручка", -5703, 161945],
			["Ручка", -5647, 162097],
			["Ручка", -5770, 162116],
			["Ручка", -6052, 162110],
			["Ручка", -5942, 162147],
			["Ручка", -6016, 162258],
			["Ручка", -6104, 162100],
			["Ручка", -3462, 162804],
			["Ручка", -3615, 162764],
			["Ручка", -3491, 162744],
			["Ручка", -3497, 162751],
			["Ручка", -43044, 157665],
			["Ручка", -161802, 200824],
			["Ручка", -145031, 178045],
			["Ручка", 151447, 137374],
			["Ручка", 69694, 202281],
			["Ручка", 80256, 182559],
			["Ручка", 80090, 182258],
			["Ручка", 93280, 192195],
			["Ручка", 1784, 164654],
			["Ручка", 2025, 164424],
			["Ручка", 1556, 165175],
			["Ручка", 2896, 164272],
			["Ручка", 3332, 182815],
			["Ручка", 112092, 139818],
			["Ручка", 72852, 136687],
			["Ручка", 2836, 162897],
			["Ручка", 2273, 162165],
			["Ручка", 3586, 160666],
			["Ручка", 3621, 160795],
			["Ручка", 4091, 160539],
			["Ручка", -41922, 87917],
			["Ручка", -41443, 88190],
			["Ручка", -41853, 88202],
			["Ручка", -115083, 66773],
			["Ручка", -29770, 17042],
			["Ручка", -39149, 3757],
			["Ручка", -35587, 2333],
			["Ручка", -34012, 140],
			["Ручка", -56710, 13376],
			["Ручка", -56749, 13467],
			["Ручка", -44204, 28118],
			["Ручка", -99039, 7260],
			["Ручка", -99515, 8181],
			["Ручка", -148628, 112279],
			["Ручка", -146380, 64696],
			["Ручка", 46039, 101112],
			["Ручка", 71285, 96629],
			["Ручка", 59053, 55213],
			["Ручка", 14767, 39320],
			["Ручка", 14796, 39321],
			["Ручка", 13832, 39223],
			["Ручка", 22874, 43319],
			["Ручка", 16835, 45386],
			["Ручка", 24972, 46280],
			["Ручка", 24965, 46278],
			["Ручка", 28661, 52764],
			["Ручка", 57081, 4826],
			["Ручка", 57073, 4825],
			["Ручка", 85505, -987]
			];
	for (var i = 0; i < hlam500.length; i++) {
				hlam_500 = new L.circleMarker([hlam500[i][1],hlam500[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam500[i][0])
					.bindTooltip(hlam500[i][0], {direction: 'top'})
					.addTo(hlam500icons);
			}
	}
	else {
		hlam500icons.clearLayers();
	}
}