var hlam101icons = L.layerGroup().addTo(map);
function Hlam101OnOff() {
	var chbox101;
	chbox101=document.getElementById('Hlam101Button');
	if (chbox101.checked) {
		var hlam101 = [
			["Глобус", -67324, -1387],
			["Глобус", -61665, -100893],
			["Глобус", -126221, -104590],
			["Глобус", -147954, -55976],
			["Глобус", -152012, -74432],
			["Глобус", 84659, -1945],
			["Глобус", 89660, -56501],
			["Глобус", 12091, -83673],
			["Глобус", -82639, 201992],
			["Глобус", 48478, 190781],
			["Глобус", 15022, 191399],
			["Глобус", 85160, 152014],
			["Глобус", -20701, 16713],
			["Глобус", -118458, 3299],
			["Глобус", 181141, 109714],
			["Глобус", 183687, 2960],
			["Глобус", 183393, 2913],
			["Глобус", 139821, 8624]
			];
	for (var i = 0; i < hlam101.length; i++) {
				hlam_101 = new L.circleMarker([hlam101[i][1],hlam101[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam101[i][0])
					.bindTooltip(hlam101[i][0], {direction: 'top'})
					.addTo(hlam101icons);
			}
	}
	else {
		hlam101icons.clearLayers();
	}
}
var hlam102icons = L.layerGroup().addTo(map);
function Hlam102OnOff() {
	var chbox102;
	chbox102=document.getElementById('Hlam102Button');
	if (chbox102.checked) {
		var hlam102 = [
			["Глушитель радиосигналов", -93220, -83640],
			["Глушитель радиосигналов", -125948, -73657],
			["Глушитель радиосигналов", -81941, -126316],
			["Глушитель радиосигналов", 93216, -31290],
			["Глушитель радиосигналов", 90778, -30531],
			["Глушитель радиосигналов", 90323, -33265],
			["Глушитель радиосигналов", -61612, -145761],
			["Глушитель радиосигналов", 143493, -148942],
			["Глушитель радиосигналов", 102745, -151459],
			["Глушитель радиосигналов", -145820, 172383],
			["Глушитель радиосигналов", 103538, 190698],
			["Глушитель радиосигналов", -130492, 10377]
			];
	for (var i = 0; i < hlam102.length; i++) {
				hlam_102 = new L.circleMarker([hlam102[i][1],hlam102[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam102[i][0])
					.bindTooltip(hlam102[i][0], {direction: 'top'})
					.addTo(hlam102icons);
			}
	}
	else {
		hlam102icons.clearLayers();
	}
}
var hlam103icons = L.layerGroup().addTo(map);
function Hlam103OnOff() {
	var chbox103;
	chbox103=document.getElementById('Hlam103Button');
	if (chbox103.checked) {
		var hlam103 = [
			["Голова горелого в банке", 101871, -12332]
			];
	for (var i = 0; i < hlam103.length; i++) {
				hlam_103 = new L.circleMarker([hlam103[i][1],hlam103[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam103[i][0])
					.bindTooltip(hlam103[i][0], {direction: 'top'})
					.addTo(hlam103icons);
			}
	}
	else {
		hlam103icons.clearLayers();
	}
}
var hlam104icons = L.layerGroup().addTo(map);
function Hlam104OnOff() {
	var chbox104;
	chbox104=document.getElementById('Hlam104Button');
	if (chbox104.checked) {
		var hlam104 = [
			["Голова куклы", -10031, -50357],
			["Голова куклы", -10547, -50652],
			["Голова куклы", -10557, -50647],
			["Голова куклы", -76234, -69574],
			["Голова куклы", -150908, -74128],
			["Голова куклы", 180806, -123888],
			["Голова куклы", -62449, -171389],
			["Голова куклы", -76812, -175313],
			["Голова куклы", -19041, 137585]
			];
	for (var i = 0; i < hlam104.length; i++) {
				hlam_104 = new L.circleMarker([hlam104[i][1],hlam104[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam104[i][0])
					.bindTooltip(hlam104[i][0], {direction: 'top'})
					.addTo(hlam104icons);
			}
	}
	else {
		hlam104icons.clearLayers();
	}
}
var hlam105icons = L.layerGroup().addTo(map);
function Hlam105OnOff() {
	var chbox105;
	chbox105=document.getElementById('Hlam105Button');
	if (chbox105.checked) {
		var hlam105 = [
			["Голова робопони &quotЛютик&quot", 89448, -53074],
			["Голова робопони &quotЛютик&quot", 35523, -34863],
			["Голова робопони &quotЛютик&quot", 107796, -153275],
			["Голова робопони &quotЛютик&quot", 111553, -146959],
			["Голова робопони &quotЛютик&quot", -129527, 131172]
			];
	for (var i = 0; i < hlam105.length; i++) {
				hlam_105 = new L.circleMarker([hlam105[i][1],hlam105[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam105[i][0])
					.bindTooltip(hlam105[i][0], {direction: 'top'})
					.addTo(hlam105icons);
			}
	}
	else {
		hlam105icons.clearLayers();
	}
}
var hlam106icons = L.layerGroup().addTo(map);
function Hlam106OnOff() {
	var chbox106;
	chbox106=document.getElementById('Hlam106Button');
	if (chbox106.checked) {
		var hlam106 = [
			["Горелка Бунзена", -120551, -45863],
			["Горелка Бунзена", -46795, -72920],
			["Горелка Бунзена", -82364, -126239],
			["Горелка Бунзена", -68533, -105431],
			["Горелка Бунзена", -122928, -122947],
			["Горелка Бунзена", -149051, -125717],
			["Горелка Бунзена", 50224, -44773],
			["Горелка Бунзена", 51079, -41528],
			["Горелка Бунзена", 8771, -85337],
			["Горелка Бунзена", 21242, -109695],
			["Горелка Бунзена", -4355, -156035],
			["Горелка Бунзена", -126498, -135373],
			["Горелка Бунзена", -121714, -132639],
			["Горелка Бунзена", -122244, -188064],
			["Горелка Бунзена", 188788, -165964],
			["Горелка Бунзена", 102455, -151818],
			["Горелка Бунзена", 108178, -153293],
			["Горелка Бунзена", -147140, 178649],
			["Горелка Бунзена", -143517, 179094],
			["Горелка Бунзена", 101630, 196788],
			["Горелка Бунзена", 69082, 202262],
			["Горелка Бунзена", 100577, 195998],
			["Горелка Бунзена", 93451, 189162],
			["Горелка Бунзена", 3395, 182778],
			["Горелка Бунзена", 88205, 157214],
			["Горелка Бунзена", -148440, 113837],
			["Горелка Бунзена", 153132, 57788],
			["Горелка Бунзена", 182557, 3289],
			["Горелка Бунзена", 111448, 58100]
			];
	for (var i = 0; i < hlam106.length; i++) {
				hlam_106 = new L.circleMarker([hlam106[i][1],hlam106[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam106[i][0])
					.bindTooltip(hlam106[i][0], {direction: 'top'})
					.addTo(hlam106icons);
			}
	}
	else {
		hlam106icons.clearLayers();
	}
}
var hlam107icons = L.layerGroup().addTo(map);
function Hlam107OnOff() {
	var chbox107;
	chbox107=document.getElementById('Hlam107Button');
	if (chbox107.checked) {
		var hlam107 = [
			["Грудная клетка", -102607, -56813],
			["Грудная клетка", -31086, -66094],
			["Грудная клетка", 105245, -22936],
			["Грудная клетка", 103146, -7120],
			["Грудная клетка", 56322, -2155],
			["Грудная клетка", 192402, -168844],
			["Грудная клетка", 111871, -134379],
			["Грудная клетка", 129818, -170018],
			["Грудная клетка", -60671, 180842],
			["Грудная клетка", -143875, 172234],
			["Грудная клетка", -142806, 173153],
			["Грудная клетка", 166692, 177857],
			["Грудная клетка", 166409, 178000],
			["Грудная клетка", 166623, 178042],
			["Грудная клетка", 166640, 177431],
			["Грудная клетка", 166513, 177765],
			["Грудная клетка", 166806, 177713],
			["Грудная клетка", 166384, 179152],
			["Грудная клетка", 166544, 178399],
			["Грудная клетка", 166346, 178771],
			["Грудная клетка", 166538, 178616],
			["Грудная клетка", 69161, 202610],
			["Грудная клетка", 69174, 202479],
			["Грудная клетка", 69232, 202651],
			["Грудная клетка", 69232, 202624],
			["Грудная клетка", 69230, 202597],
			["Грудная клетка", 69702, 202157],
			["Грудная клетка", 70027, 202521],
			["Грудная клетка", 57243, 191259],
			["Грудная клетка", 57247, 191205],
			["Грудная клетка", 38502, 146111],
			["Грудная клетка", 37488, 146100],
			["Грудная клетка", 38081, 144803],
			["Грудная клетка", 38993, 144566],
			["Грудная клетка", 39045, 144546],
			["Грудная клетка", 38073, 145969],
			["Грудная клетка", 38920, 146092],
			["Грудная клетка", 39153, 146041],
			["Грудная клетка", 56967, 152458],
			["Грудная клетка", -80311, 118634],
			["Грудная клетка", -56501, 8935],
			["Грудная клетка", 131728, 85063],
			["Грудная клетка", 14170, 39451],
			["Грудная клетка", 129912, 18657],
			["Грудная клетка", 52302, 3588],
			["Грудная клетка", 29921, 15078],
			["Грудная клетка", -101624, 84842]
			];
	for (var i = 0; i < hlam107.length; i++) {
				hlam_107 = new L.circleMarker([hlam107[i][1],hlam107[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam107[i][0])
					.bindTooltip(hlam107[i][0], {direction: 'top'})
					.addTo(hlam107icons);
			}
	}
	else {
		hlam107icons.clearLayers();
	}
}
var hlam108icons = L.layerGroup().addTo(map);
function Hlam108OnOff() {
	var chbox108;
	chbox108=document.getElementById('Hlam108Button');
	if (chbox108.checked) {
		var hlam108 = [
			["Грудная клетка и позвоночник", -22212, -45658],
			["Грудная клетка и позвоночник", -73129, -50791],
			["Грудная клетка и позвоночник", -71838, -78253],
			["Грудная клетка и позвоночник", -72068, -78082],
			["Грудная клетка и позвоночник", -168193, -42018],
			["Грудная клетка и позвоночник", 191731, -7615],
			["Грудная клетка и позвоночник", 191637, -8079],
			["Грудная клетка и позвоночник", 99780, -24294],
			["Грудная клетка и позвоночник", 103876, -20785],
			["Грудная клетка и позвоночник", 103682, -20730],
			["Грудная клетка и позвоночник", 104762, -21929],
			["Грудная клетка и позвоночник", 113376, -21111],
			["Грудная клетка и позвоночник", 102362, -18119],
			["Грудная клетка и позвоночник", 103718, -20348],
			["Грудная клетка и позвоночник", 102355, -8455],
			["Грудная клетка и позвоночник", 105496, -8830],
			["Грудная клетка и позвоночник", 103742, -12169],
			["Грудная клетка и позвоночник", 103130, -7400],
			["Грудная клетка и позвоночник", 103305, -7524],
			["Грудная клетка и позвоночник", 103191, -7263],
			["Грудная клетка и позвоночник", 103204, -7306],
			["Грудная клетка и позвоночник", -103172, -179313],
			["Грудная клетка и позвоночник", 186076, -167472],
			["Грудная клетка и позвоночник", 6796, -154977],
			["Грудная клетка и позвоночник", 6796, -154977],
			["Грудная клетка и позвоночник", 72456, -180796],
			["Грудная клетка и позвоночник", -61111, 182065],
			["Грудная клетка и позвоночник", 69205, 202585],
			["Грудная клетка и позвоночник", 69689, 202536],
			["Грудная клетка и позвоночник", 102369, 193340],
			["Грудная клетка и позвоночник", 38485, 146210],
			["Грудная клетка и позвоночник", 37632, 145936],
			["Грудная клетка и позвоночник", -80708, 118197],
			["Грудная клетка и позвоночник", -56421, 8995],
			["Грудная клетка и позвоночник", -56605, 8878],
			["Грудная клетка и позвоночник", -56221, 9222],
			["Грудная клетка и позвоночник", -65934, 4669],
			["Грудная клетка и позвоночник", 148993, 32912],
			["Грудная клетка и позвоночник", 20314, 90060]
			];
	for (var i = 0; i < hlam108.length; i++) {
				hlam_108 = new L.circleMarker([hlam108[i][1],hlam108[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam108[i][0])
					.bindTooltip(hlam108[i][0], {direction: 'top'})
					.addTo(hlam108icons);
			}
	}
	else {
		hlam108icons.clearLayers();
	}
}
var hlam109icons = L.layerGroup().addTo(map);
function Hlam109OnOff() {
	var chbox109;
	chbox109=document.getElementById('Hlam109Button');
	if (chbox109.checked) {
		var hlam109 = [
			["Грязная пепельница", -9633, -27388],
			["Грязная пепельница", -24563, -3103],
			["Грязная пепельница", -55068, -12580],
			["Грязная пепельница", -51896, -13684],
			["Грязная пепельница", -54892, -11034],
			["Грязная пепельница", -55860, -10279],
			["Грязная пепельница", -44062, -6725],
			["Грязная пепельница", -42901, -6085],
			["Грязная пепельница", -53346, -1074],
			["Грязная пепельница", -52533, -1038],
			["Грязная пепельница", -40697, -2518],
			["Грязная пепельница", -33799, -88],
			["Грязная пепельница", -122176, -27055],
			["Грязная пепельница", -121789, -27357],
			["Грязная пепельница", -121061, -13591],
			["Грязная пепельница", -120391, -13193],
			["Грязная пепельница", -120543, -13438],
			["Грязная пепельница", -107665, -14120],
			["Грязная пепельница", -8363, -56981],
			["Грязная пепельница", -55347, -60401],
			["Грязная пепельница", -55410, -61162],
			["Грязная пепельница", -55778, -61034],
			["Грязная пепельница", -39425, -60528],
			["Грязная пепельница", -37740, -58675],
			["Грязная пепельница", -41084, -37727],
			["Грязная пепельница", -41677, -38044],
			["Грязная пепельница", -119328, -46797],
			["Грязная пепельница", -120211, -45822],
			["Грязная пепельница", -120379, -45672],
			["Грязная пепельница", -114790, -47997],
			["Грязная пепельница", -114579, -46823],
			["Грязная пепельница", -114211, -47234],
			["Грязная пепельница", -29603, -94433],
			["Грязная пепельница", -13914, -66560],
			["Грязная пепельница", -9126, -69426],
			["Грязная пепельница", -59143, -79318],
			["Грязная пепельница", -46435, -72814],
			["Грязная пепельница", -100342, -66902],
			["Грязная пепельница", -1676, -129750],
			["Грязная пепельница", -48211, -128132],
			["Грязная пепельница", -43293, -127592],
			["Грязная пепельница", -74262, -114962],
			["Грязная пепельница", -87349, -112572],
			["Грязная пепельница", -79666, -107657],
			["Грязная пепельница", -102057, -129949],
			["Грязная пепельница", -111070, -112288],
			["Грязная пепельница", -155759, -14541],
			["Грязная пепельница", -156336, -14524],
			["Грязная пепельница", -169069, -23617],
			["Грязная пепельница", -179516, -2571],
			["Грязная пепельница", -178926, -2941],
			["Грязная пепельница", -149156, -57971],
			["Грязная пепельница", -148137, -59433],
			["Грязная пепельница", -148130, -59376],
			["Грязная пепельница", -149539, -58841],
			["Грязная пепельница", -148592, -56237],
			["Грязная пепельница", -152276, -75096],
			["Грязная пепельница", -152256, -74863],
			["Грязная пепельница", -152116, -74872],
			["Грязная пепельница", -152042, -75373],
			["Грязная пепельница", -151545, -75302],
			["Грязная пепельница", -151513, -75496],
			["Грязная пепельница", -151016, -75344],
			["Грязная пепельница", -151855, -73456],
			["Грязная пепельница", -150833, -73520],
			["Грязная пепельница", -150825, -73451],
			["Грязная пепельница", -151453, -71541],
			["Грязная пепельница", -132432, -121423],
			["Грязная пепельница", -168618, -116421],
			["Грязная пепельница", -168011, -115398],
			["Грязная пепельница", 197443, -31802],
			["Грязная пепельница", 195320, -31618],
			["Грязная пепельница", 167312, -24718],
			["Грязная пепельница", 167028, -22007],
			["Грязная пепельница", 173401, -13633],
			["Грязная пепельница", 173354, -11526],
			["Грязная пепельница", 131141, -31345],
			["Грязная пепельница", 155255, -32294],
			["Грязная пепельница", 148857, -52393],
			["Грязная пепельница", 151775, -49861],
			["Грязная пепельница", 150546, -46511],
			["Грязная пепельница", 183720, -92465],
			["Грязная пепельница", 185145, -65638],
			["Грязная пепельница", 147297, -78489],
			["Грязная пепельница", 147166, -78326],
			["Грязная пепельница", 149568, -75807],
			["Грязная пепельница", 149713, -67416],
			["Грязная пепельница", 99952, -29982],
			["Грязная пепельница", 128572, -30311],
			["Грязная пепельница", 128447, -30321],
			["Грязная пепельница", 104046, -19612],
			["Грязная пепельница", 102947, -20203],
			["Грязная пепельница", 103987, -14471],
			["Грязная пепельница", 90779, -30245],
			["Грязная пепельница", 81439, -21017],
			["Грязная пепельница", 81200, -21168],
			["Грязная пепельница", 82158, -20802],
			["Грязная пепельница", 87856, -21388],
			["Грязная пепельница", 74333, -18282],
			["Грязная пепельница", 76853, -15013],
			["Грязная пепельница", 77233, -15361],
			["Грязная пепельница", 74691, -9116],
			["Грязная пепельница", 75048, -8927],
			["Грязная пепельница", 75048, -9673],
			["Грязная пепельница", 93586, -7927],
			["Грязная пепельница", 85370, -2733],
			["Грязная пепельница", 49150, -21284],
			["Грязная пепельница", 47902, -21307],
			["Грязная пепельница", 59805, -22973],
			["Грязная пепельница", 34767, -6277],
			["Грязная пепельница", 4898, -31604],
			["Грязная пепельница", 6045, -32704],
			["Грязная пепельница", 28067, -31688],
			["Грязная пепельница", 29562, -21343],
			["Грязная пепельница", 91765, -59397],
			["Грязная пепельница", 89546, -52748],
			["Грязная пепельница", 64135, -50099],
			["Грязная пепельница", 36042, -42181],
			["Грязная пепельница", 51384, -41872],
			["Грязная пепельница", 51553, -40656],
			["Грязная пепельница", 29095, -58141],
			["Грязная пепельница", 27653, -44953],
			["Грязная пепельница", 75641, -76693],
			["Грязная пепельница", 54647, -67051],
			["Грязная пепельница", 56440, -67260],
			["Грязная пепельница", 8598, -82557],
			["Грязная пепельница", 9000, -79566],
			["Грязная пепельница", 11271, -77234],
			["Грязная пепельница", 125749, -99214],
			["Грязная пепельница", 54287, -128611],
			["Грязная пепельница", 37602, -119115],
			["Грязная пепельница", 47115, -104671],
			["Грязная пепельница", 47293, -104416],
			["Грязная пепельница", 18905, -106690],
			["Грязная пепельница", 18796, -106918],
			["Грязная пепельница", 18953, -106901],
			["Грязная пепельница", 20508, -108358],
			["Грязная пепельница", 19319, -104516],
			["Грязная пепельница", 19949, -104271],
			["Грязная пепельница", 19742, -104386],
			["Грязная пепельница", 28910, -101199],
			["Грязная пепельница", 29506, -101195],
			["Грязная пепельница", -4236, -155921],
			["Грязная пепельница", -30912, -152162],
			["Грязная пепельница", -41756, -135712],
			["Грязная пепельница", -126583, -144708],
			["Грязная пепельница", -24167, -179784],
			["Грязная пепельница", -24149, -179929],
			["Грязная пепельница", -14619, -173621],
			["Грязная пепельница", -53163, -168082],
			["Грязная пепельница", -80316, -180916],
			["Грязная пепельница", -84595, -176985],
			["Грязная пепельница", -120617, -188315],
			["Грязная пепельница", -133863, -153876],
			["Грязная пепельница", -139616, -144704],
			["Грязная пепельница", 197143, -143286],
			["Грязная пепельница", 203125, -138222],
			["Грязная пепельница", 166695, -149200],
			["Грязная пепельница", 108518, -161281],
			["Грязная пепельница", 115211, -157620],
			["Грязная пепельница", 52184, -149225],
			["Грязная пепельница", 51133, -151114],
			["Грязная пепельница", 22671, -150001],
			["Грязная пепельница", 22362, -150253],
			["Грязная пепельница", 76685, -179249],
			["Грязная пепельница", 74231, -177026],
			["Грязная пепельница", -63764, 202786],
			["Грязная пепельница", -97398, 199785],
			["Грязная пепельница", -97683, 200272],
			["Грязная пепельница", -25640, 185840],
			["Грязная пепельница", -25398, 186067],
			["Грязная пепельница", -25023, 185963],
			["Грязная пепельница", -25375, 185982],
			["Грязная пепельница", -10327, 192661],
			["Грязная пепельница", -9820, 193082],
			["Грязная пепельница", -60043, 182238],
			["Грязная пепельница", -60968, 181307],
			["Грязная пепельница", -84170, 166009],
			["Грязная пепельница", -95254, 183108],
			["Грязная пепельница", -92819, 183681],
			["Грязная пепельница", -95492, 184428],
			["Грязная пепельница", -1034, 158334],
			["Грязная пепельница", -5757, 161865],
			["Грязная пепельница", -5982, 161905],
			["Грязная пепельница", -5818, 162114],
			["Грязная пепельница", -6074, 162207],
			["Грязная пепельница", -3495, 162708],
			["Грязная пепельница", -35572, 158644],
			["Грязная пепельница", -121393, 143203],
			["Грязная пепельница", -163323, 200495],
			["Грязная пепельница", -163263, 200842],
			["Грязная пепельница", -141139, 170406],
			["Грязная пепельница", -144632, 173188],
			["Грязная пепельница", -145350, 174310],
			["Грязная пепельница", -143459, 178990],
			["Грязная пепельница", -156704, 190962],
			["Грязная пепельница", -144415, 137835],
			["Грязная пепельница", -141090, 142933],
			["Грязная пепельница", -142351, 143756],
			["Грязная пепельница", -160449, 152515],
			["Грязная пепельница", -141054, 156309],
			["Грязная пепельница", 179752, 133108],
			["Грязная пепельница", 152457, 139864],
			["Грязная пепельница", 153164, 139940],
			["Грязная пепельница", 152789, 161920],
			["Грязная пепельница", 70014, 202564],
			["Грязная пепельница", 16198, 197499],
			["Грязная пепельница", 101286, 192487],
			["Грязная пепельница", 79426, 176426],
			["Грязная пепельница", 79723, 176330],
			["Грязная пепельница", 79830, 176341],
			["Грязная пепельница", 79791, 176364],
			["Грязная пепельница", 44235, 164119],
			["Грязная пепельница", 61233, 172414],
			["Грязная пепельница", 64262, 173739],
			["Грязная пепельница", 63533, 177160],
			["Грязная пепельница", 1744, 164574],
			["Грязная пепельница", 71769, 133133],
			["Грязная пепельница", 72559, 133525],
			["Грязная пепельница", 77623, 151347],
			["Грязная пепельница", 75478, 151173],
			["Грязная пепельница", 88174, 157338],
			["Грязная пепельница", 47707, 143499],
			["Грязная пепельница", 43830, 163146],
			["Грязная пепельница", 29217, 131471],
			["Грязная пепельница", 2364, 138472],
			["Грязная пепельница", -129198, 119315],
			["Грязная пепельница", -129197, 119768],
			["Грязная пепельница", -38975, 84137],
			["Грязная пепельница", -42796, 87183],
			["Грязная пепельница", -41713, 87491],
			["Грязная пепельница", -41943, 87925],
			["Грязная пепельница", -42021, 88024],
			["Грязная пепельница", -128023, 80406],
			["Грязная пепельница", -17804, 59962],
			["Грязная пепельница", -39786, 47107],
			["Грязная пепельница", -37443, 48817],
			["Грязная пепельница", -52239, 55058],
			["Грязная пепельница", -52251, 56380],
			["Грязная пепельница", -119676, 40125],
			["Грязная пепельница", -104212, 38522],
			["Грязная пепельница", -104162, 38625],
			["Грязная пепельница", -104024, 38664],
			["Грязная пепельница", -23337, 11968],
			["Грязная пепельница", -19931, 15441],
			["Грязная пепельница", -41908, 2824],
			["Грязная пепельница", -39230, 3483],
			["Грязная пепельница", -37983, 3844],
			["Грязная пепельница", -33641, 99],
			["Грязная пепельница", -49291, 5161],
			["Грязная пепельница", -44032, 6406],
			["Грязная пепельница", -39255, 4760],
			["Грязная пепельница", -39759, 6321],
			["Грязная пепельница", -47828, 15375],
			["Грязная пепельница", -48830, 19389],
			["Грязная пепельница", -122623, 3088],
			["Грязная пепельница", -148739, 113556],
			["Грязная пепельница", -179495, 74180],
			["Грязная пепельница", -152823, 952],
			["Грязная пепельница", -131966, 12577],
			["Грязная пепельница", 180723, 111066],
			["Грязная пепельница", 182842, 111933],
			["Грязная пепельница", 133364, 126099],
			["Грязная пепельница", 136404, 124095],
			["Грязная пепельница", 198528, 94472],
			["Грязная пепельница", 199190, 94367],
			["Грязная пепельница", 131403, 85243],
			["Грязная пепельница", 131965, 87272],
			["Грязная пепельница", 172685, 39757],
			["Грязная пепельница", 171711, 57858],
			["Грязная пепельница", 169760, 60225],
			["Грязная пепельница", 132273, 54958],
			["Грязная пепельница", 151682, 54461],
			["Грязная пепельница", 182721, 2945],
			["Грязная пепельница", 182831, 2768],
			["Грязная пепельница", 183124, 2550],
			["Грязная пепельница", 183429, 2440],
			["Грязная пепельница", 183421, 2468],
			["Грязная пепельница", 182374, 2495],
			["Грязная пепельница", 182977, 2751],
			["Грязная пепельница", 183471, 2606],
			["Грязная пепельница", 185462, 3777],
			["Грязная пепельница", 139530, 8455],
			["Грязная пепельница", 134401, 15646],
			["Грязная пепельница", 157285, 13501],
			["Грязная пепельница", 95388, 99123],
			["Грязная пепельница", 95290, 99056],
			["Грязная пепельница", 96069, 106321],
			["Грязная пепельница", 94695, 104405],
			["Грязная пепельница", 94561, 103207],
			["Грязная пепельница", 24090, 122080],
			["Грязная пепельница", 24413, 122022],
			["Грязная пепельница", 25906, 122128],
			["Грязная пепельница", 25161, 124434],
			["Грязная пепельница", 25696, 124490],
			["Грязная пепельница", 28177, 127289],
			["Грязная пепельница", 27583, 130977],
			["Грязная пепельница", 26316, 127707],
			["Грязная пепельница", 100392, 71897],
			["Грязная пепельница", 130567, 86425],
			["Грязная пепельница", 129108, 87358],
			["Грязная пепельница", 20330, 90830],
			["Грязная пепельница", 77807, 33946],
			["Грязная пепельница", 35308, 40465],
			["Грязная пепельница", 35682, 40487],
			["Грязная пепельница", 36256, 39117],
			["Грязная пепельница", 58980, 55160],
			["Грязная пепельница", 58418, 53375],
			["Грязная пепельница", 13967, 38786],
			["Грязная пепельница", 13793, 38821],
			["Грязная пепельница", 13937, 39165],
			["Грязная пепельница", 7528, 44335],
			["Грязная пепельница", 7548, 44111],
			["Грязная пепельница", 7476, 43912],
			["Грязная пепельница", 7487, 43551],
			["Грязная пепельница", 17132, 41710],
			["Грязная пепельница", 16901, 45378],
			["Грязная пепельница", 25635, 45747],
			["Грязная пепельница", 27538, 50010],
			["Грязная пепельница", 90648, 8023],
			["Грязная пепельница", 51867, 1303],
			["Грязная пепельница", 51525, 12127],
			["Грязная пепельница", 55514, 10241],
			["Грязная пепельница", 55979, 12731]
			];
	for (var i = 0; i < hlam109.length; i++) {
				hlam_109 = new L.circleMarker([hlam109[i][1],hlam109[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam109[i][0])
					.bindTooltip(hlam109[i][0], {direction: 'top'})
					.addTo(hlam109icons);
			}
	}
	else {
		hlam109icons.clearLayers();
	}
}
var hlam110icons = L.layerGroup().addTo(map);
function Hlam110OnOff() {
	var chbox110;
	chbox110=document.getElementById('Hlam110Button');
	if (chbox110.checked) {
		var hlam110 = [
			["Грязная подушка", -150901, -74154],
			["Грязная подушка", 101965, -11743],
			["Грязная подушка", -73760, -174114],
			["Грязная подушка", -74627, -176055],
			["Грязная подушка", 67027, 19927],
			["Грязная подушка", 67031, 19922],
			["Грязная подушка", 70804, 20424],
			["Грязная подушка", 77702, 20987],
			["Грязная подушка", 78037, 20968],
			["Грязная подушка", 78079, 20973],
			["Грязная подушка", 78066, 20971]
			];
	for (var i = 0; i < hlam110.length; i++) {
				hlam_110 = new L.circleMarker([hlam110[i][1],hlam110[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam110[i][0])
					.bindTooltip(hlam110[i][0], {direction: 'top'})
					.addTo(hlam110icons);
			}
	}
	else {
		hlam110icons.clearLayers();
	}
}
var hlam111icons = L.layerGroup().addTo(map);
function Hlam111OnOff() {
	var chbox111;
	chbox111=document.getElementById('Hlam111Button');
	if (chbox111.checked) {
		var hlam111 = [
			["Грязная подушка", 56044, -66113],
			["Грязная подушка", -74629, -176015],
			["Грязная подушка", -73714, -174122]
			];
	for (var i = 0; i < hlam111.length; i++) {
				hlam_111 = new L.circleMarker([hlam111[i][1],hlam111[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam111[i][0])
					.bindTooltip(hlam111[i][0], {direction: 'top'})
					.addTo(hlam111icons);
			}
	}
	else {
		hlam111icons.clearLayers();
	}
}
var hlam112icons = L.layerGroup().addTo(map);
function Hlam112OnOff() {
	var chbox112;
	chbox112=document.getElementById('Hlam112Button');
	if (chbox112.checked) {
		var hlam112 = [
			["Грязная фоторамка", -52356, -13913],
			["Грязная фоторамка", -13924, -66545],
			["Грязная фоторамка", -69868, -96399],
			["Грязная фоторамка", -121999, -66371],
			["Грязная фоторамка", -148262, -59045],
			["Грязная фоторамка", -151531, -74604],
			["Грязная фоторамка", -152548, -73490],
			["Грязная фоторамка", -152150, -73505],
			["Грязная фоторамка", -152151, -73613],
			["Грязная фоторамка", -152109, -73082],
			["Грязная фоторамка", -151776, -72222],
			["Грязная фоторамка", -152066, -72240],
			["Грязная фоторамка", -151579, -72825],
			["Грязная фоторамка", -151328, -72520],
			["Грязная фоторамка", -151443, -71532],
			["Грязная фоторамка", -151471, -72829],
			["Грязная фоторамка", 167020, -24718],
			["Грязная фоторамка", 147695, -78271],
			["Грязная фоторамка", 150255, -67447],
			["Грязная фоторамка", 76833, -14746],
			["Грязная фоторамка", 77749, -11264],
			["Грязная фоторамка", 28096, -31764],
			["Грязная фоторамка", 91609, -59187],
			["Грязная фоторамка", 35453, -35306],
			["Грязная фоторамка", 29063, -58395],
			["Грязная фоторамка", 29373, -58627],
			["Грязная фоторамка", 75756, -76893],
			["Грязная фоторамка", 46080, -66053],
			["Грязная фоторамка", 9521, -79348],
			["Грязная фоторамка", 13463, -106956],
			["Грязная фоторамка", 22209, -105393],
			["Грязная фоторамка", -72642, -132573],
			["Грязная фоторамка", -8256, -165442],
			["Грязная фоторамка", -135314, -155968],
			["Грязная фоторамка", -131725, -158366],
			["Грязная фоторамка", -136292, -154478],
			["Грязная фоторамка", -136318, -154463],
			["Грязная фоторамка", -133838, -153781],
			["Грязная фоторамка", 131520, -131993],
			["Грязная фоторамка", 115724, -157995],
			["Грязная фоторамка", 71900, -175232],
			["Грязная фоторамка", 71865, -173333],
			["Грязная фоторамка", 48932, 190965],
			["Грязная фоторамка", 1366, 164461],
			["Грязная фоторамка", 1920, 164453],
			["Грязная фоторамка", 14140, 193719],
			["Грязная фоторамка", 72280, 133744],
			["Грязная фоторамка", 1972, 138531],
			["Грязная фоторамка", -13866, 118874],
			["Грязная фоторамка", -13871, 119515],
			["Грязная фоторамка", -40986, 87676],
			["Грязная фоторамка", -19519, 16684],
			["Грязная фоторамка", -46674, 2564],
			["Грязная фоторамка", -46692, 2557],
			["Грязная фоторамка", -46602, 2609],
			["Грязная фоторамка", -38800, 3680],
			["Грязная фоторамка", -44217, 28094],
			["Грязная фоторамка", -99682, 8028],
			["Грязная фоторамка", -98673, 7840],
			["Грязная фоторамка", -133963, 59242],
			["Грязная фоторамка", 133432, 121659],
			["Грязная фоторамка", 186382, 13908],
			["Грязная фоторамка", 95452, 99019],
			["Грязная фоторамка", 45912, 101258],
			["Грязная фоторамка", 26464, 130930],
			["Грязная фоторамка", 26215, 127668],
			["Грязная фоторамка", 57901, 10906],
			["Грязная фоторамка", 57729, 11747]
			];
	for (var i = 0; i < hlam112.length; i++) {
				hlam_112 = new L.circleMarker([hlam112[i][1],hlam112[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam112[i][0])
					.bindTooltip(hlam112[i][0], {direction: 'top'})
					.addTo(hlam112icons);
			}
	}
	else {
		hlam112icons.clearLayers();
	}
}
var hlam113icons = L.layerGroup().addTo(map);
function Hlam113OnOff() {
	var chbox113;
	chbox113=document.getElementById('Hlam113Button');
	if (chbox113.checked) {
		var hlam113 = [
			["Губная гармошка", 118193, -5016],
			["Губная гармошка", -123552, -137435],
			["Губная гармошка", -74627, -175966],
			["Губная гармошка", 6747, -154971],
			["Губная гармошка", 6747, -154971],
			["Губная гармошка", -37994, 95308],
			["Губная гармошка", -75532, 89393],
			["Губная гармошка", -99801, 35712],
			["Губная гармошка", -18842, 17514],
			["Губная гармошка", 138336, 19350],
			["Губная гармошка", 14295, 44420]
			];
	for (var i = 0; i < hlam113.length; i++) {
				hlam_113 = new L.circleMarker([hlam113[i][1],hlam113[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam113[i][0])
					.bindTooltip(hlam113[i][0], {direction: 'top'})
					.addTo(hlam113icons);
			}
	}
	else {
		hlam113icons.clearLayers();
	}
}
var hlam114icons = L.layerGroup().addTo(map);
function Hlam114OnOff() {
	var chbox114;
	chbox114=document.getElementById('Hlam114Button');
	if (chbox114.checked) {
		var hlam114 = [
			["Деревянная ложка", -53197, -13471],
			["Деревянная ложка", -127930, -839],
			["Деревянная ложка", -126710, -1278],
			["Деревянная ложка", -45500, -70345],
			["Деревянная ложка", -69656, -96311],
			["Деревянная ложка", -14469, -125374],
			["Деревянная ложка", -14183, -125322],
			["Деревянная ложка", -48929, -128786],
			["Деревянная ложка", -147771, -56988],
			["Деревянная ложка", 183575, -93124],
			["Деревянная ложка", 181064, -123160],
			["Деревянная ложка", 89042, -31669],
			["Деревянная ложка", 34081, -32664],
			["Деревянная ложка", 29707, -20720],
			["Деревянная ложка", 113632, -56011],
			["Деревянная ложка", 33930, -32896],
			["Деревянная ложка", 13820, -107283],
			["Деревянная ложка", 18119, -106528],
			["Деревянная ложка", -61004, -145126],
			["Деревянная ложка", -99443, -132088],
			["Деревянная ложка", -120690, -189508],
			["Деревянная ложка", -32392, 171617],
			["Деревянная ложка", -4309, 184926],
			["Деревянная ложка", 193770, 167308],
			["Деревянная ложка", 151530, 138793],
			["Деревянная ложка", 151635, 138511],
			["Деревянная ложка", 48331, 190411],
			["Деревянная ложка", 11651, 183018],
			["Деревянная ложка", 105281, 156744],
			["Деревянная ложка", 45742, 162620],
			["Деревянная ложка", 830, 158236],
			["Деревянная ложка", 7137, 161431],
			["Деревянная ложка", -65607, 129499],
			["Деревянная ложка", -56841, 89731],
			["Деревянная ложка", -123560, 51381],
			["Деревянная ложка", -46964, 18879],
			["Деревянная ложка", -127972, 30771],
			["Деревянная ложка", -138343, 89184],
			["Деревянная ложка", -138985, 90641],
			["Деревянная ложка", 193091, 113289],
			["Деревянная ложка", 135213, 115399],
			["Деревянная ложка", 168788, 56265],
			["Деревянная ложка", 94824, 99229],
			["Деревянная ложка", 97081, 104937],
			["Деревянная ложка", 27564, 122557],
			["Деревянная ложка", 72459, 37763],
			["Деревянная ложка", 73933, 38286],
			["Деревянная ложка", 34795, 39888],
			["Деревянная ложка", 14822, 39656],
			["Деревянная ложка", 100702, 25676],
			["Деревянная ложка", 152414, 138869],
			["Деревянная ложка", -139248, -143981]
			];
	for (var i = 0; i < hlam114.length; i++) {
				hlam_114 = new L.circleMarker([hlam114[i][1],hlam114[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam114[i][0])
					.bindTooltip(hlam114[i][0], {direction: 'top'})
					.addTo(hlam114icons);
			}
	}
	else {
		hlam114icons.clearLayers();
	}
}
var hlam115icons = L.layerGroup().addTo(map);
function Hlam115OnOff() {
	var chbox115;
	chbox115=document.getElementById('Hlam115Button');
	if (chbox115.checked) {
		var hlam115 = [
			["Деревянная лыжа", 53666, -3313],
			["Деревянная лыжа", 6620, -20753],
			["Деревянная лыжа", 6707, -20772],
			["Деревянная лыжа", 6693, -20844],
			["Деревянная лыжа", 6755, -20829],
			["Деревянная лыжа", 6619, -20591],
			["Деревянная лыжа", 6667, -20529],
			["Деревянная лыжа", 6755, -20563],
			["Деревянная лыжа", 6770, -20608],
			["Деревянная лыжа", 6786, -20549],
			["Деревянная лыжа", 6808, -20506],
			["Деревянная лыжа", 6690, -20469],
			["Деревянная лыжа", 17850, -1418],
			["Деревянная лыжа", 17842, -1400],
			["Деревянная лыжа", 17857, -1479],
			["Деревянная лыжа", 17860, -1470],
			["Деревянная лыжа", 17814, -133],
			["Деревянная лыжа", -81006, -178398],
			["Деревянная лыжа", -159260, 55810],
			["Деревянная лыжа", -159359, 55756],
			["Деревянная лыжа", 190887, 115587],
			["Деревянная лыжа", 190884, 115589],
			["Деревянная лыжа", 131210, 75330],
			["Деревянная лыжа", 131206, 75503],
			["Деревянная лыжа", 133148, 76215],
			["Деревянная лыжа", 133123, 76220],
			["Деревянная лыжа", 132792, 76205],
			["Деревянная лыжа", 132431, 79948],
			["Деревянная лыжа", 132421, 79943],
			["Деревянная лыжа", 131647, 86659],
			["Деревянная лыжа", 131431, 86756],
			["Деревянная лыжа", 131489, 86752],
			["Деревянная лыжа", 131427, 86802],
			["Деревянная лыжа", 139364, 94382],
			["Деревянная лыжа", 139373, 94368],
			["Деревянная лыжа", 144399, 97724],
			["Деревянная лыжа", 143389, 97997],
			["Деревянная лыжа", 143544, 97357],
			["Деревянная лыжа", 143534, 97371],
			["Деревянная лыжа", 143583, 96964],
			["Деревянная лыжа", 143648, 97014],
			["Деревянная лыжа", 130711, 74926],
			["Деревянная лыжа", 130713, 74930],
			["Деревянная лыжа", 129381, 85629],
			["Деревянная лыжа", 129527, 85876],
			["Деревянная лыжа", 129526, 85825],
			["Деревянная лыжа", 129688, 86069],
			["Деревянная лыжа", 35555, 71882],
			["Деревянная лыжа", 41158, 77007],
			["Деревянная лыжа", 49224, 85820],
			["Деревянная лыжа", 50207, 84852],
			["Деревянная лыжа", 25639, 69314],
			["Деревянная лыжа", 26283, 70606],
			["Деревянная лыжа", 2910, 85979],
			["Деревянная лыжа", 2902, 85989],
			["Деревянная лыжа", 35713, 40076],
			["Деревянная лыжа", 36013, 38553],
			["Деревянная лыжа", 35754, 38229],
			["Деревянная лыжа", 36208, 39351],
			["Деревянная лыжа", 35524, 39935],
			["Деревянная лыжа", 35559, 40382],
			["Деревянная лыжа", 36974, 41452],
			["Деревянная лыжа", 37270, 41142],
			["Деревянная лыжа", 17596, 35771],
			["Деревянная лыжа", 22177, 34916],
			["Деревянная лыжа", 26398, 32840],
			["Деревянная лыжа", 5566, 39943],
			["Деревянная лыжа", 5589, 39924],
			["Деревянная лыжа", 14775, 40046],
			["Деревянная лыжа", 14778, 40043],
			["Деревянная лыжа", 16216, 39958],
			["Деревянная лыжа", 16221, 39942],
			["Деревянная лыжа", 14881, 36898],
			["Деревянная лыжа", 13214, 38181],
			["Деревянная лыжа", 12738, 38744],
			["Деревянная лыжа", 12793, 38764],
			["Деревянная лыжа", 13036, 38576],
			["Деревянная лыжа", 13016, 38618],
			["Деревянная лыжа", 13646, 37802],
			["Деревянная лыжа", 13463, 37525],
			["Деревянная лыжа", 13533, 37507],
			["Деревянная лыжа", 12629, 37801],
			["Деревянная лыжа", 12321, 37711],
			["Деревянная лыжа", 14501, 37764],
			["Деревянная лыжа", 12968, 38738],
			["Деревянная лыжа", 12956, 38776],
			["Деревянная лыжа", 12930, 38785],
			["Деревянная лыжа", 13725, 39988],
			["Деревянная лыжа", 13709, 39993],
			["Деревянная лыжа", 15526, 39382],
			["Деревянная лыжа", 15515, 39387],
			["Деревянная лыжа", 15555, 39344],
			["Деревянная лыжа", 15549, 39352],
			["Деревянная лыжа", 7491, 44141],
			["Деревянная лыжа", 7537, 43961],
			["Деревянная лыжа", 6006, 43281],
			["Деревянная лыжа", 7339, 43600],
			["Деревянная лыжа", 7480, 43689],
			["Деревянная лыжа", 6163, 41843],
			["Деревянная лыжа", 7127, 42529],
			["Деревянная лыжа", 6476, 41685],
			["Деревянная лыжа", 7157, 42428],
			["Деревянная лыжа", 7135, 42549],
			["Деревянная лыжа", 8167, 42844],
			["Деревянная лыжа", 7043, 41740],
			["Деревянная лыжа", 7213, 41855],
			["Деревянная лыжа", 7136, 41780],
			["Деревянная лыжа", 7140, 41780],
			["Деревянная лыжа", 6023, 43264],
			["Деревянная лыжа", 13491, 43419],
			["Деревянная лыжа", 15586, 43857],
			["Деревянная лыжа", 15567, 43836],
			["Деревянная лыжа", 14088, 44231],
			["Деревянная лыжа", 14146, 44228],
			["Деревянная лыжа", 13924, 44346],
			["Деревянная лыжа", 16681, 44711],
			["Деревянная лыжа", 16676, 44749],
			["Деревянная лыжа", 16058, 45462],
			["Деревянная лыжа", 16057, 45477],
			["Деревянная лыжа", 15999, 45435],
			["Деревянная лыжа", 16001, 45418],
			["Деревянная лыжа", 14316, 47578],
			["Деревянная лыжа", 14272, 47588],
			["Деревянная лыжа", 14268, 47594],
			["Деревянная лыжа", 15013, 47854],
			["Деревянная лыжа", 14952, 47932],
			["Деревянная лыжа", 15601, 47813],
			["Деревянная лыжа", 15601, 47828],
			["Деревянная лыжа", 15542, 47786],
			["Деревянная лыжа", 15671, 47660],
			["Деревянная лыжа", 16152, 48281],
			["Деревянная лыжа", 16128, 48297],
			["Деревянная лыжа", 16257, 48245],
			["Деревянная лыжа", 14597, 46235],
			["Деревянная лыжа", 14527, 46303],
			["Деревянная лыжа", 14530, 46313],
			["Деревянная лыжа", 14558, 46340],
			["Деревянная лыжа", 14528, 46073],
			["Деревянная лыжа", 14537, 46001],
			["Деревянная лыжа", 14530, 45994],
			["Деревянная лыжа", 14568, 46038],
			["Деревянная лыжа", 14565, 46027],
			["Деревянная лыжа", 14606, 45789],
			["Деревянная лыжа", 14604, 45731],
			["Деревянная лыжа", 16791, 45456],
			["Деревянная лыжа", 16788, 45441],
			["Деревянная лыжа", 20463, 47205],
			["Деревянная лыжа", 20387, 47228],
			["Деревянная лыжа", 20525, 47677],
			["Деревянная лыжа", 20515, 47680],
			["Деревянная лыжа", 21017, 47748],
			["Деревянная лыжа", 28101, 48599],
			["Деревянная лыжа", 28103, 48588],
			["Деревянная лыжа", 16367, 51746],
			["Деревянная лыжа", 15877, 51579],
			["Деревянная лыжа", 17102, 51818],
			["Деревянная лыжа", 28848, 53663],
			["Деревянная лыжа", 28904, 53759],
			["Деревянная лыжа", 52184, 5930],
			["Деревянная лыжа", 52342, 8518],
			["Деревянная лыжа", 51561, 12057],
			["Деревянная лыжа", 14490, 28694],
			["Деревянная лыжа", 14507, 28690],
			["Деревянная лыжа", 15082, 28706],
			["Деревянная лыжа", 15006, 28767],
			["Деревянная лыжа", 14991, 28747],
			["Деревянная лыжа", 14635, 30847],
			["Деревянная лыжа", 14316, 29639],
			["Деревянная лыжа", 14322, 29735],
			["Деревянная лыжа", 14417, 29638],
			["Деревянная лыжа", 14339, 30700],
			["Деревянная лыжа", 14449, 30555],
			["Деревянная лыжа", 13834, 31854],
			["Деревянная лыжа", 22103, 29241],
			["Деревянная лыжа", 22106, 29230],
			["Деревянная лыжа", 22200, 29027],
			["Деревянная лыжа", 22202, 29012],
			["Деревянная лыжа", 26767, 32684],
			["Деревянная лыжа", 26776, 32564],
			["Деревянная лыжа", 135812, 90541],
			["Деревянная лыжа", 135778, 90576],
			["Деревянная лыжа", 137997, 98335],
			["Деревянная лыжа", 130769, 86305],
			["Деревянная лыжа", 130770, 86301],
			["Деревянная лыжа", 24693, 45880],
			["Деревянная лыжа", 24683, 45876]
			];
	for (var i = 0; i < hlam115.length; i++) {
				hlam_115 = new L.circleMarker([hlam115[i][1],hlam115[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam115[i][0])
					.bindTooltip(hlam115[i][0], {direction: 'top'})
					.addTo(hlam115icons);
			}
	}
	else {
		hlam115icons.clearLayers();
	}
}
var hlam116icons = L.layerGroup().addTo(map);
function Hlam116OnOff() {
	var chbox116;
	chbox116=document.getElementById('Hlam116Button');
	if (chbox116.checked) {
		var hlam116 = [
			["Деревянная пивная кружка с крышкой", -42605, -5398],
			["Деревянная пивная кружка с крышкой", -152009, -72716],
			["Деревянная пивная кружка с крышкой", 91952, -58966],
			["Деревянная пивная кружка с крышкой", 37428, -38556],
			["Деревянная пивная кружка с крышкой", 35497, -34866],
			["Деревянная пивная кружка с крышкой", 33457, -32948],
			["Деревянная пивная кружка с крышкой", 33340, -33125],
			["Деревянная пивная кружка с крышкой", 33667, -33721],
			["Деревянная пивная кружка с крышкой", 33562, -33693],
			["Деревянная пивная кружка с крышкой", 32745, -40549],
			["Деревянная пивная кружка с крышкой", 131775, 86057],
			["Деревянная пивная кружка с крышкой", 128669, 85406]
			];
	for (var i = 0; i < hlam116.length; i++) {
				hlam_116 = new L.circleMarker([hlam116[i][1],hlam116[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam116[i][0])
					.bindTooltip(hlam116[i][0], {direction: 'top'})
					.addTo(hlam116icons);
			}
	}
	else {
		hlam116icons.clearLayers();
	}
}
var hlam117icons = L.layerGroup().addTo(map);
function Hlam117OnOff() {
	var chbox117;
	chbox117=document.getElementById('Hlam117Button');
	if (chbox117.checked) {
		var hlam117 = [
			["Деревянное ведро", -21718, -57999],
			["Деревянное ведро", -163203, -53415],
			["Деревянное ведро", 17948, -1510],
			["Деревянное ведро", 32963, -40921],
			["Деревянное ведро", 35376, -34956],
			["Деревянное ведро", 33622, -33352],
			["Деревянное ведро", -93788, -175295],
			["Деревянное ведро", 68890, 203449],
			["Деревянное ведро", 556, 137974],
			["Деревянное ведро", -99193, 8109],
			["Деревянное ведро", 196590, 65569],
			["Деревянное ведро", 195426, 65595],
			["Деревянное ведро", 194224, 56372],
			["Деревянное ведро", 193177, 57809]
			];
	for (var i = 0; i < hlam117.length; i++) {
				hlam_117 = new L.circleMarker([hlam117[i][1],hlam117[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam117[i][0])
					.bindTooltip(hlam117[i][0], {direction: 'top'})
					.addTo(hlam117icons);
			}
	}
	else {
		hlam117icons.clearLayers();
	}
}
var hlam118icons = L.layerGroup().addTo(map);
function Hlam118OnOff() {
	var chbox118;
	chbox118=document.getElementById('Hlam118Button');
	if (chbox118.checked) {
		var hlam118 = [
			["Деревянный кубик — B и Y", -9495, -27059],
			["Деревянный кубик — B и Y", -51921, -12857],
			["Деревянный кубик — B и Y", -51915, -12865],
			["Деревянный кубик — B и Y", -54808, -11896],
			["Деревянный кубик — B и Y", -44013, -8063],
			["Деревянный кубик — B и Y", -38496, -61656],
			["Деревянный кубик — B и Y", -38485, -61646],
			["Деревянный кубик — B и Y", -61779, -57406],
			["Деревянный кубик — B и Y", -61770, -57409],
			["Деревянный кубик — B и Y", -61753, -57414],
			["Деревянный кубик — B и Y", -61744, -57418],
			["Деревянный кубик — B и Y", -61817, -55644],
			["Деревянный кубик — B и Y", -61812, -55647],
			["Деревянный кубик — B и Y", -61812, -55652],
			["Деревянный кубик — B и Y", -61823, -55676],
			["Деревянный кубик — B и Y", -61819, -55672],
			["Деревянный кубик — B и Y", -61821, -55667],
			["Деревянный кубик — B и Y", -107759, -56098],
			["Деревянный кубик — B и Y", -62479, -128987],
			["Деревянный кубик — B и Y", -144118, -13446],
			["Деревянный кубик — B и Y", 67576, -14534],
			["Деревянный кубик — B и Y", 67584, -14549],
			["Деревянный кубик — B и Y", 88991, -5991],
			["Деревянный кубик — B и Y", 16783, -44889],
			["Деревянный кубик — B и Y", 16776, -44884],
			["Деревянный кубик — B и Y", 17126, -44423],
			["Деревянный кубик — B и Y", 17087, -44415],
			["Деревянный кубик — B и Y", 16759, -44898],
			["Деревянный кубик — B и Y", 60920, -96559],
			["Деревянный кубик — B и Y", 11610, -83616],
			["Деревянный кубик — B и Y", 21094, -102418],
			["Деревянный кубик — B и Y", -2386, -159838],
			["Деревянный кубик — B и Y", -2387, -159837],
			["Деревянный кубик — B и Y", -29907, -132421],
			["Деревянный кубик — B и Y", -29882, -132415],
			["Деревянный кубик — B и Y", -124160, -131359],
			["Деревянный кубик — B и Y", -62223, -170970],
			["Деревянный кубик — B и Y", -75671, -178737],
			["Деревянный кубик — B и Y", -75620, -178721],
			["Деревянный кубик — B и Y", -76837, -175422],
			["Деревянный кубик — B и Y", -76836, -175472],
			["Деревянный кубик — B и Y", -76867, -175478],
			["Деревянный кубик — B и Y", -76856, -175474],
			["Деревянный кубик — B и Y", 165404, -150281],
			["Деревянный кубик — B и Y", 165414, -150292],
			["Деревянный кубик — B и Y", -27117, 162517],
			["Деревянный кубик — B и Y", -27136, 162516],
			["Деревянный кубик — B и Y", -27127, 162801],
			["Деревянный кубик — B и Y", 61507, 178662],
			["Деревянный кубик — B и Y", 48364, 190950],
			["Деревянный кубик — B и Y", 48374, 190949],
			["Деревянный кубик — B и Y", 46499, 160833],
			["Деревянный кубик — B и Y", -39678, 46929],
			["Деревянный кубик — B и Y", -123276, 51057],
			["Деревянный кубик — B и Y", -146496, 65549],
			["Деревянный кубик — B и Y", -146476, 65505],
			["Деревянный кубик — B и Y", -146482, 65516],
			["Деревянный кубик — B и Y", 170888, 56522],
			["Деревянный кубик — B и Y", 170614, 59982],
			["Деревянный кубик — B и Y", 170619, 59988],
			["Деревянный кубик — B и Y", 162590, 55660],
			["Деревянный кубик — B и Y", 94837, 98802],
			["Деревянный кубик — B и Y", 128993, 85392],
			["Деревянный кубик — B и Y", 129161, 85580],
			["Деревянный кубик — B и Y", 130117, 86571],
			["Деревянный кубик — B и Y", 57283, 54294],
			["Деревянный кубик — B и Y", 57863, 10853],
			["Деревянный кубик — B и Y", 57858, 10828]
			];
	for (var i = 0; i < hlam118.length; i++) {
				hlam_118 = new L.circleMarker([hlam118[i][1],hlam118[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam118[i][0])
					.bindTooltip(hlam118[i][0], {direction: 'top'})
					.addTo(hlam118icons);
			}
	}
	else {
		hlam118icons.clearLayers();
	}
}
var hlam119icons = L.layerGroup().addTo(map);
function Hlam119OnOff() {
	var chbox119;
	chbox119=document.getElementById('Hlam119Button');
	if (chbox119.checked) {
		var hlam119 = [
			["Деревянный кубик — I и D", -9463, -27033],
			["Деревянный кубик — I и D", -51925, -12880],
			["Деревянный кубик — I и D", -54809, -11885],
			["Деревянный кубик — I и D", -44006, -8036],
			["Деревянный кубик — I и D", -38489, -61656],
			["Деревянный кубик — I и D", -61762, -57415],
			["Деревянный кубик — I и D", -61735, -57424],
			["Деревянный кубик — I и D", -47125, -50726],
			["Деревянный кубик — I и D", -47076, -51120],
			["Деревянный кубик — I и D", -107767, -56112],
			["Деревянный кубик — I и D", -107769, -56140],
			["Деревянный кубик — I и D", -107743, -56121],
			["Деревянный кубик — I и D", -62477, -128984],
			["Деревянный кубик — I и D", -144097, -13436],
			["Деревянный кубик — I и D", 90275, -10283],
			["Деревянный кубик — I и D", 88986, -6016],
			["Деревянный кубик — I и D", 16767, -44878],
			["Деревянный кубик — I и D", 17096, -44400],
			["Деревянный кубик — I и D", 17055, -44405],
			["Деревянный кубик — I и D", 16753, -44890],
			["Деревянный кубик — I и D", 11603, -83593],
			["Деревянный кубик — I и D", -2380, -159829],
			["Деревянный кубик — I и D", -2448, -159847],
			["Деревянный кубик — I и D", -124159, -131368],
			["Деревянный кубик — I и D", -124155, -131370],
			["Деревянный кубик — I и D", -62209, -170953],
			["Деревянный кубик — I и D", -74703, -176641],
			["Деревянный кубик — I и D", -74711, -176644],
			["Деревянный кубик — I и D", -74726, -176642],
			["Деревянный кубик — I и D", -76902, -175492],
			["Деревянный кубик — I и D", 165404, -150288],
			["Деревянный кубик — I и D", -27081, 162518],
			["Деревянный кубик — I и D", -27084, 162803],
			["Деревянный кубик — I и D", -27123, 162816],
			["Деревянный кубик — I и D", 61506, 178691],
			["Деревянный кубик — I и D", 61506, 178714],
			["Деревянный кубик — I и D", 48435, 190953],
			["Деревянный кубик — I и D", 45235, 162018],
			["Деревянный кубик — I и D", -39598, 47013],
			["Деревянный кубик — I и D", -123272, 51042],
			["Деревянный кубик — I и D", -123272, 51039],
			["Деревянный кубик — I и D", 170905, 56550],
			["Деревянный кубик — I и D", 170611, 59973],
			["Деревянный кубик — I и D", 170625, 59995],
			["Деревянный кубик — I и D", 196459, 62274],
			["Деревянный кубик — I и D", 196440, 62259],
			["Деревянный кубик — I и D", 162587, 55657],
			["Деревянный кубик — I и D", 128992, 85399],
			["Деревянный кубик — I и D", 128992, 85385],
			["Деревянный кубик — I и D", 129146, 85578],
			["Деревянный кубик — I и D", 57286, 54303],
			["Деревянный кубик — I и D", 121673, 5252],
			["Деревянный кубик — I и D", 121858, 5343],
			["Деревянный кубик — I и D", 121860, 5321]
			];
	for (var i = 0; i < hlam119.length; i++) {
				hlam_119 = new L.circleMarker([hlam119[i][1],hlam119[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam119[i][0])
					.bindTooltip(hlam119[i][0], {direction: 'top'})
					.addTo(hlam119icons);
			}
	}
	else {
		hlam119icons.clearLayers();
	}
}
var hlam120icons = L.layerGroup().addTo(map);
function Hlam120OnOff() {
	var chbox120;
	chbox120=document.getElementById('Hlam120Button');
	if (chbox120.checked) {
		var hlam120 = [
			["Деревянный кубик — N и S", -9499, -27059],
			["Деревянный кубик — N и S", -44023, -8068],
			["Деревянный кубик — N и S", -47174, -50674],
			["Деревянный кубик — N и S", -47168, -50683],
			["Деревянный кубик — N и S", -47211, -50695],
			["Деревянный кубик — N и S", -47212, -50682],
			["Деревянный кубик — N и S", -47293, -51032],
			["Деревянный кубик — N и S", -47179, -51107],
			["Деревянный кубик — N и S", -47190, -51133],
			["Деревянный кубик — N и S", -47046, -50934],
			["Деревянный кубик — N и S", -47024, -50955],
			["Деревянный кубик — N и S", -107758, -56138],
			["Деревянный кубик — N и S", -107749, -56129],
			["Деревянный кубик — N и S", -62474, -128997],
			["Деревянный кубик — N и S", 67591, -14519],
			["Деревянный кубик — N и S", 16762, -44870],
			["Деревянный кубик — N и S", 17107, -44383],
			["Деревянный кубик — N и S", 17063, -44398],
			["Деревянный кубик — N и S", 60932, -96512],
			["Деревянный кубик — N и S", 11608, -83606],
			["Деревянный кубик — N и S", -2461, -159836],
			["Деревянный кубик — N и S", -29901, -132416],
			["Деревянный кубик — N и S", -124156, -131361],
			["Деревянный кубик — N и S", -124153, -131352],
			["Деревянный кубик — N и S", -62199, -170965],
			["Деревянный кубик — N и S", -74699, -176649],
			["Деревянный кубик — N и S", -75610, -178729],
			["Деревянный кубик — N и S", -75156, -179518],
			["Деревянный кубик — N и S", -75148, -179515],
			["Деревянный кубик — N и S", -76876, -175483],
			["Деревянный кубик — N и S", -76885, -175490],
			["Деревянный кубик — N и S", -27107, 162519],
			["Деревянный кубик — N и S", -27099, 162518],
			["Деревянный кубик — N и S", -27134, 162768],
			["Деревянный кубик — N и S", 61506, 178669],
			["Деревянный кубик — N и S", 61506, 178698],
			["Деревянный кубик — N и S", 61506, 178706],
			["Деревянный кубик — N и S", 46497, 160812],
			["Деревянный кубик — N и S", -127833, 86076],
			["Деревянный кубик — N и S", -39602, 46988],
			["Деревянный кубик — N и S", -123273, 51048],
			["Деревянный кубик — N и S", -146494, 65571],
			["Деревянный кубик — N и S", -146484, 65529],
			["Деревянный кубик — N и S", 170881, 56532],
			["Деревянный кубик — N и S", 170632, 60000],
			["Деревянный кубик — N и S", 196442, 62267],
			["Деревянный кубик — N и S", 162584, 55654],
			["Деревянный кубик — N и S", 94830, 98805],
			["Деревянный кубик — N и S", 129137, 85569],
			["Деревянный кубик — N и S", 130127, 86568],
			["Деревянный кубик — N и S", 57839, 10849]
			];
	for (var i = 0; i < hlam120.length; i++) {
				hlam_120 = new L.circleMarker([hlam120[i][1],hlam120[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam120[i][0])
					.bindTooltip(hlam120[i][0], {direction: 'top'})
					.addTo(hlam120icons);
			}
	}
	else {
		hlam120icons.clearLayers();
	}
}
var hlam121icons = L.layerGroup().addTo(map);
function Hlam121OnOff() {
	var chbox121;
	chbox121=document.getElementById('Hlam121Button');
	if (chbox121.checked) {
		var hlam121 = [
			["Деревянный кубик — V и F", -9505, -27060],
			["Деревянный кубик — V и F", -51925, -12870],
			["Деревянный кубик — V и F", -38497, -61662],
			["Деревянный кубик — V и F", -61816, -55638],
			["Деревянный кубик — V и F", -61810, -55658],
			["Деревянный кубик — V и F", -61818, -55662],
			["Деревянный кубик — V и F", -61822, -55681],
			["Деревянный кубик — V и F", -47134, -50718],
			["Деревянный кубик — V и F", -47298, -50718],
			["Деревянный кубик — V и F", -47094, -51081],
			["Деревянный кубик — V и F", -62482, -128991],
			["Деревянный кубик — V и F", -144088, -13429],
			["Деревянный кубик — V и F", 90271, -10275],
			["Деревянный кубик — V и F", 88990, -6007],
			["Деревянный кубик — V и F", 91893, -58989],
			["Деревянный кубик — V и F", 16757, -44863],
			["Деревянный кубик — V и F", 17118, -44413],
			["Деревянный кубик — V и F", 17070, -44418],
			["Деревянный кубик — V и F", 60921, -96501],
			["Деревянный кубик — V и F", -2393, -159850],
			["Деревянный кубик — V и F", -29891, -132416],
			["Деревянный кубик — V и F", -62205, -170959],
			["Деревянный кубик — V и F", -74719, -176641],
			["Деревянный кубик — V и F", -75075, -179548],
			["Деревянный кубик — V и F", -75101, -179540],
			["Деревянный кубик — V и F", -76868, -175387],
			["Деревянный кубик — V и F", -76846, -175486],
			["Деревянный кубик — V и F", -76894, -175488],
			["Деревянный кубик — V и F", 165398, -150281],
			["Деревянный кубик — V и F", -27089, 162518],
			["Деревянный кубик — V и F", -27110, 162802],
			["Деревянный кубик — V и F", 61507, 178678],
			["Деревянный кубик — V и F", 48424, 190952],
			["Деревянный кубик — V и F", 45237, 162002],
			["Деревянный кубик — V и F", -127872, 86119],
			["Деревянный кубик — V и F", -39618, 47002],
			["Деревянный кубик — V и F", -123275, 51035],
			["Деревянный кубик — V и F", -123271, 51051],
			["Деревянный кубик — V и F", -146492, 65537],
			["Деревянный кубик — V и F", -146492, 65559],
			["Деревянный кубик — V и F", 170898, 56517],
			["Деревянный кубик — V и F", 170612, 59978],
			["Деревянный кубик — V и F", 128992, 85377],
			["Деревянный кубик — V и F", 130104, 86585],
			["Деревянный кубик — V и F", 121673, 5252],
			["Деревянный кубик — V и F", 121875, 5340]
			];
	for (var i = 0; i < hlam121.length; i++) {
				hlam_121 = new L.circleMarker([hlam121[i][1],hlam121[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam121[i][0])
					.bindTooltip(hlam121[i][0], {direction: 'top'})
					.addTo(hlam121icons);
			}
	}
	else {
		hlam121icons.clearLayers();
	}
}
var hlam122icons = L.layerGroup().addTo(map);
function Hlam122OnOff() {
	var chbox122;
	chbox122=document.getElementById('Hlam122Button');
	if (chbox122.checked) {
		var hlam122 = [

			];
	for (var i = 0; i < hlam122.length; i++) {
				hlam_122 = new L.circleMarker([hlam122[i][1],hlam122[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam122[i][0])
					.bindTooltip(hlam122[i][0], {direction: 'top'})
					.addTo(hlam122icons);
			}
	}
	else {
		hlam122icons.clearLayers();
	}
}
var hlam123icons = L.layerGroup().addTo(map);
function Hlam123OnOff() {
	var chbox123;
	chbox123=document.getElementById('Hlam123Button');
	if (chbox123.checked) {
		var hlam123 = [

			];
	for (var i = 0; i < hlam123.length; i++) {
				hlam_123 = new L.circleMarker([hlam123[i][1],hlam123[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam123[i][0])
					.bindTooltip(hlam123[i][0], {direction: 'top'})
					.addTo(hlam123icons);
			}
	}
	else {
		hlam123icons.clearLayers();
	}
}
var hlam124icons = L.layerGroup().addTo(map);
function Hlam124OnOff() {
	var chbox124;
	chbox124=document.getElementById('Hlam124Button');
	if (chbox124.checked) {
		var hlam124 = [
			["Дешевая сигара", -152277, -75096],
			["Дешевая сигара", -112920, -55768]
			];
	for (var i = 0; i < hlam124.length; i++) {
				hlam_124 = new L.circleMarker([hlam124[i][1],hlam124[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam124[i][0])
					.bindTooltip(hlam124[i][0], {direction: 'top'})
					.addTo(hlam124icons);
			}
	}
	else {
		hlam124icons.clearLayers();
	}
}
var hlam125icons = L.layerGroup().addTo(map);
function Hlam125OnOff() {
	var chbox125;
	chbox125=document.getElementById('Hlam125Button');
	if (chbox125.checked) {
		var hlam125 = [
			["Дешевый чудо-клей", -77678, -21769],
			["Дешевый чудо-клей", -55351, -48076],
			["Дешевый чудо-клей", -52029, -46629],
			["Дешевый чудо-клей", -29436, -94475],
			["Дешевый чудо-клей", -35056, -82599],
			["Дешевый чудо-клей", -69164, -105483],
			["Дешевый чудо-клей", -69169, -105015],
			["Дешевый чудо-клей", -149050, -57937],
			["Дешевый чудо-клей", -148642, -55974],
			["Дешевый чудо-клей", -148555, -56644],
			["Дешевый чудо-клей", -158751, -44013],
			["Дешевый чудо-клей", -137635, -97280],
			["Дешевый чудо-клей", -152041, -74625],
			["Дешевый чудо-клей", -149668, -125758],
			["Дешевый чудо-клей", -131750, -113531],
			["Дешевый чудо-клей", -150913, -102098],
			["Дешевый чудо-клей", 139254, -934],
			["Дешевый чудо-клей", 140093, -2890],
			["Дешевый чудо-клей", 183687, -93334],
			["Дешевый чудо-клей", 171875, -122045],
			["Дешевый чудо-клей", 128730, -28395],
			["Дешевый чудо-клей", 105990, -21031],
			["Дешевый чудо-клей", 81964, -21170],
			["Дешевый чудо-клей", 95115, -8876],
			["Дешевый чудо-клей", 8727, -30584],
			["Дешевый чудо-клей", -55103, -160411],
			["Дешевый чудо-клей", -93329, -163667],
			["Дешевый чудо-клей", -123614, -134356],
			["Дешевый чудо-клей", -32583, -187319],
			["Дешевый чудо-клей", -43615, -173567],
			["Дешевый чудо-клей", -13008, 189698],
			["Дешевый чудо-клей", -38991, 190512],
			["Дешевый чудо-клей", -16697, 163707],
			["Дешевый чудо-клей", -37840, 159737],
			["Дешевый чудо-клей", -138836, 152540],
			["Дешевый чудо-клей", -138514, 152659],
			["Дешевый чудо-клей", 151027, 138391],
			["Дешевый чудо-клей", 103023, 191355],
			["Дешевый чудо-клей", 93481, 192122],
			["Дешевый чудо-клей", 11088, 183950],
			["Дешевый чудо-клей", 20532, 134720],
			["Дешевый чудо-клей", -129304, 119063],
			["Дешевый чудо-клей", -129531, 119223],
			["Дешевый чудо-клей", -104594, 123205],
			["Дешевый чудо-клей", -104736, 123051],
			["Дешевый чудо-клей", -37589, 84802],
			["Дешевый чудо-клей", -37860, 84783],
			["Дешевый чудо-клей", -128330, 79975],
			["Дешевый чудо-клей", -65757, 35934],
			["Дешевый чудо-клей", -46957, 2358],
			["Дешевый чудо-клей", -42594, 2498],
			["Дешевый чудо-клей", -38429, 3970],
			["Дешевый чудо-клей", -121616, 3546],
			["Дешевый чудо-клей", -119509, 1694],
			["Дешевый чудо-клей", -148446, 113672],
			["Дешевый чудо-клей", 181445, 109491],
			["Дешевый чудо-клей", 134795, 127422],
			["Дешевый чудо-клей", 196617, 63254],
			["Дешевый чудо-клей", 182968, 2776],
			["Дешевый чудо-клей", 136111, 15576],
			["Дешевый чудо-клей", 133176, 20120],
			["Дешевый чудо-клей", 111789, 55797],
			["Дешевый чудо-клей", 79808, 55810],
			["Дешевый чудо-клей", 16234, 44941],
			["Дешевый чудо-клей", 129027, 20095],
			["Дешевый чудо-клей", 58963, 12091],
			["Дешевый чудо-клей", 58660, 10311]
			];
	for (var i = 0; i < hlam125.length; i++) {
				hlam_125 = new L.circleMarker([hlam125[i][1],hlam125[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam125[i][0])
					.bindTooltip(hlam125[i][0], {direction: 'top'})
					.addTo(hlam125icons);
			}
	}
	else {
		hlam125icons.clearLayers();
	}
}
var hlam126icons = L.layerGroup().addTo(map);
function Hlam126OnOff() {
	var chbox126;
	chbox126=document.getElementById('Hlam126Button');
	if (chbox126.checked) {
		var hlam126 = [

			];
	for (var i = 0; i < hlam126.length; i++) {
				hlam_126 = new L.circleMarker([hlam126[i][1],hlam126[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam126[i][0])
					.bindTooltip(hlam126[i][0], {direction: 'top'})
					.addTo(hlam126icons);
			}
	}
	else {
		hlam126icons.clearLayers();
	}
}
var hlam127icons = L.layerGroup().addTo(map);
function Hlam127OnOff() {
	var chbox127;
	chbox127=document.getElementById('Hlam127Button');
	if (chbox127.checked) {
		var hlam127 = [
			["Довоенные деньги", -51680, -12971],
			["Довоенные деньги", -51674, -12984],
			["Довоенные деньги", -51676, -12971],
			["Довоенные деньги", -51681, -12975],
			["Довоенные деньги", -51676, -12967],
			["Довоенные деньги", -56230, -8712],
			["Довоенные деньги", -56236, -8719],
			["Довоенные деньги", -44364, -7949],
			["Довоенные деньги", -44347, -7949],
			["Довоенные деньги", -44349, -7944],
			["Довоенные деньги", -44346, -7953],
			["Довоенные деньги", -44349, -7955],
			["Довоенные деньги", -120987, -63247],
			["Довоенные деньги", -120965, -63201],
			["Довоенные деньги", -120908, -62635],
			["Довоенные деньги", -120967, -62625],
			["Довоенные деньги", -120899, -62616],
			["Довоенные деньги", -120872, -62670],
			["Довоенные деньги", -35659, -80071],
			["Довоенные деньги", -35748, -80022],
			["Довоенные деньги", -35661, -80052],
			["Довоенные деньги", -35645, -80039],
			["Довоенные деньги", -35642, -80064],
			["Довоенные деньги", -14248, -125306],
			["Довоенные деньги", -64048, -127220],
			["Довоенные деньги", -64061, -127227],
			["Довоенные деньги", -64045, -127235],
			["Довоенные деньги", -64050, -127218],
			["Довоенные деньги", -64062, -127214],
			["Довоенные деньги", -64045, -127232],
			["Довоенные деньги", -64061, -127223],
			["Довоенные деньги", -64021, -127242],
			["Довоенные деньги", -64033, -127227],
			["Довоенные деньги", -64158, -126970],
			["Довоенные деньги", -64171, -126969],
			["Довоенные деньги", -147565, -55778],
			["Довоенные деньги", -152104, -73919],
			["Довоенные деньги", 171025, -24272],
			["Довоенные деньги", 168583, -24335],
			["Довоенные деньги", 168602, -24334],
			["Довоенные деньги", 172817, -41252],
			["Довоенные деньги", 172807, -41269],
			["Довоенные деньги", 190708, -35214],
			["Довоенные деньги", 190725, -35215],
			["Довоенные деньги", 124214, -28908],
			["Довоенные деньги", 124222, -28917],
			["Довоенные деньги", 124210, -28921],
			["Довоенные деньги", 124219, -28914],
			["Довоенные деньги", 130064, -28240],
			["Довоенные деньги", 130057, -28239],
			["Довоенные деньги", 130066, -28232],
			["Довоенные деньги", 101038, -1265],
			["Довоенные деньги", 101037, -1251],
			["Довоенные деньги", 67689, -14301],
			["Довоенные деньги", 67699, -14320],
			["Довоенные деньги", 88994, -5560],
			["Довоенные деньги", 88994, -5553],
			["Довоенные деньги", 88993, -5567],
			["Довоенные деньги", 88994, -5560],
			["Довоенные деньги", 88994, -5553],
			["Довоенные деньги", 88993, -5567],
			["Довоенные деньги", 88994, -5553],
			["Довоенные деньги", 88994, -5560],
			["Довоенные деньги", 91627, -6044],
			["Довоенные деньги", 91633, -6023],
			["Довоенные деньги", 91653, -6039],
			["Довоенные деньги", 22364, -65360],
			["Довоенные деньги", 22359, -65346],
			["Довоенные деньги", 94060, -84486],
			["Довоенные деньги", 16685, -81972],
			["Довоенные деньги", 17081, -82496],
			["Довоенные деньги", 17100, -82492],
			["Довоенные деньги", 17088, -82501],
			["Довоенные деньги", 18939, -106853],
			["Довоенные деньги", 18952, -106873],
			["Довоенные деньги", 18963, -106875],
			["Довоенные деньги", -119052, -136148],
			["Довоенные деньги", -119052, -136149],
			["Довоенные деньги", 143633, -148942],
			["Довоенные деньги", 143597, -148949],
			["Довоенные деньги", 143613, -148931],
			["Довоенные деньги", 143580, -148926],
			["Довоенные деньги", 143564, -148928],
			["Довоенные деньги", 143538, -148934],
			["Довоенные деньги", 143570, -148900],
			["Довоенные деньги", -13572, 189944],
			["Довоенные деньги", -13597, 189945],
			["Довоенные деньги", -60182, 181713],
			["Довоенные деньги", -60152, 181736],
			["Довоенные деньги", -60181, 181721],
			["Довоенные деньги", 152449, 161981],
			["Довоенные деньги", 152392, 161888],
			["Довоенные деньги", 152392, 161888],
			["Довоенные деньги", 152392, 161888],
			["Довоенные деньги", 53598, 190791],
			["Довоенные деньги", 13952, 193887],
			["Довоенные деньги", 13953, 193889],
			["Довоенные деньги", 33218, 132347],
			["Довоенные деньги", 33219, 132351],
			["Довоенные деньги", 33209, 132344],
			["Довоенные деньги", 24371, 131546],
			["Довоенные деньги", 24337, 131535],
			["Довоенные деньги", -1806, 120280],
			["Довоенные деньги", -1824, 120263],
			["Довоенные деньги", -1832, 120275],
			["Довоенные деньги", -1812, 120277],
			["Довоенные деньги", -1849, 120224],
			["Довоенные деньги", -1837, 120229],
			["Довоенные деньги", -1720, 120237],
			["Довоенные деньги", -1731, 120256],
			["Довоенные деньги", -1730, 120245],
			["Довоенные деньги", -1729, 120240],
			["Довоенные деньги", -95538, 124328],
			["Довоенные деньги", -95500, 124329],
			["Довоенные деньги", -95495, 124306],
			["Довоенные деньги", -95522, 124333],
			["Довоенные деньги", -106526, 124986],
			["Довоенные деньги", -106496, 124854],
			["Довоенные деньги", -106496, 124865],
			["Довоенные деньги", -106505, 124893],
			["Довоенные деньги", -106567, 124844],
			["Довоенные деньги", -106405, 125052],
			["Довоенные деньги", -106255, 125049],
			["Довоенные деньги", -106449, 124885],
			["Довоенные деньги", -106486, 124845],
			["Довоенные деньги", -106349, 124879],
			["Довоенные деньги", -43210, 89024],
			["Довоенные деньги", -37683, 96405],
			["Довоенные деньги", -46900, 1486],
			["Довоенные деньги", -98610, 7837],
			["Довоенные деньги", -104988, 15823],
			["Довоенные деньги", -104980, 15823],
			["Довоенные деньги", -132766, 9779],
			["Довоенные деньги", 180378, 110934],
			["Довоенные деньги", 180377, 110947],
			["Довоенные деньги", 153536, 105596],
			["Довоенные деньги", 153539, 105601],
			["Довоенные деньги", 162789, 62449],
			["Довоенные деньги", 34803, 100994],
			["Довоенные деньги", 34805, 101002],
			["Довоенные деньги", 34795, 101005],
			["Довоенные деньги", 34833, 101024],
			["Довоенные деньги", 34785, 101054],
			["Довоенные деньги", 34770, 101071],
			["Довоенные деньги", 34783, 101063],
			["Довоенные деньги", 34738, 101067],
			["Довоенные деньги", 24302, 122007],
			["Довоенные деньги", 24314, 122011],
			["Довоенные деньги", 58904, 55315],
			["Довоенные деньги", 58933, 55304],
			["Довоенные деньги", 58963, 55300],
			["Довоенные деньги", 58967, 55294],
			["Довоенные деньги", 58921, 55313],
			["Довоенные деньги", 58898, 55316],
			["Довоенные деньги", 60386, 57752],
			["Довоенные деньги", 24582, 44034],
			["Довоенные деньги", 24608, 44017],
			["Довоенные деньги", 24608, 44031],
			["Довоенные деньги", 24597, 44027],
			["Довоенные деньги", 24597, 44027],
			["Довоенные деньги", 24609, 44033],
			["Довоенные деньги", 27157, 47805],
			["Довоенные деньги", 27147, 47765],
			["Довоенные деньги", 96915, 642],
			["Довоенные деньги", 96983, 723],
			["Довоенные деньги", 96968, 718],
			["Довоенные деньги", 58313, 10641],
			["Довоенные деньги", 58320, 10641],
			["Довоенные деньги", 58305, 10643],
			["Довоенные деньги", -160684, 78409],
			["Довоенные деньги", 172818, -41263],
			["Довоенные деньги", 172820, -41275]
			];
	for (var i = 0; i < hlam127.length; i++) {
				hlam_127 = new L.circleMarker([hlam127[i][1],hlam127[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam127[i][0])
					.bindTooltip(hlam127[i][0], {direction: 'top'})
					.addTo(hlam127icons);
			}
	}
	else {
		hlam127icons.clearLayers();
	}
}
var hlam128icons = L.layerGroup().addTo(map);
function Hlam128OnOff() {
	var chbox128;
	chbox128=document.getElementById('Hlam128Button');
	if (chbox128.checked) {
		var hlam128 = [
			["Дом-чайник", -51257, -14102],
			["Дом-чайник", -44448, -8487],
			["Дом-чайник", -46821, -50903],
			["Дом-чайник", -90754, -43021],
			["Дом-чайник", 33023, -40807],
			["Дом-чайник", 35775, -34865],
			["Дом-чайник", 35468, -34864],
			["Дом-чайник", 35429, -35338],
			["Дом-чайник", -29587, -132595],
			["Дом-чайник", -27724, -131680],
			["Дом-чайник", -139763, -144736],
			["Дом-чайник", -48182, 2509],
			["Дом-чайник", -37929, 3431],
			["Дом-чайник", 196378, 65713]
			];
	for (var i = 0; i < hlam128.length; i++) {
				hlam_128 = new L.circleMarker([hlam128[i][1],hlam128[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam128[i][0])
					.bindTooltip(hlam128[i][0], {direction: 'top'})
					.addTo(hlam128icons);
			}
	}
	else {
		hlam128icons.clearLayers();
	}
}
var hlam129icons = L.layerGroup().addTo(map);
function Hlam129OnOff() {
	var chbox129;
	chbox129=document.getElementById('Hlam129Button');
	if (chbox129.checked) {
		var hlam129 = [
			["Древесина", 139212, -1192],
			["Древесина", 140646, -752],
			["Древесина", 93238, -84307],
			["Древесина", 20650, -115374]
			];
	for (var i = 0; i < hlam129.length; i++) {
				hlam_129 = new L.circleMarker([hlam129[i][1],hlam129[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam129[i][0])
					.bindTooltip(hlam129[i][0], {direction: 'top'})
					.addTo(hlam129icons);
			}
	}
	else {
		hlam129icons.clearLayers();
	}
}
var hlam130icons = L.layerGroup().addTo(map);
function Hlam130OnOff() {
	var chbox130;
	chbox130=document.getElementById('Hlam130Button');
	if (chbox130.checked) {
		var hlam130 = [
			["Древний глобус", -104766, -121737],
			["Древний глобус", -150926, -75203],
			["Древний глобус", 172765, -11400],
			["Древний глобус", 179272, -10041],
			["Древний глобус", 183266, -93780],
			["Древний глобус", 29361, -58605],
			["Древний глобус", 71774, -175679],
			["Древний глобус", -13566, 189936],
			["Древний глобус", -93183, 183347],
			["Древний глобус", -92695, 183363],
			["Древний глобус", -93732, 183343],
			["Древний глобус", -93747, 184225],
			["Древний глобус", -897, 158740],
			["Древний глобус", 1641, 164594],
			["Древний глобус", 2754, 162866],
			["Древний глобус", 4192, 160610],
			["Древний глобус", -14772, 120210],
			["Древний глобус", -42195, 88566],
			["Древний глобус", -41870, 88114],
			["Древний глобус", -40806, 88360],
			["Древний глобус", -34018, 92005],
			["Древний глобус", -99061, 7138],
			["Древний глобус", 45754, 101195],
			["Древний глобус", 58409, 10511]
			];
	for (var i = 0; i < hlam130.length; i++) {
				hlam_130 = new L.circleMarker([hlam130[i][1],hlam130[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam130[i][0])
					.bindTooltip(hlam130[i][0], {direction: 'top'})
					.addTo(hlam130icons);
			}
	}
	else {
		hlam130icons.clearLayers();
	}
}
var hlam131icons = L.layerGroup().addTo(map);
function Hlam131OnOff() {
	var chbox131;
	chbox131=document.getElementById('Hlam131Button');
	if (chbox131.checked) {
		var hlam131 = [
			["Дуршлаг", -52947, -13350],
			["Дуршлаг", -52966, -14265],
			["Дуршлаг", -10512, -50634],
			["Дуршлаг", -19195, -46891],
			["Дуршлаг", -93345, -83133],
			["Дуршлаг", -114377, -117121],
			["Дуршлаг", -171081, -11104],
			["Дуршлаг", -151086, -75028],
			["Дуршлаг", -151749, -72015],
			["Дуршлаг", 168715, -24288],
			["Дуршлаг", 29065, -58330],
			["Дуршлаг", 8076, -112618],
			["Дуршлаг", -136235, -183932],
			["Дуршлаг", -27358, 162991],
			["Дуршлаг", 48585, 190361],
			["Дуршлаг", 14957, 188270],
			["Дуршлаг", 16844, 191802],
			["Дуршлаг", 107100, 161924],
			["Дуршлаг", -18083, 60460],
			["Дуршлаг", 87844, 2299],
			["Дуршлаг", -146223, 66237],
			["Дуршлаг", -121396, 143228]
			];
	for (var i = 0; i < hlam131.length; i++) {
				hlam_131 = new L.circleMarker([hlam131[i][1],hlam131[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam131[i][0])
					.bindTooltip(hlam131[i][0], {direction: 'top'})
					.addTo(hlam131icons);
			}
	}
	else {
		hlam131icons.clearLayers();
	}
}
var hlam132icons = L.layerGroup().addTo(map);
function Hlam132OnOff() {
	var chbox132;
	chbox132=document.getElementById('Hlam132Button');
	if (chbox132.checked) {
		var hlam132 = [

			];
	for (var i = 0; i < hlam132.length; i++) {
				hlam_132 = new L.circleMarker([hlam132[i][1],hlam132[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam132[i][0])
					.bindTooltip(hlam132[i][0], {direction: 'top'})
					.addTo(hlam132icons);
			}
	}
	else {
		hlam132icons.clearLayers();
	}
}
var hlam133icons = L.layerGroup().addTo(map);
function Hlam133OnOff() {
	var chbox133;
	chbox133=document.getElementById('Hlam133Button');
	if (chbox133.checked) {
		var hlam133 = [
			["Емкость с жидким азотом", -35656, -80356],
			["Емкость с жидким азотом", -61155, -100880],
			["Емкость с жидким азотом", -61161, -100864],
			["Емкость с жидким азотом", 98863, -22601],
			["Емкость с жидким азотом", 101901, -12333],
			["Емкость с жидким азотом", 101918, -12476],
			["Емкость с жидким азотом", 103714, -13410],
			["Емкость с жидким азотом", 101218, -12144],
			["Емкость с жидким азотом", 102977, -10462],
			["Емкость с жидким азотом", 99823, -84154],
			["Емкость с жидким азотом", 68602, -88333],
			["Емкость с жидким азотом", 144533, -145486],
			["Емкость с жидким азотом", 102847, -151567],
			["Емкость с жидким азотом", -90086, 149166],
			["Емкость с жидким азотом", 16275, 197849],
			["Емкость с жидким азотом", 16437, 197755],
			["Емкость с жидким азотом", -128864, 120009],
			["Емкость с жидким азотом", -128999, 119455],
			["Емкость с жидким азотом", -129583, 119513],
			["Емкость с жидким азотом", 78697, 52303]
			];
	for (var i = 0; i < hlam133.length; i++) {
				hlam_133 = new L.circleMarker([hlam133[i][1],hlam133[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam133[i][0])
					.bindTooltip(hlam133[i][0], {direction: 'top'})
					.addTo(hlam133icons);
			}
	}
	else {
		hlam133icons.clearLayers();
	}
}
var hlam134icons = L.layerGroup().addTo(map);
function Hlam134OnOff() {
	var chbox134;
	chbox134=document.getElementById('Hlam134Button');
	if (chbox134.checked) {
		var hlam134 = [
			["Желтая канистра", -44804, -15776],
			["Желтая канистра", -53075, -6672],
			["Желтая канистра", -121344, -27675],
			["Желтая канистра", -119370, -13584],
			["Желтая канистра", -56393, -60194],
			["Желтая канистра", -109841, -64717],
			["Желтая канистра", -114021, -47811],
			["Желтая канистра", -114386, -47400],
			["Желтая канистра", -18900, -75381],
			["Желтая канистра", -35092, -80740],
			["Желтая канистра", -88921, -106891],
			["Желтая канистра", -69205, -105085],
			["Желтая канистра", -114275, -117588],
			["Желтая канистра", -114148, -117767],
			["Желтая канистра", -133418, -5771],
			["Желтая канистра", -166700, -14208],
			["Желтая канистра", -147814, -56232],
			["Желтая канистра", 182247, -29967],
			["Желтая канистра", 159083, -49847],
			["Желтая канистра", 129220, -28439],
			["Желтая канистра", 48864, -21577],
			["Желтая канистра", 48392, -22610],
			["Желтая канистра", 12924, -92001],
			["Желтая канистра", 15811, -107693],
			["Желтая канистра", -61204, -145484],
			["Желтая канистра", -82124, -161249],
			["Желтая канистра", -122213, -135864],
			["Желтая канистра", -14746, -173803],
			["Желтая канистра", 164861, -149032],
			["Желтая канистра", -38777, 190301],
			["Желтая канистра", -98765, 183572],
			["Желтая канистра", -42735, 137652],
			["Желтая канистра", -39240, 158557],
			["Желтая канистра", -41152, 161313],
			["Желтая канистра", -161623, 200918],
			["Желтая канистра", -141746, 176856],
			["Желтая канистра", 143455, 194338],
			["Желтая канистра", 145148, 141370],
			["Желтая канистра", 61691, 178674],
			["Желтая канистра", 126091, 160345],
			["Желтая канистра", 74898, 150497],
			["Желтая канистра", -58467, 90728],
			["Желтая канистра", -39809, 46450],
			["Желтая канистра", -104497, 38284],
			["Желтая канистра", -98817, 38022],
			["Желтая канистра", -117669, 54575],
			["Желтая канистра", -23183, 13902],
			["Желтая канистра", -39222, 3501],
			["Желтая канистра", -43356, 12362],
			["Желтая канистра", -46289, 28644],
			["Желтая канистра", -46449, 28214],
			["Желтая канистра", -48940, 27429],
			["Желтая канистра", -130934, 10598],
			["Желтая канистра", -148442, 113693],
			["Желтая канистра", -154012, 129904],
			["Желтая канистра", -179481, 74802],
			["Желтая канистра", 134534, 127441],
			["Желтая канистра", 172387, 39298],
			["Желтая канистра", 183481, 2832],
			["Желтая канистра", 183474, 2892],
			["Желтая канистра", 183475, 2524],
			["Желтая канистра", 133288, 17913],
			["Желтая канистра", 100739, 100122],
			["Желтая канистра", 95450, 99035],
			["Желтая канистра", 93175, 103609],
			["Желтая канистра", 93470, 103273],
			["Желтая канистра", 93314, 102977],
			["Желтая канистра", 110062, 57524],
			["Желтая канистра", 74418, 44204],
			["Желтая канистра", 53000, 52264]
			];
	for (var i = 0; i < hlam134.length; i++) {
				hlam_134 = new L.circleMarker([hlam134[i][1],hlam134[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam134[i][0])
					.bindTooltip(hlam134[i][0], {direction: 'top'})
					.addTo(hlam134icons);
			}
	}
	else {
		hlam134icons.clearLayers();
	}
}
var hlam135icons = L.layerGroup().addTo(map);
function Hlam135OnOff() {
	var chbox135;
	chbox135=document.getElementById('Hlam135Button');
	if (chbox135.checked) {
		var hlam135 = [
			["Желтая краска", -29820, -93504],
			["Желтая краска", -33264, -93722],
			["Желтая краска", -10403, -123957],
			["Желтая краска", -149885, -125738],
			["Желтая краска", 195078, -31625],
			["Желтая краска", 167354, -25458],
			["Желтая краска", 167356, -25444],
			["Желтая краска", 102660, -29401],
			["Желтая краска", 88804, -30934],
			["Желтая краска", 89012, -31292],
			["Желтая краска", 88205, -6158],
			["Желтая краска", 125775, -99237],
			["Желтая краска", -55472, -160440],
			["Желтая краска", -61667, -145592],
			["Желтая краска", -93052, -163488],
			["Желтая краска", -108553, -178844],
			["Желтая краска", 115020, -157707],
			["Желтая краска", -146073, 173712],
			["Желтая краска", -146156, 173734],
			["Желтая краска", -146212, 173730],
			["Желтая краска", 178981, 133050],
			["Желтая краска", 70237, 135904],
			["Желтая краска", -61221, 89294],
			["Желтая краска", -61123, 89661],
			["Желтая краска", -59721, 89129],
			["Желтая краска", -61752, 90419],
			["Желтая краска", -84889, 66395],
			["Желтая краска", -52558, 57277],
			["Желтая краска", -46445, 28228],
			["Желтая краска", -118668, 1171],
			["Желтая краска", -130631, 10270],
			["Желтая краска", 136938, 42927],
			["Желтая краска", 171238, 1546],
			["Желтая краска", 26259, 121567],
			["Желтая краска", 31629, 122858],
			["Желтая краска", 31486, 130070],
			["Желтая краска", 111670, 58340],
			["Желтая краска", 20006, 50703],
			["Желтая краска", 77120, 20992],
			["Желтая краска", 77180, 21084],
			["Желтая краска", -94707, 10273]
			];
	for (var i = 0; i < hlam135.length; i++) {
				hlam_135 = new L.circleMarker([hlam135[i][1],hlam135[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam135[i][0])
					.bindTooltip(hlam135[i][0], {direction: 'top'})
					.addTo(hlam135icons);
			}
	}
	else {
		hlam135icons.clearLayers();
	}
}
var hlam136icons = L.layerGroup().addTo(map);
function Hlam136OnOff() {
	var chbox136;
	chbox136=document.getElementById('Hlam136Button');
	if (chbox136.checked) {
		var hlam136 = [
			["Желтая настольная лампа", -45073, -8519],
			["Желтая настольная лампа", -55707, -59946],
			["Желтая настольная лампа", -55182, -60284],
			["Желтая настольная лампа", -56211, -60843],
			["Желтая настольная лампа", -56191, -61281],
			["Желтая настольная лампа", -47439, -49315],
			["Желтая настольная лампа", -46360, -50402],
			["Желтая настольная лампа", -58362, -85820],
			["Желтая настольная лампа", -46872, -107054],
			["Желтая настольная лампа", -47115, -106917],
			["Желтая настольная лампа", -47142, -104941],
			["Желтая настольная лампа", -48303, -105204],
			["Желтая настольная лампа", -61329, -100013],
			["Желтая настольная лампа", -49471, -99246],
			["Желтая настольная лампа", -47269, -102004],
			["Желтая настольная лампа", -47637, -102162],
			["Желтая настольная лампа", -49098, -99809],
			["Желтая настольная лампа", -147695, -57514],
			["Желтая настольная лампа", -147708, -57427],
			["Желтая настольная лампа", -148110, -58807],
			["Желтая настольная лампа", -147740, -59221],
			["Желтая настольная лампа", -147881, -59360],
			["Желтая настольная лампа", -148248, -59336],
			["Желтая настольная лампа", -148967, -58203],
			["Желтая настольная лампа", -147801, -56993],
			["Желтая настольная лампа", -147785, -56493],
			["Желтая настольная лампа", -152067, -75360],
			["Желтая настольная лампа", 169767, -26366],
			["Желтая настольная лампа", 165223, -21979],
			["Желтая настольная лампа", 165146, -21838],
			["Желтая настольная лампа", 183729, -92479],
			["Желтая настольная лампа", 183049, -93380],
			["Желтая настольная лампа", 181022, -123440],
			["Желтая настольная лампа", 67442, -14123],
			["Желтая настольная лампа", 74207, -11795],
			["Желтая настольная лампа", 94314, -10925],
			["Желтая настольная лампа", 89415, -5788],
			["Желтая настольная лампа", 31737, -20998],
			["Желтая настольная лампа", 89814, -57086],
			["Желтая настольная лампа", -1769, -159577],
			["Желтая настольная лампа", -134584, -154307],
			["Желтая настольная лампа", 71533, -175100],
			["Желтая настольная лампа", -60248, 182126],
			["Желтая настольная лампа", -60006, 182405],
			["Желтая настольная лампа", 44179, 177107],
			["Желтая настольная лампа", 49111, 190414],
			["Желтая настольная лампа", -99713, 8036],
			["Желтая настольная лампа", -98593, 7823],
			["Желтая настольная лампа", -158692, 57334],
			["Желтая настольная лампа", 132794, 126418],
			["Желтая настольная лампа", 132783, 126643],
			["Желтая настольная лампа", 169703, 59607],
			["Желтая настольная лампа", 183113, 3984],
			["Желтая настольная лампа", 183081, 3620],
			["Желтая настольная лампа", 182790, 3737],
			["Желтая настольная лампа", 157105, 13480],
			["Желтая настольная лампа", 27585, 50262],
			["Желтая настольная лампа", 27751, 50230],
			["Желтая настольная лампа", 100676, 26148],
			["Желтая настольная лампа", 100480, 26305],
			["Желтая настольная лампа", 100124, 25021],
			["Желтая настольная лампа", 75415, 9969],
			["Желтая настольная лампа", 57898, 10924],
			["Желтая настольная лампа", 57790, 9672]
			];
	for (var i = 0; i < hlam136.length; i++) {
				hlam_136 = new L.circleMarker([hlam136[i][1],hlam136[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam136[i][0])
					.bindTooltip(hlam136[i][0], {direction: 'top'})
					.addTo(hlam136icons);
			}
	}
	else {
		hlam136icons.clearLayers();
	}
}
var hlam137icons = L.layerGroup().addTo(map);
function Hlam137OnOff() {
	var chbox137;
	chbox137=document.getElementById('Hlam137Button');
	if (chbox137.checked) {
		var hlam137 = [
			["Желтая тарелка", -50945, -12421],
			["Желтая тарелка", -50933, -12455],
			["Желтая тарелка", -50697, -12424],
			["Желтая тарелка", -50674, -12454],
			["Желтая тарелка", -50374, -12458],
			["Желтая тарелка", -50364, -12421],
			["Желтая тарелка", -51800, -14265],
			["Желтая тарелка", -52311, -14005],
			["Желтая тарелка", -53077, -14072],
			["Желтая тарелка", -52713, -12983],
			["Желтая тарелка", -53211, -13355],
			["Желтая тарелка", -52946, -13392],
			["Желтая тарелка", -52944, -13348],
			["Желтая тарелка", -52944, -13254],
			["Желтая тарелка", -52770, -13422],
			["Желтая тарелка", -52044, -13918],
			["Желтая тарелка", -51964, -13164],
			["Желтая тарелка", -52419, -13178],
			["Желтая тарелка", -52323, -13924],
			["Желтая тарелка", -52421, -13941],
			["Желтая тарелка", -52461, -13255],
			["Желтая тарелка", -52488, -12957],
			["Желтая тарелка", -52395, -13026],
			["Желтая тарелка", -51352, -14120],
			["Желтая тарелка", -51291, -14121],
			["Желтая тарелка", -51341, -14110],
			["Желтая тарелка", -52658, -13721],
			["Желтая тарелка", -52365, -13869],
			["Желтая тарелка", -52381, -13862],
			["Желтая тарелка", -52370, -13779],
			["Желтая тарелка", -50743, -12283],
			["Желтая тарелка", -50743, -12283],
			["Желтая тарелка", -25170, -57357],
			["Желтая тарелка", -25287, -57239],
			["Желтая тарелка", -25265, -57331],
			["Желтая тарелка", -25215, -57342],
			["Желтая тарелка", -25244, -57223],
			["Желтая тарелка", -52865, -50705],
			["Желтая тарелка", -52839, -50650],
			["Желтая тарелка", -47394, -51092],
			["Желтая тарелка", -47485, -50992],
			["Желтая тарелка", -47483, -51009],
			["Желтая тарелка", -55168, -48195],
			["Желтая тарелка", -14056, -66700],
			["Желтая тарелка", -59852, -78950],
			["Желтая тарелка", -72224, -71921],
			["Желтая тарелка", -72211, -71988],
			["Желтая тарелка", -47524, -102070],
			["Желтая тарелка", -47496, -102100],
			["Желтая тарелка", -82368, -125902],
			["Желтая тарелка", -74228, -115038],
			["Желтая тарелка", 168744, -24338],
			["Желтая тарелка", 168775, -24366],
			["Желтая тарелка", 183600, -93310],
			["Желтая тарелка", 183559, -93320],
			["Желтая тарелка", 142218, -123925],
			["Желтая тарелка", 33396, -32730],
			["Желтая тарелка", 48690, -22202],
			["Желтая тарелка", 48221, -22180],
			["Желтая тарелка", 51090, -19624],
			["Желтая тарелка", 35581, -35006],
			["Желтая тарелка", 34043, -33728],
			["Желтая тарелка", 33406, -33113],
			["Желтая тарелка", 33445, -32970],
			["Желтая тарелка", 16156, -80147],
			["Желтая тарелка", 16235, -80144],
			["Желтая тарелка", 16148, -80177],
			["Желтая тарелка", 15831, -80174],
			["Желтая тарелка", 50143, -99047],
			["Желтая тарелка", -122032, -188008],
			["Желтая тарелка", -135177, -181906],
			["Желтая тарелка", 22175, -150350],
			["Желтая тарелка", 22585, -149995],
			["Желтая тарелка", 22690, -149999],
			["Желтая тарелка", -4335, 184934],
			["Желтая тарелка", -92866, 183486],
			["Желтая тарелка", -39352, 159792],
			["Желтая тарелка", -90439, 150569],
			["Желтая тарелка", -160442, 152539],
			["Желтая тарелка", -137083, 153549],
			["Желтая тарелка", -137398, 153861],
			["Желтая тарелка", 2416, 138060],
			["Желтая тарелка", -59873, 117406],
			["Желтая тарелка", -20564, 16526],
			["Желтая тарелка", -20828, 16552],
			["Желтая тарелка", -98743, 8184],
			["Желтая тарелка", -98505, 8221],
			["Желтая тарелка", -98502, 8227],
			["Желтая тарелка", -148576, 112242],
			["Желтая тарелка", -154788, 51766],
			["Желтая тарелка", -154869, 51733],
			["Желтая тарелка", 133750, 85867],
			["Желтая тарелка", 131961, 86794],
			["Желтая тарелка", 94808, 99214],
			["Желтая тарелка", 94969, 98780],
			["Желтая тарелка", 94975, 98766],
			["Желтая тарелка", 95328, 104035],
			["Желтая тарелка", 7541, 43888],
			["Желтая тарелка", 99883, 1967]
			];
	for (var i = 0; i < hlam137.length; i++) {
				hlam_137 = new L.circleMarker([hlam137[i][1],hlam137[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam137[i][0])
					.bindTooltip(hlam137[i][0], {direction: 'top'})
					.addTo(hlam137icons);
			}
	}
	else {
		hlam137icons.clearLayers();
	}
}
var hlam138icons = L.layerGroup().addTo(map);
function Hlam138OnOff() {
	var chbox138;
	chbox138=document.getElementById('Hlam138Button');
	if (chbox138.checked) {
		var hlam138 = [
			["Жестяная банка", -8481, -3004],
			["Жестяная банка", -8450, -3029],
			["Жестяная банка", -8324, -2979],
			["Жестяная банка", -8434, -3099],
			["Жестяная банка", -8612, -2737],
			["Жестяная банка", -7845, -1091],
			["Жестяная банка", -107264, -22184],
			["Жестяная банка", -126977, -1284],
			["Жестяная банка", -28053, -60288],
			["Жестяная банка", -19175, -46793],
			["Жестяная банка", -19162, -46741],
			["Жестяная банка", -19156, -46763],
			["Жестяная банка", -19120, -46810],
			["Жестяная банка", -19165, -46813],
			["Жестяная банка", -13852, -44644],
			["Жестяная банка", -635, -36241],
			["Жестяная банка", -56031, -60553],
			["Жестяная банка", -55960, -60588],
			["Жестяная банка", -56401, -60203],
			["Жестяная банка", -38659, -57847],
			["Жестяная банка", -38540, -59443],
			["Жестяная банка", -39476, -59685],
			["Жестяная банка", -39334, -60970],
			["Жестяная банка", -61104, -56722],
			["Жестяная банка", -54160, -54640],
			["Жестяная банка", -38538, -57117],
			["Жестяная банка", -35515, -57132],
			["Жестяная банка", -46010, -50560],
			["Жестяная банка", -46501, -50676],
			["Жестяная банка", -51608, -46782],
			["Жестяная банка", -52202, -46428],
			["Жестяная банка", -41317, -37559],
			["Жестяная банка", -41335, -37546],
			["Жестяная банка", -41344, -37590],
			["Жестяная банка", -41346, -37601],
			["Жестяная банка", -120344, -46032],
			["Жестяная банка", -120347, -45915],
			["Жестяная банка", -120110, -45930],
			["Жестяная банка", -120585, -45925],
			["Жестяная банка", -120178, -45932],
			["Жестяная банка", -29382, -94328],
			["Жестяная банка", -29365, -94367],
			["Жестяная банка", -29815, -93524],
			["Жестяная банка", -29576, -94071],
			["Жестяная банка", -28836, -93902],
			["Жестяная банка", -29811, -87056],
			["Жестяная банка", -29842, -86991],
			["Жестяная банка", -29740, -87329],
			["Жестяная банка", -58915, -79222],
			["Жестяная банка", -41095, -70004],
			["Жестяная банка", -40571, -70020],
			["Жестяная банка", -40551, -70125],
			["Жестяная банка", -40493, -70121],
			["Жестяная банка", -93362, -83321],
			["Жестяная банка", -121764, -67018],
			["Жестяная банка", -100056, -67366],
			["Жестяная банка", -100038, -67376],
			["Жестяная банка", -1759, -130411],
			["Жестяная банка", -1736, -130408],
			["Жестяная банка", -13098, -125362],
			["Жестяная банка", -6727, -117685],
			["Жестяная банка", -27995, -106035],
			["Жестяная банка", -46659, -108306],
			["Жестяная банка", -61619, -100546],
			["Жестяная банка", -61619, -100262],
			["Жестяная банка", -61674, -100310],
			["Жестяная банка", -61334, -100887],
			["Жестяная банка", -61386, -100808],
			["Жестяная банка", -95261, -113591],
			["Жестяная банка", -79412, -108111],
			["Жестяная банка", -79393, -108119],
			["Жестяная банка", -79709, -108090],
			["Жестяная банка", -70524, -104568],
			["Жестяная банка", -70464, -104728],
			["Жестяная банка", -70522, -104400],
			["Жестяная банка", -70539, -104435],
			["Жестяная банка", -70551, -104469],
			["Жестяная банка", -70537, -104478],
			["Жестяная банка", -69202, -105489],
			["Жестяная банка", -123032, -123256],
			["Жестяная банка", -123006, -123347],
			["Жестяная банка", -122866, -123316],
			["Жестяная банка", -123061, -122665],
			["Жестяная банка", -122989, -122819],
			["Жестяная банка", -146931, -12783],
			["Жестяная банка", -137648, -8410],
			["Жестяная банка", -147840, -57440],
			["Жестяная банка", -147844, -57447],
			["Жестяная банка", -148259, -56845],
			["Жестяная банка", -148008, -56494],
			["Жестяная банка", -148001, -56630],
			["Жестяная банка", -148007, -56611],
			["Жестяная банка", -147992, -56610],
			["Жестяная банка", -148672, -56004],
			["Жестяная банка", -147846, -56351],
			["Жестяная банка", -158767, -44046],
			["Жестяная банка", -152048, -74671],
			["Жестяная банка", -152035, -75362],
			["Жестяная банка", -151055, -74818],
			["Жестяная банка", -150811, -74922],
			["Жестяная банка", -150813, -74887],
			["Жестяная банка", -151549, -71810],
			["Жестяная банка", -151500, -72093],
			["Жестяная банка", -132748, -121763],
			["Жестяная банка", -132754, -121783],
			["Жестяная банка", -150717, -101798],
			["Жестяная банка", -168128, -115165],
			["Жестяная банка", 167601, -23932],
			["Жестяная банка", 167637, -22845],
			["Жестяная банка", 164895, -16801],
			["Жестяная банка", 172607, -11845],
			["Жестяная банка", 172559, -11771],
			["Жестяная банка", 161023, -29803],
			["Жестяная банка", 134981, -745],
			["Жестяная банка", 140073, -2871],
			["Жестяная банка", 141579, -57798],
			["Жестяная банка", 141797, -49162],
			["Жестяная банка", 147119, -51664],
			["Жестяная банка", 147142, -51658],
			["Жестяная банка", 149120, -52352],
			["Жестяная банка", 149127, -52371],
			["Жестяная банка", 158809, -49368],
			["Жестяная банка", 157216, -46982],
			["Жестяная банка", 173659, -75489],
			["Жестяная банка", 160740, -91699],
			["Жестяная банка", 161334, -91658],
			["Жестяная банка", 161445, -92025],
			["Жестяная банка", 161275, -92154],
			["Жестяная банка", 160684, -92181],
			["Жестяная банка", 160731, -92107],
			["Жестяная банка", 160760, -92122],
			["Жестяная банка", 153013, -75469],
			["Жестяная банка", 152791, -75429],
			["Жестяная банка", 152794, -75408],
			["Жестяная банка", 153123, -75515],
			["Жестяная банка", 149986, -66974],
			["Жестяная банка", 199126, -112711],
			["Жестяная банка", 157779, -128349],
			["Жестяная банка", 157586, -129054],
			["Жестяная банка", 156927, -128634],
			["Жестяная банка", 157071, -128684],
			["Жестяная банка", 160342, -129185],
			["Жестяная банка", 153086, -103750],
			["Жестяная банка", 153021, -103692],
			["Жестяная банка", 153013, -103676],
			["Жестяная банка", 106128, -20939],
			["Жестяная банка", 98710, -12582],
			["Жестяная банка", 100724, -1755],
			["Жестяная банка", 100839, -1802],
			["Жестяная банка", 100857, -1820],
			["Жестяная банка", 100817, -1793],
			["Жестяная банка", 119658, -2252],
			["Жестяная банка", 88606, -31265],
			["Жестяная банка", 81739, -20812],
			["Жестяная банка", 82157, -21036],
			["Жестяная банка", 82145, -21036],
			["Жестяная банка", 82139, -21036],
			["Жестяная банка", 82148, -20777],
			["Жестяная банка", 82080, -20773],
			["Жестяная банка", 81979, -21158],
			["Жестяная банка", 84735, -18788],
			["Жестяная банка", 84726, -18761],
			["Жестяная банка", 74596, -15555],
			["Жестяная банка", 74595, -15583],
			["Жестяная банка", 93297, -13951],
			["Жестяная банка", 94897, -7508],
			["Жестяная банка", 94950, -7495],
			["Жестяная банка", 48079, -22213],
			["Жестяная банка", 47963, -22374],
			["Жестяная банка", 49129, -21096],
			["Жестяная банка", 50423, -22847],
			["Жестяная банка", 53447, -3091],
			["Жестяная банка", 17728, -27531],
			["Жестяная банка", 29391, -20914],
			["Жестяная банка", 30115, -21619],
			["Жестяная банка", 30224, -21373],
			["Жестяная банка", 31144, -21087],
			["Жестяная банка", 31965, -21604],
			["Жестяная банка", 31730, -21192],
			["Жестяная банка", 31623, -21551],
			["Жестяная банка", 29685, -21151],
			["Жестяная банка", 29726, -21135],
			["Жестяная банка", 29763, -20982],
			["Жестяная банка", 29687, -20719],
			["Жестяная банка", 29894, -20598],
			["Жестяная банка", 29956, -20583],
			["Жестяная банка", 29935, -20594],
			["Жестяная банка", 29574, -20830],
			["Жестяная банка", 29629, -20799],
			["Жестяная банка", 31023, -19968],
			["Жестяная банка", 31395, -20383],
			["Жестяная банка", 35942, -35293],
			["Жестяная банка", 37894, -35127],
			["Жестяная банка", 37876, -35115],
			["Жестяная банка", 38214, -35258],
			["Жестяная банка", 4034, -34883],
			["Жестяная банка", 30708, -32980],
			["Жестяная банка", 30667, -32980],
			["Жестяная банка", 30649, -32986],
			["Жестяная банка", 30649, -32988],
			["Жестяная банка", 30688, -32986],
			["Жестяная банка", 30748, -32989],
			["Жестяная банка", 30761, -32982],
			["Жестяная банка", 30767, -32990],
			["Жестяная банка", 71688, -96142],
			["Жестяная банка", 57172, -94518],
			["Жестяная банка", 7642, -96874],
			["Жестяная банка", 12029, -83338],
			["Жестяная банка", 13448, -82946],
			["Жестяная банка", 11920, -76740],
			["Жестяная банка", 101145, -100473],
			["Жестяная банка", 74298, -121025],
			["Жестяная банка", 74296, -120996],
			["Жестяная банка", 74321, -120998],
			["Жестяная банка", 88499, -119637],
			["Жестяная банка", 84049, -109486],
			["Жестяная банка", 19925, -119064],
			["Жестяная банка", 20013, -119084],
			["Жестяная банка", 9512, -107103],
			["Жестяная банка", 9603, -107336],
			["Жестяная банка", 16761, -106731],
			["Жестяная банка", 17923, -106571],
			["Жестяная банка", 22701, -106830],
			["Жестяная банка", 18717, -106096],
			["Жестяная банка", 18884, -106117],
			["Жестяная банка", 28518, -106110],
			["Жестяная банка", 28334, -106146],
			["Жестяная банка", 28312, -106156],
			["Жестяная банка", 28608, -105905],
			["Жестяная банка", -55179, -160525],
			["Жестяная банка", -55082, -160587],
			["Жестяная банка", -55088, -160574],
			["Жестяная банка", -58141, -134440],
			["Жестяная банка", -93298, -163385],
			["Жестяная банка", -93302, -163399],
			["Жестяная банка", -23193, -175935],
			["Жестяная банка", -23183, -175917],
			["Жестяная банка", -23141, -175912],
			["Жестяная банка", -23176, -175891],
			["Жестяная банка", -6647, -171952],
			["Жестяная банка", -7396, -171647],
			["Жестяная банка", -7458, -171508],
			["Жестяная банка", -43942, -177102],
			["Жестяная банка", -43974, -176954],
			["Жестяная банка", -53412, -175136],
			["Жестяная банка", -80759, -183330],
			["Жестяная банка", -82315, -178474],
			["Жестяная банка", -81150, -178440],
			["Жестяная банка", -81767, -178127],
			["Жестяная банка", -121154, -189655],
			["Жестяная банка", -121150, -189586],
			["Жестяная банка", -121137, -189523],
			["Жестяная банка", -119726, -189007],
			["Жестяная банка", -110468, -172219],
			["Жестяная банка", -113832, -169192],
			["Жестяная банка", -114027, -169489],
			["Жестяная банка", -114007, -169498],
			["Жестяная банка", -113945, -169314],
			["Жестяная банка", -110481, -172011],
			["Жестяная банка", -152943, -160651],
			["Жестяная банка", -134162, -153817],
			["Жестяная банка", -134170, -153811],
			["Жестяная банка", -136271, -184013],
			["Жестяная банка", -136110, -183804],
			["Жестяная банка", 197149, -143253],
			["Жестяная банка", 197037, -143237],
			["Жестяная банка", 197133, -143331],
			["Жестяная банка", 187173, -153264],
			["Жестяная банка", 164785, -149043],
			["Жестяная банка", 145439, -156986],
			["Жестяная банка", 145342, -156870],
			["Жестяная банка", 157624, -132805],
			["Жестяная банка", 163871, -169014],
			["Жестяная банка", 185116, -170499],
			["Жестяная банка", 52049, -149287],
			["Жестяная банка", 79613, -182496],
			["Жестяная банка", 74473, -177196],
			["Жестяная банка", 65507, -182577],
			["Жестяная банка", 65108, -178099],
			["Жестяная банка", 64959, -178065],
			["Жестяная банка", 50313, -166092],
			["Жестяная банка", 50084, -167044],
			["Жестяная банка", 50153, -166748],
			["Жестяная банка", 50164, -166468],
			["Жестяная банка", -5547, 182833],
			["Жестяная банка", -13009, 189414],
			["Жестяная банка", -38970, 190479],
			["Жестяная банка", -38560, 190448],
			["Жестяная банка", -39392, 190271],
			["Жестяная банка", -83632, 165789],
			["Жестяная банка", -95449, 174062],
			["Жестяная банка", -95452, 173993],
			["Жестяная банка", -96373, 179988],
			["Жестяная банка", -90148, 177983],
			["Жестяная банка", -97351, 184192],
			["Жестяная банка", -93935, 181821],
			["Жестяная банка", -93009, 183314],
			["Жестяная банка", -92830, 183514],
			["Жестяная банка", -87533, 184278],
			["Жестяная банка", -88659, 185206],
			["Жестяная банка", -95452, 190113],
			["Жестяная банка", -95543, 190095],
			["Жестяная банка", -97872, 189388],
			["Жестяная банка", -98823, 183377],
			["Жестяная банка", -98824, 183426],
			["Жестяная банка", -98757, 183396],
			["Жестяная банка", -2670, 158315],
			["Жестяная банка", -27648, 162209],
			["Жестяная банка", -26955, 162414],
			["Жестяная банка", -27317, 162898],
			["Жестяная банка", -27249, 162775],
			["Жестяная банка", -27287, 162366],
			["Жестяная банка", -17583, 162482],
			["Жестяная банка", -17615, 162508],
			["Жестяная банка", -5961, 162809],
			["Жестяная банка", -5969, 162790],
			["Жестяная банка", -63970, 132176],
			["Жестяная банка", -64132, 132139],
			["Жестяная банка", -63821, 132289],
			["Жестяная банка", -63811, 132271],
			["Жестяная банка", -39220, 158590],
			["Жестяная банка", -40913, 161465],
			["Жестяная банка", -71218, 145675],
			["Жестяная банка", -109653, 157602],
			["Жестяная банка", -109637, 157583],
			["Жестяная банка", -109626, 157583],
			["Жестяная банка", -109708, 157710],
			["Жестяная банка", -139339, 171817],
			["Жестяная банка", -145685, 173043],
			["Жестяная банка", -145559, 173301],
			["Жестяная банка", -145860, 172528],
			["Жестяная банка", -145826, 172642],
			["Жестяная банка", -146369, 174454],
			["Жестяная банка", -146360, 174473],
			["Жестяная банка", -146190, 174399],
			["Жестяная банка", -146090, 174287],
			["Жестяная банка", -139367, 173204],
			["Жестяная банка", -139376, 173225],
			["Жестяная банка", -163430, 141923],
			["Жестяная банка", -163470, 141943],
			["Жестяная банка", -149384, 148824],
			["Жестяная банка", -144626, 149982],
			["Жестяная банка", -138858, 152565],
			["Жестяная банка", -138695, 152472],
			["Жестяная банка", -163001, 157013],
			["Жестяная банка", -163017, 157036],
			["Жестяная банка", -163019, 157036],
			["Жестяная банка", 193953, 167563],
			["Жестяная банка", 200595, 143553],
			["Жестяная банка", 200449, 144061],
			["Жестяная банка", 179042, 133677],
			["Жестяная банка", 178883, 133901],
			["Жестяная банка", 179275, 134383],
			["Жестяная банка", 149636, 138460],
			["Жестяная банка", 152236, 138742],
			["Жестяная банка", 151681, 138851],
			["Жестяная банка", 152169, 139994],
			["Жестяная банка", 152959, 161704],
			["Жестяная банка", 152956, 161659],
			["Жестяная банка", 152958, 161695],
			["Жестяная банка", 152258, 161221],
			["Жестяная банка", 15765, 197725],
			["Жестяная банка", 80918, 184564],
			["Жестяная банка", 60328, 173206],
			["Жестяная банка", 64619, 174095],
			["Жестяная банка", 64595, 174095],
			["Жестяная банка", 64807, 174041],
			["Жестяная банка", 64797, 174020],
			["Жестяная банка", 64463, 174012],
			["Жестяная банка", 64488, 174029],
			["Жестяная банка", 6222, 164178],
			["Жестяная банка", 11640, 166820],
			["Жестяная банка", 1147, 189965],
			["Жестяная банка", 111585, 139750],
			["Жестяная банка", 70210, 135915],
			["Жестяная банка", 87557, 157568],
			["Жестяная банка", 87542, 157566],
			["Жестяная банка", 87535, 157580],
			["Жестяная банка", 87543, 157572],
			["Жестяная банка", 88405, 157372],
			["Жестяная банка", 88403, 157386],
			["Жестяная банка", 87754, 157272],
			["Жестяная банка", 49687, 162316],
			["Жестяная банка", 49752, 162178],
			["Жестяная банка", 2424, 137997],
			["Жестяная банка", 3436, 162897],
			["Жестяная банка", 3449, 162908],
			["Жестяная банка", 3966, 160360],
			["Жестяная банка", 3837, 160525],
			["Жестяная банка", -15171, 118604],
			["Жестяная банка", -15467, 118493],
			["Жестяная банка", -49051, 110158],
			["Жестяная банка", -49098, 110204],
			["Жестяная банка", -49046, 110192],
			["Жестяная банка", -86593, 115386],
			["Жестяная банка", -86598, 115368],
			["Жестяная банка", -86643, 115327],
			["Жестяная банка", -65903, 129486],
			["Жестяная банка", -104061, 109223],
			["Жестяная банка", -129301, 119369],
			["Жестяная банка", -129363, 119091],
			["Жестяная банка", -129526, 119217],
			["Жестяная банка", -129445, 119379],
			["Жестяная банка", -129262, 119028],
			["Жестяная банка", -104069, 123729],
			["Жестяная банка", -104196, 123318],
			["Жестяная банка", -63603, 74617],
			["Жестяная банка", -63533, 74657],
			["Жестяная банка", -115089, 66785],
			["Жестяная банка", -5351, 33881],
			["Жестяная банка", -8726, 42299],
			["Жестяная банка", -8949, 42237],
			["Жестяная банка", -17901, 59965],
			["Жестяная банка", -18105, 60372],
			["Жестяная банка", -18036, 60102],
			["Жестяная банка", -65457, 35905],
			["Жестяная банка", -53148, 55328],
			["Жестяная банка", -65750, 35949],
			["Жестяная банка", -123356, 51061],
			["Жестяная банка", -117781, 54950],
			["Жестяная банка", -117685, 54585],
			["Жестяная банка", -117679, 54659],
			["Жестяная банка", -25099, 3998],
			["Жестяная банка", -24857, 3902],
			["Жестяная банка", -7951, 20854],
			["Жестяная банка", -65345, 5690],
			["Жестяная банка", -56152, 10489],
			["Жестяная банка", -56147, 10569],
			["Жестяная банка", -34394, 12958],
			["Жестяная банка", -34736, 12918],
			["Жестяная банка", -34484, 12608],
			["Жестяная банка", -34471, 13597],
			["Жестяная банка", -53989, 22271],
			["Жестяная банка", -91861, 27106],
			["Жестяная банка", -91785, 26869],
			["Жестяная банка", -92253, 26868],
			["Жестяная банка", -92012, 27003],
			["Жестяная банка", -121431, 3696],
			["Жестяная банка", -119802, 5362],
			["Жестяная банка", -148449, 112042],
			["Жестяная банка", -148364, 112236],
			["Жестяная банка", -148452, 113702],
			["Жестяная банка", -148769, 113591],
			["Жестяная банка", -153908, 129990],
			["Жестяная банка", -146104, 65919],
			["Жестяная банка", -139392, 90782],
			["Жестяная банка", -139431, 90837],
			["Жестяная банка", 192945, 113301],
			["Жестяная банка", 135209, 115374],
			["Жестяная банка", 134437, 127191],
			["Жестяная банка", 201368, 94343],
			["Жестяная банка", 186074, 68560],
			["Жестяная банка", 182329, 96957],
			["Жестяная банка", 182187, 96970],
			["Жестяная банка", 182181, 96855],
			["Жестяная банка", 182459, 96804],
			["Жестяная банка", 139430, 72377],
			["Жестяная банка", 139895, 73283],
			["Жестяная банка", 139883, 73280],
			["Жестяная банка", 191410, 61199],
			["Жестяная банка", 194027, 58342],
			["Жестяная банка", 171020, 1864],
			["Жестяная банка", 183679, 2216],
			["Жестяная банка", 174155, 7180],
			["Жестяная банка", 174354, 7257],
			["Жестяная банка", 174336, 7258],
			["Жестяная банка", 172014, 8965],
			["Жестяная банка", 172337, 8932],
			["Жестяная банка", 131356, 1163],
			["Жестяная банка", 138449, 3143],
			["Жестяная банка", 140459, 8174],
			["Жестяная банка", 140468, 7489],
			["Жестяная банка", 149286, 11215],
			["Жестяная банка", 122114, 118342],
			["Жестяная банка", 93054, 103528],
			["Жестяная банка", 93059, 103529],
			["Жестяная банка", 93302, 103522],
			["Жестяная банка", 93304, 103527],
			["Жестяная банка", 39322, 115131],
			["Жестяная банка", 39360, 115152],
			["Жестяная банка", 39313, 115113],
			["Жестяная банка", 39295, 115359],
			["Жестяная банка", 26996, 127304],
			["Жестяная банка", 130934, 74750],
			["Жестяная банка", 129372, 86560],
			["Жестяная банка", 129354, 86599],
			["Жестяная банка", 129372, 86583],
			["Жестяная банка", 73152, 80253],
			["Жестяная банка", 42717, 77050],
			["Жестяная банка", 50261, 85064],
			["Жестяная банка", 54595, 94999],
			["Жестяная банка", 24245, 69391],
			["Жестяная банка", 25760, 69561],
			["Жестяная банка", 25268, 70942],
			["Жестяная банка", 25796, 70815],
			["Жестяная банка", 25384, 77057],
			["Жестяная банка", 25322, 76838],
			["Жестяная банка", 25225, 76955],
			["Жестяная банка", 28725, 93363],
			["Жестяная банка", 28739, 93385],
			["Жестяная банка", 111707, 56074],
			["Жестяная банка", 111649, 55733],
			["Жестяная банка", 110058, 57514],
			["Жестяная банка", 129298, 59806],
			["Жестяная банка", 128881, 59898],
			["Жестяная банка", 73928, 38254],
			["Жестяная банка", 73883, 38237],
			["Жестяная банка", 73916, 38266],
			["Жестяная банка", 85766, 46279],
			["Жестяная банка", 85794, 46162],
			["Жестяная банка", 85985, 46210],
			["Жестяная банка", 59137, 54955],
			["Жестяная банка", 60844, 57599],
			["Жестяная банка", 59995, 57781],
			["Жестяная банка", 7578, 44163],
			["Жестяная банка", 7482, 43974],
			["Жестяная банка", 15938, 45095],
			["Жестяная банка", 15916, 45108],
			["Жестяная банка", 16356, 45990],
			["Жестяная банка", 16340, 45990],
			["Жестяная банка", 27415, 49131],
			["Жестяная банка", 26809, 49608],
			["Жестяная банка", 29104, 53881],
			["Жестяная банка", 29122, 53930],
			["Жестяная банка", 128059, 56],
			["Жестяная банка", 127966, 176],
			["Жестяная банка", 114136, 7465],
			["Жестяная банка", 122240, 5414],
			["Жестяная банка", 120840, 10985],
			["Жестяная банка", 115780, 12871],
			["Жестяная банка", 100770, 27241],
			["Жестяная банка", 67083, 19373],
			["Жестяная банка", 67042, 19538],
			["Жестяная банка", 67063, 19551],
			["Жестяная банка", 67067, 19542],
			["Жестяная банка", 52343, 3659],
			["Жестяная банка", 52342, 3644],
			["Жестяная банка", 57384, 19],
			["Жестяная банка", 55155, 9112],
			["Жестяная банка", 55271, 9153],
			["Жестяная банка", 55528, 10249],
			["Жестяная банка", 55971, 12744],
			["Жестяная банка", 41209, 23218],
			["Жестяная банка", 41306, 23175],
			["Жестяная банка", 928, 15853],
			["Жестяная банка", 686, 15949]
			];
	for (var i = 0; i < hlam138.length; i++) {
				hlam_138 = new L.circleMarker([hlam138[i][1],hlam138[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam138[i][0])
					.bindTooltip(hlam138[i][0], {direction: 'top'})
					.addTo(hlam138icons);
			}
	}
	else {
		hlam138icons.clearLayers();
	}
}
var hlam139icons = L.layerGroup().addTo(map);
function Hlam139OnOff() {
	var chbox139;
	chbox139=document.getElementById('Hlam139Button');
	if (chbox139.checked) {
		var hlam139 = [
			["Жестяной кувшин", -50757, -13670],
			["Жестяной кувшин", -53219, -13078],
			["Жестяной кувшин", -51275, -14069],
			["Жестяной кувшин", -51695, -13082],
			["Жестяной кувшин", -43531, -6148],
			["Жестяной кувшин", -42061, -4518],
			["Жестяной кувшин", -43019, -5552],
			["Жестяной кувшин", -53901, -3985],
			["Жестяной кувшин", -56006, -60568],
			["Жестяной кувшин", -35818, -57283],
			["Жестяной кувшин", -47945, -50171],
			["Жестяной кувшин", -112365, -59586],
			["Жестяной кувшин", -109567, -58500],
			["Жестяной кувшин", -13149, -67026],
			["Жестяной кувшин", -41486, -69463],
			["Жестяной кувшин", -69508, -96216],
			["Жестяной кувшин", -47525, -117811],
			["Жестяной кувшин", -60989, -100592],
			["Жестяной кувшин", -147823, -59324],
			["Жестяной кувшин", -148074, -57521],
			["Жестяной кувшин", -148260, -56490],
			["Жестяной кувшин", -151458, -72739],
			["Жестяной кувшин", 88581, -21355],
			["Жестяной кувшин", 59825, -22966],
			["Жестяной кувшин", 37153, -38911],
			["Жестяной кувшин", 22419, -58593],
			["Жестяной кувшин", 22424, -58570],
			["Жестяной кувшин", 22399, -58582],
			["Жестяной кувшин", 75483, -76939],
			["Жестяной кувшин", 21389, -113567],
			["Жестяной кувшин", -2391, -160126],
			["Жестяной кувшин", -8115, -165218],
			["Жестяной кувшин", 164580, -149196],
			["Жестяной кувшин", 164218, -150401],
			["Жестяной кувшин", -36156, 171034],
			["Жестяной кувшин", -27272, 162375],
			["Жестяной кувшин", -121229, 143046],
			["Жестяной кувшин", 124833, 169057],
			["Жестяной кувшин", 14553, 193451],
			["Жестяной кувшин", 3229, 162053],
			["Жестяной кувшин", -59815, 117502],
			["Жестяной кувшин", -59557, 123002],
			["Жестяной кувшин", -38690, 3425],
			["Жестяной кувшин", -98729, 8065],
			["Жестяной кувшин", -165662, 122027],
			["Жестяной кувшин", 133615, 85973],
			["Жестяной кувшин", 188790, 61037],
			["Жестяной кувшин", 191080, 62488],
			["Жестяной кувшин", 189957, 63655],
			["Жестяной кувшин", 128882, 85459],
			["Жестяной кувшин", 13749, 45876],
			["Жестяной кувшин", 82380, 625],
			["Жестяной кувшин", 82392, 15463]
			];
	for (var i = 0; i < hlam139.length; i++) {
				hlam_139 = new L.circleMarker([hlam139[i][1],hlam139[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam139[i][0])
					.bindTooltip(hlam139[i][0], {direction: 'top'})
					.addTo(hlam139icons);
			}
	}
	else {
		hlam139icons.clearLayers();
	}
}
var hlam140icons = L.layerGroup().addTo(map);
function Hlam140OnOff() {
	var chbox140;
	chbox140=document.getElementById('Hlam140Button');
	if (chbox140.checked) {
		var hlam140 = [
			["Жетоны", 25723, -104405],
			["Жетоны", -57453, -154477],
			["Жетоны", 186967, -150652],
			["Жетоны", 74473, -177413],
			["Жетоны", 74471, -177438],
			["Жетоны", -38843, 157145],
			["Жетоны", -154840, 165748],
			["Жетоны", -136541, 140644],
			["Жетоны", -86621, 115509],
			["Жетоны", -95706, 73449],
			["Жетоны", -95508, 73939],
			["Жетоны", -104093, 38706],
			["Жетоны", 182863, 112712],
			["Жетоны", 111673, 55747]
			];
	for (var i = 0; i < hlam140.length; i++) {
				hlam_140 = new L.circleMarker([hlam140[i][1],hlam140[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam140[i][0])
					.bindTooltip(hlam140[i][0], {direction: 'top'})
					.addTo(hlam140icons);
			}
	}
	else {
		hlam140icons.clearLayers();
	}
}
var hlam141icons = L.layerGroup().addTo(map);
function Hlam141OnOff() {
	var chbox141;
	chbox141=document.getElementById('Hlam141Button');
	if (chbox141.checked) {
		var hlam141 = [
			["Жуткий Мистер Пушистик", -72340, -96842],
			["Жуткий Мистер Пушистик", 160633, -30357],
			["Жуткий Мистер Пушистик", -79980, -182384],
			["Жуткий Мистер Пушистик", -75335, -175163],
			["Жуткий Мистер Пушистик", 142890, -151745]
			];
	for (var i = 0; i < hlam141.length; i++) {
				hlam_141 = new L.circleMarker([hlam141[i][1],hlam141[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam141[i][0])
					.bindTooltip(hlam141[i][0], {direction: 'top'})
					.addTo(hlam141icons);
			}
	}
	else {
		hlam141icons.clearLayers();
	}
}
var hlam142icons = L.layerGroup().addTo(map);
function Hlam142OnOff() {
	var chbox142;
	chbox142=document.getElementById('Hlam142Button');
	if (chbox142.checked) {
		var hlam142 = [
			["Задняя нога робопони &quotЛютик&quot", 100707, -15188],
			["Задняя нога робопони &quotЛютик&quot", 89458, -52987],
			["Задняя нога робопони &quotЛютик&quot", -129554, 131056],
			["Задняя нога робопони &quotЛютик&quot", -56136, 10543]
			];
	for (var i = 0; i < hlam142.length; i++) {
				hlam_142 = new L.circleMarker([hlam142[i][1],hlam142[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam142[i][0])
					.bindTooltip(hlam142[i][0], {direction: 'top'})
					.addTo(hlam142icons);
			}
	}
	else {
		hlam142icons.clearLayers();
	}
}
var hlam143icons = L.layerGroup().addTo(map);
function Hlam143OnOff() {
	var chbox143;
	chbox143=document.getElementById('Hlam143Button');
	if (chbox143.checked) {
		var hlam143 = [
			["Зажигалка", -9454, -26985],
			["Зажигалка", -40842, -2549],
			["Зажигалка", -12848, -65949],
			["Зажигалка", -118000, -85403],
			["Зажигалка", -126310, -74126],
			["Зажигалка", -81797, -126446],
			["Зажигалка", -122846, -123391],
			["Зажигалка", -150847, -72891],
			["Зажигалка", -150888, -73553],
			["Зажигалка", -168964, -116045],
			["Зажигалка", -168306, -115723],
			["Зажигалка", -168131, -112528],
			["Зажигалка", -168075, -112471],
			["Зажигалка", 173373, -11540],
			["Зажигалка", 88939, -31244],
			["Зажигалка", 92236, -31736],
			["Зажигалка", 97083, -13299],
			["Зажигалка", 89825, -10379],
			["Зажигалка", 70669, -7480],
			["Зажигалка", 87383, -6534],
			["Зажигалка", 81535, -1642],
			["Зажигалка", 95769, -3430],
			["Зажигалка", 9597, -82782],
			["Зажигалка", 8230, -84881],
			["Зажигалка", 16717, -82324],
			["Зажигалка", 9002, -79557],
			["Зажигалка", 15838, -79813],
			["Зажигалка", 101187, -100201],
			["Зажигалка", 25460, -109289],
			["Зажигалка", 20532, -101895],
			["Зажигалка", -61425, -145758],
			["Зажигалка", -95341, -146598],
			["Зажигалка", -76475, -184211],
			["Зажигалка", -81667, -178150],
			["Зажигалка", -110919, -177774],
			["Зажигалка", -139582, -144677],
			["Зажигалка", 187563, -165232],
			["Зажигалка", 52175, -149232],
			["Зажигалка", 22374, -150257],
			["Зажигалка", -97420, 199805],
			["Зажигалка", -23219, 189614],
			["Зажигалка", -38988, 190470],
			["Зажигалка", -93708, 180030],
			["Зажигалка", -91799, 183547],
			["Зажигалка", -98959, 183473],
			["Зажигалка", -39746, 159641],
			["Зажигалка", -35584, 158649],
			["Зажигалка", -109654, 132858],
			["Зажигалка", -109707, 157896],
			["Зажигалка", -145688, 172554],
			["Зажигалка", -143476, 178687],
			["Зажигалка", 143786, 137279],
			["Зажигалка", 151300, 136382],
			["Зажигалка", 66360, 176889],
			["Зажигалка", 72372, 137403],
			["Зажигалка", 88190, 157234],
			["Зажигалка", 2373, 138463],
			["Зажигалка", -129470, 119904],
			["Зажигалка", -129516, 119481],
			["Зажигалка", -129155, 119276],
			["Зажигалка", -128958, 120041],
			["Зажигалка", -56385, 86905],
			["Зажигалка", -42051, 88083],
			["Зажигалка", -128644, 83055],
			["Зажигалка", -128781, 88455],
			["Зажигалка", -5497, 33922],
			["Зажигалка", -39526, 44039],
			["Зажигалка", -39456, 47280],
			["Зажигалка", -37014, 49052],
			["Зажигалка", -19938, 15446],
			["Зажигалка", -41617, 2614],
			["Зажигалка", -39258, 4746],
			["Зажигалка", -39503, 30223],
			["Зажигалка", -130587, 10539],
			["Зажигалка", -179870, 73946],
			["Зажигалка", 183439, 112115],
			["Зажигалка", 144616, 106262],
			["Зажигалка", 153544, 105590],
			["Зажигалка", 134334, 127220],
			["Зажигалка", 134066, 85923],
			["Зажигалка", 170900, 1553],
			["Зажигалка", 133409, 20605],
			["Зажигалка", 149544, 30926],
			["Зажигалка", 35964, 125142],
			["Зажигалка", 15512, 50106],
			["Зажигалка", 47908, 13864],
			["Зажигалка", -110443, -95429]
			];
	for (var i = 0; i < hlam143.length; i++) {
				hlam_143 = new L.circleMarker([hlam143[i][1],hlam143[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam143[i][0])
					.bindTooltip(hlam143[i][0], {direction: 'top'})
					.addTo(hlam143icons);
			}
	}
	else {
		hlam143icons.clearLayers();
	}
}
var hlam144icons = L.layerGroup().addTo(map);
function Hlam144OnOff() {
	var chbox144;
	chbox144=document.getElementById('Hlam144Button');
	if (chbox144.checked) {
		var hlam144 = [

			];
	for (var i = 0; i < hlam144.length; i++) {
				hlam_144 = new L.circleMarker([hlam144[i][1],hlam144[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam144[i][0])
					.bindTooltip(hlam144[i][0], {direction: 'top'})
					.addTo(hlam144icons);
			}
	}
	else {
		hlam144icons.clearLayers();
	}
}
var hlam145icons = L.layerGroup().addTo(map);
function Hlam145OnOff() {
	var chbox145;
	chbox145=document.getElementById('Hlam145Button');
	if (chbox145.checked) {
		var hlam145 = [
			["Закрытый тюбик чудо-клея", -46699, -50894],
			["Закрытый тюбик чудо-клея", -51883, -46594],
			["Закрытый тюбик чудо-клея", -71009, -69094],
			["Закрытый тюбик чудо-клея", -149265, -57989],
			["Закрытый тюбик чудо-клея", -137639, -96823],
			["Закрытый тюбик чудо-клея", -131405, -92882],
			["Закрытый тюбик чудо-клея", 139192, -962],
			["Закрытый тюбик чудо-клея", 183016, -93336],
			["Закрытый тюбик чудо-клея", 202592, -127293],
			["Закрытый тюбик чудо-клея", 69153, -15814],
			["Закрытый тюбик чудо-клея", 51413, -43671],
			["Закрытый тюбик чудо-клея", -55232, -160493],
			["Закрытый тюбик чудо-клея", 131435, -132063],
			["Закрытый тюбик чудо-клея", 115230, -157943],
			["Закрытый тюбик чудо-клея", 115416, -157751],
			["Закрытый тюбик чудо-клея", 111747, -147015],
			["Закрытый тюбик чудо-клея", 111737, -146981],
			["Закрытый тюбик чудо-клея", 111739, -146975],
			["Закрытый тюбик чудо-клея", -121332, 143239],
			["Закрытый тюбик чудо-клея", 26648, 171939],
			["Закрытый тюбик чудо-клея", 26643, 171939]
			];
	for (var i = 0; i < hlam145.length; i++) {
				hlam_145 = new L.circleMarker([hlam145[i][1],hlam145[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam145[i][0])
					.bindTooltip(hlam145[i][0], {direction: 'top'})
					.addTo(hlam145icons);
			}
	}
	else {
		hlam145icons.clearLayers();
	}
}
var hlam146icons = L.layerGroup().addTo(map);
function Hlam146OnOff() {
	var chbox146;
	chbox146=document.getElementById('Hlam146Button');
	if (chbox146.checked) {
		var hlam146 = [
			["Запечатанная &quotЧарлстон геральд&quot", -50837, -13490],
			["Запечатанная &quotЧарлстон геральд&quot", -50323, -14002],
			["Запечатанная &quotЧарлстон геральд&quot", -50773, -13934],
			["Запечатанная &quotЧарлстон геральд&quot", -50474, -12989],
			["Запечатанная &quotЧарлстон геральд&quot", -52020, -12596],
			["Запечатанная &quotЧарлстон геральд&quot", -51083, -13089],
			["Запечатанная &quotЧарлстон геральд&quot", -52302, -13422],
			["Запечатанная &quotЧарлстон геральд&quot", -51159, -13920],
			["Запечатанная &quotЧарлстон геральд&quot", -54955, -10263],
			["Запечатанная &quotЧарлстон геральд&quot", -55913, -10173],
			["Запечатанная &quotЧарлстон геральд&quot", -54889, -11003],
			["Запечатанная &quotЧарлстон геральд&quot", -50109, -9886],
			["Запечатанная &quotЧарлстон геральд&quot", -53434, -4485],
			["Запечатанная &quotЧарлстон геральд&quot", -41977, -5759],
			["Запечатанная &quotЧарлстон геральд&quot", -53561, -1922],
			["Запечатанная &quotЧарлстон геральд&quot", -52591, -1109],
			["Запечатанная &quotЧарлстон геральд&quot", -41342, -3157],
			["Запечатанная &quotЧарлстон геральд&quot", -40862, -2394],
			["Запечатанная &quotЧарлстон геральд&quot", -22946, -58509],
			["Запечатанная &quotЧарлстон геральд&quot", -68394, -77468],
			["Запечатанная &quotЧарлстон геральд&quot", -148000, -55387],
			["Запечатанная &quotЧарлстон геральд&quot", 193853, -28798],
			["Запечатанная &quotЧарлстон геральд&quot", 194398, -28064],
			["Запечатанная &quotЧарлстон геральд&quot", 167797, -22622],
			["Запечатанная &quotЧарлстон геральд&quot", 94512, -11303],
			["Запечатанная &quotЧарлстон геральд&quot", 93634, -5598],
			["Запечатанная &quotЧарлстон геральд&quot", 87716, -3791],
			["Запечатанная &quotЧарлстон геральд&quot", -37433, -157180],
			["Запечатанная &quotЧарлстон геральд&quot", -108943, -134794],
			["Запечатанная &quotЧарлстон геральд&quot", -110913, -177793],
			["Запечатанная &quotЧарлстон геральд&quot", 74521, -177445],
			["Запечатанная &quotЧарлстон геральд&quot", -71251, 198238],
			["Запечатанная &quotЧарлстон геральд&quot", -70595, 197637],
			["Запечатанная &quotЧарлстон геральд&quot", -69912, 197239],
			["Запечатанная &quotЧарлстон геральд&quot", -69570, 196714],
			["Запечатанная &quotЧарлстон геральд&quot", -60622, 182036],
			["Запечатанная &quotЧарлстон геральд&quot", -68530, 195860],
			["Запечатанная &quotЧарлстон геральд&quot", -69450, 196607],
			["Запечатанная &quotЧарлстон геральд&quot", -68910, 196035],
			["Запечатанная &quotЧарлстон геральд&quot", -68291, 195373],
			["Запечатанная &quotЧарлстон геральд&quot", -143136, 139186],
			["Запечатанная &quotЧарлстон геральд&quot", -139415, 139147],
			["Запечатанная &quotЧарлстон геральд&quot", -143031, 137012],
			["Запечатанная &quotЧарлстон геральд&quot", -143073, 140098],
			["Запечатанная &quotЧарлстон геральд&quot", -160456, 152482],
			["Запечатанная &quotЧарлстон геральд&quot", -143456, 155396],
			["Запечатанная &quotЧарлстон геральд&quot", -143295, 154010],
			["Запечатанная &quotЧарлстон геральд&quot", -143432, 156507],
			["Запечатанная &quotЧарлстон геральд&quot", -143424, 157606],
			["Запечатанная &quotЧарлстон геральд&quot", -143393, 156308],
			["Запечатанная &quotЧарлстон геральд&quot", 14292, 193682],
			["Запечатанная &quotЧарлстон геральд&quot", 16110, 193176],
			["Запечатанная &quotЧарлстон геральд&quot", 112122, 139844],
			["Запечатанная &quotЧарлстон геральд&quot", 3399, 161858],
			["Запечатанная &quotЧарлстон геральд&quot", -129846, 119590],
			["Запечатанная &quotЧарлстон геральд&quot", -128703, 83872],
			["Запечатанная &quotЧарлстон геральд&quot", -128521, 83317],
			["Запечатанная &quotЧарлстон геральд&quot", -128445, 82690],
			["Запечатанная &quotЧарлстон геральд&quot", -99886, 35530],
			["Запечатанная &quotЧарлстон геральд&quot", -98805, 38051],
			["Запечатанная &quotЧарлстон геральд&quot", -99127, 36895],
			["Запечатанная &quotЧарлстон геральд&quot", -50759, 1820],
			["Запечатанная &quotЧарлстон геральд&quot", -50838, 2772],
			["Запечатанная &quotЧарлстон геральд&quot", -50900, 1660],
			["Запечатанная &quotЧарлстон геральд&quot", -50742, 3037],
			["Запечатанная &quotЧарлстон геральд&quot", -47366, 2814],
			["Запечатанная &quotЧарлстон геральд&quot", -41510, 3154],
			["Запечатанная &quotЧарлстон геральд&quot", -39265, 3511],
			["Запечатанная &quotЧарлстон геральд&quot", -44252, 7889],
			["Запечатанная &quotЧарлстон геральд&quot", -40174, 6470],
			["Запечатанная &quotЧарлстон геральд&quot", -50213, 11849],
			["Запечатанная &quotЧарлстон геральд&quot", -51167, 11434],
			["Запечатанная &quotЧарлстон геральд&quot", -41048, 9105],
			["Запечатанная &quotЧарлстон геральд&quot", -130614, 9459],
			["Запечатанная &quotЧарлстон геральд&quot", 28702, 128191],
			["Запечатанная &quotЧарлстон геральд&quot", 69238, 37779],
			["Запечатанная &quotЧарлстон геральд&quot", 75279, 9746],
			["Запечатанная &quotЧарлстон геральд&quot", 85374, -2755]
			];
	for (var i = 0; i < hlam146.length; i++) {
				hlam_146 = new L.circleMarker([hlam146[i][1],hlam146[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam146[i][0])
					.bindTooltip(hlam146[i][0], {direction: 'top'})
					.addTo(hlam146icons);
			}
	}
	else {
		hlam146icons.clearLayers();
	}
}
var hlam147icons = L.layerGroup().addTo(map);
function Hlam147OnOff() {
	var chbox147;
	chbox147=document.getElementById('Hlam147Button');
	if (chbox147.checked) {
		var hlam147 = [
			["Запечатанная банка с образцами", -41120, -37712],
			["Запечатанная банка с образцами", -59127, -91649],
			["Запечатанная банка с образцами", -46702, -72892],
			["Запечатанная банка с образцами", 182274, -29961],
			["Запечатанная банка с образцами", 167002, -22255],
			["Запечатанная банка с образцами", 173559, -13366],
			["Запечатанная банка с образцами", 173541, -13372],
			["Запечатанная банка с образцами", 148745, -79556],
			["Запечатанная банка с образцами", 80843, -1770],
			["Запечатанная банка с образцами", 35615, -35468],
			["Запечатанная банка с образцами", 35763, -35622],
			["Запечатанная банка с образцами", 35745, -35605],
			["Запечатанная банка с образцами", 35439, -35525],
			["Запечатанная банка с образцами", 31037, -33724],
			["Запечатанная банка с образцами", 17208, -120023],
			["Запечатанная банка с образцами", 13021, -111273],
			["Запечатанная банка с образцами", 21304, -109616],
			["Запечатанная банка с образцами", -2452, -159919],
			["Запечатанная банка с образцами", -4365, -156052],
			["Запечатанная банка с образцами", -4374, -156057],
			["Запечатанная банка с образцами", -4383, -156063],
			["Запечатанная банка с образцами", -4391, -156067],
			["Запечатанная банка с образцами", -61162, -145492],
			["Запечатанная банка с образцами", -61210, -145487],
			["Запечатанная банка с образцами", -126450, -135335],
			["Запечатанная банка с образцами", -126513, -134121],
			["Запечатанная банка с образцами", -26706, -176321],
			["Запечатанная банка с образцами", -1432, -164923],
			["Запечатанная банка с образцами", 203111, -138232],
			["Запечатанная банка с образцами", 74523, -177307],
			["Запечатанная банка с образцами", 74349, -177790],
			["Запечатанная банка с образцами", 74121, -176871],
			["Запечатанная банка с образцами", 71915, -175216],
			["Запечатанная банка с образцами", 71922, -175243],
			["Запечатанная банка с образцами", 71294, -173939],
			["Запечатанная банка с образцами", -97474, 179440],
			["Запечатанная банка с образцами", -145262, 174799],
			["Запечатанная банка с образцами", -143623, 178959],
			["Запечатанная банка с образцами", -147123, 178662],
			["Запечатанная банка с образцами", 3339, 182794],
			["Запечатанная банка с образцами", 3328, 182793],
			["Запечатанная банка с образцами", 3317, 182795],
			["Запечатанная банка с образцами", 15966, 189754],
			["Запечатанная банка с образцами", 72424, 137267],
			["Запечатанная банка с образцами", 72415, 137265],
			["Запечатанная банка с образцами", 72421, 137266],
			["Запечатанная банка с образцами", -43773, 90904],
			["Запечатанная банка с образцами", -104843, 41822],
			["Запечатанная банка с образцами", -123274, 51015],
			["Запечатанная банка с образцами", -130947, 10639],
			["Запечатанная банка с образцами", -130928, 10594],
			["Запечатанная банка с образцами", 192642, 113608],
			["Запечатанная банка с образцами", 192984, 113307],
			["Запечатанная банка с образцами", 182840, 3119],
			["Запечатанная банка с образцами", 182964, 2769],
			["Запечатанная банка с образцами", 27082, 50362],
			["Запечатанная банка с образцами", 27076, 50344],
			["Запечатанная банка с образцами", 122137, 6504],
			["Запечатанная банка с образцами", 93671, 9048]
			];
	for (var i = 0; i < hlam147.length; i++) {
				hlam_147 = new L.circleMarker([hlam147[i][1],hlam147[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam147[i][0])
					.bindTooltip(hlam147[i][0], {direction: 'top'})
					.addTo(hlam147icons);
			}
	}
	else {
		hlam147icons.clearLayers();
	}
}
var hlam148icons = L.layerGroup().addTo(map);
function Hlam148OnOff() {
	var chbox148;
	chbox148=document.getElementById('Hlam148Button');
	if (chbox148.checked) {
		var hlam148 = [
			["Запечатанная стеклянная банка", -43070, -6287],
			["Запечатанная стеклянная банка", -120019, -46911],
			["Запечатанная стеклянная банка", -148703, -54414],
			["Запечатанная стеклянная банка", -148687, -54415],
			["Запечатанная стеклянная банка", 173609, -13426],
			["Запечатанная стеклянная банка", 148571, -80000],
			["Запечатанная стеклянная банка", 179617, -122046],
			["Запечатанная стеклянная банка", 81756, -20801],
			["Запечатанная стеклянная банка", 93122, -8904],
			["Запечатанная стеклянная банка", 47601, -20355],
			["Запечатанная стеклянная банка", 17948, -27479],
			["Запечатанная стеклянная банка", 30824, -33714],
			["Запечатанная стеклянная банка", 72304, -76039],
			["Запечатанная стеклянная банка", 72306, -76009],
			["Запечатанная стеклянная банка", 60628, -96664],
			["Запечатанная стеклянная банка", 18605, -123113],
			["Запечатанная стеклянная банка", 17241, -119520],
			["Запечатанная стеклянная банка", 17206, -120004],
			["Запечатанная стеклянная банка", 12459, -111965],
			["Запечатанная стеклянная банка", -4313, -156022],
			["Запечатанная стеклянная банка", -125902, -134233],
			["Запечатанная стеклянная банка", -42605, -173698],
			["Запечатанная стеклянная банка", 194822, -144619],
			["Запечатанная стеклянная банка", 189643, -164730],
			["Запечатанная стеклянная банка", -97348, 179481],
			["Запечатанная стеклянная банка", -45, 139102],
			["Запечатанная стеклянная банка", -144870, 175318],
			["Запечатанная стеклянная банка", -163017, 157005],
			["Запечатанная стеклянная банка", -163153, 157148],
			["Запечатанная стеклянная банка", 2026, 137640],
			["Запечатанная стеклянная банка", 711, 139496],
			["Запечатанная стеклянная банка", -68632, 56109],
			["Запечатанная стеклянная банка", -148457, 113679],
			["Запечатанная стеклянная банка", -154620, 49560],
			["Запечатанная стеклянная банка", -154247, 49219],
			["Запечатанная стеклянная банка", 192946, 113312],
			["Запечатанная стеклянная банка", 143545, 98561],
			["Запечатанная стеклянная банка", 131297, 85955],
			["Запечатанная стеклянная банка", 131273, 85970],
			["Запечатанная стеклянная банка", 144433, 97916],
			["Запечатанная стеклянная банка", 166967, 39404],
			["Запечатанная стеклянная банка", 113552, 114093],
			["Запечатанная стеклянная банка", 93700, 106068],
			["Запечатанная стеклянная банка", 130268, 86638],
			["Запечатанная стеклянная банка", 25833, 71262],
			["Запечатанная стеклянная банка", 75732, 9351],
			["Запечатанная стеклянная банка", 76065, 9856],
			["Запечатанная стеклянная банка", 47564, 14046]
			];
	for (var i = 0; i < hlam148.length; i++) {
				hlam_148 = new L.circleMarker([hlam148[i][1],hlam148[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam148[i][0])
					.bindTooltip(hlam148[i][0], {direction: 'top'})
					.addTo(hlam148icons);
			}
	}
	else {
		hlam148icons.clearLayers();
	}
}
var hlam149icons = L.layerGroup().addTo(map);
function Hlam149OnOff() {
	var chbox149;
	chbox149=document.getElementById('Hlam149Button');
	if (chbox149.checked) {
		var hlam149 = [
			["Золотая вилка", -139229, -144073]
			];
	for (var i = 0; i < hlam149.length; i++) {
				hlam_149 = new L.circleMarker([hlam149[i][1],hlam149[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam149[i][0])
					.bindTooltip(hlam149[i][0], {direction: 'top'})
					.addTo(hlam149icons);
			}
	}
	else {
		hlam149icons.clearLayers();
	}
}
var hlam150icons = L.layerGroup().addTo(map);
function Hlam150OnOff() {
	var chbox150;
	chbox150=document.getElementById('Hlam150Button');
	if (chbox150.checked) {
		var hlam150 = [
			["Золотая столовая ложка", -128563, 80274]
			];
	for (var i = 0; i < hlam150.length; i++) {
				hlam_150 = new L.circleMarker([hlam150[i][1],hlam150[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam150[i][0])
					.bindTooltip(hlam150[i][0], {direction: 'top'})
					.addTo(hlam150icons);
			}
	}
	else {
		hlam150icons.clearLayers();
	}
}
var hlam151icons = L.layerGroup().addTo(map);
function Hlam151OnOff() {
	var chbox151;
	chbox151=document.getElementById('Hlam151Button');
	if (chbox151.checked) {
		var hlam151 = [
			["Золотой лом", -46574, -51539],
			["Золотой лом", -46577, -51541],
			["Золотой лом", -101176, -54573],
			["Золотой лом", -101235, -54691],
			["Золотой лом", 88992, -5706],
			["Золотой лом", 88985, -5677],
			["Золотой лом", 88993, -5677],
			["Золотой лом", 48846, -21449],
			["Золотой лом", 125697, -152808],
			["Золотой лом", 61546, 178720],
			["Золотой лом", 61550, 178711],
			["Золотой лом", 61546, 178712]
			];
	for (var i = 0; i < hlam151.length; i++) {
				hlam_151 = new L.circleMarker([hlam151[i][1],hlam151[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam151[i][0])
					.bindTooltip(hlam151[i][0], {direction: 'top'})
					.addTo(hlam151icons);
			}
	}
	else {
		hlam151icons.clearLayers();
	}
}
var hlam152icons = L.layerGroup().addTo(map);
function Hlam152OnOff() {
	var chbox152;
	chbox152=document.getElementById('Hlam152Button');
	if (chbox152.checked) {
		var hlam152 = [
			["Золотой столовый нож", 127190, -81089]
			];
	for (var i = 0; i < hlam152.length; i++) {
				hlam_152 = new L.circleMarker([hlam152[i][1],hlam152[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam152[i][0])
					.bindTooltip(hlam152[i][0], {direction: 'top'})
					.addTo(hlam152icons);
			}
	}
	else {
		hlam152icons.clearLayers();
	}
}
var hlam153icons = L.layerGroup().addTo(map);
function Hlam153OnOff() {
	var chbox153;
	chbox153=document.getElementById('Hlam153Button');
	if (chbox153.checked) {
		var hlam153 = [
			["Золотые карманные часы", -53035, -1196],
			["Золотые карманные часы", -101464, -54826],
			["Золотые карманные часы", -151249, -71594],
			["Золотые карманные часы", 108578, -161411],
			["Золотые карманные часы", -143479, 156698],
			["Золотые карманные часы", 61541, 178688],
			["Золотые карманные часы", 29595, 133148],
			["Золотые карманные часы", -66012, 36273],
			["Золотые карманные часы", -50764, 2723],
			["Золотые карманные часы", -46914, 1471],
			["Золотые карманные часы", -47439, 2033],
			["Золотые карманные часы", -179485, 74394],
			["Золотые карманные часы", 181168, 109822],
			["Золотые карманные часы", 172787, 39195]
			];
	for (var i = 0; i < hlam153.length; i++) {
				hlam_153 = new L.circleMarker([hlam153[i][1],hlam153[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam153[i][0])
					.bindTooltip(hlam153[i][0], {direction: 'top'})
					.addTo(hlam153icons);
			}
	}
	else {
		hlam153icons.clearLayers();
	}
}
var hlam154icons = L.layerGroup().addTo(map);
function Hlam154OnOff() {
	var chbox154;
	chbox154=document.getElementById('Hlam154Button');
	if (chbox154.checked) {
		var hlam154 = [
			["Зонтик", -43660, -7042],
			["Зонтик", -55391, -61461],
			["Зонтик", -47778, -49922],
			["Зонтик", -13121, -66406],
			["Зонтик", -46615, -104374],
			["Зонтик", -61497, -101088],
			["Зонтик", 78047, -1403],
			["Зонтик", 93376, -1458],
			["Зонтик", 48111, -21673],
			["Зонтик", 73914, -177674],
			["Зонтик", -60106, 183186],
			["Зонтик", -60693, 181798],
			["Зонтик", -144958, 148861],
			["Зонтик", 79889, 182559],
			["Зонтик", 48745, 190371],
			["Зонтик", -39345, 46816],
			["Зонтик", -99757, 35403],
			["Зонтик", -30070, 17048],
			["Зонтик", -179945, 74353],
			["Зонтик", 111504, 55985]
			];
	for (var i = 0; i < hlam154.length; i++) {
				hlam_154 = new L.circleMarker([hlam154[i][1],hlam154[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam154[i][0])
					.bindTooltip(hlam154[i][0], {direction: 'top'})
					.addTo(hlam154icons);
			}
	}
	else {
		hlam154icons.clearLayers();
	}
}
var hlam155icons = L.layerGroup().addTo(map);
function Hlam155OnOff() {
	var chbox155;
	chbox155=document.getElementById('Hlam155Button');
	if (chbox155.checked) {
		var hlam155 = [
			["Зубная паста", -51372, -3535],
			["Зубная паста", -40462, -2643],
			["Зубная паста", -102281, -130531],
			["Зубная паста", -148265, -55788],
			["Зубная паста", -148513, -55785],
			["Зубная паста", 104085, -13500],
			["Зубная паста", 101469, -11564],
			["Зубная паста", 84348, -2025],
			["Зубная паста", 84519, -1983],
			["Зубная паста", 84504, -1985],
			["Зубная паста", 30993, -33399],
			["Зубная паста", 93111, -85162],
			["Зубная паста", 9530, -79122],
			["Зубная паста", 131497, -132016],
			["Зубная паста", 80702, -179099],
			["Зубная паста", -23294, 188902],
			["Зубная паста", -97591, 179386],
			["Зубная паста", -138620, 153621],
			["Зубная паста", 150789, 134750],
			["Зубная паста", 46336, 165394],
			["Зубная паста", 14660, 192825],
			["Зубная паста", -103778, 108909],
			["Зубная паста", -104711, 123053],
			["Зубная паста", -98678, 7607],
			["Зубная паста", -172480, 109583],
			["Зубная паста", 140862, 9235],
			["Зубная паста", 128816, 85162],
			["Зубная паста", 113878, 6588],
			["Зубная паста", 125931, 9913]
			];
	for (var i = 0; i < hlam155.length; i++) {
				hlam_155 = new L.circleMarker([hlam155[i][1],hlam155[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam155[i][0])
					.bindTooltip(hlam155[i][0], {direction: 'top'})
					.addTo(hlam155icons);
			}
	}
	else {
		hlam155icons.clearLayers();
	}
}
var hlam156icons = L.layerGroup().addTo(map);
function Hlam156OnOff() {
	var chbox156;
	chbox156=document.getElementById('Hlam156Button');
	if (chbox156.checked) {
		var hlam156 = [
			["Зубная щетка", -42466, -5103],
			["Зубная щетка", -102272, -130508],
			["Зубная щетка", -148264, -55770],
			["Зубная щетка", -148527, -55780],
			["Зубная щетка", 167275, -22508],
			["Зубная щетка", 101060, -15457],
			["Зубная щетка", 103686, -15271],
			["Зубная щетка", 104086, -13494],
			["Зубная щетка", 101480, -11562],
			["Зубная щетка", 84353, -2030],
			["Зубная щетка", 84501, -1983],
			["Зубная щетка", 84506, -1981],
			["Зубная щетка", 31024, -33409],
			["Зубная щетка", 9318, -82312],
			["Зубная щетка", 9538, -79137],
			["Зубная щетка", 19933, -104231],
			["Зубная щетка", 111313, -147438],
			["Зубная щетка", 80703, -179114],
			["Зубная щетка", -23295, 188892],
			["Зубная щетка", -97549, 179387],
			["Зубная щетка", 150807, 134765],
			["Зубная щетка", 46335, 165409],
			["Зубная щетка", 48405, 190947],
			["Зубная щетка", 14643, 192826],
			["Зубная щетка", 111080, 157879],
			["Зубная щетка", 86163, 151927],
			["Зубная щетка", -103772, 108906],
			["Зубная щетка", -104578, 123176],
			["Зубная щетка", -58653, 7121],
			["Зубная щетка", -98646, 7623],
			["Зубная щетка", -172487, 109580],
			["Зубная щетка", 140859, 9227],
			["Зубная щетка", 94820, 98815],
			["Зубная щетка", 96916, 104741],
			["Зубная щетка", 128820, 85173],
			["Зубная щетка", 72709, 38248],
			["Зубная щетка", 27854, 47436],
			["Зубная щетка", 113892, 6593],
			["Зубная щетка", 125930, 9928]
			];
	for (var i = 0; i < hlam156.length; i++) {
				hlam_156 = new L.circleMarker([hlam156[i][1],hlam156[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam156[i][0])
					.bindTooltip(hlam156[i][0], {direction: 'top'})
					.addTo(hlam156icons);
			}
	}
	else {
		hlam156icons.clearLayers();
	}
}
var hlam157icons = L.layerGroup().addTo(map);
function Hlam157OnOff() {
	var chbox157;
	chbox157=document.getElementById('Hlam157Button');
	if (chbox157.checked) {
		var hlam157 = [
			["Игрушечная машинка", -9484, -27036],
			["Игрушечная машинка", -56024, -10173],
			["Игрушечная машинка", -109030, -21131],
			["Игрушечная машинка", -38503, -61621],
			["Игрушечная машинка", -46902, -50818],
			["Игрушечная машинка", -89953, -42409],
			["Игрушечная машинка", -52607, -96615],
			["Игрушечная машинка", -4187, -130003],
			["Игрушечная машинка", -114448, -117179],
			["Игрушечная машинка", 190589, -29979],
			["Игрушечная машинка", 191380, -30720],
			["Игрушечная машинка", 191359, -30739],
			["Игрушечная машинка", 192374, -29215],
			["Игрушечная машинка", 190973, -26729],
			["Игрушечная машинка", 169222, -129],
			["Игрушечная машинка", 193592, -34658],
			["Игрушечная машинка", 101439, -29220],
			["Игрушечная машинка", 67639, -14562],
			["Игрушечная машинка", 17039, -44375],
			["Игрушечная машинка", 78447, -93300],
			["Игрушечная машинка", 21088, -102412],
			["Игрушечная машинка", -1974, -160017],
			["Игрушечная машинка", -2425, -159869],
			["Игрушечная машинка", -75308, -182587],
			["Игрушечная машинка", -142414, -159067],
			["Игрушечная машинка", 165439, -150274],
			["Игрушечная машинка", 145321, -149961],
			["Игрушечная машинка", 145459, -149906],
			["Игрушечная машинка", 23222, -148953],
			["Игрушечная машинка", 74805, -179372],
			["Игрушечная машинка", 71968, -173317],
			["Игрушечная машинка", -13552, 196939],
			["Игрушечная машинка", -31097, 196489],
			["Игрушечная машинка", -27088, 162769],
			["Игрушечная машинка", -144375, 149634],
			["Игрушечная машинка", -145031, 150019],
			["Игрушечная машинка", 170555, 240480],
			["Игрушечная машинка", 121375, 143763],
			["Игрушечная машинка", 45285, 162058],
			["Игрушечная машинка", 46482, 160836],
			["Игрушечная машинка", -91006, 66461],
			["Игрушечная машинка", -39604, 47018],
			["Игрушечная машинка", -91753, 26224],
			["Игрушечная машинка", 189473, 84168],
			["Игрушечная машинка", 162744, 55856],
			["Игрушечная машинка", 157450, 13515],
			["Игрушечная машинка", 121381, 116464],
			["Игрушечная машинка", 30360, 127862],
			["Игрушечная машинка", 30521, 65848],
			["Игрушечная машинка", 106874, 51610],
			["Игрушечная машинка", 121766, 5650],
			["Игрушечная машинка", 121781, 5781],
			["Игрушечная машинка", 121781, 5984],
			["Игрушечная машинка", 75557, 9532],
			["Игрушечная машинка", 57915, 10880],
			["Игрушечная машинка", 57818, 10045],
			["Игрушечная машинка", 58523, 10767],
			["Игрушечная машинка", 58760, 9117],
			["Игрушечная машинка", -1712, -164458]
			];
	for (var i = 0; i < hlam157.length; i++) {
				hlam_157 = new L.circleMarker([hlam157[i][1],hlam157[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam157[i][0])
					.bindTooltip(hlam157[i][0], {direction: 'top'})
					.addTo(hlam157icons);
			}
	}
	else {
		hlam157icons.clearLayers();
	}
}
var hlam158icons = L.layerGroup().addTo(map);
function Hlam158OnOff() {
	var chbox158;
	chbox158=document.getElementById('Hlam158Button');
	if (chbox158.checked) {
		var hlam158 = [
			["Игрушечная машинка", 88396, 157379]
			];
	for (var i = 0; i < hlam158.length; i++) {
				hlam_158 = new L.circleMarker([hlam158[i][1],hlam158[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam158[i][0])
					.bindTooltip(hlam158[i][0], {direction: 'top'})
					.addTo(hlam158icons);
			}
	}
	else {
		hlam158icons.clearLayers();
	}
}
var hlam159icons = L.layerGroup().addTo(map);
function Hlam159OnOff() {
	var chbox159;
	chbox159=document.getElementById('Hlam159Button');
	if (chbox159.checked) {
		var hlam159 = [
			["Игрушечная ракета", -42298, -5577],
			["Игрушечная ракета", -43996, -8017],
			["Игрушечная ракета", -108953, -21866],
			["Игрушечная ракета", -38465, -61602],
			["Игрушечная ракета", -47175, -51187],
			["Игрушечная ракета", -61581, -100583],
			["Игрушечная ракета", -149518, -58975],
			["Игрушечная ракета", 190608, -29981],
			["Игрушечная ракета", 191419, -30566],
			["Игрушечная ракета", 191486, -30574],
			["Игрушечная ракета", 193451, -34555],
			["Игрушечная ракета", 74217, -18301],
			["Игрушечная ракета", 92504, -7135],
			["Игрушечная ракета", 30938, -33269],
			["Игрушечная ракета", 14479, -75575],
			["Игрушечная ракета", 47104, -104679],
			["Игрушечная ракета", 9481, -107385],
			["Игрушечная ракета", -1943, -160030],
			["Игрушечная ракета", -76413, -182965],
			["Игрушечная ракета", 165459, -150311],
			["Игрушечная ракета", 146103, -149564],
			["Игрушечная ракета", 145543, -149779],
			["Игрушечная ракета", 145539, -149781],
			["Игрушечная ракета", 145543, -149810],
			["Игрушечная ракета", 189056, -165942],
			["Игрушечная ракета", 79288, -153892],
			["Игрушечная ракета", -82631, 202005],
			["Игрушечная ракета", -19984, 146009],
			["Игрушечная ракета", -144380, 149624],
			["Игрушечная ракета", 151130, 136113],
			["Игрушечная ракета", 146915, 139914],
			["Игрушечная ракета", 152841, 161862],
			["Игрушечная ракета", 120387, 144338],
			["Игрушечная ракета", 45266, 162036],
			["Игрушечная ракета", -93906, 67435],
			["Игрушечная ракета", -91885, 26165],
			["Игрушечная ракета", -158353, 56283],
			["Игрушечная ракета", 180864, 110900],
			["Игрушечная ракета", 189540, 84196],
			["Игрушечная ракета", 133602, 85959],
			["Игрушечная ракета", 145077, 87296],
			["Игрушечная ракета", 122118, 118239],
			["Игрушечная ракета", 30082, 127708],
			["Игрушечная ракета", 16833, 45357],
			["Игрушечная ракета", 28610, 52644],
			["Игрушечная ракета", 121408, 5693],
			["Игрушечная ракета", 75572, 9562],
			["Игрушечная ракета", -110470, -95465]
			];
	for (var i = 0; i < hlam159.length; i++) {
				hlam_159 = new L.circleMarker([hlam159[i][1],hlam159[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam159[i][0])
					.bindTooltip(hlam159[i][0], {direction: 'top'})
					.addTo(hlam159icons);
			}
	}
	else {
		hlam159icons.clearLayers();
	}
}
var hlam160icons = L.layerGroup().addTo(map);
function Hlam160OnOff() {
	var chbox160;
	chbox160=document.getElementById('Hlam160Button');
	if (chbox160.checked) {
		var hlam160 = [
			["Игрушечная ракета", 88394, 157387]
			];
	for (var i = 0; i < hlam160.length; i++) {
				hlam_160 = new L.circleMarker([hlam160[i][1],hlam160[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam160[i][0])
					.bindTooltip(hlam160[i][0], {direction: 'top'})
					.addTo(hlam160icons);
			}
	}
	else {
		hlam160icons.clearLayers();
	}
}
var hlam161icons = L.layerGroup().addTo(map);
function Hlam161OnOff() {
	var chbox161;
	chbox161=document.getElementById('Hlam161Button');
	if (chbox161.checked) {
		var hlam161 = [
			["Игрушечный грузовик", -9442, -27031],
			["Игрушечный грузовик", -52477, -13346],
			["Игрушечный грузовик", -42380, -5466],
			["Игрушечный грузовик", -109054, -21159],
			["Игрушечный грузовик", -109363, -23654],
			["Игрушечный грузовик", -109077, -21850],
			["Игрушечный грузовик", -14131, -43581],
			["Игрушечный грузовик", -38576, -61596],
			["Игрушечный грузовик", -47151, -50700],
			["Игрушечный грузовик", -52247, -46204],
			["Игрушечный грузовик", -90893, -42223],
			["Игрушечный грузовик", -107731, -56120],
			["Игрушечный грузовик", -4078, -130293],
			["Игрушечный грузовик", -61338, -100930],
			["Игрушечный грузовик", 192121, -29322],
			["Игрушечный грузовик", 192084, -29290],
			["Игрушечный грузовик", 191396, -30696],
			["Игрушечный грузовик", 191127, -30713],
			["Игрушечный грузовик", 193430, -34529],
			["Игрушечный грузовик", 193530, -34457],
			["Игрушечный грузовик", 74217, -18233],
			["Игрушечный грузовик", 89034, -6004],
			["Игрушечный грузовик", 39242, -37194],
			["Игрушечный грузовик", 17062, -44442],
			["Игрушечный грузовик", 78431, -93334],
			["Игрушечный грузовик", 93885, -84297],
			["Игрушечный грузовик", 11811, -83827],
			["Игрушечный грузовик", 21093, -102416],
			["Игрушечный грузовик", -1978, -159999],
			["Игрушечный грузовик", -27087, -131694],
			["Игрушечный грузовик", -124157, -131333],
			["Игрушечный грузовик", -76625, -175311],
			["Игрушечный грузовик", 165462, -150200],
			["Игрушечный грузовик", 145435, -149916],
			["Игрушечный грузовик", 145295, -149971],
			["Игрушечный грузовик", 115129, -157955],
			["Игрушечный грузовик", 79333, -153886],
			["Игрушечный грузовик", -13428, 196827],
			["Игрушечный грузовик", -136428, 146736],
			["Игрушечный грузовик", 170517, 240546],
			["Игрушечный грузовик", 150721, 138162],
			["Игрушечный грузовик", 48406, 190952],
			["Игрушечный грузовик", 120315, 144205],
			["Игрушечный грузовик", 88556, 156981],
			["Игрушечный грузовик", 46410, 160914],
			["Игрушечный грузовик", -91268, 66596],
			["Игрушечный грузовик", -158408, 56137],
			["Игрушечный грузовик", 189445, 84159],
			["Игрушечный грузовик", 162752, 55836],
			["Игрушечный грузовик", 157422, 13540],
			["Игрушечный грузовик", 121523, 116691],
			["Игрушечный грузовик", 30134, 127365],
			["Игрушечный грузовик", 121786, 5910],
			["Игрушечный грузовик", 75675, 9606],
			["Игрушечный грузовик", 57874, 10896],
			["Игрушечный грузовик", 57776, 10070]
			];
	for (var i = 0; i < hlam161.length; i++) {
				hlam_161 = new L.circleMarker([hlam161[i][1],hlam161[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam161[i][0])
					.bindTooltip(hlam161[i][0], {direction: 'top'})
					.addTo(hlam161icons);
			}
	}
	else {
		hlam161icons.clearLayers();
	}
}
var hlam162icons = L.layerGroup().addTo(map);
function Hlam162OnOff() {
	var chbox162;
	chbox162=document.getElementById('Hlam162Button');
	if (chbox162.checked) {
		var hlam162 = [
			["Игрушечный инопланетянин", -108732, -23246],
			["Игрушечный инопланетянин", -38541, -61460],
			["Игрушечный инопланетянин", -47148, -51250],
			["Игрушечный инопланетянин", -121795, -62306],
			["Игрушечный инопланетянин", -121826, -62322],
			["Игрушечный инопланетянин", -59002, -66539],
			["Игрушечный инопланетянин", -61335, -100931],
			["Игрушечный инопланетянин", -75418, -110947],
			["Игрушечный инопланетянин", -68814, -103669],
			["Игрушечный инопланетянин", 190587, -29985],
			["Игрушечный инопланетянин", 190573, -29957],
			["Игрушечный инопланетянин", 191519, -30544],
			["Игрушечный инопланетянин", 193542, -34619],
			["Игрушечный инопланетянин", 193474, -34563],
			["Игрушечный инопланетянин", 74221, -18264],
			["Игрушечный инопланетянин", 29369, -58594],
			["Игрушечный инопланетянин", 17020, -44367],
			["Игрушечный инопланетянин", 32412, -39309],
			["Игрушечный инопланетянин", 74846, -83265],
			["Игрушечный инопланетянин", -62523, -170622],
			["Игрушечный инопланетянин", 165599, -150232],
			["Игрушечный инопланетянин", 145982, -149741],
			["Игрушечный инопланетянин", 145996, -149721],
			["Игрушечный инопланетянин", 145409, -149925],
			["Игрушечный инопланетянин", 102857, -151574],
			["Игрушечный инопланетянин", 74667, -179351],
			["Игрушечный инопланетянин", -145032, 149984],
			["Игрушечный инопланетянин", 152597, 162013],
			["Игрушечный инопланетянин", -92523, 65114],
			["Игрушечный инопланетянин", -99577, 38948],
			["Игрушечный инопланетянин", -29833, 17019],
			["Игрушечный инопланетянин", -64859, 5593],
			["Игрушечный инопланетянин", 166957, 14803],
			["Игрушечный инопланетянин", 70124, 82838],
			["Игрушечный инопланетянин", 81393, 54732],
			["Игрушечный инопланетянин", 101660, 3521],
			["Игрушечный инопланетянин", 100985, 2918],
			["Игрушечный инопланетянин", -19704, 16768],
			["Игрушечный инопланетянин", -128548, 80258]
			];
	for (var i = 0; i < hlam162.length; i++) {
				hlam_162 = new L.circleMarker([hlam162[i][1],hlam162[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam162[i][0])
					.bindTooltip(hlam162[i][0], {direction: 'top'})
					.addTo(hlam162icons);
			}
	}
	else {
		hlam162icons.clearLayers();
	}
}
var hlam163icons = L.layerGroup().addTo(map);
function Hlam163OnOff() {
	var chbox163;
	chbox163=document.getElementById('Hlam163Button');
	if (chbox163.checked) {
		var hlam163 = [
			["Игрушечный инопланетянин", -109391, -20536],
			["Игрушечный инопланетянин", 8740, -79091]
			];
	for (var i = 0; i < hlam163.length; i++) {
				hlam_163 = new L.circleMarker([hlam163[i][1],hlam163[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam163[i][0])
					.bindTooltip(hlam163[i][0], {direction: 'top'})
					.addTo(hlam163icons);
			}
	}
	else {
		hlam163icons.clearLayers();
	}
}
var hlam164icons = L.layerGroup().addTo(map);
function Hlam164OnOff() {
	var chbox164;
	chbox164=document.getElementById('Hlam164Button');
	if (chbox164.checked) {
		var hlam164 = [
			["Избыточный клей", 101453, 196724],
			["Избыточный клей", 101454, 196713],
			["Избыточный клей", 114674, 68825]
			];
	for (var i = 0; i < hlam164.length; i++) {
				hlam_164 = new L.circleMarker([hlam164[i][1],hlam164[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam164[i][0])
					.bindTooltip(hlam164[i][0], {direction: 'top'})
					.addTo(hlam164icons);
			}
	}
	else {
		hlam164icons.clearLayers();
	}
}
var hlam165icons = L.layerGroup().addTo(map);
function Hlam165OnOff() {
	var chbox165;
	chbox165=document.getElementById('Hlam165Button');
	if (chbox165.checked) {
		var hlam165 = [
			["Изолента", -77627, -21759],
			["Изолента", -123501, -17270],
			["Изолента", -29321, -49356],
			["Изолента", -45925, -50186],
			["Изолента", -46675, -50869],
			["Изолента", -55346, -48069],
			["Изолента", -52001, -46652],
			["Изолента", -119784, -45960],
			["Изолента", -29798, -93022],
			["Изолента", -29807, -93020],
			["Изолента", -29737, -93827],
			["Изолента", -46969, -72931],
			["Изолента", -46822, -72911],
			["Изолента", -83474, -78966],
			["Изолента", -129978, -91767],
			["Изолента", -43129, -127636],
			["Изолента", -93225, -130971],
			["Изолента", -88883, -108918],
			["Изолента", -88797, -108946],
			["Изолента", -85258, -110047],
			["Изолента", -69009, -105114],
			["Изолента", -122942, -122963],
			["Изолента", -148846, -57961],
			["Изолента", -151387, -74150],
			["Изолента", -150892, -74133],
			["Изолента", -168000, -115298],
			["Изолента", 194206, -31474],
			["Изолента", 167518, -24529],
			["Изолента", 173268, -18120],
			["Изолента", 182981, -93334],
			["Изолента", 158178, -68788],
			["Изолента", 89796, -31761],
			["Изолента", 88641, -31226],
			["Изолента", 81776, -20860],
			["Изолента", 69155, -15779],
			["Изолента", 97101, -13323],
			["Изолента", 91965, -9879],
			["Изолента", 34738, -6118],
			["Изолента", 34746, -6116],
			["Изолента", 62408, -58228],
			["Изолента", 61876, -56981],
			["Изолента", 24907, -63579],
			["Изолента", 24908, -63535],
			["Изолента", 24973, -60300],
			["Изолента", 29251, -58759],
			["Изолента", 31141, -33476],
			["Изолента", 101137, -100416],
			["Изолента", 18490, -122945],
			["Изолента", 18320, -122644],
			["Изолента", 9848, -107128],
			["Изолента", -4457, -156145],
			["Изолента", -4163, -155646],
			["Изолента", -4111, -155603],
			["Изолента", -4068, -155624],
			["Изолента", -61336, -145545],
			["Изолента", -121653, -132642],
			["Изолента", -14669, -173629],
			["Изолента", -43773, -173823],
			["Изолента", -53597, -167990],
			["Изолента", -95198, -176693],
			["Изолента", -82637, -178539],
			["Изолента", 131478, -132251],
			["Изолента", 189084, -169265],
			["Изолента", 188602, -165424],
			["Изолента", 188745, -165884],
			["Изолента", 61963, -134094],
			["Изолента", 26732, -136501],
			["Изолента", 28278, -138298],
			["Изолента", 28798, -138393],
			["Изолента", 71714, -175124],
			["Изолента", -16589, 163848],
			["Изолента", -23386, 188909],
			["Изолента", -60533, 180550],
			["Изолента", -97408, 179452],
			["Изолента", -80042, 180396],
			["Изолента", -93180, 184323],
			["Изолента", -3944, 161412],
			["Изолента", -42734, 137647],
			["Изолента", -39324, 159462],
			["Изолента", -40479, 161219],
			["Изолента", -40402, 161401],
			["Изолента", -121367, 143242],
			["Изолента", -161622, 200918],
			["Изолента", -145843, 172533],
			["Изолента", -146184, 172647],
			["Изолента", -146975, 178700],
			["Изолента", -145560, 177447],
			["Изолента", -143494, 179078],
			["Изолента", -158650, 185619],
			["Изолента", -141064, 143128],
			["Изолента", -141061, 143119],
			["Изолента", -163013, 156962],
			["Изолента", 143460, 194338],
			["Изолента", 143799, 137007],
			["Изолента", 153241, 139830],
			["Изолента", 152612, 161862],
			["Изолента", 70228, 202089],
			["Изолента", 101247, 192439],
			["Изолента", 103220, 190833],
			["Изолента", 101568, 193771],
			["Изолента", 100615, 195951],
			["Изолента", 80878, 184336],
			["Изолента", 94796, 194378],
			["Изолента", 61197, 172685],
			["Изолента", 62351, 172989],
			["Изолента", 63409, 177065],
			["Изолента", 3120, 182025],
			["Изолента", 15940, 189859],
			["Изолента", 72047, 138237],
			["Изолента", 20394, 134831],
			["Изолента", 5707, 160384],
			["Изолента", -37774, 84737],
			["Изолента", -37651, 84154],
			["Изолента", -37786, 83466],
			["Изолента", -37536, 83715],
			["Изолента", -41515, 88663],
			["Изолента", -43246, 88068],
			["Изолента", -87999, 67557],
			["Изолента", -87859, 67326],
			["Изолента", -115233, 84568],
			["Изолента", -5488, 33921],
			["Изолента", -24626, 10004],
			["Изолента", -45959, 1782],
			["Изолента", -42101, 1924],
			["Изолента", -34977, 13244],
			["Изолента", -43531, 28265],
			["Изолента", -43886, 28322],
			["Изолента", -45526, 28905],
			["Изолента", -43831, 29156],
			["Изолента", -148776, 113667],
			["Изолента", -138896, 88675],
			["Изолента", -132226, 10547],
			["Изолента", 182367, 110641],
			["Изолента", 182923, 110991],
			["Изолента", 183131, 111486],
			["Изолента", 182684, 111627],
			["Изолента", 182732, 111605],
			["Изолента", 134538, 127441],
			["Изолента", 153961, 77440],
			["Изолента", 144288, 81116],
			["Изолента", 153171, 57680],
			["Изолента", 140680, 3543],
			["Изолента", 131870, 11934],
			["Изолента", 133288, 17908],
			["Изолента", 133574, 17158],
			["Изолента", 130408, 112442],
			["Изолента", 95455, 99033],
			["Изолента", 94085, 103636],
			["Изолента", 106779, 51874],
			["Изолента", 111564, 58084],
			["Изолента", 76480, 37049],
			["Изолента", 74423, 44205],
			["Изолента", 80009, 55743],
			["Изолента", 79815, 55813],
			["Изолента", 9998, 48579],
			["Изолента", 19975, 50699],
			["Изолента", 130564, 17590],
			["Изолента", 130080, 20104],
			["Изолента", 87826, 2290],
			["Изолента", 89581, 7950],
			["Изолента", 89524, 7906],
			["Изолента", 89421, 7961],
			["Изолента", 87252, 7081],
			["Изолента", 87333, 7144],
			["Изолента", 87352, 7319],
			["Изолента", 93584, 9037],
			["Изолента", 53012, 10974],
			["Изолента", 55329, 8397],
			["Изолента", 54534, 8981]
			];
	for (var i = 0; i < hlam165.length; i++) {
				hlam_165 = new L.circleMarker([hlam165[i][1],hlam165[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam165[i][0])
					.bindTooltip(hlam165[i][0], {direction: 'top'})
					.addTo(hlam165icons);
			}
	}
	else {
		hlam165icons.clearLayers();
	}
}
var hlam166icons = L.layerGroup().addTo(map);
function Hlam166OnOff() {
	var chbox166;
	chbox166=document.getElementById('Hlam166Button');
	if (chbox166.checked) {
		var hlam166 = [
			["Изолента военного образца", -16155, -69151],
			["Изолента военного образца", -11613, -68588],
			["Изолента военного образца", -35118, -84311],
			["Изолента военного образца", -35125, -84316],
			["Изолента военного образца", -147162, -70583],
			["Изолента военного образца", 167292, -25439],
			["Изолента военного образца", 182756, -93500],
			["Изолента военного образца", 182761, -93505],
			["Изолента военного образца", 182756, -93497],
			["Изолента военного образца", 94075, -84498],
			["Изолента военного образца", 108139, -153562],
			["Изолента военного образца", 107905, -153479],
			["Изолента военного образца", -169775, 202286],
			["Изолента военного образца", -155137, 164545],
			["Изолента военного образца", -86610, 115373],
			["Изолента военного образца", -103211, 108922],
			["Изолента военного образца", -89671, 82797],
			["Изолента военного образца", -99274, 37062],
			["Изолента военного образца", -58663, 7114],
			["Изолента военного образца", -68059, 2800],
			["Изолента военного образца", -173052, 110382],
			["Изолента военного образца", -172698, 109568],
			["Изолента военного образца", 179427, 111983],
			["Изолента военного образца", 160380, 116067],
			["Изолента военного образца", 160384, 116061],
			["Изолента военного образца", 190322, 30928],
			["Изолента военного образца", 190393, 30914],
			["Изолента военного образца", 98375, 100562],
			["Изолента военного образца", 72509, 38364],
			["Изолента военного образца", 64849, -58632]
			];
	for (var i = 0; i < hlam166.length; i++) {
				hlam_166 = new L.circleMarker([hlam166[i][1],hlam166[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam166[i][0])
					.bindTooltip(hlam166[i][0], {direction: 'top'})
					.addTo(hlam166icons);
			}
	}
	else {
		hlam166icons.clearLayers();
	}
}
var hlam167icons = L.layerGroup().addTo(map);
function Hlam167OnOff() {
	var chbox167;
	chbox167=document.getElementById('Hlam167Button');
	if (chbox167.checked) {
		var hlam167 = [
			["Импортная китайская панда", -44458, -7805],
			["Импортная китайская панда", -42708, -4271],
			["Импортная китайская панда", -21760, -43677],
			["Импортная китайская панда", 76387, -6762],
			["Импортная китайская панда", 29372, -58741],
			["Импортная китайская панда", -84512, -176476],
			["Импортная китайская панда", -133817, -157890],
			["Импортная китайская панда", 146231, -149389],
			["Импортная китайская панда", 143469, -144469],
			["Импортная китайская панда", -141300, 190217],
			["Импортная китайская панда", -141230, 190073],
			["Импортная китайская панда", -141186, 190291],
			["Импортная китайская панда", -141411, 190246],
			["Импортная китайская панда", -142961, 138312],
			["Импортная китайская панда", 165377, 152667],
			["Импортная китайская панда", 42952, 198498],
			["Импортная китайская панда", 1609, 137605],
			["Импортная китайская панда", -21272, 16456],
			["Импортная китайская панда", 162649, 55656],
			["Импортная китайская панда", 94803, 103085],
			["Импортная китайская панда", 47331, 62408],
			["Импортная китайская панда", 6065, 43306],
			["Импортная китайская панда", 23261, 48903],
			["Импортная китайская панда", 88001, 1721],
			["Импортная китайская панда", 58842, 9420]
			];
	for (var i = 0; i < hlam167.length; i++) {
				hlam_167 = new L.circleMarker([hlam167[i][1],hlam167[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam167[i][0])
					.bindTooltip(hlam167[i][0], {direction: 'top'})
					.addTo(hlam167icons);
			}
	}
	else {
		hlam167icons.clearLayers();
	}
}
var hlam168icons = L.layerGroup().addTo(map);
function Hlam168OnOff() {
	var chbox168;
	chbox168=document.getElementById('Hlam168Button');
	if (chbox168.checked) {
		var hlam168 = [
			["Канистра", -8580, -2637],
			["Канистра", -8585, -2670],
			["Канистра", -44662, -15574],
			["Канистра", -44662, -15592],
			["Канистра", -54344, -12240],
			["Канистра", -47281, -6462],
			["Канистра", -43188, -6791],
			["Канистра", -77795, -21621],
			["Канистра", -68260, -14248],
			["Канистра", -68268, -14245],
			["Канистра", -121506, -27714],
			["Канистра", -120181, -14200],
			["Канистра", -107454, -14059],
			["Канистра", -21646, -44825],
			["Канистра", -41004, -37823],
			["Канистра", -72952, -50445],
			["Канистра", -85337, -45371],
			["Канистра", -85282, -45651],
			["Канистра", -85304, -45678],
			["Канистра", -119743, -46910],
			["Канистра", -119781, -46893],
			["Канистра", -120159, -45930],
			["Канистра", -114035, -47178],
			["Канистра", -29642, -94415],
			["Канистра", -28844, -93916],
			["Канистра", -29665, -87706],
			["Канистра", -29639, -87738],
			["Канистра", -31277, -65765],
			["Канистра", -34976, -84691],
			["Канистра", -34930, -84666],
			["Канистра", -34497, -84370],
			["Канистра", -34986, -82570],
			["Канистра", -34770, -82848],
			["Канистра", -58874, -79297],
			["Канистра", -36522, -81509],
			["Канистра", -35771, -81384],
			["Канистра", -46542, -72892],
			["Канистра", -72784, -96596],
			["Канистра", -93041, -83460],
			["Канистра", -93562, -83058],
			["Канистра", -110496, -95403],
			["Канистра", -118191, -84363],
			["Канистра", -118137, -84927],
			["Канистра", -99728, -82145],
			["Канистра", -129492, -65549],
			["Канистра", -1442, -128719],
			["Канистра", -1778, -129881],
			["Канистра", -43109, -127655],
			["Канистра", -46386, -105207],
			["Канистра", -46345, -105160],
			["Канистра", -97848, -126081],
			["Канистра", -97782, -126131],
			["Канистра", -82958, -116970],
			["Канистра", -83001, -116980],
			["Канистра", -95420, -113430],
			["Канистра", -73360, -113461],
			["Канистра", -73325, -113455],
			["Канистра", -85349, -109994],
			["Канистра", -85712, -109678],
			["Канистра", -85615, -109624],
			["Канистра", -85626, -109629],
			["Канистра", -68204, -104705],
			["Канистра", -68199, -104656],
			["Канистра", -124517, -127912],
			["Канистра", -124066, -127846],
			["Канистра", -124065, -127834],
			["Канистра", -124850, -129439],
			["Канистра", -124773, -127532],
			["Канистра", -124757, -127535],
			["Канистра", -121500, -112300],
			["Канистра", -101904, -114599],
			["Канистра", -101986, -114601],
			["Канистра", -156427, -14729],
			["Канистра", -145661, -11627],
			["Канистра", -179314, -2977],
			["Канистра", -147820, -56369],
			["Канистра", -150873, -56224],
			["Канистра", -147981, -57186],
			["Канистра", -159415, -40868],
			["Канистра", -146140, -95898],
			["Канистра", -146164, -95939],
			["Канистра", -151333, -74814],
			["Канистра", -160477, -71589],
			["Канистра", -161230, -72605],
			["Канистра", -145525, -126823],
			["Канистра", -133765, -121371],
			["Канистра", -150845, -102110],
			["Канистра", -168825, -116200],
			["Канистра", -168003, -115355],
			["Канистра", -168128, -112473],
			["Канистра", 188179, -28907],
			["Канистра", 189352, -30399],
			["Канистра", 189330, -30397],
			["Канистра", 194228, -31490],
			["Канистра", 167661, -25655],
			["Канистра", 167703, -25647],
			["Канистра", 164912, -16804],
			["Канистра", 176352, -14946],
			["Канистра", 176465, -14823],
			["Канистра", 160645, -30005],
			["Канистра", 140519, -2800],
			["Канистра", 172039, -43110],
			["Канистра", 172053, -43087],
			["Канистра", 191916, -34072],
			["Канистра", 191947, -34073],
			["Канистра", 141701, -57767],
			["Канистра", 132566, -55369],
			["Канистра", 132537, -55290],
			["Канистра", 142712, -57014],
			["Канистра", 143152, -55859],
			["Канистра", 146955, -56700],
			["Канистра", 153737, -53437],
			["Канистра", 153761, -53462],
			["Канистра", 141541, -51334],
			["Канистра", 141512, -51326],
			["Канистра", 157692, -51014],
			["Канистра", 157744, -51051],
			["Канистра", 155759, -51755],
			["Канистра", 142995, -48257],
			["Канистра", 142967, -48295],
			["Канистра", 151788, -48313],
			["Канистра", 152011, -48360],
			["Канистра", 155951, -46762],
			["Канистра", 173650, -75468],
			["Канистра", 161410, -92008],
			["Канистра", 158186, -68586],
			["Канистра", 177579, -122528],
			["Канистра", 177574, -122558],
			["Канистра", 103085, -29904],
			["Канистра", 129635, -28099],
			["Канистра", 101962, -11238],
			["Канистра", 105571, -7219],
			["Канистра", 103186, -7750],
			["Канистра", 103603, -7408],
			["Канистра", 99880, -1601],
			["Канистра", 100818, -2088],
			["Канистра", 100847, -2084],
			["Канистра", 89788, -30608],
			["Канистра", 88958, -31239],
			["Канистра", 89845, -31417],
			["Канистра", 92077, -30559],
			["Канистра", 91187, -32213],
			["Канистра", 90534, -29460],
			["Канистра", 90266, -27752],
			["Канистра", 81940, -20759],
			["Канистра", 82354, -21092],
			["Канистра", 84756, -18900],
			["Канистра", 74592, -15610],
			["Канистра", 93431, -13365],
			["Канистра", 70217, -7846],
			["Канистра", 81784, -1594],
			["Канистра", 81292, -1585],
			["Канистра", 95767, -3414],
			["Канистра", 48218, -20747],
			["Канистра", 59908, -23277],
			["Канистра", 34487, -5752],
			["Канистра", 34437, -5667],
			["Канистра", 35025, -6130],
			["Канистра", 35032, -6156],
			["Канистра", 34819, -5828],
			["Канистра", 9117, -30361],
			["Канистра", 108228, -54329],
			["Канистра", 108210, -54342],
			["Канистра", 111589, -55447],
			["Канистра", 111612, -55446],
			["Канистра", 111540, -55443],
			["Канистра", 90176, -56902],
			["Канистра", 62365, -58154],
			["Канистра", 61858, -57205],
			["Канистра", 63714, -49950],
			["Канистра", 39301, -38408],
			["Канистра", 37782, -35341],
			["Канистра", 38888, -36074],
			["Канистра", 25040, -63784],
			["Канистра", 24714, -60273],
			["Канистра", 29462, -58476],
			["Канистра", 82901, -96266],
			["Канистра", 72287, -76212],
			["Канистра", 72282, -76191],
			["Канистра", 57187, -94498],
			["Канистра", 55168, -67304],
			["Канистра", 16227, -79843],
			["Канистра", 16244, -79859],
			["Канистра", 101398, -100285],
			["Канистра", 101199, -100142],
			["Канистра", 108618, -100656],
			["Канистра", 89757, -125064],
			["Канистра", 87994, -115421],
			["Канистра", 84828, -109137],
			["Канистра", 84844, -109144],
			["Канистра", 69297, -103947],
			["Канистра", 68556, -102756],
			["Канистра", 68549, -102702],
			["Канистра", 69788, -104094],
			["Канистра", 69775, -104096],
			["Канистра", 73077, -105242],
			["Канистра", 47033, -104686],
			["Канистра", 60793, -98850],
			["Канистра", 60702, -99288],
			["Канистра", 5338, -116214],
			["Канистра", 17832, -117569],
			["Канистра", 18240, -108715],
			["Канистра", 22839, -107004],
			["Канистра", 22854, -102250],
			["Канистра", -6849, -161175],
			["Канистра", -54677, -160757],
			["Канистра", -42990, -135319],
			["Канистра", -44365, -133176],
			["Канистра", -39863, -131961],
			["Канистра", -93771, -163347],
			["Канистра", -79703, -162140],
			["Канистра", -81679, -160661],
			["Канистра", -71731, -163755],
			["Канистра", -71744, -163755],
			["Канистра", -73164, -132511],
			["Канистра", -73097, -132581],
			["Канистра", -73077, -132612],
			["Канистра", -72572, -133145],
			["Канистра", -72610, -133054],
			["Канистра", -126515, -135617],
			["Канистра", -126501, -135611],
			["Канистра", -118880, -135679],
			["Канистра", -124077, -132396],
			["Канистра", -124086, -132421],
			["Канистра", -121073, -132629],
			["Канистра", -7223, -166156],
			["Канистра", -43618, -173553],
			["Канистра", -80160, -182564],
			["Канистра", -80138, -182559],
			["Канистра", -92848, -176975],
			["Канистра", -88605, -165736],
			["Канистра", -122362, -193044],
			["Канистра", -122598, -192864],
			["Канистра", -130245, -186343],
			["Канистра", -126823, -184014],
			["Канистра", -121228, -182425],
			["Канистра", -121312, -182377],
			["Канистра", -133835, -156811],
			["Канистра", -132697, -151868],
			["Канистра", -132865, -151867],
			["Канистра", -148915, -142852],
			["Канистра", 197153, -142648],
			["Канистра", 187202, -153293],
			["Канистра", 194164, -144825],
			["Канистра", 194220, -144851],
			["Канистра", 194252, -144802],
			["Канистра", 136692, -162813],
			["Канистра", 136710, -162807],
			["Канистра", 146237, -143374],
			["Канистра", 146240, -143343],
			["Канистра", 187716, -165462],
			["Канистра", 189017, -165982],
			["Канистра", 109825, -162300],
			["Канистра", 115329, -157581],
			["Канистра", 107869, -153690],
			["Канистра", 52094, -149209],
			["Канистра", 51854, -149217],
			["Канистра", 19502, -144400],
			["Канистра", 2225, -140220],
			["Канистра", 74491, -177151],
			["Канистра", 73747, -177687],
			["Канистра", -32182, 196632],
			["Канистра", -62065, 197343],
			["Канистра", -63562, 197466],
			["Канистра", -68779, 198547],
			["Канистра", -82284, 201080],
			["Канистра", -8363, 189330],
			["Канистра", -32132, 196328],
			["Канистра", -55372, 165764],
			["Канистра", -56645, 165411],
			["Канистра", -39574, 190193],
			["Канистра", -39584, 190214],
			["Канистра", -95603, 174095],
			["Канистра", -95617, 174081],
			["Канистра", -90361, 178076],
			["Канистра", -79836, 180165],
			["Канистра", -94748, 183391],
			["Канистра", -95702, 181705],
			["Канистра", -97976, 184098],
			["Канистра", -93885, 181779],
			["Канистра", -91596, 183436],
			["Канистра", -87649, 183993],
			["Канистра", -79994, 180384],
			["Канистра", -95293, 190165],
			["Канистра", -94932, 190276],
			["Канистра", -65565, 196501],
			["Канистра", -65743, 196248],
			["Канистра", -99021, 183448],
			["Канистра", -98467, 189179],
			["Канистра", -19536, 145191],
			["Канистра", -19560, 145189],
			["Канистра", -27450, 162263],
			["Канистра", -4301, 161677],
			["Канистра", -63990, 131094],
			["Канистра", -65326, 131718],
			["Канистра", -65307, 131719],
			["Канистра", -59080, 141895],
			["Канистра", -59083, 141884],
			["Канистра", -40766, 161289],
			["Канистра", -39229, 160067],
			["Канистра", -119370, 131885],
			["Канистра", -109668, 157631],
			["Канистра", -109322, 158583],
			["Канистра", -160276, 200982],
			["Канистра", -160330, 200816],
			["Канистра", -160674, 202477],
			["Канистра", -161646, 200846],
			["Канистра", -161659, 200850],
			["Канистра", -154581, 165613],
			["Канистра", -145514, 173453],
			["Канистра", -144448, 172851],
			["Канистра", -145509, 173439],
			["Канистра", -146401, 179416],
			["Канистра", -144598, 178738],
			["Канистра", -143115, 177853],
			["Канистра", -140975, 143801],
			["Канистра", -140980, 143829],
			["Канистра", -138791, 152481],
			["Канистра", -163031, 157134],
			["Канистра", 179324, 134291],
			["Канистра", 152850, 161854],
			["Канистра", 101775, 196652],
			["Канистра", 69115, 202349],
			["Канистра", 16260, 197941],
			["Канистра", 15833, 197269],
			["Канистра", 15843, 197256],
			["Канистра", 81970, 184268],
			["Канистра", 92752, 191800],
			["Канистра", 62141, 172928],
			["Канистра", 61502, 174104],
			["Канистра", 2345, 179053],
			["Канистра", 2906, 182099],
			["Канистра", 11104, 183969],
			["Канистра", 15994, 189724],
			["Канистра", 14191, 196402],
			["Канистра", 70164, 135921],
			["Канистра", 78134, 138312],
			["Канистра", 74709, 150664],
			["Канистра", 221, 139661],
			["Канистра", 212, 139666],
			["Канистра", 202, 139670],
			["Канистра", 3821, 160514],
			["Канистра", -25863, 99067],
			["Канистра", -25843, 99099],
			["Канистра", -25883, 99103],
			["Канистра", -59808, 116994],
			["Канистра", -80843, 103238],
			["Канистра", -86807, 115467],
			["Канистра", -86792, 115451],
			["Канистра", -87643, 116049],
			["Канистра", -87674, 116063],
			["Канистра", -129095, 119952],
			["Канистра", -128455, 120674],
			["Канистра", -128619, 119286],
			["Канистра", -105554, 123459],
			["Канистра", -105559, 123410],
			["Канистра", -60593, 85565],
			["Канистра", -38846, 83746],
			["Канистра", -37501, 83613],
			["Канистра", -38194, 84846],
			["Канистра", -41043, 88332],
			["Канистра", -41627, 88341],
			["Канистра", -58501, 90234],
			["Канистра", -87760, 67661],
			["Канистра", -78957, 89280],
			["Канистра", -80156, 88728],
			["Канистра", -80167, 88612],
			["Канистра", -5278, 33843],
			["Канистра", -5282, 33874],
			["Канистра", -47533, 33120],
			["Канистра", -47564, 33125],
			["Канистра", -52785, 55337],
			["Канистра", -68507, 55876],
			["Канистра", -93410, 62104],
			["Канистра", -93393, 62094],
			["Канистра", -102634, 38680],
			["Канистра", -123429, 51002],
			["Канистра", -123333, 51418],
			["Канистра", -24817, 10744],
			["Канистра", -47317, 767],
			["Канистра", -51767, 13188],
			["Канистра", -47971, 15376],
			["Канистра", -34376, 13604],
			["Канистра", -34348, 13597],
			["Канистра", -56639, 17751],
			["Канистра", -49384, 27967],
			["Канистра", -49719, 27380],
			["Канистра", -49393, 26775],
			["Канистра", -45448, 27215],
			["Канистра", -47712, 26690],
			["Канистра", -46240, 26697],
			["Канистра", -44649, 28228],
			["Канистра", -40180, 27922],
			["Канистра", -46975, 28956],
			["Канистра", -71148, 24760],
			["Канистра", -71117, 24753],
			["Канистра", -118699, 730],
			["Канистра", -119793, 5427],
			["Канистра", -148445, 113735],
			["Канистра", -148758, 113691],
			["Канистра", -148745, 113526],
			["Канистра", -148764, 113157],
			["Канистра", -173403, 109431],
			["Канистра", 181716, 109939],
			["Канистра", 183900, 112084],
			["Канистра", 182146, 110751],
			["Канистра", 144597, 106326],
			["Канистра", 144555, 106141],
			["Канистра", 134709, 116694],
			["Канистра", 160479, 115986],
			["Канистра", 160529, 116016],
			["Канистра", 134853, 127421],
			["Канистра", 200917, 93822],
			["Канистра", 139128, 73414],
			["Канистра", 140007, 73313],
			["Канистра", 199707, 46108],
			["Канистра", 153376, 55696],
			["Канистра", 170897, 1533],
			["Канистра", 183618, 2948],
			["Канистра", 183016, 2707],
			["Канистра", 190260, 31288],
			["Канистра", 190266, 31275],
			["Канистра", 132004, 11992],
			["Канистра", 87605, 104861],
			["Канистра", 87597, 104877],
			["Канистра", 87594, 104898],
			["Канистра", 87633, 105420],
			["Канистра", 87870, 105759],
			["Канистра", 87583, 104972],
			["Канистра", 87647, 105046],
			["Канистра", 97116, 104431],
			["Канистра", 97111, 104419],
			["Канистра", 93948, 106955],
			["Канистра", 43098, 110144],
			["Канистра", 39454, 115516],
			["Канистра", 39392, 115762],
			["Канистра", 39300, 115719],
			["Канистра", 39279, 115708],
			["Канистра", 39637, 115864],
			["Канистра", 200, 128470],
			["Канистра", 157, 128453],
			["Канистра", 73235, 80609],
			["Канистра", 42726, 77046],
			["Канистра", 25288, 71014],
			["Канистра", 26051, 70742],
			["Канистра", 19713, 90309],
			["Канистра", 19730, 90256],
			["Канистра", 104251, 43669],
			["Канистра", 105298, 52458],
			["Канистра", 105309, 52879],
			["Канистра", 110798, 58405],
			["Канистра", 110831, 58389],
			["Канистра", 110762, 58378],
			["Канистра", 111676, 58157],
			["Канистра", 128781, 59924],
			["Канистра", 129054, 59920],
			["Канистра", 107242, 61504],
			["Канистра", 114566, 63425],
			["Канистра", 76549, 43279],
			["Канистра", 74421, 42886],
			["Канистра", 80668, 53587],
			["Канистра", 78870, 53658],
			["Канистра", 78889, 53698],
			["Канистра", 80069, 55583],
			["Канистра", 84930, 58661],
			["Канистра", 85911, 62417],
			["Канистра", 85959, 62439],
			["Канистра", 36226, 39224],
			["Канистра", 60916, 57456],
			["Канистра", 7482, 44455],
			["Канистра", 6116, 42135],
			["Канистра", 14669, 44488],
			["Канистра", 103590, 4097],
			["Канистра", 100714, 27251],
			["Канистра", 84444, 765],
			["Канистра", 91429, 31689],
			["Канистра", 56851, 12084],
			["Канистра", 56884, 12085],
			["Канистра", 55355, 8440],
			["Канистра", 55556, 10201],
			["Канистра", -126497, -111233],
			["Канистра", -126529, -111248]
			];
	for (var i = 0; i < hlam168.length; i++) {
				hlam_168 = new L.circleMarker([hlam168[i][1],hlam168[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam168[i][0])
					.bindTooltip(hlam168[i][0], {direction: 'top'})
					.addTo(hlam168icons);
			}
	}
	else {
		hlam168icons.clearLayers();
	}
}
var hlam169icons = L.layerGroup().addTo(map);
function Hlam169OnOff() {
	var chbox169;
	chbox169=document.getElementById('Hlam169Button');
	if (chbox169.checked) {
		var hlam169 = [
			["Канистра с ацетоном", -44698, -15806],
			["Канистра с ацетоном", -44688, -15786],
			["Канистра с ацетоном", -47161, -6316],
			["Канистра с ацетоном", -39152, -59003],
			["Канистра с ацетоном", -37343, -59265],
			["Канистра с ацетоном", -46364, -50539],
			["Канистра с ацетоном", -55498, -48695],
			["Канистра с ацетоном", -129747, -91970],
			["Канистра с ацетоном", -10465, -123874],
			["Канистра с ацетоном", -168998, -23242],
			["Канистра с ацетоном", -147833, -56269],
			["Канистра с ацетоном", -132396, -112421],
			["Канистра с ацетоном", 130060, -27293],
			["Канистра с ацетоном", 103106, -11360],
			["Канистра с ацетоном", 89700, -29933],
			["Канистра с ацетоном", 92301, -29762],
			["Канистра с ацетоном", 48410, -22263],
			["Канистра с ацетоном", 9001, -30311],
			["Канистра с ацетоном", 8491, -84780],
			["Канистра с ацетоном", 60770, -98977],
			["Канистра с ацетоном", 9864, -107346],
			["Канистра с ацетоном", 9885, -107337],
			["Канистра с ацетоном", 22397, -108372],
			["Канистра с ацетоном", -86314, -165669],
			["Канистра с ацетоном", 164790, -148852],
			["Канистра с ацетоном", 27760, -137706],
			["Канистра с ацетоном", -17575, 164103],
			["Канистра с ацетоном", -17522, 164302],
			["Канистра с ацетоном", -83619, 165775],
			["Канистра с ацетоном", -98981, 183467],
			["Канистра с ацетоном", -4619, 163124],
			["Канистра с ацетоном", -41121, 161270],
			["Канистра с ацетоном", -144477, 173026],
			["Канистра с ацетоном", 146555, 136575],
			["Канистра с ацетоном", 152608, 140049],
			["Канистра с ацетоном", 153043, 141617],
			["Канистра с ацетоном", 152274, 140681],
			["Канистра с ацетоном", 79932, 184505],
			["Канистра с ацетоном", 2338, 179031],
			["Канистра с ацетоном", 84955, 151272],
			["Канистра с ацетоном", 19242, 134182],
			["Канистра с ацетоном", -59906, 116980],
			["Канистра с ацетоном", -14690, 80968],
			["Канистра с ацетоном", -47125, 3379],
			["Канистра с ацетоном", -46502, 1330],
			["Канистра с ацетоном", -56156, 10570],
			["Канистра с ацетоном", 93281, 103198],
			["Канистра с ацетоном", 93309, 103279],
			["Канистра с ацетоном", 93480, 103045],
			["Канистра с ацетоном", 93286, 102936],
			["Канистра с ацетоном", 93114, 102988],
			["Канистра с ацетоном", 93210, 103654],
			["Канистра с ацетоном", 25051, 121362],
			["Канистра с ацетоном", 26221, 121617],
			["Канистра с ацетоном", 31647, 122876],
			["Канистра с ацетоном", 31515, 130082],
			["Канистра с ацетоном", 114771, 64589]
			];
	for (var i = 0; i < hlam169.length; i++) {
				hlam_169 = new L.circleMarker([hlam169[i][1],hlam169[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam169[i][0])
					.bindTooltip(hlam169[i][0], {direction: 'top'})
					.addTo(hlam169icons);
			}
	}
	else {
		hlam169icons.clearLayers();
	}
}
var hlam170icons = L.layerGroup().addTo(map);
function Hlam170OnOff() {
	var chbox170;
	chbox170=document.getElementById('Hlam170Button');
	if (chbox170.checked) {
		var hlam170 = [
			["Карандаш", -57259, -6327],
			["Карандаш", -57261, -6336],
			["Карандаш", -57258, -6332],
			["Карандаш", -57249, -6342],
			["Карандаш", -57261, -6337],
			["Карандаш", -57258, -6332],
			["Карандаш", -57258, -6330],
			["Карандаш", -57261, -6334],
			["Карандаш", -44346, -7946],
			["Карандаш", -42651, -5757],
			["Карандаш", -77754, -21585],
			["Карандаш", -72470, -7281],
			["Карандаш", -72480, -7277],
			["Карандаш", -68922, -2423],
			["Карандаш", -67554, -1357],
			["Карандаш", -67559, -1360],
			["Карандаш", -10644, -50209],
			["Карандаш", -21323, -44509],
			["Карандаш", -96060, -60140],
			["Карандаш", -117290, -62980],
			["Карандаш", -112654, -58888],
			["Карандаш", -112477, -59179],
			["Карандаш", -56294, -78583],
			["Карандаш", -120190, -73736],
			["Карандаш", -14363, -125224],
			["Карандаш", -43286, -127617],
			["Карандаш", -72267, -98518],
			["Карандаш", -122564, -125292],
			["Карандаш", -104881, -121695],
			["Карандаш", -105239, -119314],
			["Карандаш", -149509, -58202],
			["Карандаш", -148227, -59090],
			["Карандаш", -147700, -57019],
			["Карандаш", -148156, -55480],
			["Карандаш", -131612, -95678],
			["Карандаш", -151986, -74513],
			["Карандаш", -151072, -74892],
			["Карандаш", -161916, -73492],
			["Карандаш", -152027, -72206],
			["Карандаш", -152162, -71911],
			["Карандаш", -146927, -70758],
			["Карандаш", 167284, -24316],
			["Карандаш", 182371, -13623],
			["Карандаш", 149847, -52309],
			["Карандаш", 147772, -48915],
			["Карандаш", 183355, -65839],
			["Карандаш", 183354, -66004],
			["Карандаш", 183353, -65999],
			["Карандаш", 183359, -66004],
			["Карандаш", 183358, -65957],
			["Карандаш", 183352, -65962],
			["Карандаш", 183357, -65969],
			["Карандаш", 152908, -103882],
			["Карандаш", 101746, -13790],
			["Карандаш", 84556, -18773],
			["Карандаш", 77788, -15184],
			["Карандаш", 77489, -15486],
			["Карандаш", 77479, -15498],
			["Карандаш", 77515, -15309],
			["Карандаш", 92293, -9770],
			["Карандаш", 90362, -9909],
			["Карандаш", 96002, -11779],
			["Карандаш", 73387, -7246],
			["Карандаш", 73471, -7250],
			["Карандаш", 89393, -5819],
			["Карандаш", 89343, -5753],
			["Карандаш", 81449, -1120],
			["Карандаш", 78945, -1828],
			["Карандаш", 84703, -1951],
			["Карандаш", 28226, -31584],
			["Карандаш", 28217, -31591],
			["Карандаш", 28402, -31055],
			["Карандаш", 28490, -31043],
			["Карандаш", 28756, -31340],
			["Карандаш", 28746, -31298],
			["Карандаш", 29435, -21277],
			["Карандаш", 29698, -21239],
			["Карандаш", 108006, -54331],
			["Карандаш", 111556, -55280],
			["Карандаш", 34463, -36922],
			["Карандаш", 34466, -36950],
			["Карандаш", 51831, -40501],
			["Карандаш", 35478, -35285],
			["Карандаш", 13046, -60167],
			["Карандаш", 29498, -58315],
			["Карандаш", 29558, -58613],
			["Карандаш", 32199, -40234],
			["Карандаш", 31245, -33249],
			["Карандаш", 31257, -33407],
			["Карандаш", 30867, -33366],
			["Карандаш", 30841, -33448],
			["Карандаш", 79453, -81823],
			["Карандаш", 56007, -66070],
			["Карандаш", 13374, -92127],
			["Карандаш", 12589, -91621],
			["Карандаш", 47314, -104456],
			["Карандаш", 21730, -113235],
			["Карандаш", 21414, -113638],
			["Карандаш", 21424, -113635],
			["Карандаш", 21619, -113310],
			["Карандаш", 13426, -106937],
			["Карандаш", 14159, -107621],
			["Карандаш", 18140, -106813],
			["Карандаш", 21833, -105142],
			["Карандаш", 22192, -105406],
			["Карандаш", 29199, -100581],
			["Карандаш", 29277, -100660],
			["Карандаш", 29224, -100595],
			["Карандаш", -4210, -155917],
			["Карандаш", -61330, -145553],
			["Карандаш", -126581, -144629],
			["Карандаш", -24123, -179945],
			["Карандаш", -42966, -173495],
			["Карандаш", -54159, -168211],
			["Карандаш", -79994, -182390],
			["Карандаш", -79204, -181107],
			["Карандаш", -87717, -165965],
			["Карандаш", -120891, -186504],
			["Карандаш", -134299, -154353],
			["Карандаш", -133373, -153355],
			["Карандаш", -132101, -148793],
			["Карандаш", -145910, -143142],
			["Карандаш", 143388, -148967],
			["Карандаш", 189436, -168981],
			["Карандаш", 189048, -164727],
			["Карандаш", 102716, -151436],
			["Карандаш", 25905, -137519],
			["Карандаш", 74237, -177007],
			["Карандаш", 74290, -172821],
			["Карандаш", 74457, -173331],
			["Карандаш", -94745, 183258],
			["Карандаш", -94463, 183316],
			["Карандаш", -94747, 183260],
			["Карандаш", -93434, 183690],
			["Карандаш", -93193, 183850],
			["Карандаш", -92581, 183812],
			["Карандаш", -93351, 183826],
			["Карандаш", -93610, 183801],
			["Карандаш", -93092, 183752],
			["Карандаш", -95003, 190434],
			["Карандаш", -94995, 190427],
			["Карандаш", -10084, 132116],
			["Карандаш", -918, 158705],
			["Карандаш", -3939, 161523],
			["Карандаш", -4033, 161548],
			["Карандаш", -4052, 161659],
			["Карандаш", -4059, 161618],
			["Карандаш", -4049, 161534],
			["Карандаш", -4075, 161562],
			["Карандаш", -63741, 131367],
			["Карандаш", -133328, 164180],
			["Карандаш", -145018, 178023],
			["Карандаш", -143739, 178794],
			["Карандаш", 69698, 202282],
			["Карандаш", 16346, 197836],
			["Карандаш", 1371, 164479],
			["Карандаш", 1790, 164660],
			["Карандаш", 1952, 164376],
			["Карандаш", 6317, 164456],
			["Карандаш", 1084, 189971],
			["Карандаш", 15245, 191330],
			["Карандаш", 15244, 191313],
			["Карандаш", 15272, 191166],
			["Карандаш", 15252, 191206],
			["Карандаш", 15180, 191276],
			["Карандаш", 14746, 191226],
			["Карандаш", 72269, 133731],
			["Карандаш", 72805, 136602],
			["Карандаш", 26303, 131367],
			["Карандаш", 2830, 162904],
			["Карандаш", 2814, 163221],
			["Карандаш", 2953, 163528],
			["Карандаш", 2380, 162227],
			["Карандаш", 3608, 160795],
			["Карандаш", 3615, 160789],
			["Карандаш", 3696, 160343],
			["Карандаш", 4096, 160533],
			["Карандаш", -14670, 120438],
			["Карандаш", -14629, 120188],
			["Карандаш", -13929, 119450],
			["Карандаш", -129280, 119091],
			["Карандаш", -129250, 119290],
			["Карандаш", -32216, 92056],
			["Карандаш", -115239, 84631],
			["Карандаш", -17878, 59768],
			["Карандаш", -47402, 50940],
			["Карандаш", -68934, 56155],
			["Карандаш", -87885, 63812],
			["Карандаш", -104518, 38813],
			["Карандаш", -117627, 54619],
			["Карандаш", -29776, 17051],
			["Карандаш", -33962, 201],
			["Карандаш", -39779, 5489],
			["Карандаш", -46847, 13253],
			["Карандаш", -44209, 28116],
			["Карандаш", -99048, 7260],
			["Карандаш", -99522, 8187],
			["Карандаш", -99261, 8158],
			["Карандаш", -130812, 10522],
			["Карандаш", -145984, 65993],
			["Карандаш", -139431, 90995],
			["Карандаш", -139393, 90978],
			["Карандаш", -161274, 31359],
			["Карандаш", -161302, 31303],
			["Карандаш", 170812, 56811],
			["Карандаш", 171108, 56773],
			["Карандаш", 171194, 56519],
			["Карандаш", 171167, 56621],
			["Карандаш", 162675, 55653],
			["Карандаш", 160398, 58759],
			["Карандаш", 190228, 32242],
			["Карандаш", 139536, 8486],
			["Карандаш", 121786, 118228],
			["Карандаш", 104464, 42033],
			["Карандаш", 73921, 38263],
			["Карандаш", 88596, 53095],
			["Карандаш", 58258, 53095],
			["Карандаш", 59041, 55256],
			["Карандаш", 23873, 43574],
			["Карандаш", 23825, 43600],
			["Карандаш", 23892, 43607],
			["Карандаш", 23841, 43641],
			["Карандаш", 16973, 45565],
			["Карандаш", 16761, 49931],
			["Карандаш", 104157, 6864],
			["Карандаш", 88782, 2856],
			["Карандаш", 58425, 10510],
			["Карандаш", -110427, -95480],
			["Карандаш", -59242, 123216]
			];
	for (var i = 0; i < hlam170.length; i++) {
				hlam_170 = new L.circleMarker([hlam170[i][1],hlam170[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam170[i][0])
					.bindTooltip(hlam170[i][0], {direction: 'top'})
					.addTo(hlam170icons);
			}
	}
	else {
		hlam170icons.clearLayers();
	}
}
var hlam171icons = L.layerGroup().addTo(map);
function Hlam171OnOff() {
	var chbox171;
	chbox171=document.getElementById('Hlam171Button');
	if (chbox171.checked) {
		var hlam171 = [
			["Кастрюля", -40451, -55061],
			["Кастрюля", -47197, -50926],
			["Кастрюля", -111363, -61268],
			["Кастрюля", -47148, -69990],
			["Кастрюля", -6723, -117684],
			["Кастрюля", -56434, -108764],
			["Кастрюля", -70445, -104641],
			["Кастрюля", -112410, -122742],
			["Кастрюля", -125010, -116176],
			["Кастрюля", -114913, -99251],
			["Кастрюля", -148252, -57106],
			["Кастрюля", -151004, -74943],
			["Кастрюля", 138836, -53788],
			["Кастрюля", 183677, -93095],
			["Кастрюля", 182157, -92183],
			["Кастрюля", 101695, -29144],
			["Кастрюля", 103632, -21253],
			["Кастрюля", 89988, -29848],
			["Кастрюля", 92571, -28996],
			["Кастрюля", 91157, -30389],
			["Кастрюля", 89061, -21063],
			["Кастрюля", 70456, -9878],
			["Кастрюля", 34297, -36317],
			["Кастрюля", 24888, -59580],
			["Кастрюля", 60794, -96580],
			["Кастрюля", 15888, -79774],
			["Кастрюля", 17069, -107021],
			["Кастрюля", 18112, -106529],
			["Кастрюля", 17094, -106958],
			["Кастрюля", -120833, -189625],
			["Кастрюля", -115096, -171379],
			["Кастрюля", -113492, -169331],
			["Кастрюля", -132085, -149662],
			["Кастрюля", -147202, -143238],
			["Кастрюля", 51521, -149715],
			["Кастрюля", -67619, 201581],
			["Кастрюля", -61267, 180748],
			["Кастрюля", -60968, 180643],
			["Кастрюля", -60978, 181291],
			["Кастрюля", -60967, 181532],
			["Кастрюля", -61279, 181128],
			["Кастрюля", -83614, 165895],
			["Кастрюля", -91599, 183421],
			["Кастрюля", -442, 139156],
			["Кастрюля", -6289, 146204],
			["Кастрюля", -140913, 178903],
			["Кастрюля", -138346, 152844],
			["Кастрюля", 152185, 138763],
			["Кастрюля", 151599, 138776],
			["Кастрюля", 151609, 138506],
			["Кастрюля", 152286, 138875],
			["Кастрюля", 152045, 161259],
			["Кастрюля", 80610, 184012],
			["Кастрюля", 48491, 190521],
			["Кастрюля", 15003, 188350],
			["Кастрюля", 107062, 162134],
			["Кастрюля", 71815, 137234],
			["Кастрюля", 73008, 136779],
			["Кастрюля", 636, 136872],
			["Кастрюля", 676, 139319],
			["Кастрюля", 7105, 162254],
			["Кастрюля", -59806, 117530],
			["Кастрюля", -59968, 117075],
			["Кастрюля", -103814, 109510],
			["Кастрюля", -129222, 119539],
			["Кастрюля", -81082, 89565],
			["Кастрюля", -47564, 20432],
			["Кастрюля", -53593, 21096],
			["Кастрюля", -45565, 20686],
			["Кастрюля", -47139, 28103],
			["Кастрюля", -45270, 28827],
			["Кастрюля", -172813, 110005],
			["Кастрюля", 193013, 113307],
			["Кастрюля", 171230, 57192],
			["Кастрюля", 169085, 56806],
			["Кастрюля", 169242, 56152],
			["Кастрюля", 191358, 60545],
			["Кастрюля", 183717, 2278],
			["Кастрюля", 130231, 112433],
			["Кастрюля", 27565, 122557],
			["Кастрюля", 73274, 41737],
			["Кастрюля", 9047, 50062],
			["Кастрюля", 58785, 11303],
			["Кастрюля", 57984, 10279],
			["Кастрюля", 152426, 138869]
			];
	for (var i = 0; i < hlam171.length; i++) {
				hlam_171 = new L.circleMarker([hlam171[i][1],hlam171[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam171[i][0])
					.bindTooltip(hlam171[i][0], {direction: 'top'})
					.addTo(hlam171icons);
			}
	}
	else {
		hlam171icons.clearLayers();
	}
}
var hlam172icons = L.layerGroup().addTo(map);
function Hlam172OnOff() {
	var chbox172;
	chbox172=document.getElementById('Hlam172Button');
	if (chbox172.checked) {
		var hlam172 = [
			["Кастрюля", -24762, -59591],
			["Кастрюля", -7109, -48665],
			["Кастрюля", -20571, -44122],
			["Кастрюля", -42787, -64697],
			["Кастрюля", -39066, -59205],
			["Кастрюля", -39735, -60466],
			["Кастрюля", -38136, -59141],
			["Кастрюля", -38865, -58873],
			["Кастрюля", -39311, -57849],
			["Кастрюля", -45522, -70326],
			["Кастрюля", -84676, -80432],
			["Кастрюля", -84684, -80479],
			["Кастрюля", -48957, -128787],
			["Кастрюля", -61508, -100169],
			["Кастрюля", -75813, -114783],
			["Кастрюля", -102118, -129658],
			["Кастрюля", -178862, -2923],
			["Кастрюля", -148157, -57176],
			["Кастрюля", -151001, -74616],
			["Кастрюля", 167888, -17807],
			["Кастрюля", 173867, -13701],
			["Кастрюля", 184010, -66],
			["Кастрюля", 148925, -52417],
			["Кастрюля", 149540, -52006],
			["Кастрюля", 183632, -93147],
			["Кастрюля", 147584, -78057],
			["Кастрюля", 179788, -125469],
			["Кастрюля", 181059, -123158],
			["Кастрюля", 160371, -128956],
			["Кастрюля", 152997, -104480],
			["Кастрюля", 128702, -31888],
			["Кастрюля", 93372, -12955],
			["Кастрюля", 48842, -21450],
			["Кастрюля", 48874, -22107],
			["Кастрюля", 53440, -3060],
			["Кастрюля", 29821, -20662],
			["Кастрюля", 30822, -20298],
			["Кастрюля", 29411, -18511],
			["Кастрюля", 113630, -55967],
			["Кастрюля", 33938, -32802],
			["Кастрюля", 55547, -65900],
			["Кастрюля", 88512, -119562],
			["Кастрюля", -126587, -144592],
			["Кастрюля", -126457, -135437],
			["Кастрюля", -99441, -132058],
			["Кастрюля", -23189, -175982],
			["Кастрюля", -6772, -171762],
			["Кастрюля", -53601, -175001],
			["Кастрюля", -38406, -174213],
			["Кастрюля", -76560, -184203],
			["Кастрюля", -92790, -176857],
			["Кастрюля", -121013, -189351],
			["Кастрюля", -138033, -152414],
			["Кастрюля", -139221, -144010],
			["Кастрюля", 140690, -147076],
			["Кастрюля", 65319, -182442],
			["Кастрюля", -5736, 182968],
			["Кастрюля", -8313, 189332],
			["Кастрюля", -55977, 166257],
			["Кастрюля", -61275, 181282],
			["Кастрюля", -61288, 181379],
			["Кастрюля", -69243, 170962],
			["Кастрюля", -95098, 181014],
			["Кастрюля", -27500, 162104],
			["Кастрюля", -27330, 162901],
			["Кастрюля", -145508, 173556],
			["Кастрюля", 179283, 134121],
			["Кастрюля", 152935, 161663],
			["Кастрюля", 60305, 173259],
			["Кастрюля", 2444, 166309],
			["Кастрюля", 15967, 189941],
			["Кастрюля", 2110, 137654],
			["Кастрюля", 7140, 161461],
			["Кастрюля", -65589, 129516],
			["Кастрюля", -56879, 89741],
			["Кастрюля", -17889, 60186],
			["Кастрюля", -18084, 60205],
			["Кастрюля", -17643, 60288],
			["Кастрюля", -92534, 65066],
			["Кастрюля", -21458, 11164],
			["Кастрюля", -46919, 18495],
			["Кастрюля", -127940, 30776],
			["Кастрюля", -138424, 89107],
			["Кастрюля", -138976, 90671],
			["Кастрюля", 135223, 115400],
			["Кастрюля", 134819, 127561],
			["Кастрюля", 199539, 46140],
			["Кастрюля", 191370, 60576],
			["Кастрюля", 131643, 12141],
			["Кастрюля", 113452, 114180],
			["Кастрюля", 95291, 103778],
			["Кастрюля", 91648, 114973],
			["Кастрюля", 39488, 115309],
			["Кастрюля", 39245, 115419],
			["Кастрюля", 39610, 115845],
			["Кастрюля", 42575, 76617],
			["Кастрюля", 72462, 37793],
			["Кастрюля", 59144, 54934],
			["Кастрюля", 7617, 44368],
			["Кастрюля", 7637, 44146],
			["Кастрюля", 14519, 48691],
			["Кастрюля", 27098, 50099],
			["Кастрюля", 29147, 53929],
			["Кастрюля", 100701, 25621],
			["Кастрюля", 67077, 19483],
			["Кастрюля", 52318, 3704],
			["Кастрюля", 57443, 31],
			["Кастрюля", 55497, 10241],
			["Кастрюля", 55914, 12723]
			];
	for (var i = 0; i < hlam172.length; i++) {
				hlam_172 = new L.circleMarker([hlam172[i][1],hlam172[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam172[i][0])
					.bindTooltip(hlam172[i][0], {direction: 'top'})
					.addTo(hlam172icons);
			}
	}
	else {
		hlam172icons.clearLayers();
	}
}
var hlam173icons = L.layerGroup().addTo(map);
function Hlam173OnOff() {
	var chbox173;
	chbox173=document.getElementById('Hlam173Button');
	if (chbox173.checked) {
		var hlam173 = [
			["Катушка стекловолокна", -29362, -49356],
			["Катушка стекловолокна", -46704, -50898],
			["Катушка стекловолокна", -60983, -83484],
			["Катушка стекловолокна", 183022, -93337],
			["Катушка стекловолокна", 69152, -15820],
			["Катушка стекловолокна", 115171, -157914],
			["Катушка стекловолокна", -19962, 145761],
			["Катушка стекловолокна", -40940, 161312],
			["Катушка стекловолокна", -121326, 143237],
			["Катушка стекловолокна", -152561, 1137]
			];
	for (var i = 0; i < hlam173.length; i++) {
				hlam_173 = new L.circleMarker([hlam173[i][1],hlam173[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam173[i][0])
					.bindTooltip(hlam173[i][0], {direction: 'top'})
					.addTo(hlam173icons);
			}
	}
	else {
		hlam173icons.clearLayers();
	}
}
var hlam174icons = L.layerGroup().addTo(map);
function Hlam174OnOff() {
	var chbox174;
	chbox174=document.getElementById('Hlam174Button');
	if (chbox174.checked) {
		var hlam174 = [
			["Квантовый мишка", -24669, -3048],
			["Квантовый мишка", -119866, -14171],
			["Квантовый мишка", -49636, -55525],
			["Квантовый мишка", -41360, -37602],
			["Квантовый мишка", 190924, -31855],
			["Квантовый мишка", 147338, -53508],
			["Квантовый мишка", 150210, -46059],
			["Квантовый мишка", 149442, -44080],
			["Квантовый мишка", 90938, -23698],
			["Квантовый мишка", 85030, -335],
			["Квантовый мишка", 21806, -81442],
			["Квантовый мишка", -126632, -135532],
			["Квантовый мишка", -22952, -173201],
			["Квантовый мишка", -75331, -183003],
			["Квантовый мишка", -74910, -179079],
			["Квантовый мишка", -74908, -178942],
			["Квантовый мишка", 138482, -148958],
			["Квантовый мишка", 146252, -149362],
			["Квантовый мишка", 146053, -149522],
			["Квантовый мишка", -4783, 191286],
			["Квантовый мишка", -139624, 140916],
			["Квантовый мишка", 87747, 157112],
			["Квантовый мишка", -36786, 121119],
			["Квантовый мишка", 189436, 84218],
			["Квантовый мишка", 202582, 54612],
			["Квантовый мишка", 202597, 54631],
			["Квантовый мишка", 202573, 54582],
			["Квантовый мишка", 202586, 54560],
			["Квантовый мишка", 196098, 65025],
			["Квантовый мишка", 115293, 111346],
			["Квантовый мишка", 42755, 109523],
			["Квантовый мишка", 130556, 86184],
			["Квантовый мишка", 64914, 76982],
			["Квантовый мишка", 23052, 43284],
			["Квантовый мишка", 16426, 45858],
			["Квантовый мишка", 183600, -92876],
			["Квантовый мишка", -54643, -131830]
			];
	for (var i = 0; i < hlam174.length; i++) {
				hlam_174 = new L.circleMarker([hlam174[i][1],hlam174[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam174[i][0])
					.bindTooltip(hlam174[i][0], {direction: 'top'})
					.addTo(hlam174icons);
			}
	}
	else {
		hlam174icons.clearLayers();
	}
}
var hlam175icons = L.layerGroup().addTo(map);
function Hlam175OnOff() {
	var chbox175;
	chbox175=document.getElementById('Hlam175Button');
	if (chbox175.checked) {
		var hlam175 = [
			["Кегля для боулинга", -107651, -56092],
			["Кегля для боулинга", 193084, -30851],
			["Кегля для боулинга", 193089, -30833],
			["Кегля для боулинга", 193060, -30805],
			["Кегля для боулинга", 193025, -30777],
			["Кегля для боулинга", -124163, -131247],
			["Кегля для боулинга", 142813, -150221],
			["Кегля для боулинга", 142844, -150196],
			["Кегля для боулинга", 142861, -150203],
			["Кегля для боулинга", 142841, -150132],
			["Кегля для боулинга", -27138, 162156],
			["Кегля для боулинга", -27109, 162168],
			["Кегля для боулинга", -27150, 162180],
			["Кегля для боулинга", -27159, 162156],
			["Кегля для боулинга", 54137, 188501],
			["Кегля для боулинга", -78212, 88645],
			["Кегля для боулинга", -78210, 88641],
			["Кегля для боулинга", -78210, 88630],
			["Кегля для боулинга", -101740, 86225],
			["Кегля для боулинга", -101706, 86223],
			["Кегля для боулинга", -101689, 86240],
			["Кегля для боулинга", 157709, 67819],
			["Кегля для боулинга", 93195, 103617],
			["Кегля для боулинга", 95481, 105802],
			["Кегля для боулинга", 106755, 51844],
			["Кегля для боулинга", 113811, 61672],
			["Кегля для боулинга", 113785, 61698]
			];
	for (var i = 0; i < hlam175.length; i++) {
				hlam_175 = new L.circleMarker([hlam175[i][1],hlam175[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam175[i][0])
					.bindTooltip(hlam175[i][0], {direction: 'top'})
					.addTo(hlam175icons);
			}
	}
	else {
		hlam175icons.clearLayers();
	}
}
var hlam176icons = L.layerGroup().addTo(map);
function Hlam176OnOff() {
	var chbox176;
	chbox176=document.getElementById('Hlam176Button');
	if (chbox176.checked) {
		var hlam176 = [
			["Кегля для боулинга", 89567, -56555],
			["Кегля для боулинга", -27126, 162187],
			["Кегля для боулинга", -27136, 162200],
			["Кегля для боулинга", -101691, 86275],
			["Кегля для боулинга", -101724, 86242],
			["Кегля для боулинга", -101707, 86259],
			["Кегля для боулинга", -101689, 86256],
			["Кегля для боулинга", -101721, 86225],
			["Кегля для боулинга", -101706, 86240],
			["Кегля для боулинга", -101689, 86223],
			["Кегля для боулинга", 157723, 67807],
			["Кегля для боулинга", 93106, 103055],
			["Кегля для боулинга", 93245, 103906]
			];
	for (var i = 0; i < hlam176.length; i++) {
				hlam_176 = new L.circleMarker([hlam176[i][1],hlam176[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam176[i][0])
					.bindTooltip(hlam176[i][0], {direction: 'top'})
					.addTo(hlam176icons);
			}
	}
	else {
		hlam176icons.clearLayers();
	}
}
var hlam177icons = L.layerGroup().addTo(map);
function Hlam177OnOff() {
	var chbox177;
	chbox177=document.getElementById('Hlam177Button');
	if (chbox177.checked) {
		var hlam177 = [
			["Керамическая миска", -101231, -54987],
			["Керамическая миска", -150997, -75555],
			["Керамическая миска", -150981, -75568],
			["Керамическая миска", -150891, -72887],
			["Керамическая миска", 173687, -14467],
			["Керамическая миска", 173648, -14478],
			["Керамическая миска", 173374, -13424],
			["Керамическая миска", 173526, -13366],
			["Керамическая миска", 173708, -13477]
			];
	for (var i = 0; i < hlam177.length; i++) {
				hlam_177 = new L.circleMarker([hlam177[i][1],hlam177[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam177[i][0])
					.bindTooltip(hlam177[i][0], {direction: 'top'})
					.addTo(hlam177icons);
			}
	}
	else {
		hlam177icons.clearLayers();
	}
}
var hlam178icons = L.layerGroup().addTo(map);
function Hlam178OnOff() {
	var chbox178;
	chbox178=document.getElementById('Hlam178Button');
	if (chbox178.checked) {
		var hlam178 = [

			];
	for (var i = 0; i < hlam178.length; i++) {
				hlam_178 = new L.circleMarker([hlam178[i][1],hlam178[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam178[i][0])
					.bindTooltip(hlam178[i][0], {direction: 'top'})
					.addTo(hlam178icons);
			}
	}
	else {
		hlam178icons.clearLayers();
	}
}
var hlam179icons = L.layerGroup().addTo(map);
function Hlam179OnOff() {
	var chbox179;
	chbox179=document.getElementById('Hlam179Button');
	if (chbox179.checked) {
		var hlam179 = [
			["Кисть", -44463, -16004],
			["Кисть", -40428, -3965],
			["Кисть", -61621, -57649],
			["Кисть", -59059, -39656],
			["Кисть", -85004, -45648],
			["Кисть", -29837, -93530],
			["Кисть", -11039, -68871],
			["Кисть", -84396, -80270],
			["Кисть", -84392, -80269],
			["Кисть", -84482, -80174],
			["Кисть", -10387, -123969],
			["Кисть", -83866, -106090],
			["Кисть", -158716, -57722],
			["Кисть", -149290, -37844],
			["Кисть", -159195, -75699],
			["Кисть", -161840, -73498],
			["Кисть", -159811, -73518],
			["Кисть", 170323, -31581],
			["Кисть", 195041, -31590],
			["Кисть", 167619, -22529],
			["Кисть", 167585, -22897],
			["Кисть", 164928, -22820],
			["Кисть", 166414, -21335],
			["Кисть", 149039, -51893],
			["Кисть", 158221, -68636],
			["Кисть", 158077, -68836],
			["Кисть", 130170, -27643],
			["Кисть", 127717, -24968],
			["Кисть", 101192, -15600],
			["Кисть", 90571, -9834],
			["Кисть", 88217, -6193],
			["Кисть", 30901, -19649],
			["Кисть", 17355, -44249],
			["Кисть", 17936, -108441],
			["Кисть", 22672, -106800],
			["Кисть", -55343, -160398],
			["Кисть", -81999, -161172],
			["Кисть", -114576, -191780],
			["Кисть", -122865, -184454],
			["Кисть", -132711, -154947],
			["Кисть", -138280, -139926],
			["Кисть", -93173, 183620],
			["Кисть", -93169, 183669],
			["Кисть", -92896, 183913],
			["Кисть", -92667, 183513],
			["Кисть", -27022, 162557],
			["Кисть", -27166, 162444],
			["Кисть", -147454, 151955],
			["Кисть", 151896, 138001],
			["Кисть", 85475, 152468],
			["Кисть", 88307, 157613],
			["Кисть", -59515, 89143],
			["Кисть", -61146, 89599],
			["Кисть", -43224, 88051],
			["Кисть", -61834, 90465],
			["Кисть", -101698, 84958],
			["Кисть", -46108, 1731],
			["Кисть", -46442, 3802],
			["Кисть", -39516, 7415],
			["Кисть", -39310, 5070],
			["Кисть", -42378, 11964],
			["Кисть", -41242, 10666],
			["Кисть", -41023, 10301],
			["Кисть", -40963, 10330],
			["Кисть", -46302, 28595],
			["Кисть", -46445, 28193],
			["Кисть", -46766, 26991],
			["Кисть", -164450, 123379],
			["Кисть", 182899, 109865],
			["Кисть", 181656, 109516],
			["Кисть", 183736, 110980],
			["Кисть", 191305, 115648],
			["Кисть", 136806, 15555],
			["Кисть", 94578, 98866],
			["Кисть", 130761, 74578],
			["Кисть", 79544, 55534],
			["Кисть", 52841, 52098],
			["Кисть", 60397, 57692],
			["Кисть", 16724, 45015],
			["Кисть", 16505, 43972],
			["Кисть", 14889, 48507],
			["Кисть", 20026, 50697],
			["Кисть", 100752, 27267],
			["Кисть", 100601, 25403],
			["Кисть", -94807, 10233]
			];
	for (var i = 0; i < hlam179.length; i++) {
				hlam_179 = new L.circleMarker([hlam179[i][1],hlam179[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam179[i][0])
					.bindTooltip(hlam179[i][0], {direction: 'top'})
					.addTo(hlam179icons);
			}
	}
	else {
		hlam179icons.clearLayers();
	}
}
var hlam180icons = L.layerGroup().addTo(map);
function Hlam180OnOff() {
	var chbox180;
	chbox180=document.getElementById('Hlam180Button');
	if (chbox180.checked) {
		var hlam180 = [
			["Клейстер", -53217, -13134],
			["Клейстер", -63062, -129244],
			["Клейстер", -151531, -71773],
			["Клейстер", -151506, -71769],
			["Клейстер", 160796, -91680],
			["Клейстер", 71949, 133644],
			["Клейстер", 71919, 133656],
			["Клейстер", 71921, 133645],
			["Клейстер", 2379, 137742],
			["Клейстер", 2381, 137732],
			["Клейстер", 2409, 137730]
			];
	for (var i = 0; i < hlam180.length; i++) {
				hlam_180 = new L.circleMarker([hlam180[i][1],hlam180[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam180[i][0])
					.bindTooltip(hlam180[i][0], {direction: 'top'})
					.addTo(hlam180icons);
			}
	}
	else {
		hlam180icons.clearLayers();
	}
}
var hlam181icons = L.layerGroup().addTo(map);
function Hlam181OnOff() {
	var chbox181;
	chbox181=document.getElementById('Hlam181Button');
	if (chbox181.checked) {
		var hlam181 = [

			];
	for (var i = 0; i < hlam181.length; i++) {
				hlam_181 = new L.circleMarker([hlam181[i][1],hlam181[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam181[i][0])
					.bindTooltip(hlam181[i][0], {direction: 'top'})
					.addTo(hlam181icons);
			}
	}
	else {
		hlam181icons.clearLayers();
	}
}
var hlam182icons = L.layerGroup().addTo(map);
function Hlam182OnOff() {
	var chbox182;
	chbox182=document.getElementById('Hlam182Button');
	if (chbox182.checked) {
		var hlam182 = [
			["Клоун", -51959, -12856],
			["Клоун", -52964, -14061],
			["Клоун", -108378, -22939],
			["Клоун", -59288, -85452],
			["Клоун", -147754, -59223],
			["Клоун", -151548, -72734],
			["Клоун", 180853, -123883],
			["Клоун", 108237, -54399],
			["Клоун", -129935, -156095],
			["Клоун", -76644, -175074],
			["Клоун", 145421, -149926],
			["Клоун", -97004, 184454],
			["Клоун", -96984, 184452],
			["Клоун", -96963, 184455],
			["Клоун", -96943, 184447],
			["Клоун", -96953, 184429],
			["Клоун", -96977, 184435],
			["Клоун", -96999, 184437],
			["Клоун", -96988, 184421],
			["Клоун", -96965, 184410],
			["Клоун", -96980, 184405],
			["Клоун", 14767, 193597],
			["Клоун", 14802, 193491],
			["Клоун", 198604, 45027],
			["Клоун", 58416, 10291],
			["Клоун", -54655, -131836]
			];
	for (var i = 0; i < hlam182.length; i++) {
				hlam_182 = new L.circleMarker([hlam182[i][1],hlam182[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam182[i][0])
					.bindTooltip(hlam182[i][0], {direction: 'top'})
					.addTo(hlam182icons);
			}
	}
	else {
		hlam182icons.clearLayers();
	}
}
var hlam183icons = L.layerGroup().addTo(map);
function Hlam183OnOff() {
	var chbox183;
	chbox183=document.getElementById('Hlam183Button');
	if (chbox183.checked) {
		var hlam183 = [
			["Ковшик", -24915, -59741],
			["Ковшик", -27832, -60187],
			["Ковшик", -51842, -46091],
			["Ковшик", -63063, -128979],
			["Ковшик", -51164, -106530],
			["Ковшик", -47829, -106793],
			["Ковшик", -61440, -100366],
			["Ковшик", -72733, -98368],
			["Ковшик", -147814, -56900],
			["Ковшик", -147794, -56934],
			["Ковшик", 183633, -93128],
			["Ковшик", 183264, -66962],
			["Ковшик", 17232, -82292],
			["Ковшик", -133935, -153761],
			["Ковшик", -136790, -177180],
			["Ковшик", -121369, 143207],
			["Ковшик", 193765, 167302],
			["Ковшик", 111730, 139628],
			["Ковшик", 88158, 157293],
			["Ковшик", -20866, 16659],
			["Ковшик", 169029, 56093],
			["Ковшик", 171727, 59159],
			["Ковшик", 89468, 55573],
			["Ковшик", 88822, 2856]
			];
	for (var i = 0; i < hlam183.length; i++) {
				hlam_183 = new L.circleMarker([hlam183[i][1],hlam183[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam183[i][0])
					.bindTooltip(hlam183[i][0], {direction: 'top'})
					.addTo(hlam183icons);
			}
	}
	else {
		hlam183icons.clearLayers();
	}
}
var hlam184icons = L.layerGroup().addTo(map);
function Hlam184OnOff() {
	var chbox184;
	chbox184=document.getElementById('Hlam184Button');
	if (chbox184.checked) {
		var hlam184 = [
			["Ковшик", -8733, -2462],
			["Ковшик", -53209, -13447],
			["Ковшик", -24858, -59704],
			["Ковшик", -27925, -60076],
			["Ковшик", -21803, -58232],
			["Ковшик", -8322, -57027],
			["Ковшик", -17383, -46289],
			["Ковшик", -19307, -47159],
			["Ковшик", -7100, -48702],
			["Ковшик", -20628, -44202],
			["Ковшик", -45494, -70346],
			["Ковшик", -48928, -128780],
			["Ковшик", -46665, -108286],
			["Ковшик", -61490, -100151],
			["Ковшик", -61363, -100067],
			["Ковшик", -102261, -129617],
			["Ковшик", -148195, -57156],
			["Ковшик", -147796, -56975],
			["Ковшик", -151038, -74620],
			["Ковшик", 167305, -24421],
			["Ковшик", 164885, -16818],
			["Ковшик", 167938, -17927],
			["Ковшик", 138696, -53782],
			["Ковшик", 148996, -52324],
			["Ковшик", 147393, -78092],
			["Ковшик", 105742, -7230],
			["Ковшик", 89037, -31672],
			["Ковшик", 93288, -12978],
			["Ковшик", 80774, -1507],
			["Ковшик", 50279, -23387],
			["Ковшик", 28403, -31216],
			["Ковшик", 29921, -20604],
			["Ковшик", 29407, -18808],
			["Ковшик", 29386, -18821],
			["Ковшик", 107914, -54306],
			["Ковшик", 113637, -56011],
			["Ковшик", 33946, -32911],
			["Ковшик", 38062, -35321],
			["Ковшик", 30821, -33186],
			["Ковшик", 94461, -101626],
			["Ковшик", 13820, -107282],
			["Ковшик", 17468, -106905],
			["Ковшик", -31462, -153099],
			["Ковшик", -29900, -132629],
			["Ковшик", -60999, -145130],
			["Ковшик", -95280, -146575],
			["Ковшик", -126654, -135561],
			["Ковшик", -126451, -134044],
			["Ковшик", -99438, -132092],
			["Ковшик", -6584, -172056],
			["Ковшик", -84598, -176422],
			["Ковшик", -120986, -189366],
			["Ковшик", -138040, -152372],
			["Ковшик", 140698, -147042],
			["Ковшик", 146054, -143200],
			["Ковшик", -4349, 184943],
			["Ковшик", -8511, 189393],
			["Ковшик", -60988, 181577],
			["Ковшик", -54372, 192525],
			["Ковшик", -90144, 178002],
			["Ковшик", -92012, 180113],
			["Ковшик", -95143, 181015],
			["Ковшик", -93936, 181901],
			["Ковшик", -87765, 183947],
			["Ковшик", -91477, 185371],
			["Ковшик", -99023, 183297],
			["Ковшик", -26443, 144467],
			["Ковшик", -27628, 162134],
			["Ковшик", -27268, 162798],
			["Ковшик", -146167, 175438],
			["Ковшик", -146219, 173352],
			["Ковшик", -145459, 173441],
			["Ковшик", -145287, 174919],
			["Ковшик", -161579, 194227],
			["Ковшик", -138364, 152470],
			["Ковшик", 151542, 138525],
			["Ковшик", 151741, 138710],
			["Ковшик", 151882, 138766],
			["Ковшик", 151621, 138894],
			["Ковшик", 152027, 161324],
			["Ковшик", 152199, 161320],
			["Ковшик", 64475, 174048],
			["Ковшик", 48337, 190411],
			["Ковшик", 11583, 182886],
			["Ковшик", 105310, 156621],
			["Ковшик", 71645, 132926],
			["Ковшик", 71772, 137128],
			["Ковшик", 45736, 162619],
			["Ковшик", 3885, 160442],
			["Ковшик", 7142, 161427],
			["Ковшик", -29072, 125115],
			["Ковшик", -80581, 102660],
			["Ковшик", -65603, 129498],
			["Ковшик", -5494, 33973],
			["Ковшик", -18081, 60233],
			["Ковшик", -47720, 32950],
			["Ковшик", -23514, 11881],
			["Ковшик", -7099, 21234],
			["Ковшик", -48866, 19828],
			["Ковшик", -71343, 25085],
			["Ковшик", -127974, 30765],
			["Ковшик", -138346, 89190],
			["Ковшик", -138981, 90636],
			["Ковшик", 135383, 116225],
			["Ковшик", 133392, 126844],
			["Ковшик", 201785, 93690],
			["Ковшик", 200906, 93854],
			["Ковшик", 184095, 70210],
			["Ковшик", 168528, 56453],
			["Ковшик", 168755, 56259],
			["Ковшик", 170340, 31025],
			["Ковшик", 131714, 11894],
			["Ковшик", 130347, 112416],
			["Ковшик", 94830, 99227],
			["Ковшик", 25254, 77022],
			["Ковшик", 28518, 93339],
			["Ковшик", 72464, 37759],
			["Ковшик", 29432, 53779],
			["Ковшик", 114136, 7233],
			["Ковшик", -139241, -143984],
			["Ковшик", 25404, -109268]
			];
	for (var i = 0; i < hlam184.length; i++) {
				hlam_184 = new L.circleMarker([hlam184[i][1],hlam184[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam184[i][0])
					.bindTooltip(hlam184[i][0], {direction: 'top'})
					.addTo(hlam184icons);
			}
	}
	else {
		hlam184icons.clearLayers();
	}
}
var hlam185icons = L.layerGroup().addTo(map);
function Hlam185OnOff() {
	var chbox185;
	chbox185=document.getElementById('Hlam185Button');
	if (chbox185.checked) {
		var hlam185 = [
			["Ковшик с крышкой", -53210, -13122],
			["Ковшик с крышкой", -19238, -46900],
			["Ковшик с крышкой", -59298, -84592],
			["Ковшик с крышкой", -50989, -106845],
			["Ковшик с крышкой", -47862, -106756],
			["Ковшик с крышкой", -80949, -102299],
			["Ковшик с крышкой", 73018, -7789],
			["Ковшик с крышкой", 89820, -57089],
			["Ковшик с крышкой", -133941, -153806],
			["Ковшик с крышкой", -136034, -184072],
			["Ковшик с крышкой", -136764, -177164],
			["Ковшик с крышкой", -10461, 193539],
			["Ковшик с крышкой", -60894, 182059],
			["Ковшик с крышкой", -96811, 180906],
			["Ковшик с крышкой", -129418, 119126],
			["Ковшик с крышкой", 168983, 56069],
			["Ковшик с крышкой", 172737, 58283]
			];
	for (var i = 0; i < hlam185.length; i++) {
				hlam_185 = new L.circleMarker([hlam185[i][1],hlam185[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam185[i][0])
					.bindTooltip(hlam185[i][0], {direction: 'top'})
					.addTo(hlam185icons);
			}
	}
	else {
		hlam185icons.clearLayers();
	}
}
var hlam186icons = L.layerGroup().addTo(map);
function Hlam186OnOff() {
	var chbox186;
	chbox186=document.getElementById('Hlam186Button');
	if (chbox186.checked) {
		var hlam186 = [
			["Колба", -166561, -14096],
			["Колба", 101168, -12351],
			["Колба", 89915, -29574],
			["Колба", 50244, -44697],
			["Колба", 50225, -44773],
			["Колба", 51079, -41528],
			["Колба", 51102, -41549],
			["Колба", -4409, -156056],
			["Колба", -4421, -156068],
			["Колба", -123395, -131301],
			["Колба", 115343, -157746],
			["Колба", 69085, 202321],
			["Колба", 63519, 179684],
			["Колба", 63545, 179729],
			["Колба", 2464, 163010],
			["Колба", 20186, 89799],
			["Колба", 87266, 2724]
			];
	for (var i = 0; i < hlam186.length; i++) {
				hlam_186 = new L.circleMarker([hlam186[i][1],hlam186[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam186[i][0])
					.bindTooltip(hlam186[i][0], {direction: 'top'})
					.addTo(hlam186icons);
			}
	}
	else {
		hlam186icons.clearLayers();
	}
}
var hlam187icons = L.layerGroup().addTo(map);
function Hlam187OnOff() {
	var chbox187;
	chbox187=document.getElementById('Hlam187Button');
	if (chbox187.checked) {
		var hlam187 = [
			["Коллекционный бейсбольный мяч", 149570, -75785]
			];
	for (var i = 0; i < hlam187.length; i++) {
				hlam_187 = new L.circleMarker([hlam187[i][1],hlam187[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam187[i][0])
					.bindTooltip(hlam187[i][0], {direction: 'top'})
					.addTo(hlam187icons);
			}
	}
	else {
		hlam187icons.clearLayers();
	}
}
var hlam188icons = L.layerGroup().addTo(map);
function Hlam188OnOff() {
	var chbox188;
	chbox188=document.getElementById('Hlam188Button');
	if (chbox188.checked) {
		var hlam188 = [
			["Колышек для гольфа", -57957, -23948],
			["Колышек для гольфа", -57938, -23920],
			["Колышек для гольфа", -57924, -23916],
			["Колышек для гольфа", -51750, -13181],
			["Колышек для гольфа", -51752, -13190],
			["Колышек для гольфа", -51751, -13189],
			["Колышек для гольфа", -51103, -13080],
			["Колышек для гольфа", -51104, -13082],
			["Колышек для гольфа", -51104, -13081],
			["Колышек для гольфа", -46642, -13729],
			["Колышек для гольфа", -58110, -5600],
			["Колышек для гольфа", 196584, -143467],
			["Колышек для гольфа", 196588, -143480],
			["Колышек для гольфа", 196592, -143492]
			];
	for (var i = 0; i < hlam188.length; i++) {
				hlam_188 = new L.circleMarker([hlam188[i][1],hlam188[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam188[i][0])
					.bindTooltip(hlam188[i][0], {direction: 'top'})
					.addTo(hlam188icons);
			}
	}
	else {
		hlam188icons.clearLayers();
	}
}
var hlam189icons = L.layerGroup().addTo(map);
function Hlam189OnOff() {
	var chbox189;
	chbox189=document.getElementById('Hlam189Button');
	if (chbox189.checked) {
		var hlam189 = [

			];
	for (var i = 0; i < hlam189.length; i++) {
				hlam_189 = new L.circleMarker([hlam189[i][1],hlam189[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam189[i][0])
					.bindTooltip(hlam189[i][0], {direction: 'top'})
					.addTo(hlam189icons);
			}
	}
	else {
		hlam189icons.clearLayers();
	}
}
var hlam190icons = L.layerGroup().addTo(map);
function Hlam190OnOff() {
	var chbox190;
	chbox190=document.getElementById('Hlam190Button');
	if (chbox190.checked) {
		var hlam190 = [

			];
	for (var i = 0; i < hlam190.length; i++) {
				hlam_190 = new L.circleMarker([hlam190[i][1],hlam190[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam190[i][0])
					.bindTooltip(hlam190[i][0], {direction: 'top'})
					.addTo(hlam190icons);
			}
	}
	else {
		hlam190icons.clearLayers();
	}
}
var hlam191icons = L.layerGroup().addTo(map);
function Hlam191OnOff() {
	var chbox191;
	chbox191=document.getElementById('Hlam191Button');
	if (chbox191.checked) {
		var hlam191 = [
			["Комбинированный ключ", -44656, -15759],
			["Комбинированный ключ", -53081, -8850],
			["Комбинированный ключ", -48069, -10362],
			["Комбинированный ключ", -42746, -6427],
			["Комбинированный ключ", -77614, -21767],
			["Комбинированный ключ", -29306, -49358],
			["Комбинированный ключ", -38694, -59183],
			["Комбинированный ключ", -45969, -50227],
			["Комбинированный ключ", -46663, -50859],
			["Комбинированный ключ", -55380, -48112],
			["Комбинированный ключ", -51713, -46519],
			["Комбинированный ключ", -51874, -46581],
			["Комбинированный ключ", -51832, -46526],
			["Комбинированный ключ", -52011, -46663],
			["Комбинированный ключ", -89188, -48718],
			["Комбинированный ключ", -47144, -85846],
			["Комбинированный ключ", -34636, -83049],
			["Комбинированный ключ", -84689, -80060],
			["Комбинированный ключ", -71045, -69171],
			["Комбинированный ключ", -71016, -69109],
			["Комбинированный ключ", -10693, -123718],
			["Комбинированный ключ", -93281, -130952],
			["Комбинированный ключ", -69174, -105040],
			["Комбинированный ключ", -103724, -121213],
			["Комбинированный ключ", -104847, -120310],
			["Комбинированный ключ", -147726, -59217],
			["Комбинированный ключ", -148792, -57963],
			["Комбинированный ключ", -148115, -56682],
			["Комбинированный ключ", -158359, -44243],
			["Комбинированный ключ", -159974, -40774],
			["Комбинированный ключ", -155640, -36236],
			["Комбинированный ключ", -131392, -92884],
			["Комбинированный ключ", -131455, -92911],
			["Комбинированный ключ", -152228, -74862],
			["Комбинированный ключ", -164086, -128889],
			["Комбинированный ключ", 188246, -29590],
			["Комбинированный ключ", 140123, -2997],
			["Комбинированный ключ", 172273, -42984],
			["Комбинированный ключ", 184262, -92752],
			["Комбинированный ключ", 182966, -93331],
			["Комбинированный ключ", 158076, -68776],
			["Комбинированный ключ", 197792, -128034],
			["Комбинированный ключ", 103082, -11010],
			["Комбинированный ключ", 88890, -30980],
			["Комбинированный ключ", 69157, -15764],
			["Комбинированный ключ", 92150, -9616],
			["Комбинированный ключ", 77079, -6608],
			["Комбинированный ключ", 48647, -21917],
			["Комбинированный ключ", 48684, -21941],
			["Комбинированный ключ", 48378, -21995],
			["Комбинированный ключ", 9110, -30455],
			["Комбинированный ключ", 17965, -2557],
			["Комбинированный ключ", 108053, -54980],
			["Комбинированный ключ", 111583, -55504],
			["Комбинированный ключ", 111678, -55256],
			["Комбинированный ключ", 111716, -55206],
			["Комбинированный ключ", 62024, -58614],
			["Комбинированный ключ", 50838, -45151],
			["Комбинированный ключ", 50839, -45206],
			["Комбинированный ключ", 51498, -43669],
			["Комбинированный ключ", 51429, -43670],
			["Комбинированный ключ", 22920, -61082],
			["Комбинированный ключ", 17321, -44208],
			["Комбинированный ключ", 57484, -94496],
			["Комбинированный ключ", 13385, -92127],
			["Комбинированный ключ", 101287, -100422],
			["Комбинированный ключ", 74353, -121045],
			["Комбинированный ключ", 69322, -103927],
			["Комбинированный ключ", 60932, -98894],
			["Комбинированный ключ", 25724, -104425],
			["Комбинированный ключ", -39016, -132814],
			["Комбинированный ключ", -92766, -136280],
			["Комбинированный ключ", -117453, -136471],
			["Комбинированный ключ", -14701, -173680],
			["Комбинированный ключ", -42995, -173483],
			["Комбинированный ключ", -94997, -176563],
			["Комбинированный ключ", -95006, -176575],
			["Комбинированный ключ", -82206, -176498],
			["Комбинированный ключ", -81803, -178093],
			["Комбинированный ключ", -120364, -189798],
			["Комбинированный ключ", -108629, -187346],
			["Комбинированный ключ", -143123, -159863],
			["Комбинированный ключ", 131391, -132099],
			["Комбинированный ключ", 131631, -132402],
			["Комбинированный ключ", 189356, -169547],
			["Комбинированный ключ", 189656, -169464],
			["Комбинированный ключ", 193849, -169035],
			["Комбинированный ключ", 189083, -165387],
			["Комбинированный ключ", 188657, -165425],
			["Комбинированный ключ", 115061, -157857],
			["Комбинированный ключ", 42556, -153757],
			["Комбинированный ключ", 51913, -149103],
			["Комбинированный ключ", 75517, -174768],
			["Комбинированный ключ", 75417, -173387],
			["Комбинированный ключ", -71045, 198034],
			["Комбинированный ключ", -16580, 163860],
			["Комбинированный ключ", -4706, 185233],
			["Комбинированный ключ", -83876, 165654],
			["Комбинированный ключ", -84312, 165972],
			["Комбинированный ключ", -84312, 165958],
			["Комбинированный ключ", -97254, 184441],
			["Комбинированный ключ", -93235, 184324],
			["Комбинированный ключ", -89814, 185776],
			["Комбинированный ключ", -95136, 190241],
			["Комбинированный ключ", -94834, 189635],
			["Комбинированный ключ", -94683, 190373],
			["Комбинированный ключ", -1738, 158414],
			["Комбинированный ключ", -16620, 163804],
			["Комбинированный ключ", -16661, 163752],
			["Комбинированный ключ", -5850, 160697],
			["Комбинированный ключ", -5864, 160702],
			["Комбинированный ключ", -3963, 161361],
			["Комбинированный ключ", -42746, 137700],
			["Комбинированный ключ", -40437, 161443],
			["Комбинированный ключ", -39703, 163062],
			["Комбинированный ключ", -38020, 159867],
			["Комбинированный ключ", -109795, 132615],
			["Комбинированный ключ", -121381, 143245],
			["Комбинированный ключ", -161574, 200917],
			["Комбинированный ключ", -155128, 164556],
			["Комбинированный ключ", -146315, 172730],
			["Комбинированный ключ", -158672, 185700],
			["Комбинированный ключ", -138770, 141945],
			["Комбинированный ключ", 156623, 184624],
			["Комбинированный ключ", 143405, 194343],
			["Комбинированный ключ", 150978, 138361],
			["Комбинированный ключ", 151079, 161426],
			["Комбинированный ключ", 92728, 191852],
			["Комбинированный ключ", 93506, 192145],
			["Комбинированный ключ", 97665, 191001],
			["Комбинированный ключ", 26701, 171935],
			["Комбинированный ключ", 2293, 179105],
			["Комбинированный ключ", 3132, 182055],
			["Комбинированный ключ", 10845, 184074],
			["Комбинированный ключ", 72017, 133124],
			["Комбинированный ключ", 20437, 134799],
			["Комбинированный ключ", 20383, 134841],
			["Комбинированный ключ", 20489, 134757],
			["Комбинированный ключ", 1717, 138083],
			["Комбинированный ключ", 2699, 163079],
			["Комбинированный ключ", 3857, 160268],
			["Комбинированный ключ", 7046, 162378],
			["Комбинированный ключ", 5731, 160352],
			["Комбинированный ключ", -25791, 99443],
			["Комбинированный ключ", -42838, 113770],
			["Комбинированный ключ", -86679, 115703],
			["Комбинированный ключ", -129228, 119052],
			["Комбинированный ключ", -104679, 123047],
			["Комбинированный ключ", -25592, 72928],
			["Комбинированный ключ", -38335, 84055],
			["Комбинированный ключ", -59892, 86869],
			["Комбинированный ключ", -128074, 80407],
			["Комбинированный ключ", -128273, 79973],
			["Комбинированный ключ", -40742, 50826],
			["Комбинированный ключ", -40727, 50828],
			["Комбинированный ключ", -52238, 55025],
			["Комбинированный ключ", -54860, 57687],
			["Комбинированный ключ", -85971, 65117],
			["Комбинированный ключ", -102305, 39112],
			["Комбинированный ключ", -24174, 10228],
			["Комбинированный ключ", -24575, 10022],
			["Комбинированный ключ", -45906, 1810],
			["Комбинированный ключ", -42048, 1936],
			["Комбинированный ключ", -42343, 2605],
			["Комбинированный ключ", -42087, 2598],
			["Комбинированный ключ", -52355, 8008],
			["Комбинированный ключ", -121595, 3571],
			["Комбинированный ключ", -119452, 1696],
			["Комбинированный ключ", -98554, 7604],
			["Комбинированный ключ", -153759, 129881],
			["Комбинированный ключ", -153847, 129719],
			["Комбинированный ключ", -138740, 90733],
			["Комбинированный ключ", 181383, 110689],
			["Комбинированный ключ", 183193, 111451],
			["Комбинированный ключ", 134821, 127156],
			["Комбинированный ключ", 134484, 127442],
			["Комбинированный ключ", 198073, 46686],
			["Комбинированный ключ", 171161, 1487],
			["Комбинированный ключ", 133289, 17963],
			["Комбинированный ключ", 133233, 20118],
			["Комбинированный ключ", 95406, 99057],
			["Комбинированный ключ", 1927, 100161],
			["Комбинированный ключ", 50006, 84737],
			["Комбинированный ключ", 74369, 44206],
			["Комбинированный ключ", 80099, 55493],
			["Комбинированный ключ", 16314, 44729],
			["Комбинированный ключ", 16317, 44719],
			["Комбинированный ключ", 16371, 44699],
			["Комбинированный ключ", 20064, 50652],
			["Комбинированный ключ", 130578, 17588],
			["Комбинированный ключ", 130025, 20106]
			];
	for (var i = 0; i < hlam191.length; i++) {
				hlam_191 = new L.circleMarker([hlam191[i][1],hlam191[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam191[i][0])
					.bindTooltip(hlam191[i][0], {direction: 'top'})
					.addTo(hlam191icons);
			}
	}
	else {
		hlam191icons.clearLayers();
	}
}
var hlam192icons = L.layerGroup().addTo(map);
function Hlam192OnOff() {
	var chbox192;
	chbox192=document.getElementById('Hlam192Button');
	if (chbox192.checked) {
		var hlam192 = [
			["Композитные лыжи", 17817, -201],
			["Композитные лыжи", 17813, -183],
			["Композитные лыжи", 29330, -58586],
			["Композитные лыжи", 29325, -58589],
			["Композитные лыжи", -82185, -178767],
			["Композитные лыжи", 132823, 76242],
			["Композитные лыжи", 132999, 74494],
			["Композитные лыжи", 133121, 74317],
			["Композитные лыжи", 132832, 76241],
			["Композитные лыжи", 131239, 86902],
			["Композитные лыжи", 129352, 85651],
			["Композитные лыжи", 129670, 86058],
			["Композитные лыжи", 25912, 70613],
			["Композитные лыжи", 25772, 70724],
			["Композитные лыжи", 17652, 75392],
			["Композитные лыжи", 17643, 75381],
			["Композитные лыжи", 35255, 40403],
			["Композитные лыжи", 35283, 40410],
			["Композитные лыжи", 35967, 38272],
			["Композитные лыжи", 34917, 40477],
			["Композитные лыжи", 34472, 55027],
			["Композитные лыжи", 34477, 55005],
			["Композитные лыжи", 13201, 38150],
			["Композитные лыжи", 14460, 37820],
			["Композитные лыжи", 13736, 39917],
			["Композитные лыжи", 15476, 39353],
			["Композитные лыжи", 14104, 38454],
			["Композитные лыжи", 14083, 38450],
			["Композитные лыжи", 16107, 38611],
			["Композитные лыжи", 15626, 43852],
			["Композитные лыжи", 13993, 44385],
			["Композитные лыжи", 13984, 44388],
			["Композитные лыжи", 14981, 47887],
			["Композитные лыжи", 14980, 47896],
			["Композитные лыжи", 16152, 48240],
			["Композитные лыжи", 13696, 45834],
			["Композитные лыжи", 13688, 45975],
			["Композитные лыжи", 20506, 47730],
			["Композитные лыжи", 21042, 47736],
			["Композитные лыжи", 21133, 45591],
			["Композитные лыжи", 21096, 45558],
			["Композитные лыжи", 22924, 47647],
			["Композитные лыжи", 22948, 47655],
			["Композитные лыжи", 24693, 46385],
			["Композитные лыжи", 28637, 48442],
			["Композитные лыжи", 29415, 53562],
			["Композитные лыжи", 29464, 53554],
			["Композитные лыжи", 13724, 26092],
			["Композитные лыжи", 13733, 26075],
			["Композитные лыжи", 14488, 29701],
			["Композитные лыжи", 13769, 31708],
			["Композитные лыжи", 14177, 29261],
			["Композитные лыжи", 136621, 90722],
			["Композитные лыжи", 136607, 90737],
			["Композитные лыжи", 14623, 30859],
			["Композитные лыжи", 133133, 87965],
			["Композитные лыжи", 133119, 87980]
			];
	for (var i = 0; i < hlam192.length; i++) {
				hlam_192 = new L.circleMarker([hlam192[i][1],hlam192[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam192[i][0])
					.bindTooltip(hlam192[i][0], {direction: 'top'})
					.addTo(hlam192icons);
			}
	}
	else {
		hlam192icons.clearLayers();
	}
}
var hlam193icons = L.layerGroup().addTo(map);
function Hlam193OnOff() {
	var chbox193;
	chbox193=document.getElementById('Hlam193Button');
	if (chbox193.checked) {
		var hlam193 = [

			];
	for (var i = 0; i < hlam193.length; i++) {
				hlam_193 = new L.circleMarker([hlam193[i][1],hlam193[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam193[i][0])
					.bindTooltip(hlam193[i][0], {direction: 'top'})
					.addTo(hlam193icons);
			}
	}
	else {
		hlam193icons.clearLayers();
	}
}
var hlam194icons = L.layerGroup().addTo(map);
function Hlam194OnOff() {
	var chbox194;
	chbox194=document.getElementById('Hlam194Button');
	if (chbox194.checked) {
		var hlam194 = [
			["Конец вала", -82182, -29429],
			["Конец вала", -84294, -28976],
			["Конец вала", -83970, -29173],
			["Конец вала", -83104, -29825],
			["Конец вала", -82920, -29082],
			["Конец вала", -86763, -13292],
			["Конец вала", -4055, -41807],
			["Конец вала", -4013, -41714],
			["Конец вала", -91870, -51775],
			["Конец вала", -121041, -64994],
			["Конец вала", -120711, -65187],
			["Конец вала", -120572, -45939],
			["Конец вала", -34503, -85143],
			["Конец вала", -34483, -85199],
			["Конец вала", -43832, -125412],
			["Конец вала", -92587, -99905],
			["Конец вала", -121795, -112182],
			["Конец вала", -168100, -112486],
			["Конец вала", 131475, -31382],
			["Конец вала", 181128, -59424],
			["Конец вала", 141743, -60635],
			["Конец вала", 142603, -60040],
			["Конец вала", 184021, -92841],
			["Конец вала", 130088, -27449],
			["Конец вала", 88936, -31257],
			["Конец вала", 90462, -30455],
			["Конец вала", 84758, -19232],
			["Конец вала", 111277, -55224],
			["Конец вала", 111704, -55248],
			["Конец вала", 25715, -61082],
			["Конец вала", 56929, -94413],
			["Конец вала", 56943, -94368],
			["Конец вала", 56955, -94383],
			["Конец вала", 57857, -95320],
			["Конец вала", 37017, -91371],
			["Конец вала", -7016, -161544],
			["Конец вала", -6782, -161741],
			["Конец вала", -126428, -135344],
			["Конец вала", -125912, -134213],
			["Конец вала", -146596, -143241],
			["Конец вала", -146570, -143298],
			["Конец вала", 131564, -132201],
			["Конец вала", 115621, -157720],
			["Конец вала", -61264, 181348],
			["Конец вала", -89310, 179599],
			["Конец вала", -79740, 180161],
			["Конец вала", -94968, 190441],
			["Конец вала", -94098, 190645],
			["Конец вала", -19816, 145726],
			["Конец вала", -143498, 171999],
			["Конец вала", -144893, 175318],
			["Конец вала", -147088, 178595],
			["Конец вала", -171742, 147499],
			["Конец вала", 14863, 195150],
			["Конец вала", 19393, 134896],
			["Конец вала", -12645, 116465],
			["Конец вала", -38806, 83758],
			["Конец вала", -25640, 47003],
			["Конец вала", -24651, 47737],
			["Конец вала", -104093, 38662],
			["Конец вала", -995, 1595],
			["Конец вала", -1045, 1368],
			["Конец вала", -119623, 3456],
			["Конец вала", -119309, 5304],
			["Конец вала", -122878, 18860],
			["Конец вала", -148759, 113386],
			["Конец вала", -138314, 88025],
			["Конец вала", -138313, 88022],
			["Конец вала", -138318, 88016],
			["Конец вала", 181524, 111549],
			["Конец вала", 154180, 77729],
			["Конец вала", 154179, 77377],
			["Конец вала", 144541, 81502],
			["Конец вала", 143592, 82169],
			["Конец вала", 152973, 57799],
			["Конец вала", 153134, 57774],
			["Конец вала", 170890, 1561],
			["Конец вала", 183781, 2614],
			["Конец вала", 111461, 57883],
			["Конец вала", 111464, 58092],
			["Конец вала", 120690, 5182],
			["Конец вала", 51286, 492]
			];
	for (var i = 0; i < hlam194.length; i++) {
				hlam_194 = new L.circleMarker([hlam194[i][1],hlam194[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam194[i][0])
					.bindTooltip(hlam194[i][0], {direction: 'top'})
					.addTo(hlam194icons);
			}
	}
	else {
		hlam194icons.clearLayers();
	}
}
var hlam195icons = L.layerGroup().addTo(map);
function Hlam195OnOff() {
	var chbox195;
	chbox195=document.getElementById('Hlam195Button');
	if (chbox195.checked) {
		var hlam195 = [
			["Корзина для продуктов", -36062, -17892],
			["Корзина для продуктов", -50972, -14056],
			["Корзина для продуктов", -50687, -14213],
			["Корзина для продуктов", -50508, -14017],
			["Корзина для продуктов", -50533, -13856],
			["Корзина для продуктов", -50540, -13816],
			["Корзина для продуктов", -43607, -6975],
			["Корзина для продуктов", -44005, -6892],
			["Корзина для продуктов", -44320, -7549],
			["Корзина для продуктов", -43971, -6874],
			["Корзина для продуктов", -40384, -2702],
			["Корзина для продуктов", -109420, -21245],
			["Корзина для продуктов", -109112, -21824],
			["Корзина для продуктов", -10067, -50391],
			["Корзина для продуктов", -21684, -43984],
			["Корзина для продуктов", -21683, -43985],
			["Корзина для продуктов", -38571, -58996],
			["Корзина для продуктов", -61872, -54962],
			["Корзина для продуктов", -31867, -130014],
			["Корзина для продуктов", -51988, -111457],
			["Корзина для продуктов", -52383, -111238],
			["Корзина для продуктов", -52053, -110975],
			["Корзина для продуктов", -52460, -111137],
			["Корзина для продуктов", -47598, -101007],
			["Корзина для продуктов", -68652, -105594],
			["Корзина для продуктов", -102072, -129923],
			["Корзина для продуктов", 192836, -28891],
			["Корзина для продуктов", 193010, -29459],
			["Корзина для продуктов", 191300, -26956],
			["Корзина для продуктов", 194061, -28468],
			["Корзина для продуктов", 194374, -28032],
			["Корзина для продуктов", 191397, -33997],
			["Корзина для продуктов", 194209, -33561],
			["Корзина для продуктов", 194280, -33622],
			["Корзина для продуктов", 151131, -52865],
			["Корзина для продуктов", 157719, -49457],
			["Корзина для продуктов", 157595, -49235],
			["Корзина для продуктов", 183172, -65950],
			["Корзина для продуктов", 183412, -65738],
			["Корзина для продуктов", 183695, -66113],
			["Корзина для продуктов", 183844, -66335],
			["Корзина для продуктов", 72212, -3936],
			["Корзина для продуктов", 72439, -3788],
			["Корзина для продуктов", 73238, -3536],
			["Корзина для продуктов", 73365, -3569],
			["Корзина для продуктов", 84353, -2027],
			["Корзина для продуктов", 48184, -22047],
			["Корзина для продуктов", 48078, -22693],
			["Корзина для продуктов", 18070, -1119],
			["Корзина для продуктов", 18027, -1089],
			["Корзина для продуктов", 18621, -266],
			["Корзина для продуктов", 18148, -982],
			["Корзина для продуктов", 17816, -755],
			["Корзина для продуктов", 17953, -1515],
			["Корзина для продуктов", 17838, -1193],
			["Корзина для продуктов", 17943, -788],
			["Корзина для продуктов", 18590, -152],
			["Корзина для продуктов", 18254, -391],
			["Корзина для продуктов", 19301, -386],
			["Корзина для продуктов", 20557, -513],
			["Корзина для продуктов", 115441, -62863],
			["Корзина для продуктов", 115470, -62850],
			["Корзина для продуктов", 34093, -33056],
			["Корзина для продуктов", 38148, -35401],
			["Корзина для продуктов", 25736, -60637],
			["Корзина для продуктов", 9438, -107404],
			["Корзина для продуктов", 9901, -107098],
			["Корзина для продуктов", 9881, -107108],
			["Корзина для продуктов", 9822, -107183],
			["Корзина для продуктов", 20966, -108762],
			["Корзина для продуктов", -27274, -131407],
			["Корзина для продуктов", -71477, -163428],
			["Корзина для продуктов", -74645, -176316],
			["Корзина для продуктов", -74740, -178479],
			["Корзина для продуктов", -77409, -175989],
			["Корзина для продуктов", 73781, -177475],
			["Корзина для продуктов", -23627, 210296],
			["Корзина для продуктов", -70900, 197872],
			["Корзина для продуктов", -71285, 198216],
			["Корзина для продуктов", -70194, 197335],
			["Корзина для продуктов", -69612, 196917],
			["Корзина для продуктов", -83921, 202022],
			["Корзина для продуктов", -16820, 164201],
			["Корзина для продуктов", -16788, 164193],
			["Корзина для продуктов", -17070, 163848],
			["Корзина для продуктов", -10501, 192079],
			["Корзина для продуктов", -11370, 195014],
			["Корзина для продуктов", -60507, 181757],
			["Корзина для продуктов", -59150, 180986],
			["Корзина для продуктов", -60381, 182029],
			["Корзина для продуктов", -97335, 184011],
			["Корзина для продуктов", -80113, 183730],
			["Корзина для продуктов", -68563, 195640],
			["Корзина для продуктов", -16930, 163543],
			["Корзина для продуктов", -141924, 134892],
			["Корзина для продуктов", -142977, 136275],
			["Корзина для продуктов", -143116, 136854],
			["Корзина для продуктов", -143146, 139585],
			["Корзина для продуктов", -143111, 140112],
			["Корзина для продуктов", -144661, 148863],
			["Корзина для продуктов", -143434, 154414],
			["Корзина для продуктов", -143294, 153808],
			["Корзина для продуктов", -138055, 153517],
			["Корзина для продуктов", -137849, 152621],
			["Корзина для продуктов", -136163, 153022],
			["Корзина для продуктов", -136122, 152767],
			["Корзина для продуктов", -136192, 152480],
			["Корзина для продуктов", -138528, 152640],
			["Корзина для продуктов", -138700, 152637],
			["Корзина для продуктов", -138709, 152636],
			["Корзина для продуктов", -138435, 152838],
			["Корзина для продуктов", -138781, 153273],
			["Корзина для продуктов", -138761, 153708],
			["Корзина для продуктов", -138756, 152983],
			["Корзина для продуктов", -139004, 153531],
			["Корзина для продуктов", -138936, 153254],
			["Корзина для продуктов", -139060, 152886],
			["Корзина для продуктов", -139083, 152790],
			["Корзина для продуктов", -139089, 152799],
			["Корзина для продуктов", -139072, 152770],
			["Корзина для продуктов", -139103, 152585],
			["Корзина для продуктов", -138363, 153654],
			["Корзина для продуктов", -138393, 153662],
			["Корзина для продуктов", -143462, 155789],
			["Корзина для продуктов", -143431, 156321],
			["Корзина для продуктов", -143340, 157351],
			["Корзина для продуктов", 149640, 138463],
			["Корзина для продуктов", 149689, 138569],
			["Корзина для продуктов", 151989, 138904],
			["Корзина для продуктов", 24506, 131806],
			["Корзина для продуктов", 24452, 131468],
			["Корзина для продуктов", 24140, 131285],
			["Корзина для продуктов", -59906, 117486],
			["Корзина для продуктов", -59403, 89052],
			["Корзина для продуктов", -128524, 84796],
			["Корзина для продуктов", -128578, 83127],
			["Корзина для продуктов", -128571, 83349],
			["Корзина для продуктов", -128069, 84559],
			["Корзина для продуктов", -128146, 85080],
			["Корзина для продуктов", -39959, 44543],
			["Корзина для продуктов", -22988, 11956],
			["Корзина для продуктов", -19941, 15544],
			["Корзина для продуктов", -43138, 12343],
			["Корзина для продуктов", 199619, 46423],
			["Корзина для продуктов", 133111, 54873],
			["Корзина для продуктов", 128101, 122166],
			["Корзина для продуктов", 127806, 121871],
			["Корзина для продуктов", 96246, 106211],
			["Корзина для продуктов", 39635, 115812],
			["Корзина для продуктов", 39440, 115771],
			["Корзина для продуктов", 81002, 59450],
			["Корзина для продуктов", 81175, 59534],
			["Корзина для продуктов", 81265, 59386],
			["Корзина для продуктов", 5516, 11487],
			["Корзина для продуктов", -129445, -155969]
			];
	for (var i = 0; i < hlam195.length; i++) {
				hlam_195 = new L.circleMarker([hlam195[i][1],hlam195[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam195[i][0])
					.bindTooltip(hlam195[i][0], {direction: 'top'})
					.addTo(hlam195icons);
			}
	}
	else {
		hlam195icons.clearLayers();
	}
}
var hlam196icons = L.layerGroup().addTo(map);
function Hlam196OnOff() {
	var chbox196;
	chbox196=document.getElementById('Hlam196Button');
	if (chbox196.checked) {
		var hlam196 = [
			["Коричневая бутылка", -8459, -2563],
			["Коричневая бутылка", -107768, -23319],
			["Коричневая бутылка", -123757, -17115],
			["Коричневая бутылка", -38248, -58652],
			["Коричневая бутылка", -107894, -84797],
			["Коричневая бутылка", -126151, -74082],
			["Коричневая бутылка", -97741, -126346],
			["Коричневая бутылка", -101739, -114743],
			["Коричневая бутылка", -101319, -107037],
			["Коричневая бутылка", -151391, -72287],
			["Коричневая бутылка", 143541, -59515],
			["Коричневая бутылка", 150256, -49255],
			["Коричневая бутылка", 51547, -40700],
			["Коричневая бутылка", 35699, -35156],
			["Коричневая бутылка", 72298, -76002],
			["Коричневая бутылка", -22735, -182097],
			["Коричневая бутылка", -22637, -182114],
			["Коричневая бутылка", -120498, -190003],
			["Коричневая бутылка", -152732, -160501],
			["Коричневая бутылка", 78308, -154319],
			["Коричневая бутылка", 52025, -149323],
			["Коричневая бутылка", 74211, -176903],
			["Коричневая бутылка", -82693, 202015],
			["Коричневая бутылка", -146168, 153545],
			["Коричневая бутылка", 149553, 134868],
			["Коричневая бутылка", 80784, 183997],
			["Коричневая бутылка", 58816, 175952],
			["Коричневая бутылка", 58711, 176039],
			["Коричневая бутылка", 58614, 176313],
			["Коричневая бутылка", 3141, 181976],
			["Коричневая бутылка", 14855, 188234],
			["Коричневая бутылка", 72343, 137403],
			["Коричневая бутылка", 44988, 163250],
			["Коричневая бутылка", 45015, 163227],
			["Коричневая бутылка", -88056, 79227],
			["Коричневая бутылка", -88067, 79156],
			["Коричневая бутылка", -129125, 88431],
			["Коричневая бутылка", -39228, 4547],
			["Коричневая бутылка", -122622, 2994],
			["Коричневая бутылка", -98815, 8275],
			["Коричневая бутылка", 143512, 97943],
			["Коричневая бутылка", 198078, 46742],
			["Коричневая бутылка", 88142, 105854],
			["Коричневая бутылка", 93369, 103384],
			["Коричневая бутылка", 92793, 103170],
			["Коричневая бутылка", 93297, 103394],
			["Коричневая бутылка", 93163, 103659],
			["Коричневая бутылка", 93486, 103023],
			["Коричневая бутылка", 93472, 103143],
			["Коричневая бутылка", 93285, 102936],
			["Коричневая бутылка", 93301, 102913],
			["Коричневая бутылка", 93478, 103247],
			["Коричневая бутылка", 93515, 103067],
			["Коричневая бутылка", 93419, 103404],
			["Коричневая бутылка", 93503, 103198],
			["Коричневая бутылка", 24859, 123490],
			["Коричневая бутылка", 128627, 85452],
			["Коричневая бутылка", 130148, 86536],
			["Коричневая бутылка", 17488, 76135],
			["Коричневая бутылка", 14967, 39556],
			["Коричневая бутылка", 15296, 42386],
			["Коричневая бутылка", 15954, 41828]
			];
	for (var i = 0; i < hlam196.length; i++) {
				hlam_196 = new L.circleMarker([hlam196[i][1],hlam196[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam196[i][0])
					.bindTooltip(hlam196[i][0], {direction: 'top'})
					.addTo(hlam196icons);
			}
	}
	else {
		hlam196icons.clearLayers();
	}
}
var hlam197icons = L.layerGroup().addTo(map);
function Hlam197OnOff() {
	var chbox197;
	chbox197=document.getElementById('Hlam197Button');
	if (chbox197.checked) {
		var hlam197 = [
			["Коробка &quotОгней Сан-Франциско&quot", -82126, -161118],
			["Коробка &quotОгней Сан-Франциско&quot", -39036, 190463],
			["Коробка &quotОгней Сан-Франциско&quot", 101974, 196849],
			["Коробка &quotОгней Сан-Франциско&quot", -48808, 19400]
			];
	for (var i = 0; i < hlam197.length; i++) {
				hlam_197 = new L.circleMarker([hlam197[i][1],hlam197[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam197[i][0])
					.bindTooltip(hlam197[i][0], {direction: 'top'})
					.addTo(hlam197icons);
			}
	}
	else {
		hlam197icons.clearLayers();
	}
}
var hlam198icons = L.layerGroup().addTo(map);
function Hlam198OnOff() {
	var chbox198;
	chbox198=document.getElementById('Hlam198Button');
	if (chbox198.checked) {
		var hlam198 = [
			["Коробка из-под гамбургера", -56407, -10540],
			["Коробка из-под гамбургера", -55815, -9701],
			["Коробка из-под гамбургера", -56297, -10469],
			["Коробка из-под гамбургера", -56663, -11101],
			["Коробка из-под гамбургера", -109417, -20554],
			["Коробка из-под гамбургера", -109181, -22039],
			["Коробка из-под гамбургера", -52289, -46478],
			["Коробка из-под гамбургера", -147909, -59207],
			["Коробка из-под гамбургера", -151664, -71836],
			["Коробка из-под гамбургера", -151095, -72025],
			["Коробка из-под гамбургера", 197492, -31810],
			["Коробка из-под гамбургера", 199227, -29729],
			["Коробка из-под гамбургера", 198909, -27110],
			["Коробка из-под гамбургера", 192122, -30182],
			["Коробка из-под гамбургера", 192110, -29150],
			["Коробка из-под гамбургера", 191010, -31619],
			["Коробка из-под гамбургера", 195725, -31383],
			["Коробка из-под гамбургера", 198394, -33195],
			["Коробка из-под гамбургера", 191198, -34219],
			["Коробка из-под гамбургера", 191415, -34119],
			["Коробка из-под гамбургера", 194739, -33414],
			["Коробка из-под гамбургера", 194362, -33113],
			["Коробка из-под гамбургера", 194351, -33159],
			["Коробка из-под гамбургера", 193826, -34560],
			["Коробка из-под гамбургера", 88273, -21319],
			["Коробка из-под гамбургера", 18614, -1281],
			["Коробка из-под гамбургера", 18119, -848],
			["Коробка из-под гамбургера", 17731, -1199],
			["Коробка из-под гамбургера", 17857, -1013],
			["Коробка из-под гамбургера", 115525, -63407],
			["Коробка из-под гамбургера", -79354, -180756],
			["Коробка из-под гамбургера", -77783, -181129],
			["Коробка из-под гамбургера", -73935, -179852],
			["Коробка из-под гамбургера", -73785, -179280],
			["Коробка из-под гамбургера", -76216, -177950],
			["Коробка из-под гамбургера", -76388, -177417],
			["Коробка из-под гамбургера", -73728, -179157],
			["Коробка из-под гамбургера", -140031, 140458],
			["Коробка из-под гамбургера", 149599, 134760],
			["Коробка из-под гамбургера", 85999, 151855],
			["Коробка из-под гамбургера", -17861, 59095],
			["Коробка из-под гамбургера", -17877, 59135],
			["Коробка из-под гамбургера", -17838, 59259],
			["Коробка из-под гамбургера", -17879, 59261],
			["Коробка из-под гамбургера", -47241, 2996],
			["Коробка из-под гамбургера", 183491, 3397],
			["Коробка из-под гамбургера", 26242, 54725],
			["Коробка из-под гамбургера", 25919, 55333],
			["Коробка из-под гамбургера", 25999, 55234],
			["Коробка из-под гамбургера", 26360, 54969],
			["Коробка из-под гамбургера", 96912, 608]
			];
	for (var i = 0; i < hlam198.length; i++) {
				hlam_198 = new L.circleMarker([hlam198[i][1],hlam198[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam198[i][0])
					.bindTooltip(hlam198[i][0], {direction: 'top'})
					.addTo(hlam198icons);
			}
	}
	else {
		hlam198icons.clearLayers();
	}
}
var hlam199icons = L.layerGroup().addTo(map);
function Hlam199OnOff() {
	var chbox199;
	chbox199=document.getElementById('Hlam199Button');
	if (chbox199.checked) {
		var hlam199 = [
			["Коробка из-под пиццы", -86743, -13431],
			["Коробка из-под пиццы", -52005, -46551],
			["Коробка из-под пиццы", -91245, -43507],
			["Коробка из-под пиццы", -91380, -42872],
			["Коробка из-под пиццы", -89373, -41291],
			["Коробка из-под пиццы", -109499, -59739],
			["Коробка из-под пиццы", -107998, -59695],
			["Коробка из-под пиццы", -108505, -59793],
			["Коробка из-под пиццы", -108586, -59599],
			["Коробка из-под пиццы", -108530, -59422],
			["Коробка из-под пиццы", -32133, -129935],
			["Коробка из-под пиццы", -34392, -116168],
			["Коробка из-под пиццы", -81248, -110312],
			["Коробка из-под пиццы", 198635, -27851],
			["Коробка из-под пиццы", 192018, -30092],
			["Коробка из-под пиццы", 192482, -29051],
			["Коробка из-под пиццы", 191220, -31067],
			["Коробка из-под пиццы", 190831, -31867],
			["Коробка из-под пиццы", 195900, -31463],
			["Коробка из-под пиццы", 190394, -33517],
			["Коробка из-под пиццы", 191181, -34329],
			["Коробка из-под пиццы", 194136, -33412],
			["Коробка из-под пиццы", 193613, -34421],
			["Коробка из-под пиццы", 193566, -34365],
			["Коробка из-под пиццы", 101651, -30893],
			["Коробка из-под пиццы", 81858, -1168],
			["Коробка из-под пиццы", 115558, -63393],
			["Коробка из-под пиццы", 10123, -52459],
			["Коробка из-под пиццы", 10123, -52459],
			["Коробка из-под пиццы", 36906, -119357],
			["Коробка из-под пиццы", -79087, -181104],
			["Коробка из-под пиццы", -77749, -180648],
			["Коробка из-под пиццы", -77052, -180748],
			["Коробка из-под пиццы", -77305, -180962],
			["Коробка из-под пиццы", -76517, -180798],
			["Коробка из-под пиццы", -78476, -179231],
			["Коробка из-под пиццы", -75003, -178860],
			["Коробка из-под пиццы", -74110, -179740],
			["Коробка из-под пиццы", -74066, -179444],
			["Коробка из-под пиццы", -75856, -177915],
			["Коробка из-под пиццы", 140647, -158086],
			["Коробка из-под пиццы", 140254, -158922],
			["Коробка из-под пиццы", 140309, -158439],
			["Коробка из-под пиццы", 140305, -157343],
			["Коробка из-под пиццы", 140040, -158717],
			["Коробка из-под пиццы", 139948, -148074],
			["Коробка из-под пиццы", 139868, -149072],
			["Коробка из-под пиццы", 139902, -148602],
			["Коробка из-под пиццы", 145521, -148462],
			["Коробка из-под пиццы", 145327, -149253],
			["Коробка из-под пиццы", 140759, -144708],
			["Коробка из-под пиццы", 142100, -144849],
			["Коробка из-под пиццы", 142931, -144766],
			["Коробка из-под пиццы", 142953, -144629],
			["Коробка из-под пиццы", 143684, -146190],
			["Коробка из-под пиццы", 144162, -145003],
			["Коробка из-под пиццы", 185051, -170397],
			["Коробка из-под пиццы", 84323, 151861],
			["Коробка из-под пиццы", 87773, 159212],
			["Коробка из-под пиццы", -47225, 1010],
			["Коробка из-под пиццы", 33250, 129005]
			];
	for (var i = 0; i < hlam199.length; i++) {
				hlam_199 = new L.circleMarker([hlam199[i][1],hlam199[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam199[i][0])
					.bindTooltip(hlam199[i][0], {direction: 'top'})
					.addTo(hlam199icons);
			}
	}
	else {
		hlam199icons.clearLayers();
	}
}
var hlam200icons = L.layerGroup().addTo(map);
function Hlam200OnOff() {
	var chbox200;
	chbox200=document.getElementById('Hlam200Button');
	if (chbox200.checked) {
		var hlam200 = [
			["Коробка из-под хот-дога", -56480, -10816],
			["Коробка из-под хот-дога", -56792, -11005],
			["Коробка из-под хот-дога", -55877, -11008],
			["Коробка из-под хот-дога", 197481, -32248],
			["Коробка из-под хот-дога", 199540, -29931],
			["Коробка из-под хот-дога", 198297, -29510],
			["Коробка из-под хот-дога", 197900, -27293],
			["Коробка из-под хот-дога", 192130, -29131],
			["Коробка из-под хот-дога", 192042, -29236],
			["Коробка из-под хот-дога", 190759, -30004],
			["Коробка из-под хот-дога", 196363, -31973],
			["Коробка из-под хот-дога", 195631, -31078],
			["Коробка из-под хот-дога", 195513, -31161],
			["Коробка из-под хот-дога", 192550, -29177],
			["Коробка из-под хот-дога", 191794, -28648],
			["Коробка из-под хот-дога", 191183, -34370],
			["Коробка из-под хот-дога", 194105, -33447],
			["Коробка из-под хот-дога", 194209, -33307],
			["Коробка из-под хот-дога", 18600, -1446],
			["Коробка из-под хот-дога", 17913, -1013],
			["Коробка из-под хот-дога", 17772, -1457],
			["Коробка из-под хот-дога", -27708, -131497],
			["Коробка из-под хот-дога", -82822, -184690],
			["Коробка из-под хот-дога", -82127, -184315],
			["Коробка из-под хот-дога", -79598, -180987],
			["Коробка из-под хот-дога", -79980, -180567],
			["Коробка из-под хот-дога", -79735, -180619],
			["Коробка из-под хот-дога", -79387, -180407],
			["Коробка из-под хот-дога", -79115, -181020],
			["Коробка из-под хот-дога", -77761, -180690],
			["Коробка из-под хот-дога", -77291, -180383],
			["Коробка из-под хот-дога", -77481, -180863],
			["Коробка из-под хот-дога", -77339, -180919],
			["Коробка из-под хот-дога", -76357, -180799],
			["Коробка из-под хот-дога", -78754, -179243],
			["Коробка из-под хот-дога", -78609, -179276],
			["Коробка из-под хот-дога", -75457, -179810],
			["Коробка из-под хот-дога", -74747, -179441],
			["Коробка из-под хот-дога", -74869, -179667],
			["Коробка из-под хот-дога", -73792, -179560],
			["Коробка из-под хот-дога", -73788, -179562],
			["Коробка из-под хот-дога", -74096, -179406],
			["Коробка из-под хот-дога", -76149, -177910],
			["Коробка из-под хот-дога", -76521, -176976],
			["Коробка из-под хот-дога", -76376, -177034],
			["Коробка из-под хот-дога", 140682, -158117],
			["Коробка из-под хот-дога", 140357, -157552],
			["Коробка из-под хот-дога", 137821, -147717],
			["Коробка из-под хот-дога", 142449, -148138],
			["Коробка из-под хот-дога", 142648, -148540],
			["Коробка из-под хот-дога", 142304, -149632],
			["Коробка из-под хот-дога", 140408, -149279],
			["Коробка из-под хот-дога", 141734, -149366],
			["Коробка из-под хот-дога", 143134, -147512],
			["Коробка из-под хот-дога", 140858, -147722],
			["Коробка из-под хот-дога", 140745, -148317],
			["Коробка из-под хот-дога", 140117, -147753],
			["Коробка из-под хот-дога", 139906, -149023],
			["Коробка из-под хот-дога", 140031, -148338],
			["Коробка из-под хот-дога", 139406, -148203],
			["Коробка из-под хот-дога", 146569, -149719],
			["Коробка из-под хот-дога", 146152, -150937],
			["Коробка из-под хот-дога", 145549, -148935],
			["Коробка из-под хот-дога", 145390, -147702],
			["Коробка из-под хот-дога", 143744, -149547],
			["Коробка из-под хот-дога", 145035, -149546],
			["Коробка из-под хот-дога", 143531, -149472],
			["Коробка из-под хот-дога", 144200, -149380],
			["Коробка из-под хот-дога", 143567, -147882],
			["Коробка из-под хот-дога", 143843, -147875],
			["Коробка из-под хот-дога", 143660, -148989],
			["Коробка из-под хот-дога", 143390, -148798],
			["Коробка из-под хот-дога", 139010, -147177],
			["Коробка из-под хот-дога", 140764, -144117],
			["Коробка из-под хот-дога", 140756, -144617],
			["Коробка из-под хот-дога", 140669, -144865],
			["Коробка из-под хот-дога", 142161, -145019],
			["Коробка из-под хот-дога", 142025, -144798],
			["Коробка из-под хот-дога", 141638, -144477],
			["Коробка из-под хот-дога", 143308, -146114],
			["Коробка из-под хот-дога", 142865, -144596],
			["Коробка из-под хот-дога", 143020, -144668],
			["Коробка из-под хот-дога", 143309, -147140],
			["Коробка из-под хот-дога", 142549, -147239],
			["Коробка из-под хот-дога", 140221, -144968],
			["Коробка из-под хот-дога", 141375, -146546],
			["Коробка из-под хот-дога", 141783, -145480],
			["Коробка из-под хот-дога", 140402, -146312],
			["Коробка из-под хот-дога", 140148, -147116],
			["Коробка из-под хот-дога", 143912, -146826],
			["Коробка из-под хот-дога", 145527, -146973],
			["Коробка из-под хот-дога", 145562, -146632],
			["Коробка из-под хот-дога", 144496, -146600],
			["Коробка из-под хот-дога", 143524, -146078],
			["Коробка из-под хот-дога", 143610, -146243],
			["Коробка из-под хот-дога", 143854, -144933],
			["Коробка из-под хот-дога", 144089, -145056],
			["Коробка из-под хот-дога", 144001, -144891],
			["Коробка из-под хот-дога", 162017, -168983],
			["Коробка из-под хот-дога", 162726, -168638],
			["Коробка из-под хот-дога", -139969, 140397],
			["Коробка из-под хот-дога", -37755, 95768],
			["Коробка из-под хот-дога", -17871, 59108],
			["Коробка из-под хот-дога", -17853, 59255],
			["Коробка из-под хот-дога", -17866, 59238],
			["Коробка из-под хот-дога", -17806, 59304],
			["Коробка из-под хот-дога", -17795, 59280],
			["Коробка из-под хот-дога", -17852, 59298],
			["Коробка из-под хот-дога", -18091, 60268],
			["Коробка из-под хот-дога", -18091, 60268],
			["Коробка из-под хот-дога", -18037, 60098],
			["Коробка из-под хот-дога", -47420, 2910],
			["Коробка из-под хот-дога", 28716, 128308]
			];
	for (var i = 0; i < hlam200.length; i++) {
				hlam_200 = new L.circleMarker([hlam200[i][1],hlam200[i][2]], {color: "#FFFFFF"})
					.bindPopup(hlam200[i][0])
					.bindTooltip(hlam200[i][0], {direction: 'top'})
					.addTo(hlam200icons);
			}
	}
	else {
		hlam200icons.clearLayers();
	}
}